{
  "year": 2003,
  "references": [],
  "id": "SP:009dbf3187862352aac542bf7d61e27bce6b27f5",
  "authors": [],
  "abstractText": "The problem of measuring \"similarity\" of objects arises in many applications, and many domain-specific measures have been developed, e.g., matching text across documents or computing overlap among item-sets. We propose a complementary approach, applicable in any domain with object-to-object relationships, that measures similarity of the structural context in which objects occur, based on their relationships with other objects. Effectively, we compute a measure that says \"two objects are similar if they are related to similar objects:' This general similarity measure, called SimRank, is based on a simple and intuitive graph-theoretic model. For a given domain, SireRank can be combined with other domain-specific similarity measures. We suggest techniques for efficient computation of SirnRank scores, and provide experimental resuits on two application domains showing the computational feasibility and effectiveness of our approach. 1 I n t r o d u c t i o n Many applications require a measure of \"similarity\" between objects. One obvious example is the \"find-similar-document\" query, on traditional text corpora or the World-Wide Web [2]. More generally, a similarity measure can be used to cluster objects, such as for collaborative filtering in a recommender system [3, 6, 9], in which \"similar\" users and items are grouped based on the users' preferences. Various aspects of objects can be used to determine similarity, usually depending on the domain and the appropriate definition of similarity for that domain. In a document corpus, matching text may be used, and for collaborative filtering, similar users may be identified by common preferences. We propose a general approach that exploits the object-to-object relationships found in many domains of interest. On the Web, for example, we can say that two pages are related if there are hyperlinks between them. A similar approach *This work was supported by the National Science Foundation under grants IIS-9817799 and IIS-9811947. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee pro~,ided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. SIGKDD 02 Edmonton, Alberta, Canada Copyright 2002 ACM 1-58113-567-X/02/0007 ...$5.00. G"
}