{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 746–751 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n746"
  }, {
    "heading": "1 Introduction",
    "text": "Enabling machines to understand natural language text is arguably the ultimate goal of natural language processing, and the task of machine reading comprehension is an intermediate step towards this ultimate goal (Richardson et al., 2013; Hermann et al., 2015; Hill et al., 2015; Rajpurkar et al., 2016; Nguyen et al., 2016). Recently, Lai et al. (2017) released a new multi-choice machine comprehension dataset called RACE that was extracted from middle and high school English examinations in China. Figure 1 shows an example passage and two related questions from RACE. The key difference between RACE and previously released machine comprehension datasets (e.g., the CNN/Daily Mail dataset (Hermann et al., 2015) and SQuAD (Rajpurkar et al., 2016)) is that the answers in RACE often cannot be directly extracted from the given passages, as illustrated by the two example questions (Q1 & Q2) in Figure 1. Thus, answering these questions is more challenging and requires more inferences.\nPrevious approaches to machine comprehension are usually based on pairwise sequence matching, where either the passage is matched against the sequence that concatenates both the\nquestion and a candidate answer (Yin et al., 2016), or the passage is matched against the question alone followed by a second step of selecting an answer using the matching result of the first step (Lai et al., 2017; Zhou et al., 2018). However, these approaches may not be suitable for multi-choice reading comprehension since questions and answers are often equally important. Matching the passage only against the question may not be meaningful and may lead to loss of information from the original passage, as we can see from the first example question in Figure 1. On the other hand, concatenating the question and the answer into a single sequence for matching may not work, either, due to the loss of interaction information between a question and an answer. As illustrated by Q2 in Figure 1, the model may need to recognize what “he” and “it” in candidate answer (c) refer to in the question, in order to select (c) as the correct answer. This observation of the RACE dataset shows that we face a new challenge of matching sequence triplets (i.e., passage, question and answer) instead of pairwise matching.\nIn this paper, we propose a new model to match a question-answer pair to a given passage. Our comatching approach explicitly treats the question and the candidate answer as two sequences and jointly matches them to the given passage. Specifically, for each position in the passage, we compute two attention-weighted vectors, where one is from the question and the other from the candidate answer. Then, two matching representations are constructed: the first one matches the passage with the question while the second one matches the passage with the candidate answer. These two newly constructed matching representations together form a co-matching state. Intuitively, it encodes the locational information of the question and the candidate answer matched to a specific context of the passage. Finally, we apply a hierar-\nchical LSTM (Tang et al., 2015) over the sequence of co-matching states at different positions of the passage. Information is aggregated from wordlevel to sentence-level and then from sentencelevel to document-level. In this way, our model can better deal with the questions that require evidence scattered in different sentences in the passage. Our model improves the state-of-the-art model by 3 percentage on the RACE dataset. Our code will be released under https://github. com/shuohangwang/comatch."
  }, {
    "heading": "2 Model",
    "text": "For the task of multi-choice reading comprehension, the machine is given a passage, a question and a set of candidate answers. The goal is to select the correct answer from the candidates. Let us use P ∈ Rd×P , Q ∈ Rd×Q and A ∈ Rd×A to represent the passage, the question and a candidate answer, respectively, where each word in each sequence is represented by an embedding vector. d is the dimensionality of the embeddings, and P , Q, and A are the lengths of these sequences.\nOverall our model works as follows. For each candidate answer, our model constructs a vector that represents the matching of P with both Q and A. The vectors of all candidate answers are then used for answer selection. Because we simultaneously match P with Q and A, we call this a comatching model. In Section 2.1 we introduce the word-level co-matching mechanism. Then in Section 2.2 we introduce a hierarchical aggregation\nprocess. Finally in Section 2.3 we present the objective function. An overview of our co-matching model is shown in Figure 2."
  }, {
    "heading": "2.1 Co-matching",
    "text": "The co-matching part of our model aims to match the passage with the question and the candidate answer at the word-level. Inspired by some previous work (Wang and Jiang, 2016; Trischler et al., 2016), we first use bi-directional LSTMs (Hochreiter and Schmidhuber, 1997) to pre-process the sequences as follows:\nHp = Bi-LSTM(P),Hq = Bi-LSTM(Q),\nHa = Bi-LSTM(A), (1)\nwhere Hp ∈ Rl×P , Hq ∈ Rl×Q and Ha ∈ Rl×A are the sequences of hidden states generated by the bi-directional LSTMs. We then make use of the attention mechanism to match each state in the passage to an aggregated representation of the question and the candidate answer. The attention vectors are computed as follows:\nGq = SoftMax ( (WgHq + bg ⊗ eQ)THp ) ,\nGa = SoftMax ( (WgHa + bg ⊗ eQ)THp ) , H q = HqGq, H a = HaGa, (2)\nwhere Wg ∈ Rl×l and bg ∈ Rl are the parameters to learn. eQ ∈ RQ is a vector of all 1s and it is used to repeat the bias vector into the matrix. Gq ∈ RQ×P and Ga ∈ RA×P are the attention\nweights assigned to the different hidden states in the question and the candidate answer sequences, respectively. Hq ∈ Rl×P is the weighted sum of all the question hidden states and it represents how the question can be aligned to each hidden state in the passage. So is Ha ∈ Rl×P . Finally we can co-match the passage states with the question and the candidate answer as follows:\nMq = ReLU ( Wm [ H\nq Hp H q ⊗Hp\n] + bm ) ,\nMa = ReLU ( Wm [ H\na Hp H a ⊗Hp\n] + bm ) ,\nC =\n[ Mq\nMa\n] , (3)\nwhere Wg ∈ Rl×2l and bg ∈ Rl are the parameters to learn. [ · · ] is the column-wise concatenation of two matrices, and · · and ·⊗ · are the elementwise subtraction and multiplication between two matrices, which are used to build better matching representations (Tai et al., 2015; Wang and Jiang, 2017). Mq ∈ Rl×P represents the matching between the hidden states of the passage and the corresponding attention-weighted representations of the question. Similarly, we match the passage with the candidate answer and represent the matching results using Ma ∈ Rl×P . Finally C ∈ R2l×P is the concatenation of Mq ∈ Rl×P\nand Ma ∈ Rl×P and represents how each passage state can be matched with the question and the candidate answer. We refer to c ∈ R2l, which is a single column of C, as a co-matching state that concurrently matches a passage state with both the question and the candidate answer."
  }, {
    "heading": "2.2 Hierarchical Aggregation",
    "text": "In order to capture the sentence structure of the passage, we further modify the model presented earlier and build a hierarchical LSTM (Tang et al., 2015) on top of the co-matching states. Specifically, we first split the passage into sentences and we use P1,P2, . . . ,PN to represent these sentences, where N is the number of sentences in the passage. For each triplet {Pn,Q,A}, n ∈ [1, N ], we can get the co-matching states Cn through Eqn. (1-3). Then we build a bi-directional LSTM followed by max pooling on top of the comatching states of each sentence as follows:\nhsn = MaxPooling (Bi-LSTM (Cn)) , (4)\nwhere the function MaxPooling(·) is the row-wise max pooling operation. hsn ∈ Rl, n ∈ [1, N ] is the sentence-level aggregation of the co-matching states. All these representations will be further integrated by another Bi-LSTM to get the final triplet matching representation.\nHs = [hs1;h s 2; . . . ;h s N ],\nht = MaxPooling (Bi-LSTM (Hs)) , (5)\nwhere Hs ∈ Rl×N is the concatenation of all the sentence-level representations and it is the input of a higher level LSTM. ht ∈ Rl is the final output of the matching between the sequences of the passage, the question and the candidate answer."
  }, {
    "heading": "2.3 Objective function",
    "text": "For each candidate answer Ai, we can build its matching representation hti ∈ Rl with the question and the passage through Eqn. (5). Our loss function is computed as follows:\nL(Ai|P,Q) = − log exp(wThti)∑4 j=1 exp(w Thtj) , (6)\nwhere w ∈ Rl is a parameter to learn."
  }, {
    "heading": "3 Experiment",
    "text": "To evaluate the effectiveness of our hierarchical co-matching model, we use the RACE dataset (Lai et al., 2017), which consists of two subsets: RACE-M comes from middle school examinations while RACE-H comes from high school examinations. RACE is the combination of the two.\nWe compare our model with a number of baseline models. We also compare with two variants of our model for an ablation study.\nComparison with Baselines We compare our model with the following baselines: • Sliding Window based method (Richardson et al., 2013) computes the matching score based on the sum of the tf-idf values of the matched words between the question-answer pair and each subpassage with a fixed a window size.\n• Stanford Attentive Reader (AR) (Chen et al., 2016) first builds a question-related passage representation through attention mechanism and then compares it with each candidate answer representation to get the answer probabilities. • GA (Dhingra et al., 2017) uses gated attention mechanism with multiple hops to extract the question-related information of the passage and compares it with candidate answers. • ElimiNet (Soham et al., 2017) tries to first eliminate the most irrelevant choices and then select the best answer. • HAF (Zhou et al., 2018) considers not only the matching between the three sequences, namely, passage, question and candidate answer, but also the matching between the candidate answers. • MUSIC (Xu et al., 2017) integrates different sequence matching strategies into the model and also adds a unit of multi-step reasoning for selecting the answer.\nBesides, we also report the following two results as reference points: Turkers is the performance of Amazon Turkers on a randomly sampled subset of the RACE test set. Ceiling is the percentage of the unambiguous questions with a correct answer in a subset of the test set.\nThe performance of our model together with the baselines are shown in Table 2. We can see that our proposed complete model, Hier-CoMatching, achieved the best performance among all the public results. Still, there is a huge gap between the best machine reading performance and the human performance, showing the great potential for further research.\nAblation Study Moreover, we conduct an ablation study of our model architecture. In this study, we are mainly interested in the contribution of each component introduced in this work to our final results. We studied two key factors: (1) the comatching module and (2) the hierarchical aggregation approach. We observed a 4 percentage performance decrease by replacing the co-matching module with a single matching state (i.e., only Ma in Eqn (3)) by directly concatenating the question with each candidate answer (Yin et al., 2016). We also observe about 2 percentage decrease when we treat the passage as a plain sequence, and run a two-layer LSTM (to ensure the numbers of parameters are comparable) over the whole passage instead of the hierarchical LSTM.\nQuestion Type Analysis We also conducted an analysis on what types of questions our model can handle better. We find that our model obtains similar performance on the “wh” questions such as “why,” “what,” “when” and “where” questions, on which the performance is usually around 50%. We also check statement-justification questions with the keyword “true” (e.g., “Which of the following statements is true”), negation questions with the keyword “not” (e.g., “which of the following is not true”), and summarization questions with the keyword “title” (e.g., “what is the best title for the passage?”), and their performance is 51%, 52% and 48%, respectively. We can see that the performance of our model on different types of questions in the RACE dataset is quite similar. However, our model is only based on wordlevel matching and may not have the ability of reasoning. In order to answer questions that require summarization, inference or reasoning, we still need to further explore the dataset and improve the model. Finally, we further compared our model to the baseline, which concatenates the question with each candidate answer, and our model can achieve better performance on different types of questions. For example, on the subset of the questions with pronouns, our model can achieve better accuracy of 49.8% than 47.9%. Similarly, on statement-justification questions with the keyword “true”, our model could achieve better accuracy of 51% than 47%."
  }, {
    "heading": "4 Conclusions",
    "text": "In this paper, we proposed a co-matching model for multi-choice reading comprehension. The model consists of a co-matching component and a hierarchical aggregation component. We showed that our model could achieve state-of-the-art performance on the RACE dataset. In the future, we will adapt the idea of co-matching and hierarchical aggregation to the standard open-domain QA setting for answer candidate reranking (Wang et al., 2017). We will also further study how to explicitly model inference and reasoning on the RACE dataset."
  }, {
    "heading": "5 Acknowledgement",
    "text": "This work was partially supported by DSO grant DSOCL15223."
  }],
  "year": 2018,
  "references": [{
    "title": "A thorough examination of the CNN/Daily Mail reading comprehension task",
    "authors": ["Danqi Chen", "Jason Bolton", "Christopher D. Manning."],
    "venue": "Proceedings of the Conference on Association for Computational Linguistics.",
    "year": 2016
  }, {
    "title": "Gated-attention readers for text comprehension",
    "authors": ["Bhuwan Dhingra", "Hanxiao Liu", "Zhilin Yang", "William W Cohen", "Ruslan Salakhutdinov."],
    "venue": "Proceedings of the Conference on Association for Computational Linguistics.",
    "year": 2017
  }, {
    "title": "Teaching machines to read and comprehend",
    "authors": ["Karl Moritz Hermann", "Tomas Kocisky", "Edward Grefenstette", "Lasse Espeholt", "Will Kay", "Mustafa Suleyman", "Phil Blunsom."],
    "venue": "Proceedings of the Conference on Advances in Neural Information",
    "year": 2015
  }, {
    "title": "The goldilocks principle: Reading children’s books with explicit memory representations",
    "authors": ["Felix Hill", "Antoine Bordes", "Sumit Chopra", "Jason Weston."],
    "venue": "arXiv preprint arXiv:1511.02301 .",
    "year": 2015
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural Computation 9(8):1735–1780.",
    "year": 1997
  }, {
    "title": "RACE: Large-scale reading comprehension dataset from examinations",
    "authors": ["Guokun Lai", "Qizhe Xie", "Hanxiao Liu", "Yiming Yang", "Eduard Hovy."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing .",
    "year": 2017
  }, {
    "title": "MS MARCO: A human generated machine reading comprehension dataset",
    "authors": ["Tri Nguyen", "Mir Rosenberg", "Xia Song", "Jianfeng Gao", "Saurabh Tiwary", "Rangan Majumder", "Li Deng."],
    "venue": "arXiv preprint arXiv:1611.09268 .",
    "year": 2016
  }, {
    "title": "SQuAD: 100,000+ questions for machine comprehension of text",
    "authors": ["Pranav Rajpurkar", "Jian Zhang", "Konstantin Lopyrev", "Percy Liang."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2016
  }, {
    "title": "MCTest: A challenge dataset for the open-domain machine comprehension of text",
    "authors": ["Matthew Richardson", "Christopher JC Burges", "Erin Renshaw."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2013
  }, {
    "title": "Eliminet: A model for eliminating options for reading comprehension with multiple choice questions",
    "authors": ["Parikh Soham", "Sai Ananya", "Nema Preksha", "M Khapra Mitesh."],
    "venue": "Openreview .",
    "year": 2017
  }, {
    "title": "Improved semantic representations from tree-structured long short-term memory networks",
    "authors": ["Kai Sheng Tai", "Richard Socher", "Christopher D Manning."],
    "venue": "Proceedings of the Conference on Association for Computational Linguistics.",
    "year": 2015
  }, {
    "title": "Document modeling with gated recurrent neural network for sentiment classification",
    "authors": ["Duyu Tang", "Bing Qin", "Ting Liu."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2015
  }, {
    "title": "A parallel-hierarchical model for machine comprehension on sparse data",
    "authors": ["Adam Trischler", "Zheng Ye", "Xingdi Yuan", "Jing He", "Phillip Bachman", "Kaheer Suleman."],
    "venue": "Proceedings of the Conference on Association for Computational Linguistics.",
    "year": 2016
  }, {
    "title": "Learning natural language inference with LSTM",
    "authors": ["Shuohang Wang", "Jing Jiang."],
    "venue": "Proceedings of the Conference on the North American Chapter of the Association for Computational Linguistics.",
    "year": 2016
  }, {
    "title": "A compareaggregate model for matching text sequences",
    "authors": ["Shuohang Wang", "Jing Jiang."],
    "venue": "Proceedings of the International Conference on Learning Representations.",
    "year": 2017
  }, {
    "title": "Evidence aggregation for answer re-ranking in open-domain question answering",
    "authors": ["Shuohang Wang", "Mo Yu", "Jing Jiang", "Wei Zhang", "Xiaoxiao Guo", "Shiyu Chang", "Zhiguo Wang", "Tim Klinger", "Gerald Tesauro", "Murray Campbell."],
    "venue": "arXiv preprint",
    "year": 2017
  }, {
    "title": "Towards human-level machine reading comprehension: Reasoning and inference with multiple strategies",
    "authors": ["Yichong Xu", "Jingjing Liu", "Jianfeng Gao", "Yelong Shen", "Xiaodong Liu."],
    "venue": "arXiv preprint arXiv:1711.04964 .",
    "year": 2017
  }, {
    "title": "Attention-based convolutional neural network for machine comprehension",
    "authors": ["Wenpeng Yin", "Sebastian Ebert", "Hinrich Schütze."],
    "venue": "arXiv preprint arXiv:1602.04341 .",
    "year": 2016
  }, {
    "title": "Hierarchical attention flow for multiplechoice reading comprehension",
    "authors": ["Haichao Zhou", "Wei Furu", "Qin Bing", "Liu Ting."],
    "venue": "Proceedings of AAAI Conference on Artificial Intelligence.",
    "year": 2018
  }],
  "id": "SP:c037ecc26ba97243bef09cbc839467ab5847e835",
  "authors": [{
    "name": "Shuohang Wang",
    "affiliations": []
  }, {
    "name": "Mo Yu",
    "affiliations": []
  }, {
    "name": "Shiyu Chang",
    "affiliations": []
  }, {
    "name": "Jing Jiang",
    "affiliations": []
  }],
  "abstractText": "Multi-choice reading comprehension is a challenging task, which involves the matching between a passage and a question-answer pair. This paper proposes a new co-matching approach to this problem, which jointly models whether a passage can match both a question and a candidate answer. Experimental results on the RACE dataset demonstrate that our approach achieves state-of-the-art performance.",
  "title": "A Co-Matching Model for Multi-choice Reading Comprehension"
}