{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 1938–1947 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n1938"
  }, {
    "heading": "1 Introduction",
    "text": "The explicit modeling of morphology has been shown to improve a number of tasks (Seeker and Çetinoglu, 2015; Luong et al., 2013). In a large number of the world’s languages, many words are composed through morphological operations on subword units. Some languages are rich in inflectional morphology, characterized by syntactic transformations like pluralization. Similarly, languages like English are rich in derivational morphology, where the semantics of words are composed from\n∗These authors contributed equally; listed alphabetically.\nsmaller parts. The AGENT derivational transformation, for example, answers the question, what is the word for ‘someone who runs’? with the answer, a runner.1 Here, AGENT is spelled out as suffixing -ner onto the root verb run.\nWe tackle the task of derived word generation. In this task, a root word x and a derivational transformation t are given to the learner. The learner’s job is to produce the result of the transformation on the root word, called the derived word y. Table 1 gives examples of these transformations.\nPrevious approaches to derived word generation model the task as a character-level sequenceto-sequence (seq2seq) problem (Cotterell et al., 2017b). The letters from the root word and some encoding of the transformation are given as input to a neural encoder, and the decoder is trained to produce the derived word, one letter at a time. We identify the following problems with these approaches:\nFirst, because these models are unconstrained, they can generate sequences of characters that do\n1We use the verb run as a demonstrative example; the transformation can be applied to most verbs.\nnot form actual words. We argue that requiring the model to generate a known word is a reasonable constraint in the special case of English derivational morphology, and doing so avoids a large number of common errors.\nSecond, sequence-based models can only generalize string manipulations (such as “add -ment”) if they appear frequently in the training data. Because of this, they are unable to generate derived words that do not follow typical patterns, such as generating truth as the nominative derivation of true. We propose to learn a function for each transformation in a low dimensional vector space that corresponds to mapping from representations of the root word to the derived word. This eliminates the reliance on orthographic information, unlike related approaches to distributional semantics, which operate at the suffix level (Gupta et al., 2017).\nWe contribute an aggregation model of derived word generation that produces hypotheses independently from two separate learned models: one from a seq2seq model with only orthographic information, and one from a feed-forward network using only distributional semantic information in the form of pretrained word vectors. The model learns to choose between the hypotheses according to the relative confidence of each. This system can be interpreted as learning to decide between positing an orthographically regular form or a semantically salient word. See Figure 1 for a diagram of our model.\nWe show that this model helps with two open problems with current state-of-the-art seq2seq derived word generation systems, suffix ambiguity and orthographic irregularity (Section 2). We also\nimprove the accuracy of seq2seq-only derived word systems by adding external information through constrained decoding and hypothesis rescoring. These methods provide orthogonal gains to our main contribution.\nWe evaluate models in two categories: open vocabulary models that can generate novel words unattested in a preset vocabulary, and closedvocabulary models, which cannot. Our best openvocabulary and closed-vocabulary models demonstrate 22% and 37% relative error reductions over the current state of the art."
  }, {
    "heading": "2 Background: Derivational Morphology",
    "text": "Derivational transformations generate novel words that are semantically composed from the root word and the transformation. We identify two unsolved problems in derived word transformation, each of which we address in Sections 3 and 4.\nFirst, many plausible choices of suffix for a single pair of root word and transformation. For example, for the verb ground, the RESULT transformation could plausibly take as many forms as2\n(ground, RESULT)→ grounding (ground, RESULT)→ *groundation (ground, RESULT)→ *groundment (ground, RESULT)→ *groundal\nHowever, only one is correct, even though each suffix appears often in the RESULT transformation of other words. We will refer to this problem as “suffix ambiguity.”\nSecond, many derived words seem to lack a generalizable orthographic relationship to their root words. For example, the RESULT of the verb speak is speech. It is unlikely, given an orthographically similar verb creak, that the RESULT be creech instead of, say, creaking. Seq2seq models must grapple with the problem of derived words that are the result of unlikely or potentially unseen string transformations. We refer to this problem as “orthographic irregularity.”"
  }, {
    "heading": "3 Sequence Models and Corpus Knowledge",
    "text": "In this section, we introduce the prior state-of-theart model, which serves as our baseline system. Then we build on top of this system by incorporating a dictionary constraint and rescoring the\n2The * indicates a non-word.\nmodel’s hypotheses with token frequency information to address the suffix ambiguity problem."
  }, {
    "heading": "3.1 Baseline Architecture",
    "text": "We begin by formalizing the problem and defining some notation. For source word x = x1, x2, . . . xm, a derivational transformation t, and target word y = y1, y2, . . . yn, our goal is to learn some function from the pair (x, t) to y. Here, xi and yj are the ith and jth characters of the input strings x and y. We will sometimes use x1:i to denote x1, x2, . . . xi, and similarly for y1:j .\nThe current state-of-the-art model for derivedform generation approaches this problem by learning a character-level encoder-decoder neural network with an attention mechanism (Cotterell et al., 2017b; Bahdanau et al., 2014).\nThe input to the bidirectional LSTM encoder (Hochreiter and Schmidhuber, 1997; Graves and Schmidhuber, 2005) is the sequence #, x1, x2, . . . xm, #, t, where # is a special symbol to denote the start and end of a word, and the encoding of the derivational transformation t is concatenated to the input characters. The model is trained to minimize the cross entropy of the training data. We refer to our reimplementation of this model as SEQ.\nFor a more detailed treatment of neural sequenceto-sequence models with attention, we direct the reader to Luong et al. (2015)."
  }, {
    "heading": "3.2 Dictionary Constraint",
    "text": "The suffix ambiguity problem poses challenges for models which rely exclusively on input characters for information. As previously demonstrated, words derived via the same transformation may take different suffixes, and it is hard to select among them based on character information alone. Here, we describe a process for restricting our inference procedure to only generate known English words, which we call a dictionary constraint. We believe that for English morphology, a large enough corpus will contain the vast majority of derived forms, so while this approach is somewhat restricting, it removes a significant amount of ambiguity from the problem.\nTo describe how we implemented this dictionary constraint, it is useful first to discuss how decoding in a seq2seq model is equivalent to solving a shortest path problem. The notation is specific to our model, but the argument is applicable to seq2seq models in general.\nThe goal of decoding is to find the most probable structure ŷ conditioned on some observation x and transformation t. That is, the problem is to solve\nŷ = argmax y∈Y\np(y | x, t) (1)\n= argmin y∈Y − log p(y | x, t) (2)\nwhere Y is the set of valid structures. Sequential models have a natural ordering y = y1, y2, . . . yn over which − log p(y | x, t) can be decomposed\n− log p(y | x, t) = n∑\nt=1\n− log p(yt | y1:t−1,x, t)\n(3) Solving Equation 2 can be viewed as solving a shortest path problem from a special starting state to a special ending state via some path which uniquely represents y. Each vertex in the graph represents some sequence y1:i, and the weight of the edge from y1:i to y1:i+1 is given by\n− log p(yi+1 | y1:i−1,x, t) (4)\nThe weight of the path from the start state to the end state via the unique path that describes y is exactly equal to Equation 3. When the vocabulary size is too large, the exact shortest path is intractable, and approximate search methods, such as beam search, are used instead.\nIn derived word generation, Y is an infinite set of strings. Since Y is unrestricted, almost all of the strings in Y are not valid words. Given a dictionary YD, the search space is restricted to only those words in the dictionary by searching over the trie induced from YD, which is a subgraph of the unrestricted graph. By limiting the search space to YD, the decoder is guaranteed to generate some known word. Models which use this dictionaryconstrained inference procedure will be labeled with +DICT. Algorithm 1 has the pseudocode for our decoding procedure.\nWe discuss specific details of the search procedure and interesting observations of the search space in Section 6. Section 5.2 describes how we obtained the dictionary of valid words."
  }, {
    "heading": "3.3 Word Frequency Knowledge through Rescoring",
    "text": "We also consider the inclusion of explicit word frequency information to help solve suffix ambiguity, using the intuition that “real” derived words\nare likely to be frequently attested. This permits a high-recall, potentially noisy dictionary.\nWe are motivated by very high top-10 accuracy compared to top-1 accuracy, even among dictionary-constrained models. By rescoring the hypotheses of a model using word frequency (a word-global signal) as a feature, attempt to recover a portion of this top-10 accuracy.\nWhen a model has been trained, we query it for its top-10 most likely hypotheses. The union of all hypotheses for a subset of the training observations forms the training set for a classifier that learns to predict whether a hypothesis generated by the model is correct. Each hypothesis is labelled with its correctness, a value in {±1}. We train a simple combination of two scores: the seq2seq model score for the hypothesis, and the log of the word frequency of the hypothesis.\nTo permit a nonlinear combination of word frequency and model score, we train a small multilayer perceptron with the model score and the frequency of a derived word hypothesis as features.\nAt testing time, the 10 hypotheses generated by a single seq2seq model for a single observation are rescored. The new model top-1 hypothesis, then, is the argmax over the 10 hypotheses according to the rescorer. In this way, we are able to incorporate word-global information, e.g. word frequency, that is ill-suited for incorporation at each character prediction step of the seq2seq model. We label models that are rescored in this way +FREQ."
  }, {
    "heading": "4 Distributional Models",
    "text": "So far, we have presented models that learn derivational transformations as orthographic operations. Such models struggle by construction with the orthographic irregularity problem, as they are trained to generalize orthographic information. However, the semantic relationships between root words and derived words are the same even when the orthography is dissimilar. It is salient, for example, that irregular word speech is related to its root speak in about the same way as how exploration is related to the word explore.\nWe model distributional transformations as functions in dense distributional word embedding spaces, crucially learning a function per derivational transformation, not per suffix pair. In this way, we aim to explicitly model the semantic transformation, not the othographic information."
  }, {
    "heading": "4.1 Feed-forward derivational transformations",
    "text": "For all source words x and all target words y, we look up static distributional embeddings vx, vy ∈ Rd. For each derivational transformation t, we learn a function ft : Rd → Rd that maps vx to vy. ft is parametrized as two-layer perceptron, trained using a squared loss,\nL = bTb (5) b = ft(vx)− vy (6)\nWe perform inference by nearest neighbor search in the embedding space. This inference strategy requires a subset of strings for our embedding dictionary, YV .\nUpon receiving (x, t) at test time, we compute ft(vx) and find the most similar embeddings in YV . Specifically, we find the top-k most similar embeddings, and take the most similar derived word that starts with the same 4 letters as the root word, and is not identical to it. This heuristic filters out highly implausible hypotheses.\nWe use the single-word subset of the Google News vectors (Mikolov et al., 2013) as YV , so the size of the vocabulary is 929k words."
  }, {
    "heading": "4.2 SEQ and DIST Aggregation",
    "text": "The seq2seq and distributional models we have presented learn with disjoint information to solve separate problems. We leverage this intuition to build a model that chooses, for each observation, whether to generate according to orthographic information via the SEQ model, or produce a potentially irregular form via the DIST model.\nTo train this model, we use a held-out portion of the training set, and filter it to only observations for which exactly one of the two models produces the correct derived form. Finally, we make the strong assumption that the probability of a derived form being generated correctly according to 1 model as opposed to the other is dependent only on the unnormalized model score from each. We model this as a logistic regression (t is omitted for clarity):\nP (·|yD,yS,x) = softmax(We [DIST(yD|x); SEQ(yS|x)] + be)\nwhere We and be are learned parameters, yD and yS are the hypotheses of the distributional and seq2seq models, and DIST(·) and SEQ(·) are the models’ likelihood functions. We denote this aggregate AGGR in our results."
  }, {
    "heading": "5 Datasets",
    "text": "In this section we describe the derivational morphology dataset used in our experiments and how we collected the dictionary and token frequencies used in the dictionary constraint and rescorer."
  }, {
    "heading": "5.1 Derivational Morphology",
    "text": "In our experiments, we use the derived word generation derivational morphology dataset released in Cotterell et al. (2017b). The dataset, derived from NomBank (Meyers et al., 2004) , consists of 4,222 training, 905 validation, and 905 test triples of the form (x, t,y). The transformations are from the following categories: ADVERB (ADJ→ ADV), RESULT (V→ N), AGENT (V→ N), and NOMINAL (ADJ→ N). Examples from the dataset can be found in Table 1."
  }, {
    "heading": "5.2 Dictionary and Token Frequency Statistics",
    "text": "The dictionary and token frequency statistics used in the dictionary constraint and frequency reranking come from the Google Books NGram corpus (Michel et al., 2011). The unigram frequency counts were aggregated across years, and any tokens which appear fewer than approximately 2,000 times, do not end in a known possible suffix, or contain a character outside of our vocabulary were removed.\nThe frequency threshold was determined using development data, optimizing for high recall. We collect a set of known suffixes from the training data by removing the longest common prefix between the source and target words from the target word. The result is a dictionary with frequency information for around 360k words, which covers 98% of the target words in the training data.3"
  }, {
    "heading": "6 Inference Procedure Discussion",
    "text": "In many sequence models where the vocabulary size is large, exact inference by finding the true shortest path in the graph discussed in Section 3.2 is intractable. As a result, approximate inference techniques such as beam search are often used, or the size of the search space is reduced, for example, by using a Markov assumption. We, however, observed that exact inference via a shortest path algorithm is not only tractable in our model, but\n3 The remaining 2% is mostly words with hyphens or mistakes in the dataset.\nonly slightly more expensive than greedy search and significantly less expensive than beam search.\nTo quantify this claim, we measured the accuracy and number of states explored by greedy search, beam search, and shortest path with and without a dictionary constraint on the development data. Table 2 shows the results averaged over 30 runs. As expected, beam search and shortest path have higher accuracies than greedy search and explore more of the search space. Surprisingly, beam search and shortest path have nearly identical accuracies, but shortest path explores significantly fewer hypotheses.\nAt least two factors contribute to the tractability of exact search in our model. First, our characterlevel sequence model has a vocabulary size of 63, which is significantly smaller than token-level models, in which a vocabulary of 50k words is not uncommon. The search space of sequence models is dependent upon the size of the vocabulary, so the model’s search space is dramatically smaller than for a token-level model.\nSecond, the inherent structure of the task makes it easy to eliminate large subgraphs of the search space. The first several characters of the input word and output word are almost always the same, so the model assigns very low probability to any sequence with different starting characters than the input. Then, the rest of the search procedure is dedicated to deciding between suffixes. Any suffix which does not appear frequently in the training data receives a low score, leaving the search to decide between a handful of possible options. The result is that the learned probability distribution is very spiked; it puts very high probability on just a few output sequences. It is empirically true that the top few most probable sequences have significantly higher scores than the next most probable sequences, which supports this hypothesis.\nIn our subsequent experiments, we decode using\nAlgorithm 1 The decoding procedure uses a shortest-path algorithm to find the most probable output sequence. The dictionary constraint is (optionally) implemented on line 9 by only considering prefixes that are contained in some trie T .\n1: procedure DECODE(x, t, V , T ) 2: H ← Heap() 3: H .insert(0, #) 4: while H is not empty do 5: y← H .remove() 6: if y is a complete word then return y 7: for y ∈ V do 8: y′ ← y + y 9: if y′ ∈ T then\n10: s← FORWARD(x, t,y′) 11: H .insert(s, y′)\nexact inference by running a shortest path algorithm (see Algorithm 1). For reranking models, instead of typically using a beam of size k, we use the top k most probable sequences."
  }, {
    "heading": "7 Results",
    "text": "In all of our experiments, we use the training, development, and testing splits provided by Cotterell et al. (2017b) and average over 30 random restarts. Table 3 displays the accuracies and average edit distances on the test set of each of the systems presented in this work and the state-of-the-art model from Cotterell et al. (2017b).\nFirst, we observed that SEQ outperforms the results reported in Cotterell et al. (2017b) by a large margin, despite the fact that the model architectures are the same. We attribute this difference to better hyperparameter settings and improved learning rate annealing.\nThen, it is clear that the accuracy of the distributional model, DIST, is significantly lower than any seq2seq model. We believe the orthographyinformed models perform better because most observations in the dataset are orthographically regular, providing low-hanging fruit.\nOpen-vocabulary models Our open-vocabulary aggregation model AGGR improves performance by 3.8 points accuracy over SEQ, indicating that the sequence models and the distributional model are contributing complementary signals. AGGR is an open-vocabulary model like Cotterell et al. (2017b) and improves upon it by 6.3 points, making it our best comparable model. We provide an in-\ndepth analysis of the strengths of SEQ and DIST in Section 7.1.\nClosed-vocabulary models We now consider closed-vocabulary models that improve upon the seq2seq model in AGGR. First, we see that restricting the decoder to only generate known words is extremely useful, with SEQ+DICT improving over SEQ by 6.2 points. Qualitatively, we note that this constraint helps solve the suffix ambiguity problem, since orthographically plausible incorrect hypotheses are pruned as non-words. See Table 6 for examples of this phenomenon. Additionally, we observe that the dictionary-constrained model outperforms the unconstrained model according to top-10 accuracy (see Table 5).\nRescoring (+FREQ) provides further improvement of 0.8 points, showing that the decoding dictionary constraint provides a higher-quality beam that still has room for top-1 improvement. All together, AGGR+FREQ+DICT provides a 4.4 point improvement over the best open-vocabulary model, AGGR. This shows the disambiguating power of assuming a closed vocabulary.\nEdit Distance One interesting side effect of the dictionary constraint appears when comparing AGGR+FREQ with and without the dictionary constraint. Although the accuracy of the dictionaryconstrained model is better, the average edit distance is worse. The unconstrained model is free to put invalid words which are orthographically similar to the target word in its top-k, however the constrained model can only choose valid words. This means it is easier for the unconstrained model to generate words which have a low edit distance to the ground truth, whereas the constrained model\ncan only do that if such a word exists. The result is a more accurate, yet more orthographically diverse, set of hypotheses.\nResults by Transformation Next, we compare our best open vocabulary and closed vocabulary models to previous work across each derivational transformation. These results are in Table 4.\nThe largest improvement over the baseline system is for NOMINAL transformations, in which the AGGR has a 49% reduction in error. We attribute most of this gain to the difficulty of this particular transformation. NOMINAL is challenging because there are several plausible endings (e.g. -ity, -ness, -ence) which occur at roughly the same rate. Additionally, NOMINAL examples are the least frequent transformation in the dataset, so it is challenging for a sequential model to learn to generalize. The distributional model, which does not rely on suffix information, does not have this same weakness, so the aggregation AGGR model has better results.\nThe performance of AGGR+FREQ+DICT is worse than AGGR, however. This is surprising because, in all other transformations, adding dictionary information improves the accuracies. We believe this is due to the ambiguity of the ground truth: Many root words have seemingly multiple plausible nominal transformations, such as rigid → {rigidness, rigidity} and equivalent → {equivalence, equivalency}. The dictionary constraint produces a better set of hypotheses to rescore, as demonstrated in Table 5. Therefore, the dictionary-constrained model is likely to have more of these ambiguous cases, which makes the task more difficult."
  }, {
    "heading": "7.1 Strengths of SEQ and DIST",
    "text": "In this subsection we explore why AGGR improves consistently over SEQ even though it maintains an open vocabulary. We have argued that DIST is able to correctly produce derived words that are\northographically irregular or infrequent in the training data. Figure 2 quantifies this phenomenon, analyzing the difference in accuracy between the two models, and plotting this in relationship to the frequency of the suffix in the training data. The plot shows that SEQ excels at generating derived words ending in -ly, -ion, and other suffixes that appeared frequently in the training data. DIST’s improvements over SEQ are generally much less frequent in the training data, or as in the case of -ment, are less frequent than other suffixes for the same transformation (like -ion.) By producing derived words whose suffixes show up rarely in the training data, DIST helps solve the orthographic irregularity problem."
  }, {
    "heading": "8 Prior Work",
    "text": "There has been much work on the related task of inflected word generation (Durrett and DeNero,\n2013; Rastogi et al., 2016; Hulden et al., 2014). It is a structurally similar task to ours, but does not have the same difficulty of challenges (Cotterell et al., 2017a,b), which we have addressed in our work. The paradigm completion for derivational morphology dataset we use in this work was introduced in Cotterell et al. (2017b). They apply the model that won the 2016 SIGMORPHON shared task on inflectional morphology to derivational morphology (Kann and Schütze, 2016; Cotterell et al., 2016). We use this as our baseline.\nOur implementation of the dictionary constraint is an example of a special constraint which can be directly incorporated into the inference algorithm at little additional cost. Roth and Yih (2004, 2007) propose a general inference procedure that naturally incorporates constraints through recasting inference as solving an integer linear program.\nBeam or hypothesis rescoring to incorporate an expensive or non-decomposable signal into search has a history in machine translation (Huang and Chiang, 2007). In inflectional morphology, Nicolai et al. (2015) use this idea to rerank hypotheses using orthographic features and Faruqui et al. (2016) use a character-level language model. Our approach is similar to Faruqui et al. (2016) in that we use statistics from a raw corpus, but at the token level.\nThere have been several attempts to use distributional information in morphological generation and analysis. Soricut and Och (2015) collect pairs of words related by any morphological change in an unsupervised manner, then select a vector offset which best explains their observations. There has been subsequent work exploring the vector offset method, finding it unsuccessful in captur-\ning derivational transformations (Gladkova et al., 2016). However, we use more expressive, nonlinear functions to model derivational transformations and report positive results. Gupta et al. (2017) then learn a linear transformation per orthographic rule to solve a word analogy task. Our distributional model learns a function per derivational transformation, not per orthographic rule, which allows it to generalize to unseen orthography."
  }, {
    "heading": "9 Implementation Details",
    "text": "Our models are implemented in Python using the DyNet deep learning library (Neubig et al., 2017). The code is freely available for download.4\nSequence Model The sequence-to-sequence model uses character embeddings of size 20, which are shared across the encoder and decoder, with a vocabulary size of 63. The hidden states of the LSTMs are of size 40.\nFor training, we use Adam with an initial learning rate of 0.005, a batch size of 5, and train for a maximum of 30 epochs. If after one epoch of the training data, the loss on the validation set does not decrease, we anneal the learning rate by half and revert to the previous best model.\nDuring decoding, we find the top 1 most probable sequence as discussed in Section 6 unless rescoring is used, in which we use the top 10.\nRescorer The rescorer is a 1-hidden-layer perceptron with a tanh nonlinearity and 4 hidden units. It is trained for a maximum of 5 epochs.\nDistributional Model The DIST model is a 1- hidden-layer perceptron with a tanh nonlinearity\n4https://github.com/danieldeutsch/ acl2018\nand 100 hidden units. It is trained for a maximum of 25 epochs."
  }, {
    "heading": "10 Conclusion",
    "text": "In this work, we present a novel aggregation model for derived word generation. This model learns to choose between the predictions of orthographicallyand distributionally-informed models. This ameliorates suffix ambiguity and orthographic irregularity, the salient problems of the generation task. Concurrently, we show that derivational transformations can be usefully modeled as nonlinear functions on distributional word embeddings. The distributional and orthographic models aggregated contribute orthogonal information to the aggregate, as shown by substantial improvements over state-of-the-art results, and qualitative analysis. Two ways of incorporating corpus knowledge – constrained decoding and rescoring – demonstrate further improvements to our main contribution."
  }, {
    "heading": "Acknowledgements",
    "text": "We would like to thank Shyam Upadhyay, Jordan Kodner, and Ryan Cotterell for insightful discussions about derivational morphology. We would also like to thank our anonymous reviewers for helpful feedback on clarity and presentation.\nThis work was supported by Contract HR001115-2-0025 with the US Defense Advanced Research Projects Agency (DARPA). Approved for Public Release, Distribution Unlimited. The views expressed are those of the authors and do not reflect the official policy or position of the Department of Defense or the U.S. Government."
  }],
  "year": 2018,
  "references": [{
    "title": "Neural machine translation by jointly learning to align and translate",
    "authors": ["Dzmitry Bahdanau", "Kyunghyun Cho", "Yoshua Bengio."],
    "venue": "CoRR abs/1409.0473.",
    "year": 2014
  }, {
    "title": "The sigmorphon 2016 shared taskmorphological reinflection",
    "authors": ["Ryan Cotterell", "Christo Kirov", "John Sylak-Glassman", "David Yarowsky", "Jason Eisner", "Mans Hulden."],
    "venue": "ACL 2016 page 10.",
    "year": 2016
  }, {
    "title": "Paradigm completion for derivational morphology",
    "authors": ["Ryan Cotterell", "Ekaterina Vylomova", "Huda Khayrallah", "Christo Kirov", "David Yarowsky."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language",
    "year": 2017
  }, {
    "title": "Supervised learning of complete morphological paradigms",
    "authors": ["Greg Durrett", "John DeNero."],
    "venue": "Proceedings of the 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language",
    "year": 2013
  }, {
    "title": "Morphological inflection generation using character sequence to sequence learning",
    "authors": ["Manaal Faruqui", "Yulia Tsvetkov", "Graham Neubig", "Chris Dyer."],
    "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association",
    "year": 2016
  }, {
    "title": "Analogy-based detection of morphological and semantic relations with word embeddings: what works and what doesn’t",
    "authors": ["Anna Gladkova", "Aleksandr Drozd", "Satoshi Matsuoka."],
    "venue": "Proceedings of the NAACL Student Research",
    "year": 2016
  }, {
    "title": "Framewise phoneme classification with bidirectional lstm and other neural network architectures",
    "authors": ["Alex Graves", "Jürgen Schmidhuber."],
    "venue": "Neural Networks 18(5-6):602–610.",
    "year": 2005
  }, {
    "title": "Exploiting morphological regularities in distributional word representations",
    "authors": ["Arihant Gupta", "Syed Sarfaraz Akhtar", "Avijit Vajpayee", "Arjit Srivastava", "Madan Gopal Jhanwar", "Manish Shrivastava."],
    "venue": "Proceedings of the 2017 Con-",
    "year": 2017
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural computation 9(8):1735– 1780.",
    "year": 1997
  }, {
    "title": "Forest rescoring: Faster decoding with integrated language models",
    "authors": ["Liang Huang", "David Chiang."],
    "venue": "Proceedings of the 45th Annual Meeting of the Association of Computational",
    "year": 2007
  }, {
    "title": "Quantitative analysis",
    "authors": ["Erez Lieberman Aiden"],
    "year": 2011
  }, {
    "title": "Efficient estimation",
    "authors": ["Jeffrey Dean"],
    "year": 2013
  }, {
    "title": "Inflection generation as discriminative string transduction",
    "authors": ["Garrett Nicolai", "Colin Cherry", "Grzegorz Kondrak."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human",
    "year": 2015
  }, {
    "title": "Weighting finite-state transductions with neural context",
    "authors": ["Pushpendre Rastogi", "Ryan Cotterell", "Jason Eisner."],
    "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Lan-",
    "year": 2016
  }, {
    "title": "A linear programming formulation for global inference in natural language tasks",
    "authors": ["D. Roth", "W. Yih."],
    "venue": "Hwee Tou Ng and Ellen Riloff, editors, Proc. of the Conference on Computational Natural Language Learning (CoNLL). As-",
    "year": 2004
  }, {
    "title": "Global inference for entity and relation identification via a linear programming formulation http://cogcomp.org/papers/RothYi07.pdf",
    "authors": ["D. Roth", "W. Yih"],
    "year": 2007
  }, {
    "title": "A graphbased lattice dependency parser for joint morphological segmentation and syntactic analysis",
    "authors": ["Wolfgang Seeker", "Özlem Çetinoglu."],
    "venue": "Transactions of the Association for Computational Linguistics 3:359–373.",
    "year": 2015
  }, {
    "title": "Unsupervised morphology induction using word embeddings",
    "authors": ["Radu Soricut", "Franz Och."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Lan-",
    "year": 2015
  }],
  "id": "SP:4649032b1ab77c0107acf6b91f4c2c56afc4f9cd",
  "authors": [{
    "name": "Daniel Deutsch",
    "affiliations": []
  }, {
    "name": "John Hewitt",
    "affiliations": []
  }, {
    "name": "Dan Roth",
    "affiliations": []
  }],
  "abstractText": "Modeling derivational morphology to generate words with particular semantics is useful in many text generation tasks, such as machine translation or abstractive question answering. In this work, we tackle the task of derived word generation. That is, given the word “run,” we attempt to generate the word “runner” for “someone who runs.” We identify two key problems in generating derived words from root words and transformations: suffix ambiguity and orthographic irregularity. We contribute a novel aggregation model of derived word generation that learns derivational transformations both as orthographic functions using sequence-to-sequence models and as functions in distributional word embedding space. Our best open-vocabulary model, which can generate novel words, and our best closed-vocabulary model, show 22% and 37% relative error reductions over current state-of-the-art systems on the same dataset.",
  "title": "A Distributional and Orthographic Aggregation Model for English Derivational Morphology"
}