{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 758–763 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n758"
  }, {
    "heading": "1 Introduction",
    "text": "Sentiment classification is an important task of natural language processing (NLP), aiming to classify the sentiment polarity of a given text as positive, negative, or more fine-grained classes. It has obtained considerable attention due to its broad applications in natural language processing (Hao et al., 2012; Gui et al., 2017). Most existing studies set up sentiment classifiers using supervised machine learning approaches, such as support vector machine (SVM) (Pang et al., 2002), convolutional neural network (CNN) (Kim, 2014; Bonggun et al., 2017), long short-term memory (LSTM) (Hochreiter and Schmidhuber, 1997; Qian et al., 2017), Tree-LSTM (Tai et al., 2015), and attention-based methods (Zhou et al., 2016; Yang et al., 2016; Lin et al., 2017; Du et al., 2017).\nDespite the remarkable progress made by the\nprevious work, we argue that sentiment analysis still remains a challenge. Sentiment resources including sentiment lexicon, negation words, intensity words play a crucial role in traditional sentiment classification approaches (Maks and Vossen, 2012; Duyu et al., 2014). Despite its usefulness, to date, the sentiment linguistic knowledge has been underutilized in most recent deep neural network models (e.g., CNNs and LSTMs).\nIn this work, we propose a Multi-sentimentresource Enhanced Attention Network (MEAN) for sentence-level sentiment classification to integrate many kinds of sentiment linguistic knowledge into deep neural networks via multi-path attention mechanism. Specifically, we first design a coupled word embedding module to model the word representation from character-level and word-level semantics. This can help to capture the morphological information such as prefixes and suffixes of words. Then, we propose a multisentiment-resource attention module to learn more comprehensive and meaningful sentiment-specific sentence representation by using the three types of sentiment resource words as attention sources attending to the context words respectively. In this way, we can attend to different sentimentrelevant information from different representation subspaces implied by different types of sentiment sources and capture the overall semantics of the sentiment, negation and intensity words for sentiment prediction.\nThe main contributions of this paper are summarized as follows. First, we design a coupled word embedding obtained from character-level embedding and word-level embedding to capture both the character-level morphological information and word-level semantics. Second, we propose a multi-sentiment-resource attention module to learn more comprehensive sentiment-specific sentence representation from multiply subspaces\nimplied by three kinds of sentiment resources including sentiment lexicon, intensity words, negation words. Finally, the experimental results show that MEAN consistently outperforms competitive methods."
  }, {
    "heading": "2 Model",
    "text": "Our proposed MEAN model consists of three key components: coupled word embedding module, multi-sentiment-resource attention module, sentence classifier module. In the rest of this section, we will elaborate these three parts in details."
  }, {
    "heading": "2.1 Coupled Word Embedding",
    "text": "To exploit the sentiment-related morphological information implied by some prefixes and suffixes of words (such as “Non-”, “In-”, “Im-”), we design a coupled word embedding learned from character-level embedding and word-level embedding. We first design a character-level convolution neural network (Char-CNN) to obtain characterlevel embedding (Zhang et al., 2015). Different from (Zhang et al., 2015), the designed CharCNN is a fully convolutional network without max-pooling layer to capture better semantic information in character chunk. Specifically, we first input one-hot-encoding character sequences to a 1 × 1 convolution layer to enhance the semantic nonlinear representation ability of our model (Long et al., 2015), and the output is then fed into a multi-gram (i.e. different window sizes) convolution layer to capture different local character chunk information. For word-level embedding, we use pre-trained word vectors, GloVe (Pennington et al., 2014), to map each word to a lowdimensional vector space. Finally, each word is represented as a concatenation of the characterlevel embedding and word-level embedding. This is performed on the context words and the three types of sentiment resource words 1, resulting in four final coupled word embedding matrices: the W c = [wc1, ..., w c t ] ∈ Rd×t for context words, the W s = [ws1, ..., w s m] ∈ Rd×m for sentiment words, the W i = [wi1, ..., w i k] ∈ Rd×k for intensity words, the Wn = [wn1 , ..., w n p ] ∈ Rd×p for negation words. Here, t,m, k, p are the length of the corresponding items respectively, and d is the embedding dimension. Each W is normalized to better calculate the following word correlation.\n1To be precise, sentiment resource words include sentiment words, negation words and intensity words."
  }, {
    "heading": "2.2 Multi-sentiment-resource Attention Module",
    "text": "After obtaining the coupled word embedding, we propose a multi-sentiment-resource attention mechanism to help select the crucial sentimentresource-relevant context words to build the sentiment-specific sentence representation. Concretely, we use the three kinds of sentiment resource words as attention sources to attend to the context words respectively, which is beneficial to capture different sentiment-relevant context words corresponding to different types of sentiment sources. For example, using sentiment words as attention source attending to the context words helps form the sentiment-word-enhanced sentence representation. Then, we combine the three kinds of sentiment-resource-enhanced sentence representations to learn the final sentiment-specific sentence representation. We design three types of attention mechanisms: sentiment attention, intensity attention, negation attention to model the three kinds of sentiment resources, respectively. In the following, we will elaborate the three types of attention mechanisms in details.\nFirst, inspired by (Xiong et al.), we expect to establish the word-level relationship between the context words and different kinds of sentiment resource words. To be specific, we define the dot products among the context words and the three kinds of sentiment resource words as correlation matrices. Mathematically, the detailed formulation is described as follows.\nM s = (W c)T ·W s ∈ Rt×m (1) M i = (W c)T ·W i ∈ Rt×k (2) Mn = (W c)T ·Wn ∈ Rt×p (3)\nwhereM s,M i,Mn are the correlation matrices to measure the relationship among the context words and the three kinds of sentiment resource words, representing the relevance between the context words and the sentiment resource word.\nAfter obtaining the correlation matrices, we can compute the sentiment-resource-relevant context word representations Xcs , X c i , X c n by the dot products among the context words and different types of corresponding correlation matrices. Meanwhile, we can also obtain the context-wordrelevant sentiment word representation matrix Xs by the dot product between the correlation matrix M s and the sentiment words W s, the context-\nword-relevant intensity word representation matrix Xi by the dot product between the intensity words W i and the correlation matrix M i, the context-word-relevant negation word representation matrix Xn by the dot product between the negation words Wn and the correlation matrix Mn. The detailed formulas are presented as follows:\nXcs = W cM s, Xs = W s(M s)T (4) Xci = W cM i, Xi = W i(M i)T (5) Xcn = W cMn, Xn = Wn(Mn)T (6)\nThe final enhanced context word representation matrix is computed as:\nXc = Xcs +X c i +X c n. (7)\nNext, we employ four independent GRU networks (Chung et al., 2015) to encode hidden states of the context words and the three types of sentiment resource words, respectively. Formally, given the word embedding Xc, Xs, Xi, Xn, the hidden state matrices Hc, Hs, H i, Hn can be obtained as follows:\nHc = GRU(Xc) (8)\nHs = GRU(Xs) (9)\nH i = GRU(Xi) (10)\nHn = GRU(Xn) (11)\nAfter obtaining the hidden state matrices, the sentiment-word-enhanced sentence representation o1 can be computed as:\no1 = t∑ i=1 αih c i , q s = m∑ i=1 hsi/m (12) β([hci ; qs]) = u T s tanh(Ws[h c i ; qs]) (13) αi = exp(β([hci ; qs]))∑t i=1 exp(β([h c i ; qs])) (14)\nwhere qs denotes the mean-pooling operation towards Hs, β is the attention function that calculates the importance of the i-th word hci in the context and αi indicates the importance of the ith word in the context, us and Ws are learnable parameters.\nSimilarly, with the hidden states H i and Hn for the intensity words and the negation words as attention sources, we can obtain the intensityword-enhanced sentence representation o2 and the\nnegation-word-enhanced sentence representation o3. The final comprehensive sentiment-specific sentence representation õ is the composition of the above three sentiment-resource-specific sentence representations o1, o2, o3:\nõ = [o1, o2, o3] (15)"
  }, {
    "heading": "2.3 Sentence Classifier",
    "text": "After obtaining the final sentence representation õ, we feed it to a softmax layer to predict the sentiment label distribution of a sentence:\nŷ = exp(W̃o T õ + b̃o)∑C\ni=1 exp(W̃o T õ + b̃o)\n(16)\nwhere ŷ is the predicted sentiment distribution of the sentence, C is the number of sentiment labels, W̃o and b̃o are parameters to be learned.\nFor model training, our goal is to minimize the cross entropy between the ground truth and predicted results for all sentences. Meanwhile, in order to avoid overfitting, we use dropout strategy to randomly omit parts of the parameters on each training case. Inspired by (Lin et al., 2017), we also design a penalization term to ensure the diversity of semantics from different sentiment-resourcespecific sentence representations, which reduces information redundancy from different sentiment resources attention. Specifically, the final loss function is presented as follows:\nL(ŷ, y) =− N∑ i=1 C∑ j=1 yji log(ŷ j i ) + λ( ∑ θ∈Θ θ2)\n(17)\n+ µ||ÕÕT − ψI||2F Õ =[o1; o2; o3] (18)\nwhere yji is the target sentiment distribution of the sentence, ŷji is the prediction probabilities, θ denotes each parameter to be regularized, Θ is parameter set, λ is the coefficient for L2 regularization, µ is a hyper-parameter to balance the three terms, ψ is the weight parameter, I denotes the the identity matrix and ||.||F denotes the Frobenius norm of a matrix. Here, the first two terms of the loss function are cross-entropy function of the predicted and true distributions and L2 regularization respectively, and the final term is a penalization term to encourage the diversity of sentiment sources."
  }, {
    "heading": "3 Experiments",
    "text": ""
  }, {
    "heading": "3.1 Datasets and Sentiment Resources",
    "text": "Movie Review (MR)2 and Stanford Sentiment Treebank (SST)3 are used to evaluate our model. MR dataset has 5,331 positive samples and 5,331 negative samples. We adopt the same data split as in (Qian et al., 2017). SST consists of 8,545 training samples, 1,101 validation samples, 2210 test samples. Each sample is marked as very negative, negative, neutral, positive, or very positive. Sentiment lexicon combines the sentiment words from both (Qian et al., 2017) and (Hu and Liu, 2004), resulting in 10,899 sentiment words in total. We collect negation and intensity words manually as the number of these words is limited."
  }, {
    "heading": "3.2 Baselines",
    "text": "In order to comprehensively evaluate the performance of our model, we list several baselines for sentence-level sentiment classification.\nRNTN: Recursive Tensor Neural Network (Socher et al., 2013) is used to model correlations between different dimensions of child nodes vectors.\nLSTM/Bi-LSTM: Cho et al. (2014) employs Long Short-Term Memory and the bidirectional variant to capture sequential information.\nTree-LSTM: Memory cells was introduced by Tree-Structured Long Short-Term Memory (Tai et al., 2015) and gates into tree-structured neural network, which is beneficial to capture semantic relatedness by parsing syntax trees.\nCNN: Convolutional Neural Networks (Kim, 2014) is applied to generate task-specific sentence representation.\nNCSL: Teng et al. (2016) designs a Neural Context-Sensitive Lexicon (NSCL) to obtain prior sentiment scores of words in the sentence.\nLR-Bi-LSTM: Qian et al. (2017) imposes linguistic roles into neural networks by applying linguistic regularization on intermediate outputs with KL divergence.\nSelf-attention: Lin et al. (2017) proposes a selfattention mechanism to learn structured sentence embedding.\n2http://www.cs.cornell.edu/people/ pabo/movie-review-data/\n3https://nlp.stanford.edu/sentiment/we train the model on both phrases and sentences but only test on sentences\nID-LSTM: (Tianyang et al., 2018) uses reinforcement learning to learn structured sentence representation for sentiment classification."
  }, {
    "heading": "3.3 Implementation Details",
    "text": "In our experiments, the dimensions of characterlevel embedding and word embedding (GloVe) are both set to 300. Kernel sizes of multi-gram convolution for Char-CNN are set to 2, 3, respectively. All the weight matrices are initialized as random orthogonal matrices, and we set all the bias vectors as zero vectors. We optimize the proposed model with RMSprop algorithm, using mini-batch training. The size of mini-batch is 60. The dropout rate is 0.5, and the coefficient λ of L2 normalization is set to 10−5. µ is set to 10−4. ψ is set to 0.9. When there are not sentiment resource words in the sentences, all the context words are treated as sentiment resource words to implement the multi-path self-attention strategy."
  }, {
    "heading": "3.4 Experiment Results",
    "text": "In our experiments, to be consistent with the recent baseline methods, we adopt classification accuracy as evaluation metric. We summarize the experimental results in Table 1. Our model has robust superiority over competitors and sets stateof-the-art on MR and SST datasets. First, our model brings a substantial improvement over the methods that do not leverage sentiment linguistic knowledge (e.g., RNTN, LSTM, BiLSTM, CNN and ID-LSTM) on both datasets. This verifies the effectiveness of leveraging sentiment linguistic resource with the deep learning algorithms. Second, our model also consistently outperforms LR-Bi-LSTM which integrates linguistic roles of sentiment, negation and intensity words into neural networks via the linguistic regularization. For example, our model achieves 2.4% improvements over the MR dataset and 0.8% improvements over the SST dataset compared to LR-Bi-LSTM. This is because that MEAN designs attention mechanisms to leverage sentiment resources efficiently, which utilizes the interactive information between context words and sentiment resource words.\nIn order to analyze the effectiveness of each component of MEAN, we also report the ablation test in terms of discarding character-level embedding (denoted as MEAN w/o CharCNN) and sentiment words/negation words/intensity words (denoted as MEAN w/o sentiment words/negation words/intensity words). All the tested factors con-\ntribute greatly to the improvement of the MEAN. In particular, the accuracy decreases sharply when discarding the sentiment words. This is within our expectation since sentiment words are vital when classifying the polarity of the sentences."
  }, {
    "heading": "4 Conclusion",
    "text": "In this paper, we propose a novel Multi-sentimentresource Enhanced Attention Network (MEAN) to enhance the performance of sentence-level sentiment analysis, which integrates the sentiment linguistic knowledge into the deep neural network."
  }, {
    "heading": "Acknowledgements",
    "text": "This work was supported in part by the Research Fund for the development of strategic emerging industries by ShenZhen city (No.JCYJ20160301151844537 and No. JCYJ20160331104524983)."
  }],
  "year": 2018,
  "references": [{
    "title": "Lexicon integrated cnn models with attention for sentiment analysis",
    "authors": ["Shin Bonggun", "Lee Timothy", "D. Choi Jinho."],
    "venue": "Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis, ACL 2017.",
    "year": 2017
  }, {
    "title": "Learning phrase representations using RNN encoder-decoder for statistical machine translation",
    "authors": ["Kyunghyun Cho", "Bart van Merrienboer", "Çaglar Gülçehre", "Fethi Bougares", "Holger Schwenk", "Yoshua Bengio."],
    "venue": "CoRR, abs/1406.1078.",
    "year": 2014
  }, {
    "title": "Gated feedback recurrent neural networks",
    "authors": ["Junyoung Chung", "Caglar Gulcehre", "Kyunghyun Cho", "Yoshua Bengio."],
    "venue": "Proceedings of ICML 2015.",
    "year": 2015
  }, {
    "title": "Stance classification with target-specific neural attention networks",
    "authors": ["Jiachen Du", "Ruifeng Xu", "Yulan He", "Lin Gui."],
    "venue": "Proceedings of IJCAI 2017.",
    "year": 2017
  }, {
    "title": "Coooolll: A deep learning system for twitter sentiment classification",
    "authors": ["Tang Duyu", "Wei Furu", "Qin Bing", "Liu Ting", "Zhou Ming."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation, SemEval@COLING 2014.",
    "year": 2014
  }, {
    "title": "Learning representations from heterogeneous network for sentiment classification of product reviews",
    "authors": ["Lin Gui", "Yu Zhou", "Ruifeng Xu", "Yulan He", "Qin Lu."],
    "venue": "Knowledge-Based Systems, 124:34–45.",
    "year": 2017
  }, {
    "title": "Combining social cognitive theories with linguistic features for multi-genre sentiment analysis",
    "authors": ["Li Hao", "Chen Yu", "Ji Heng", "Muresan Smaranda", "Zheng Dequan."],
    "venue": "Proceedings of the 26th Pacific Asia Conference on Language, Information and",
    "year": 2012
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural computation, pages 1735–1780.",
    "year": 1997
  }, {
    "title": "Mining and summarizing customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of SIGKDD 2004.",
    "year": 2004
  }, {
    "title": "Convolutional neural networks for sentence classification",
    "authors": ["Yoon Kim."],
    "venue": "Proceedings of EMNLP 2014.",
    "year": 2014
  }, {
    "title": "A structured self-attentive sentence embedding",
    "authors": ["Zhouhan Lin", "Minwei Feng", "Cicero Nogueira dos Santos", "Mo Yu", "Bing Xiang", "Bowen Zhou", "Yoshua Bengio."],
    "venue": "Proceedings of ICLR 2017.",
    "year": 2017
  }, {
    "title": "Fully convolutional networks for semantic segmentation",
    "authors": ["Jonathan Long", "Evan Shelhamer", "Trevor Darrell."],
    "venue": "Proceedings of CVPR 2015.",
    "year": 2015
  }, {
    "title": "A lexicon model for deep sentiment analysis and opinion mining applications",
    "authors": ["Isa Maks", "Piek Vossen."],
    "venue": "Decision Support Systems, pages 680–688.",
    "year": 2012
  }, {
    "title": "Thumbs up?: sentiment classification using machine learning techniques",
    "authors": ["Bo Pang", "Lillian Lee", "Shivakumar Vaithyanathan."],
    "venue": "Proceedings of ACL 2002.",
    "year": 2002
  }, {
    "title": "Glove: Global vectors for word representation",
    "authors": ["Jeffrey Pennington", "Richard Socher", "Christopher Manning."],
    "venue": "Proceedings of EMNLP 2014.",
    "year": 2014
  }, {
    "title": "Linguistically regularized LSTM for sentiment classification",
    "authors": ["Qiao Qian", "Minlie Huang", "Jinhao Lei", "Xiaoyan Zhu."],
    "venue": "Proceedings of ACL 2017, pages 1679–1689.",
    "year": 2017
  }, {
    "title": "Recursive deep models for semantic compositionality over a sentiment treebank",
    "authors": ["Richard Socher", "Alex Perelygin", "Jean Wu", "Jason Chuang", "Christopher D Manning", "Andrew Ng", "Christopher Potts."],
    "venue": "Proceedings of EMNLP 2013.",
    "year": 2013
  }, {
    "title": "Improved semantic representations from tree-structured long short-term memory networks",
    "authors": ["Kai Sheng Tai", "Richard Socher", "Christopher D. Manning."],
    "venue": "Proceedings of ACL 2015.",
    "year": 2015
  }, {
    "title": "Context-sensitive lexicon features for neural sentiment analysis",
    "authors": ["Zhiyang Teng", "Duy-Tin Vo", "Yue Zhang."],
    "venue": "Proceedings of EMNLP 2016.",
    "year": 2016
  }, {
    "title": "Learning structured representation for text classification via reinforcement learning",
    "authors": ["Zhang Tianyang", "Huang Minlie", "Li Zhao."],
    "venue": "Proceedings of AAAI 2018.",
    "year": 2018
  }, {
    "title": "Hierarchical attention networks for document classification",
    "authors": ["Zichao Yang", "Diyi Yang", "Chris Dyer", "Xiaodong He", "Alex Smola", "Eduard Hovy."],
    "venue": "Proceedings of NAACL 2016.",
    "year": 2016
  }, {
    "title": "Character-level convolutional networks for text classification",
    "authors": ["Xiang Zhang", "Junbo Zhao", "Yann LeCun."],
    "venue": "Proceedings of NIPS 2015.",
    "year": 2015
  }, {
    "title": "Attention-based lstm network for cross-lingual sentiment classification",
    "authors": ["Xinjie Zhou", "Xiaojun Wan", "Jianguo Xiao."],
    "venue": "Proceedings of EMNLP 2016.",
    "year": 2016
  }],
  "id": "SP:11bb1c2392189658618cca5e7ed9dc91fb900d2d",
  "authors": [{
    "name": "Zeyang Lei",
    "affiliations": []
  }, {
    "name": "Yujiu Yang",
    "affiliations": []
  }, {
    "name": "Min Yang",
    "affiliations": []
  }, {
    "name": "Yi Liu",
    "affiliations": []
  }],
  "abstractText": "Deep learning approaches for sentiment classification do not fully exploit sentiment linguistic knowledge. In this paper, we propose a Multi-sentiment-resource Enhanced Attention Network (MEAN) to alleviate the problem by integrating three kinds of sentiment linguistic knowledge (e.g., sentiment lexicon, negation words, intensity words) into the deep neural network via attention mechanisms. By using various types of sentiment resources, MEAN utilizes sentiment-relevant information from different representation subspaces, which makes it more effective to capture the overall semantics of the sentiment, negation and intensity words for sentiment prediction. The experimental results demonstrate that MEAN has robust superiority over strong competitors.",
  "title": "A Multi-sentiment-resource Enhanced Attention Network for Sentiment Classification"
}