{
  "sections": [{
    "text": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 4810–4815 Brussels, Belgium, October 31 - November 4, 2018. c©2018 Association for Computational Linguistics\n4810"
  }, {
    "heading": "1 Introduction",
    "text": "Community question-answer fora are great resources, collecting answers to frequently and lessfrequently asked questions on specific topics, but these are often not moderated and contain many irrelevant answers. Community Question Answering (CQA), cast as a question relevancy ranking problem, was the topic of two shared tasks at SemEval 2016-17. This is a non-trivial retrieval task, typically evaluated using mean average precision (MAP). We present a strong baseline for this task, on par with or surpassing state-of-the-art systems.\nThe English subtasks of the SemEval CQA (Nakov et al., 2015, 2017) consist of QuestionQuestion Similarity, Question-Comment Similarity, and Question-External Comment Similarity. In this study, we focus on the core subtask of Question-Question similarity, defined as follows: Given a question, rank other relevant questions by their relevancy to that question. This proved to be a difficult task in both SemEval-16 and SemEval17 as it is the one with the least amount of data available. The baseline was the ranking retrieved\nby performing a Google search, which proved to be a strong baseline beating a large portion of the systems submitted.\nContribution Our baseline is a simple multitask feed-forward neural network taking distance measures between pairs of questions as input. We use a question-answer dataset as auxiliary task; but we also experiment with datasets for pairwise classification tasks such as natural language inference and fake news detection. This simple, easy-totrain model is on par or better than state-of-theart systems for question relevancy ranking. We also show that this simple model outperforms a more complex model based on recurrent neural networks."
  }, {
    "heading": "2 Our Model",
    "text": "We present a simple baseline model for question relevancy ranking.1 It is a deep feed-forward network with a hidden layer that is shared with an auxiliary task model. The input to the network is extremely simple and consists of five distance measures of the input question-question pair. §2.1 discusses these distance measures, and how they relate. §2.2 introduces the multi-task learning architecture that we propose."
  }, {
    "heading": "2.1 Features",
    "text": "We use four similarity metrics and three sentence representations (averaged word embeddings, binary unigram vectors, and trigram vectors). The cosine distance between the sentence representations of query x and query y is∑\ni xiyi√∑ i x 2 + √∑ i y 2\n1Code available at http://anavaleriagonzalez/FAQ rank.\nThe Manhattan distance is∑ i |xi − yi|\nThe Bhattacharya distance is\n− ln( ∑ i √ xiyi)\nand is a measure of divergence, and the Euclidean distance is √∑\ni\n(xi − yi)2\nNote that the squared Euclidean distance is proportional to cosine distance and Manhattan distance. The Bhattacharya and Jaccard metrics, on the other hand, are sensitive to the number of types in the input (the `1 norm of the vector encodings). So, for example, only the cosine, Euclidean, and Manhattan distances will be the same for\nx = 〈1, 1, 0, 0, 1, 0, 1, 1, 0, 1〉,y = 〈0, 0, 1, 0, 1, 0, 0, 0, 1, 1〉\nand\nx = 〈0, 0, 0, 0, 0, 1, 0, 0, 1, 1〉,y = 〈1, 1, 1, 1, 0, 0, 0, 0, 0, 1〉\nThe Jaccard index is the only metric that can only be applied to two of our representations, unigrams and n-grams: It is defined over mdimensional binary (indicator) vectors and therefore not applicable to averaged embeddings. It is defined as\nx · y m\nWe represent each query pair by these 14 numerical features."
  }, {
    "heading": "2.2 MTL Architecture",
    "text": "Our architecture is a simple feed-forward, multitask learning (MTL) architecture. Our architecture is presented in Figure 1 and is a Multi-Layer Perceptron (MLP) that takes a pair of sequences as input. The sequences can be sampled from the main task or the auxiliary task. The MLP has one shared hidden layer, a task-specific hidden layer and, finally, a task-specific classification layer for each output. The hyper-parameters, after doing grid search, optimizing performance on the validation data, are given in Figure 2."
  }, {
    "heading": "2.3 LSTM baseline",
    "text": "We compare our MLP ranker to a bidirectional LSTM (Hochreiter and Schmidhuber, 1997) model. It takes two sequences inputs: sequence 1 and sequence 2, and a stack of three bidirectional LSTM layers, which encode sequence 1 and sequence 2, respectively. The outputs are then concatenated, to enable representing the differences between the two sequences. Instead of relying only on this presentation (Bowman et al., 2015; Augenstein et al., 2016), we also concatenate our distance features and feed everything into our MLP ranker described above."
  }, {
    "heading": "3 Datasets",
    "text": "For our experiments, we use data from SemEval shared tasks, but we also take advantage of potential synergies with other existing datasets for classification of sentence pairs. Below we present the datasets used for our main and auxiliary tasks. We provide some summary statistics for each dataset in Table 3.\nSemEval 2016 and 2017 As our main dataset we use the queries from SemEval’s subtask B which consists of an original query and 10 possibly related queries. As an auxiliary task, we use the data from subtask A, which is a questionrelated comment ranking task.\nNatural Language Inference Natural Language Inference (NLI), consists in predicting ENTAILMENT, CONTRADICTION or NEUTRAL, given a hypothesis and a premise. We use the MNLI dataset as opposed to the SNLI data (Bowman et al., 2015; Nangia et al., 2017), since it contains different genres. Our model is not built to be a strong NLI system; we use the similarity between premise and hypothesis as a weak signal to improve the generalization on our main task.\nFake News Challenge The Fake News Challenge2 (FNC) was introduced to combat misleading and false information online. This task has been used before in a multi-task setting as a way to utilize general information about pairwise relations (Augenstein et al., 2018). Formally, the FNC task consists in, given a headline and the body of\n2http://www.fakenewschallenge.org/\ntext which can be from the same news article or not, classify the stance of the body of text relative to what is claimed in the headline. There are four labels:\n• AGREES: The body of the article is in agreement with the headline • DISAGREES: The body of the article is in dis-\nagreement with the headline • DISCUSSES: The body of the article does not\ntake a position • UNRELATED: the body of the article dis-\ncusses a different topic\nWe include fake news detection as a weak auxiliary signal that can lead to better generalization of our question-question ranking model."
  }, {
    "heading": "3.1 Evaluation",
    "text": "We evaluate our performance on the main task of question relevancy ranking using the official\nSemEval-2017 Task 3 evaluation scripts (Nakov et al., 2017). The scripts provide a variety of metrics; however, in accordance with the shared task, we report Mean Average Precision (MAP) (the official metric for the SemEval 2016 and 2017 shared tasks); Mean Reciprocal Rank (MRR), which has being thoroughly used for IR and QA; Average Recall; and, finally, the accuracy of predicting relevant documents."
  }, {
    "heading": "4 Results",
    "text": "The results from our experiments are shown in Table 1. We present the official metric from the SemEval task, as well as other common metrics. For the SemEval-16 data, our multitask MLP architecture with a question-answer auxiliary task performed best on all metrics, except accuracy, where the multi-task MLP using all auxiliary tasks performed best. We outperform the winning systems of both the SemEval 2016 and 2017 campaigns. In addition, our improvements from single-task to multi-task are significant (p < 0.01). We also outperform the official IR baseline used in the SemEval 2016 and 2017 shared tasks. We discuss the STL-LSTM-SIM results in §5. Furthermore, in Table 2, we show the performance of our models when training on feature combinations, while in Table 3, we present an ablation test where we remove one feature at a time.\nLearning curve In Figure 4, we also present our learning curves for the development set when incrementally increasing the training set size. We observe that when using an auxiliary task, the learning is more stable across training set size."
  }, {
    "heading": "5 Discussion",
    "text": "For the SemEval shared tasks on CQA, several authors used complex recurrent and convolutional neural network architectures (Severyn and Moschitti, 2015; Barrón-Cedeno et al., 2016). For example, Barrón-Cedeno et al. used a convolutional neural network in combination with feature vectors representing lexical, syntactic, and semantic similarity as well as tree kernels. Their performance was slightly lower than the best system (SemEval-Best for 2016 in Table 1). The best system used lexical and semantic similarity measures in combination with a ranking model based on support vector machines (SVMs) (Filice et al., 2016; Franco-Salvador et al., 2016). Both systems are harder to implement and train than the model we propose here. For SemEval-17, FrancoSalvador et al. (2016), the winning team used\ndistributed representations of words, knowledge graphs and frames from FrameNet (Baker et al., 1998) as some of their features, and used SVMs for ranking.\nFor a more direct comparison, we also train a more expressive model than the simple MTLbased model we propose. This architecture is based on bi-directional LSTMs (Hochreiter and Schmidhuber, 1997). For this model, we input sequences of embedded words (using pre-trained word embeddings) from each query into independent BiLSTM blocks and output a vector representation for each query. We then concatenate the vector representations with the similarity features from our MTL model and feed it into a dense layer and a classification layer. This way we can evaluate the usefulness of the flexible, expressive LSTM network directly (as our MTL model becomes an ablation instance of the full, more complex architecture). We use the same dropout regularization and SGD values as for the MLP. Tuning all parameters on the development data, we do not manage to outperform our proposed model, however. See lines MTL-LSTM-SIM in Table 1 for results."
  }, {
    "heading": "6 Conclusion",
    "text": "We show that simple feature engineering, combined with an auxiliary task and a simple feedfor-\nward neural architecture is appropriate for a small dataset and manages to beat the baseline and the best performing systems for the Semeval task of question relevancy ranking. We observe that introducing pairwise classification tasks leads to significant improvements in performance and a more stable model. Overall, our simple model introduces a new strong baseline which is particularly useful when there is a lack of labeled data."
  }, {
    "heading": "Acknowledgments",
    "text": "The first author of this paper is funded by a BotXO PhD Award;3 the last author by an ERC Starting Grant. We gratefully acknowledge the support of the NVIDIA Corporation with the donation of the Titan Xp GPU used for this research."
  }],
  "year": 2018,
  "references": [{
    "title": "Stance Detection with Bidirectional Conditional Encoding",
    "authors": ["Isabelle Augenstein", "Tim Rocktschel", "Andreas Vlachos", "Kalina Bontcheva."],
    "venue": "EMNLP, pages 876–885. The Association for Computational Linguistics.",
    "year": 2016
  }, {
    "title": "Multi-task learning of pairwise sequence classification tasks over disparate label spaces",
    "authors": ["Isabelle Augenstein", "Sebastian Ruder", "Anders Søgaard."],
    "venue": "NAACL.",
    "year": 2018
  }, {
    "title": "The Berkeley Framenet project",
    "authors": ["Collin F Baker", "Charles J Fillmore", "John B Lowe."],
    "venue": "Proceedings of the 17th international conference on Computational linguistics-Volume 1, pages 86–90. Association for Computational Linguistics.",
    "year": 1998
  }, {
    "title": "ConvKN at SemEval-2016 task 3: Answer and question selection for question",
    "authors": ["Alberto Barrón-Cedeno", "Giovanni Da San Martino", "Shafiq Joty", "Alessandro Moschitti", "Fahad AlObaidli", "Salvatore Romeo", "Kateryna Tymoshenko", "Antonio Uva"],
    "year": 2016
  }, {
    "title": "A large annotated corpus for learning natural language inference",
    "authors": ["Samuel R Bowman", "Gabor Angeli", "Christopher Potts", "Christopher D Manning."],
    "venue": "arXiv preprint arXiv:1508.05326.",
    "year": 2015
  }, {
    "title": "KELP at SemEval2016 task 3: Learning semantic relations between questions and answers",
    "authors": ["Simone Filice", "Danilo Croce", "Alessandro Moschitti", "Roberto Basili."],
    "venue": "Proceedings of the 10th International Workshop on Semantic Evalua-",
    "year": 2016
  }, {
    "title": "Uh-prhlt at semeval-2016 task 3: Combining lexical and semantic-based features for community question answering",
    "authors": ["Marc Franco-Salvador", "Sudipta Kar", "Thamar Solorio", "Paolo Rosso."],
    "venue": "Proceedings of SemEval, pages 814–821.",
    "year": 2016
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural computation, 9(8):1735–1780.",
    "year": 1997
  }, {
    "title": "Semeval-2017 task 3: Community question answering",
    "authors": ["Preslav Nakov", "Doris Hoogeveen", "Lluı́s Màrquez", "Alessandro Moschitti", "Hamdy Mubarak", "Timothy Baldwin", "Karin Verspoor"],
    "venue": "In Proceedings of the 11th International Workshop on Semantic",
    "year": 2017
  }, {
    "title": "Semeval-2015 task 3: Answer selection in community question answering",
    "authors": ["Preslav Nakov", "Lluı́s Màrquez", "Walid Magdy", "Alessandro Moschitti", "Jim Glass", "Bilal Randeree"],
    "venue": "In Proceedings of the 9th International Workshop on Semantic Evaluation",
    "year": 2015
  }, {
    "title": "The repeval 2017 shared task: Multi-genre natural language inference with sentence representations",
    "authors": ["Nikita Nangia", "Adina Williams", "Angeliki Lazaridou", "Samuel R Bowman."],
    "venue": "arXiv preprint arXiv:1707.08172.",
    "year": 2017
  }, {
    "title": "Learning to rank short text pairs with convolutional deep neural networks",
    "authors": ["Aliaksei Severyn", "Alessandro Moschitti."],
    "venue": "Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval, pages",
    "year": 2015
  }],
  "id": "SP:5992adca0b296cf1542675f807cb72e730aad966",
  "authors": [{
    "name": "Ana V. González-Garduño",
    "affiliations": []
  }, {
    "name": "Isabelle Augenstein",
    "affiliations": []
  }, {
    "name": "Anders Søgaard",
    "affiliations": []
  }],
  "abstractText": "The best systems at the SemEval-16 and SemEval-17 community question answering shared tasks – a task that amounts to question relevancy ranking – involve complex pipelines and manual feature engineering. Despite this, many of these still fail at beating the IR baseline, i.e., the rankings provided by Google’s search engine. We present a strong baseline for question relevancy ranking by training a simple multi-task feed forward network on a bag of 14 distance measures for the input question pair. This baseline model, which is fast to train and uses only language-independent features, outperforms the best shared task systems on the task of retrieving relevant previously asked questions.",
  "title": "A strong baseline for question relevancy ranking"
}