{
  "sections": [{
    "text": "Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 1127–1138 Vancouver, Canada, July 30 - August 4, 2017. c©2017 Association for Computational Linguistics\nhttps://doi.org/10.18653/v1/P17-1104"
  }, {
    "heading": "1 Introduction",
    "text": "Universal Conceptual Cognitive Annotation (UCCA, Abend and Rappoport, 2013) is a crosslinguistically applicable semantic representation scheme, building on the established Basic Linguistic Theory typological framework (Dixon, 2010a,b, 2012), and Cognitive Linguistics literature (Croft and Cruse, 2004). It has demonstrated applicability to multiple languages, including English, French, German and Czech, support for rapid annotation by non-experts (assisted by an accessible annotation interface (Abend et al., 2017)), and stability under translation (Sulem et al., 2015). It has also proven useful for machine translation evaluation (Birch et al., 2016). UCCA differs from syntactic schemes in terms of content and formal structure. It exhibits reentrancy,\ndiscontinuous nodes and non-terminals, which no single existing parser supports. Lacking a parser, UCCA’s applicability has been so far limited, a gap this work addresses.\nWe present the first UCCA parser, TUPA (Transition-based UCCA Parser), building on recent advances in discontinuous constituency and dependency graph parsing, and further introducing novel transitions and features for UCCA. Transition-based techniques are a natural starting point for UCCA parsing, given the conceptual similarity of UCCA’s distinctions, centered around predicate-argument structures, to distinctions expressed by dependency schemes, and the achievements of transition-based methods in dependency parsing (Dyer et al., 2015; Andor et al., 2016; Kiperwasser and Goldberg, 2016). We are further motivated by the strength of transition-based methods in related tasks, including dependency graph parsing (Sagae and Tsujii, 2008; Ribeyre et al., 2014; Tokgöz and Eryiğit, 2015), constituency parsing (Sagae and Lavie, 2005; Zhang and Clark, 2009; Zhu et al., 2013; Maier, 2015; Maier and Lichte, 2016), AMR parsing (Wang et al., 2015a,b, 2016; Misra and Artzi, 2016; Goodman et al., 2016; Zhou et al., 2016; Damonte et al., 2017) and CCG parsing (Zhang and Clark, 2011; Ambati et al., 2015, 2016).\nWe evaluate TUPA on the English UCCA corpora, including in-domain and out-of-domain settings. To assess the ability of existing parsers to tackle the task, we develop a conversion procedure from UCCA to bilexical graphs and trees. Results show superior performance for TUPA, demonstrating the effectiveness of the presented approach.1\nThe rest of the paper is structured as follows:\n1All parsing and conversion code, as well as trained parser models, are available at https://github.com/ danielhers/tupa.\n1127\nSection 2 describes UCCA in more detail. Section 3 introduces TUPA. Section 4 discusses the data and experimental setup. Section 5 presents the experimental results. Section 6 summarizes related work, and Section 7 concludes the paper."
  }, {
    "heading": "2 The UCCA Scheme",
    "text": "UCCA graphs are labeled, directed acyclic graphs (DAGs), whose leaves correspond to the tokens of the text. A node (or unit) corresponds to a terminal or to several terminals (not necessarily contiguous) viewed as a single entity according to semantic or cognitive considerations. Edges bear a category, indicating the role of the sub-unit in the parent relation. Figure 1 presents a few examples.\nUCCA is a multi-layered representation, where each layer corresponds to a “module” of semantic distinctions. UCCA’s foundational layer, targeted in this paper, covers the predicate-argument structure evoked by predicates of all grammatical categories (verbal, nominal, adjectival and others), the inter-relations between them, and other major linguistic phenomena such as coordination and multi-word expressions. The layer’s basic notion is the scene, describing a state, action, movement or some other relation that evolves in time. Each scene contains one main relation (marked as either a Process or a State), as well as one or more Participants. For example, the sentence “After graduation, John moved to Paris” (Figure 1a) contains two scenes, whose main relations are “graduation” and “moved”. “John” is a Participant in both scenes, while “Paris” only in the latter. Further categories account for inter-scene relations and the internal structure of complex arguments and relations (e.g. coordination, multi-word expressions and modification).\nOne incoming edge for each non-root node is marked as primary, and the rest (mostly used for implicit relations and arguments) as remote edges, a distinction made by the annotator. The primary edges thus form a tree structure, whereas the remote edges enable reentrancy, forming a DAG.\nWhile parsing technology in general, and transition-based parsing in particular, is wellestablished for syntactic parsing, UCCA has several distinct properties that distinguish it from syntactic representations, mostly UCCA’s tendency to abstract away from syntactic detail that do not affect argument structure. For instance, consider the following examples where the concept of a scene\n(a) After\nL\ngraduation P\nH\n, U\nJohn\nA\nmoved\nP\nto R\nParis\nC\nA\nH\nA\n(b) John\nA\ngave\nC\neverything up\nC\nP\nA P process A participant H linked scene C center R relator N connector L scene linker U punctuation F function unit\n(c)\nJohn\nC\nand\nN\nMary\nC\n’s\nF\nA\ntrip\nP\nhome\nA\nFigure 1: UCCA structures demonstrating three structural properties exhibited by the scheme. (a) includes a remote edge (dashed), resulting in “John” having two parents. (b) includes a discontinuous unit (“gave ... up”). (c) includes a coordination construction (“John and Mary”). Pre-terminal nodes are omitted for brevity. Right: legend of edge labels.\nhas a different rationale from the syntactic concept of a clause. First, non-verbal predicates in UCCA are represented like verbal ones, such as when they appear in copula clauses or noun phrases. Indeed, in Figure 1a, “graduation” and “moved” are considered separate events, despite appearing in the same clause. Second, in the same example, “John” is marked as a (remote) Participant in the graduation scene, despite not being overtly marked. Third, consider the possessive construction in Figure 1c. While in UCCA “trip” evokes a scene in which “John and Mary” is a Participant, a syntactic scheme would analyze this phrase similarly to “John and Mary’s shoes”.\nThese examples demonstrate that a UCCA parser, and more generally semantic parsers, face an additional level of ambiguity compared to their syntactic counterparts (e.g., “after graduation” is formally very similar to “after 2pm”, which does not evoke a scene). Section 6 discusses UCCA in the context of other semantic schemes, such as AMR (Banarescu et al., 2013).\nAlongside recent progress in dependency parsing into projective trees, there is increasing interest in parsing into representations with more general structural properties (see Section 6). One such property is reentrancy, namely the sharing of semantic units between predicates. For instance, in Figure 1a, “John” is an argument of both “gradu-\nation” and “moved”, yielding a DAG rather than a tree. A second property is discontinuity, as in Figure 1b, where “gave up” forms a discontinuous semantic unit. Discontinuities are pervasive, e.g., with multi-word expressions (Schneider et al., 2014). Finally, unlike most dependency schemes, UCCA uses non-terminal nodes to represent units comprising more than one word. The use of non-terminal nodes is motivated by constructions with no clear head, including coordination structures (e.g., “John and Mary” in Figure 1c), some multi-word expressions (e.g., “The Haves and the Have Nots”), and prepositional phrases (either the preposition or the head noun can serve as the constituent’s head). To our knowledge, no existing parser supports all structural properties required for UCCA parsing."
  }, {
    "heading": "3 Transition-based UCCA Parsing",
    "text": "We now turn to presenting TUPA. Building on previous work on parsing reentrancies, discontinuities and non-terminal nodes, we define an extended set of transitions and features that supports the conjunction of these properties.\nTransition-based parsers (Nivre, 2003) scan the text from start to end, and create the parse incrementally by applying a transition at each step to the parser’s state, defined using three data structures: a buffer B of tokens and nodes to be processed, a stack S of nodes currently being processed, and a graph G = (V,E, `) of constructed nodes and edges, where V is the set of nodes, E is the set of edges, and ` : E → L is the label function, L being the set of possible labels. Some states are marked as terminal, meaning that G is the final output. A classifier is used at each step to select the next transition based on features encoding the parser’s current state. During training, an oracle creates training instances for the classifier, based on gold-standard annotations.\nTransition Set. Given a sequence of tokens w1, . . . , wn, we predict a UCCA graph G over the sequence. Parsing starts with a single node on the stack (an artificial root node), and the input tokens in the buffer. Figure 2 shows the transition set.\nIn addition to the standard SHIFT and REDUCE operations, we follow previous work in transition-based constituency parsing (Sagae and Lavie, 2005), adding the NODE transition for creating new non-terminal nodes. For every X ∈ L, NODEX creates a new node on the buffer as a par-\nent of the first element on the stack, with an Xlabeled edge. LEFT-EDGEX and RIGHT-EDGEX create a new primary X-labeled edge between the first two elements on the stack, where the parent is the left or the right node, respectively. As a UCCA node may only have one incoming primary edge, EDGE transitions are disallowed if the child node already has an incoming primary edge. LEFTREMOTEX and RIGHT-REMOTEX do not have this restriction, and the created edge is additionally marked as remote. We distinguish between these two pairs of transitions to allow the parser to create remote edges without the possibility of producing invalid graphs. To support the prediction of multiple parents, node and edge transitions leave the stack unchanged, as in other work on transition-based dependency graph parsing (Sagae and Tsujii, 2008; Ribeyre et al., 2014; Tokgöz and Eryiğit, 2015). REDUCE pops the stack, to allow removing a node once all its edges have been created. To handle discontinuous nodes, SWAP pops the second node on the stack and adds it to the top of the buffer, as with the similarly named transition in previous work (Nivre, 2009; Maier, 2015). Finally, FINISH pops the root node and marks the state as terminal.\nClassifier. The choice of classifier and feature representation has been shown to play an important role in transition-based parsing (Chen and Manning, 2014; Andor et al., 2016; Kiperwasser and Goldberg, 2016). To investigate the impact of the type of transition classifier in UCCA parsing, we experiment with three different models.\n1. Starting with a simple and common choice (e.g., Maier and Lichte, 2016), TUPASparse uses a linear classifier with sparse features, trained with the averaged structured perceptron algorithm (Collins and Roark, 2004) and MINUPDATE (Goldberg and Elhadad, 2011): each feature requires a minimum number of updates in training to be included in the model.2\n2. Changing the model to a feedforward neural network with dense embedding features, TUPAMLP (“multi-layer perceptron”), uses an architecture similar to that of Chen and Manning (2014), but with two rectified linear layers\n2We also experimented with a linear model using dense embedding features, trained with the averaged structured perceptron algorithm. It performed worse than the sparse perceptron model and was hence discarded.\ninstead of one layer with cube activation. The embeddings and classifier are trained jointly.\n3. Finally, TUPABiLSTM uses a bidirectional LSTM for feature representation, on top of the dense embedding features, an architecture similar to Kiperwasser and Goldberg (2016). The BiLSTM runs on the input tokens in forward and backward directions, yielding a vector representation that is then concatenated with dense features representing the parser state (e.g., existing edge labels and previous parser actions; see below). This representation is then fed into a feedforward network similar to TUPAMLP. The feedforward layers, BiLSTM and embeddings are all trained jointly.\nFor all classifiers, inference is performed greedily, i.e., without beam search. Hyperparameters are tuned on the development set (see Section 4).\nFeatures. TUPASparse uses binary indicator features representing the words, POS tags, syntactic dependency labels and existing edge labels related to the top four stack elements and the next three buffer elements, in addition to their children and grandchildren in the graph. We also use bi- and trigram features based on these values (Zhang and Clark, 2009; Zhu et al., 2013), features related to discontinuous nodes (Maier, 2015, including separating punctuation and gap type), features representing existing edges and the number of parents and children, as well as the past actions taken by the parser. In addition, we use use a novel, UCCAspecific feature: number of remote children.3\nFor TUPAMLP and TUPABiLSTM, we replace all indicator features by a concatenation of the vector embeddings of all represented elements: words,\n3See Appendix A for a full list of used feature templates.\nPOS tags, syntactic dependency labels, edge labels, punctuation, gap type and parser actions. These embeddings are initialized randomly. We additionally use external word embeddings initialized with pre-trained word2vec vectors (Mikolov et al., 2013),4 updated during training. In addition to dropout between NN layers, we apply word dropout (Kiperwasser and Goldberg, 2016): with a certain probability, the embedding for a word is replaced with a zero vector. We do not apply word dropout to the external word embeddings.\nFinally, for all classifiers we add a novel realvalued feature to the input vector, ratio, corresponding to the ratio between the number of terminals to number of nodes in the graph G. This feature serves as a regularizer for the creation of new nodes, and should be beneficial for other transition-based constituency parsers too.\nTraining. For training the transition classifiers, we use a dynamic oracle (Goldberg and Nivre, 2012), i.e., an oracle that outputs a set of optimal transitions: when applied to the current parser state, the gold standard graph is reachable from the resulting state. For example, the oracle would predict a NODE transition if the stack has on its top a parent in the gold graph that has not been created, but would predict a RIGHT-EDGE transition if the second stack element is a parent of the first element according to the gold graph and the edge between them has not been created. The transition predicted by the classifier is deemed correct and is applied to the parser state to reach the subsequent state, if the transition is included in the set of optimal transitions. Otherwise, a random optimal transition is applied, and for the perceptronbased parser, the classifier’s weights are updated\n4https://goo.gl/6ovEhC\naccording to the perceptron update rule. POS tags and syntactic dependency labels are extracted using spaCy (Honnibal and Johnson, 2015).5 We use the categorical cross-entropy objective function and optimize the NN classifiers with the Adam optimizer (Kingma and Ba, 2014)."
  }, {
    "heading": "4 Experimental Setup",
    "text": "Data. We conduct our experiments on the UCCA Wikipedia corpus (henceforth, Wiki), and use the English part of the UCCA Twenty Thousand Leagues Under the Sea English-French parallel corpus (henceforth, 20K Leagues) as outof-domain data.6 Table 1 presents some statistics for the two corpora. We use passages of indices up to 676 of the Wiki corpus as our training set, passages 688–808 as development set, and passages 942–1028 as in-domain test set. While\n5https://spacy.io 6http://cs.huji.ac.il/˜oabend/ucca.html\nUCCA edges can cross sentence boundaries, we adhere to the common practice in semantic parsing and train our parsers on individual sentences, discarding inter-relations between them (0.18% of the edges). We also discard linkage nodes and edges (as they often express inter-sentence relations and are thus mostly redundant when applied at the sentence level) as well as implicit nodes.7 In the out-of-domain experiments, we apply the same parsers (trained on the Wiki training set) to the 20K Leagues corpus without parameter re-tuning.\nImplementation. We use the DyNet package (Neubig et al., 2017) for implementing the NN classifiers. Unless otherwise noted, we use the default values provided by the package. See Appendix C for the hyperparameter values we found by tuning on the development set.\nEvaluation. We define a simple measure for comparing UCCA structures Gp = (Vp, Ep, `p) and Gg = (Vg, Eg, `g), the predicted and goldstandard graphs, respectively, over the same sequence of terminals W = {w1, . . . , wn}. For an edge e = (u, v) in either graph, u being the parent and v the child, its yield y(e) ⊆ W is the set of terminals in W that are descendants of v. Define the set of mutual edges between Gp and Gg:\nM(Gp, Gg) =\n{(e1, e2) ∈ Ep × Eg | y(e1) = y(e2) ∧ `p(e1) = `g(e2)}\nLabeled precision and recall are defined by dividing |M(Gp, Gg)| by |Ep| and |Eg|, respectively, and F-score by taking their harmonic mean.\n7Appendix B further discusses linkage and implicit units.\nWe report two variants of this measure: one where we consider only primary edges, and another for remote edges (see Section 2). Performance on remote edges is of pivotal importance in this investigation, which focuses on extending the class of graphs supported by statistical parsers.\nWe note that the measure collapses to the standard PARSEVAL constituency evaluation measure if Gp and Gg are trees. Punctuation is excluded from the evaluation, but not from the datasets.\nComparison to bilexical graph parsers. As no direct comparison with existing parsers is possible, we compare TUPA to bilexical dependency graph parsers, which support reentrancy and discontinuity but not non-terminal nodes.\nTo facilitate the comparison, we convert our training set into bilexical graphs (see examples in Figure 4), train each of the parsers, and evaluate them by applying them to the test set and then reconstructing UCCA graphs, which are compared with the gold standard. The conversion to bilexical graphs is done by heuristically selecting a head terminal for each non-terminal node, and attaching all terminal descendents to the head terminal. In the inverse conversion, we traverse the bilexical graph in topological order, creating non-terminal parents for all terminals, and attaching them to the previously-created non-terminals corresponding to the bilexical heads.8\nIn Section 5 we report the upper bounds on the achievable scores due to the error resulting from the removal of non-terminal nodes.\nComparison to tree parsers. For completeness, and as parsing technology is considerably more\n8See Appendix D for a detailed description of the conversion procedures.\nmature for tree (rather than graph) parsing, we also perform a tree approximation experiment, converting UCCA to (bilexical) trees and evaluating constituency and dependency tree parsers on them (see examples in Figure 5). Our approach is similar to the tree approximation approach used for dependency graph parsing (Agić et al., 2015; Fernández-González and Martins, 2015), where dependency graphs were converted into dependency trees and then parsed by dependency tree parsers. In our setting, the conversion to trees consists simply of removing remote edges from the graph, and then to bilexical trees by applying the same procedure as for bilexical graphs.\nBaseline parsers. We evaluate two bilexical graph semantic dependency parsers: DAGParser (Ribeyre et al., 2014), the leading transition-based parser in SemEval 2014 (Oepen et al., 2014) and TurboParser (Almeida and Martins, 2015), a graph-based parser from SemEval 2015 (Oepen et al., 2015); UPARSE (Maier and Lichte, 2016), a transition-based constituency parser supporting discontinuous constituents; and two bilexical tree parsers: MaltParser (Nivre et al., 2007), and the stack LSTM-based parser of Dyer et al. (2015, henceforce “LSTM Parser”). Default settings are used in all cases.9 DAGParser and UPARSE use beam search by default, with a beam size of 5 and 4 respectively. The other parsers are greedy."
  }, {
    "heading": "5 Results",
    "text": "Table 2 presents our main experimental results, as well as upper bounds for the baseline parsers, re-\n9For MaltParser we use the ARCEAGER transition set and SVM classifier. Other configurations yielded lower scores.\nflecting the error resulting from the conversion.10\nDAGParser and UPARSE are most directly comparable to TUPASparse, as they also use a perceptron classifier with sparse features. TUPASparse considerably outperforms both, where DAGParser does not predict any remote edges in the out-ofdomain setting. TurboParser fares worse in this comparison, despite somewhat better results on remote edges. The LSTM parser of Dyer et al. (2015) obtains the highest primary F-score among the baseline parsers, with a considerable margin.\nUsing a feedforward NN and embedding features, TUPAMLP obtains higher scores than TUPASparse, but is outperformed by the LSTM parser on primary edges. However, using better input encoding allowing virtual look-ahead and look-behind in the token representation, TUPABiLSTM obtains substantially higher scores than TUPAMLP and all other parsers, on both primary and remote edges, both in the in-domain and out-of-domain settings. Its performance in absolute terms, of 73.5% F-score on primary edges, is encouraging in light of UCCA’s inter-annotator agreement of 80–85% F-score on them (Abend and Rappoport, 2013).\nThe parsers resulting from tree approximation 10The low upper bound for remote edges is partly due to the removal of implicit nodes (not supported in bilexical representations), where the whole sub-graph headed by such nodes, often containing remote edges, must be discarded.\nare unable to recover any remote edges, as these are removed in the conversion.11 The bilexical DAG parsers are quite limited in this respect as well. While some of the DAG parsers’ difficulty can be attributed to the conversion upper bound of 58.3%, this in itself cannot account for their poor performance on remote edges, which is an order of magnitude lower than that of TUPABiLSTM."
  }, {
    "heading": "6 Related Work",
    "text": "While earlier work on anchored12 semantic parsing has mostly concentrated on shallow semantic analysis, focusing on semantic role labeling of verbal argument structures, the focus has recently shifted to parsing of more elaborate representations that account for a wider range of phenomena (Abend and Rappoport, 2017).\nGrammar-Based Parsing. Linguistically expressive grammars such as HPSG (Pollard and Sag, 1994), CCG (Steedman, 2000) and TAG (Joshi and Schabes, 1997) provide a theory of the syntax-semantics interface, and have been used as a basis for semantic parsers by defining com-\n11We also experimented with a simpler version of TUPA lacking REMOTE transitions, obtaining an increase of up to 2 labeled F-score points on primary edges, at the cost of not being able to predict remote edges.\n12By anchored we mean that the semantic representation directly corresponds to the words and phrases of the text.\npositional semantics on top of them (Flickinger, 2000; Bos, 2005, among others). Depending on the grammar and the implementation, such semantic parsers can support some or all of the structural properties UCCA exhibits. Nevertheless, this line of work differs from our approach in two important ways. First, the representations are different. UCCA does not attempt to model the syntaxsemantics interface and is thus less coupled with syntax. Second, while grammar-based parsers explicitly model syntax, our approach directly models the relation between tokens and semantic structures, without explicit composition rules.\nBroad-Coverage Semantic Parsing. Most closely related to this work is Broad-Coverage Semantic Dependency Parsing (SDP), addressed in two SemEval tasks (Oepen et al., 2014, 2015). Like UCCA parsing, SDP addresses a wide range of semantic phenomena, and supports discontinuous units and reentrancy. In SDP, however, bilexical dependencies are used, and a head must be selected for every relation—even in constructions that have no clear head, such as coordination (Ivanova et al., 2012). The use of non-terminal nodes is a simple way to avoid this liability. SDP also differs from UCCA in the type of distinctions it makes, which are more tightly coupled with syntactic considerations, where UCCA aims to capture purely semantic cross-linguistically applicable notions. For instance, the “poss” label in the DM target representation is used to annotate syntactic possessive constructions, regardless of whether they correspond to semantic ownership (e.g., “John’s dog”) or other semantic relations, such as marking an argument of a nominal predicate (e.g., “John’s kick”). UCCA reflects the difference between these constructions.\nRecent interest in SDP has yielded numerous works on graph parsing (Ribeyre et al., 2014; Thomson et al., 2014; Almeida and Martins, 2015; Du et al., 2015), including tree approximation (Agić and Koller, 2014; Schluter et al., 2014) and joint syntactic/semantic parsing (Henderson et al., 2013; Swayamdipta et al., 2016).\nAbstract Meaning Representation. Another line of work addresses parsing into AMRs (Flanigan et al., 2014; Vanderwende et al., 2015; Pust et al., 2015; Artzi et al., 2015), which, like UCCA, abstract away from syntactic distinctions and represent meaning directly, using OntoNotes predi-\ncates (Weischedel et al., 2013). Events in AMR may also be evoked by non-verbal predicates, including possessive constructions.\nUnlike in UCCA, the alignment between AMR concepts and the text is not explicitly marked. While sharing much of this work’s motivation, not anchoring the representation in the text complicates the parsing task, as it requires the alignment to be automatically (and imprecisely) detected. Indeed, despite considerable technical effort (Flanigan et al., 2014; Pourdamghani et al., 2014; Werling et al., 2015), concept identification is only about 80%–90% accurate. Furthermore, anchoring allows breaking down sentences into semantically meaningful sub-spans, which is useful for many applications (Fernández-González and Martins, 2015; Birch et al., 2016).\nSeveral transition-based AMR parsers have been proposed: CAMR assumes syntactically parsed input, processing dependency trees into AMR (Wang et al., 2015a,b, 2016; Goodman et al., 2016). In contrast, the parsers of Damonte et al. (2017) and Zhou et al. (2016) do not require syntactic pre-processing. Damonte et al. (2017) perform concept identification using a simple heuristic selecting the most frequent graph for each token, and Zhou et al. (2016) perform concept identification and parsing jointly. UCCA parsing does not require separately aligning the input tokens to the graph. TUPA creates non-terminal units as part of the parsing process.\nFurthermore, existing transition-based AMR parsers are not general DAG parsers. They are only able to predict a subset of reentrancies and discontinuities, as they may remove nodes before their parents have been predicted (Damonte et al., 2017). They are thus limited to a sub-class of AMRs in particular, and specifically cannot produce arbitrary DAG parses. TUPA’s transition set, on the other hand, allows general DAG parsing.13"
  }, {
    "heading": "7 Conclusion",
    "text": "We present TUPA, the first parser for UCCA. Evaluated in in-domain and out-of-domain settings, we show that coupled with a NN classifier and BiLSTM feature extractor, it accurately predicts UCCA graphs from text, outperforming a variety of strong baselines by a margin.\nDespite the recent diversity of semantic pars-\n13See Appendix E for a proof sketch for the completeness of TUPA’s transition set.\ning work, the effectiveness of different approaches for structurally and semantically different schemes is not well-understood (Kuhlmann and Oepen, 2016). Our contribution to this literature is a general parser that supports multiple parents, discontinuous units and non-terminal nodes.\nFuture work will evaluate TUPA in a multilingual setting, assessing UCCA’s cross-linguistic applicability. We will also apply the TUPA transition scheme to different target representations, including AMR and SDP, exploring the limits of its generality. In addition, we will explore different conversion procedures (Kong et al., 2015) to compare different representations, suggesting ways for a data-driven design of semantic annotation.\nA parser for UCCA will enable using the framework for new tasks, in addition to existing applications such as machine translation evaluation (Birch et al., 2016). We believe UCCA’s merits in providing a cross-linguistically applicable, broadcoverage annotation will support ongoing efforts to incorporate deeper semantic structures into various applications, such as sentence simplification (Narayan and Gardent, 2014) and summarization (Liu et al., 2015)."
  }, {
    "heading": "Acknowledgments",
    "text": "This work was supported by the HUJI Cyber Security Research Center in conjunction with the Israel National Cyber Bureau in the Prime Minister’s Office, and by the Intel Collaborative Research Institute for Computational Intelligence (ICRI-CI). The first author was supported by a fellowship from the Edmond and Lily Safra Center for Brain Sciences. We thank Wolfgang Maier, Nathan Schneider, Elior Sulem and the anonymous reviewers for their helpful comments."
  }],
  "year": 2017,
  "references": [{
    "title": "Universal Conceptual Cognitive Annotation (UCCA)",
    "authors": ["Omri Abend", "Ari Rappoport."],
    "venue": "Proc. of ACL. pages 228–238. http://aclweb.org/anthology/P13-1023.",
    "year": 2013
  }, {
    "title": "The state of the art in semantic representation",
    "authors": ["Omri Abend", "Ari Rappoport."],
    "venue": "Proc. of ACL. To appear.",
    "year": 2017
  }, {
    "title": "UCCAApp: Web-application for syntactic and semantic phrase-based annotation",
    "authors": ["Omri Abend", "Shai Yerushalmi", "Ari Rappoport."],
    "venue": "Proc. of ACL: System Demonstration Papers. To appear.",
    "year": 2017
  }, {
    "title": "Potsdam: Semantic dependency parsing by bidirectional graph-tree transformations and syntactic parsing",
    "authors": ["Željko Agić", "Alexander Koller."],
    "venue": "Proc. of SemEval. pages 465–470. http://aclweb.org/anthology/S14-2081.",
    "year": 2014
  }, {
    "title": "Semantic dependency graph parsing using tree approximations",
    "authors": ["Željko Agić", "Alexander Koller", "Stephan Oepen."],
    "venue": "Proc. of IWCS. pages 217– 227. http://aclweb.org/anthology/W15-0126.",
    "year": 2015
  }, {
    "title": "Lisbon: Evaluating TurboSemanticParser on multiple languages and out-of-domain data",
    "authors": ["Mariana S.C. Almeida", "André F.T. Martins."],
    "venue": "Proc. of SemEval. pages 970–973. http://aclweb.org/anthology/S15-2162.",
    "year": 2015
  }, {
    "title": "An incremental algorithm for transition-based CCG parsing",
    "authors": ["Bharat Ram Ambati", "Tejaswini Deoskar", "Mark Johnson", "Mark Steedman."],
    "venue": "Proc. of NAACL. pages 53–63. http://aclweb.org/anthology/N15-1006.",
    "year": 2015
  }, {
    "title": "Shift-reduce CCG parsing using neural network models",
    "authors": ["Bharat Ram Ambati", "Tejaswini Deoskar", "Mark Steedman."],
    "venue": "Proc. of NAACL-HLT . pages 447–453. http://aclweb.org/anthology/N161052.",
    "year": 2016
  }, {
    "title": "Globally normalized transition-based neural networks",
    "authors": ["Daniel Andor", "Chris Alberti", "David Weiss", "Aliaksei Severyn", "Alessandro Presta", "Kuzman Ganchev", "Slav Petrov", "Michael Collins."],
    "venue": "Proc. of ACL. pages 2442–2452.",
    "year": 2016
  }, {
    "title": "Broad-coverage CCG semantic parsing with AMR",
    "authors": ["Yoav Artzi", "Kenton Lee", "Luke Zettlemoyer."],
    "venue": "Proc. of EMNLP. pages 1699–1710. http://aclweb.org/anthology/D15-1198.",
    "year": 2015
  }, {
    "title": "Abstract Meaning Representation for sembanking",
    "authors": ["Laura Banarescu", "Claire Bonial", "Shu Cai", "Madalina Georgescu", "Kira Griffitt", "Ulf Hermjakob", "Kevin Knight", "Martha Palmer", "Nathan Schneider."],
    "venue": "Proc. of the Linguistic Annotation",
    "year": 2013
  }, {
    "title": "HUME: Human UCCA-based evaluation of machine translation",
    "authors": ["Alexandra Birch", "Omri Abend", "Ondřej Bojar", "Barry Haddow."],
    "venue": "Proc. of EMNLP. pages 1264–1274. http://aclweb.org/anthology/D16-1134.",
    "year": 2016
  }, {
    "title": "Towards wide-coverage semantic interpretation",
    "authors": ["Johan Bos"],
    "year": 2005
  }, {
    "title": "Incremental parsing with the perceptron algorithm",
    "authors": ["Michael Collins", "Brian Roark."],
    "venue": "Proc. of ACL. pages 111–118. http://aclweb.org/anthology/P04-1015.",
    "year": 2004
  }, {
    "title": "Cognitive linguistics",
    "authors": ["William Croft", "D Alan Cruse."],
    "venue": "Cambridge University Press.",
    "year": 2004
  }, {
    "title": "An incremental parser for abstract meaning representation",
    "authors": ["Marco Damonte", "Shay B. Cohen", "Giorgio Satta."],
    "venue": "Proceedings of EACL. http://homepages.inf.ed.ac.uk/scohen/eacl17amr.pdf.",
    "year": 2017
  }, {
    "title": "Basic Linguistic Theory: Grammatical Topics, volume 2",
    "authors": ["Robert M.W. Dixon."],
    "venue": "Oxford University Press.",
    "year": 2010
  }, {
    "title": "Basic Linguistic Theory: Methodology, volume 1",
    "authors": ["Robert M.W. Dixon."],
    "venue": "Oxford University Press.",
    "year": 2010
  }, {
    "title": "Basic Linguistic Theory: Further Grammatical Topics, volume 3",
    "authors": ["Robert M.W. Dixon."],
    "venue": "Oxford University Press.",
    "year": 2012
  }, {
    "title": "Peking: Building semantic dependency graphs with a hybrid parser",
    "authors": ["Yantao Du", "Fan Zhang", "Xun Zhang", "Weiwei Sun", "Xiaojun Wan."],
    "venue": "Proc. of SemEval. pages 927–931. http://aclweb.org/anthology/S15-2154.",
    "year": 2015
  }, {
    "title": "Transitionbased dependeny parsing with stack long shortterm memory",
    "authors": ["Chris Dyer", "Miguel Ballesteros", "Wang Ling", "Austin Matthews", "Noah A. Smith."],
    "venue": "Proc. of ACL. pages 334–343. http://aclweb.org/anthology/P15-1033.",
    "year": 2015
  }, {
    "title": "Parsing as reduction",
    "authors": ["Daniel Fernández-González", "André FT Martins."],
    "venue": "Proc. of ACL. pages 1523–1533. http://aclweb.org/anthology/P15-1147.",
    "year": 2015
  }, {
    "title": "A discriminative graph-based parser for the abstract meaning representation",
    "authors": ["Jeffrey Flanigan", "Sam Thomson", "Jaime Carbonell", "Chris Dyer", "Noah A. Smith."],
    "venue": "Proc. of ACL. pages 1426–1436. http://aclweb.org/anthology/P14-1134.",
    "year": 2014
  }, {
    "title": "On building a more efficient grammar by exploiting types",
    "authors": ["Daniel Flickinger."],
    "venue": "Collaborative Language Engineering, CLSI, Stanford, CA, volume 6, pages 15–28.",
    "year": 2000
  }, {
    "title": "Learning sparser perceptron models",
    "authors": ["Yoav Goldberg", "Michael Elhadad."],
    "venue": "Technical report. http://www.cs.bgu.ac.il/ ̃yoavg/publications.",
    "year": 2011
  }, {
    "title": "A dynamic oracle for arc-eager dependency parsing",
    "authors": ["Yoav Goldberg", "Joakim Nivre."],
    "venue": "Proc. of COLING. pages 959–976. http://aclweb.org/anthology/C12-1059.",
    "year": 2012
  }, {
    "title": "Noise reduction and targeted exploration in imitation learning for Abstract Meaning Representation parsing",
    "authors": ["James Goodman", "Andreas Vlachos", "Jason Naradowsky."],
    "venue": "Proc. of ACL. pages 1–",
    "year": 2016
  }, {
    "title": "Multilingual joint parsing of syntactic and semantic dependencies with a latent variable model",
    "authors": ["James Henderson", "Paola Merlo", "Ivan Titov", "Gabriele Musillo."],
    "venue": "Computational Linguistics 39(4):949–998. http://cognet.mit.edu/node/27348.",
    "year": 2013
  }, {
    "title": "An improved non-monotonic transition system for dependency parsing",
    "authors": ["Matthew Honnibal", "Mark Johnson."],
    "venue": "Proc. of EMNLP. pages 1373– 1378. http://aclweb.org/anthology/D15-1162.",
    "year": 2015
  }, {
    "title": "Who did what to whom? A contrastive study of syntacto-semantic dependencies",
    "authors": ["Angelina Ivanova", "Stephan Oepen", "Lilja Øvrelid", "Dan Flickinger."],
    "venue": "Proc. of LAW. pages 2–11. http://aclweb.org/anthology/W12-3602.",
    "year": 2012
  }, {
    "title": "TreeAdjoining Grammars",
    "authors": ["Aravind Joshi", "Yves Schabes."],
    "venue": "Grzegorz Rozenberg and Arto Salomaa, editors, Handbook of Formal Languages, Springer, Berlin, volume 3, pages 69–124.",
    "year": 1997
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["Diederik P. Kingma", "Jimmy Ba."],
    "venue": "CoRR abs/1412.6980. http://arxiv.org/abs/1412.6980.",
    "year": 2014
  }, {
    "title": "Simple and accurate dependency parsing using bidirectional LSTM feature representations",
    "authors": ["Eliyahu Kiperwasser", "Yoav Goldberg."],
    "venue": "TACL 4:313–327. https://transacl.org/ojs/index.php/tacl/article/view/885.",
    "year": 2016
  }, {
    "title": "Transforming dependencies into phrase structures",
    "authors": ["Lingpeng Kong", "Alexander M. Rush", "Noah A. Smith."],
    "venue": "Proc. of NAACL HLT . https://aclweb.org/anthology/N15-1080.",
    "year": 2015
  }, {
    "title": "Towards a catalogue of linguistic graph banks",
    "authors": ["Marco Kuhlmann", "Stephan Oepen."],
    "venue": "Computational Linguistics https://mn.uio.no/ifi/english/people/aca/oe/cl.pdf.",
    "year": 2016
  }, {
    "title": "Toward abstractive summarization using semantic representations",
    "authors": ["Fei Liu", "Jeffrey Flanigan", "Sam Thomson", "Norman Sadeh", "Noah A. Smith."],
    "venue": "Proc. of NAACL. pages 1077–1086. http://aclweb.org/anthology/N15-1114.",
    "year": 2015
  }, {
    "title": "Discontinuous incremental shift-reduce parsing",
    "authors": ["Wolfgang Maier."],
    "venue": "Proc. of ACL. pages 1202– 1212. http://aclweb.org/anthology/P15-1116.",
    "year": 2015
  }, {
    "title": "Discontinuous parsing with continuous trees",
    "authors": ["Wolfgang Maier", "Timm Lichte."],
    "venue": "Proc. of Workshop on Discontinuous Structures in NLP. pages 47–",
    "year": 2016
  }, {
    "title": "Efficient estimation of word representations in vector space",
    "authors": ["Tomas Mikolov", "Kai Chen", "Greg Corrado", "Jeffrey Dean."],
    "venue": "CoRR abs/1301.3781. https://arxiv.org/pdf/1301.3781.",
    "year": 2013
  }, {
    "title": "Neural shift-reduce CCG semantic parsing",
    "authors": ["Dipendra K Misra", "Yoav Artzi."],
    "venue": "Proc. of EMNLP. pages 1775–1786. http://aclweb.org/anthology/D16-1183.",
    "year": 2016
  }, {
    "title": "Hybrid simplification using deep semantics and machine translation",
    "authors": ["Shashi Narayan", "Claire Gardent."],
    "venue": "Proc. of ACL. pages 435–445. http://aclweb.org/anthology/P14-1041.",
    "year": 2014
  }, {
    "title": "DyNet: The dynamic neural network toolkit",
    "authors": ["Lingpeng Kong", "Adhiguna Kuncoro", "Gaurav Kumar", "Chaitanya Malaviya", "Paul Michel", "Yusuke Oda", "Matthew Richardson", "Naomi Saphra", "Swabha Swayamdipta", "Pengcheng Yin."],
    "venue": "arXiv preprint",
    "year": 2017
  }, {
    "title": "An efficient algorithm for projective dependency parsing",
    "authors": ["Joakim Nivre."],
    "venue": "Proc. of IWPT . pages 149–160. http://aclweb.org/anthology/W06-2933.",
    "year": 2003
  }, {
    "title": "Non-projective dependency parsing in expected linear time",
    "authors": ["Joakim Nivre."],
    "venue": "Proc. of ACL. pages 351–359. http://aclweb.org/anthology/P09-1040.",
    "year": 2009
  }, {
    "title": "MaltParser: A language-independent system for data-driven dependency parsing",
    "authors": ["Joakim Nivre", "Johan Hall", "Jens Nilsson", "Atanas Chanev", "Gülsen Eryigit", "Sandra Kübler", "Svetoslav Marinov", "Erwin Marsi."],
    "venue": "Natural Language Engineering",
    "year": 2007
  }, {
    "title": "SemEval 2015 task 18: Broad-coverage semantic dependency parsing",
    "authors": ["Stephan Oepen", "Marco Kuhlmann", "Yusuke Miyao", "Daniel Zeman", "Silvie Cinková", "Dan Flickinger", "Jan Hajič", "Zdeňka Urešová."],
    "venue": "Proc. of SemEval. pages 915–926.",
    "year": 2015
  }, {
    "title": "SemEval 2014 task 8: Broad-coverage semantic dependency parsing",
    "authors": ["Stephan Oepen", "Marco Kuhlmann", "Yusuke Miyao", "Daniel Zeman", "Dan Flickinger", "Jan Hajič", "Angelina Ivanova", "Yi Zhang."],
    "venue": "Proc. of SemEval. pages 63–72.",
    "year": 2014
  }, {
    "title": "Head Driven Phrase Structure Grammar",
    "authors": ["Carl Pollard", "Ivan Sag."],
    "venue": "CSLI Publications, Stanford, CA.",
    "year": 1994
  }, {
    "title": "Aligning English strings with abstract meaning representation graphs",
    "authors": ["Nima Pourdamghani", "Yang Gao", "Ulf Hermjakob", "Kevin Knight."],
    "venue": "Proc. of EMNLP. pages 425–429. http://aclweb.org/anthology/D14-1048.",
    "year": 2014
  }, {
    "title": "Parsing English into abstract meaning representation using syntax-based machine translation",
    "authors": ["Michael Pust", "Ulf Hermjakob", "Kevin Knight", "Daniel Marcu", "Jonathan May."],
    "venue": "Proc. of EMNLP. pages 1143–1154.",
    "year": 2015
  }, {
    "title": "Alpage: Transitionbased semantic graph parsing with syntactic features",
    "authors": ["Corentin Ribeyre", "Eric Villemonte de la Clergerie", "Djamé Seddah."],
    "venue": "Proc. of SemEval. pages 97–103. http://aclweb.org/anthology/S14-2012.",
    "year": 2014
  }, {
    "title": "A classifierbased parser with linear run-time complexity",
    "authors": ["Kenji Sagae", "Alon Lavie."],
    "venue": "Proc. of IWPT . pages 125–132. http://aclweb.org/anthology/W05-1513.",
    "year": 2005
  }, {
    "title": "Shift-reduce dependency DAG parsing",
    "authors": ["Kenji Sagae", "Jun’ichi Tsujii"],
    "venue": "In Proc. of COLING",
    "year": 2008
  }, {
    "title": "Copenhagen-Malmö: Tree approximations of semantic parsing problems",
    "authors": ["Natalie Schluter", "Anders Søgaard", "Jakob Elming", "Dirk Hovy", "Barbara Plank", "Héctor Martı́nez Alonso", "Anders Johanssen", "Sigrid Klerke"],
    "venue": "In Proc. of SemEval",
    "year": 2014
  }, {
    "title": "Discriminative lexical semantic segmentation with gaps: running the MWE gamut",
    "authors": ["Nathan Schneider", "Emily Danchik", "Chris Dyer", "Noah A Smith."],
    "venue": "TACL 2:193–206. http://aclweb.org/anthology/Q14-1016.pdf.",
    "year": 2014
  }, {
    "title": "The Syntactic Process",
    "authors": ["Mark Steedman."],
    "venue": "MIT Press, Cambridge, MA.",
    "year": 2000
  }, {
    "title": "Conceptual annotations preserve structure across translations: A French-English case study",
    "authors": ["Elior Sulem", "Omri Abend", "Ari Rappoport."],
    "venue": "Proc. of S2MT . pages 11–22. http://aclweb.org/anthology/W15-3502.",
    "year": 2015
  }, {
    "title": "Greedy, joint syntactic-semantic parsing with stack LSTMs",
    "authors": ["Swabha Swayamdipta", "Miguel Ballesteros", "Chris Dyer", "Noah A. Smith."],
    "venue": "Proc. of CoNLL. pages 187–197. http://aclweb.org/anthology/K16-1019.",
    "year": 2016
  }, {
    "title": "Transitionbased dependency DAG parsing using dynamic oracles",
    "authors": ["Alper Tokgöz", "Gülsen Eryiğit."],
    "venue": "Proc. of ACL Student Research Workshop. pages 22–27. http://aclweb.org/anthology/P153004.",
    "year": 2015
  }, {
    "title": "An AMR parser for English, French, German, Spanish and Japanese and a new AMRannotated corpus",
    "authors": ["Lucy Vanderwende", "Arul Menezes", "Chris Quirk."],
    "venue": "Proc. of NAACL. pages 26–30. http://aclweb.org/anthology/N15-3006.",
    "year": 2015
  }, {
    "title": "CAMR at SemEval2016 task 8: An extended transition-based amr parser",
    "authors": ["Chuan Wang", "Sameer Pradhan", "Xiaoman Pan", "Heng Ji", "Nianwen Xue."],
    "venue": "Proc. of SemEval. pages 1173–1178. http://aclweb.org/anthology/S16-1181.",
    "year": 2016
  }, {
    "title": "Boosting transition-based AMR parsing with refined actions and auxiliary analyzers",
    "authors": ["Chuan Wang", "Nianwen Xue", "Sameer Pradhan."],
    "venue": "Proc. of ACL. pages 857–862. http://aclweb.org/anthology/P15-2141.",
    "year": 2015
  }, {
    "title": "A transition-based algorithm for AMR parsing",
    "authors": ["Chuan Wang", "Nianwen Xue", "Sameer Pradhan."],
    "venue": "Proc. of NAACL. pages 366–375. http://aclweb.org/anthology/N15-1040.",
    "year": 2015
  }, {
    "title": "OntoNotes release 5.0 LDC2013T19",
    "authors": ["Ralph Weischedel", "Martha Palmer", "Mitchell Marcus", "Eduard Hovy", "Sameer Pradhan", "Lance Ramshaw", "Nianwen Xue", "Ann Taylor", "Jeff Kaufman", "Michelle Franchini"],
    "year": 2013
  }, {
    "title": "Robust subgraph generation improves abstract meaning representation parsing",
    "authors": ["Keenon Werling", "Gabor Angeli", "Christopher D. Manning."],
    "venue": "Proc. of ACL. pages 982–991. http://aclweb.org/anthology/P15-1095.",
    "year": 2015
  }, {
    "title": "Transition-based parsing of the Chinese treebank using a global discriminative model",
    "authors": ["Yue Zhang", "Stephen Clark."],
    "venue": "Proc. of IWPT . Association for Computational Linguistics, pages 162–171. http://aclweb.org/anthology/W09-3825.",
    "year": 2009
  }, {
    "title": "Shift-reduce CCG parsing",
    "authors": ["Yue Zhang", "Stephen Clark."],
    "venue": "Proc. of ACL. pages 683–692. http://aclweb.org/anthology/P11-1069.",
    "year": 2011
  }, {
    "title": "AMR parsing with an incremental joint model",
    "authors": ["Junsheng Zhou", "Feiyu Xu", "Hans Uszkoreit", "Weiguang Qu", "Ran Li", "Yanhui Gu."],
    "venue": "Proc. of EMNLP. pages 680–689. http://aclweb.org/anthology/D16-1065.",
    "year": 2016
  }, {
    "title": "Fast and accurate shiftreduce constituent parsing",
    "authors": ["Muhua Zhu", "Yue Zhang", "Wenliang Chen", "Min Zhang", "Jingbo Zhu."],
    "venue": "Proc. of ACL. pages 434–443. http://aclweb.org/anthology/P13-1043.",
    "year": 2013
  }],
  "id": "SP:25370a5cd20e08ad1013989ea33de4d64143d856",
  "authors": [{
    "name": "Daniel Hershcovich",
    "affiliations": []
  }, {
    "name": "Omri Abend",
    "affiliations": []
  }, {
    "name": "Ari Rappoport",
    "affiliations": []
  }],
  "abstractText": "We present the first parser for UCCA, a cross-linguistically applicable framework for semantic representation, which builds on extensive typological work and supports rapid annotation. UCCA poses a challenge for existing parsing techniques, as it exhibits reentrancy (resulting in DAG structures), discontinuous structures and non-terminal nodes corresponding to complex semantic units. To our knowledge, the conjunction of these formal properties is not supported by any existing parser. Our transition-based parser, which uses a novel transition set and features based on bidirectional LSTMs, has value not just for UCCA parsing: its ability to handle more general graph structures can inform the development of parsers for other semantic DAG structures, and in languages that frequently use discontinuous structures.",
  "title": "A Transition-Based Directed Acyclic Graph Parser for UCCA"
}