{
  "sections": [{
    "heading": "1. Introduction",
    "text": "This article is about the set of all decompositions (clusterings) of a graph. A decomposition of a graph G = (V,E) is a partition Π of the node set V such that, for every subset U ∈ Π of nodes, the subgraph of G induced by U is connected. An example is depicted in Fig. 1. Decompositions of a graph arise in practice, as feasible solutions of clustering problems, and in theory, as a generalization of partitions of a set, to which they specialize for complete graphs.\nWe study the set of all decompositions of a graph through its characterization as a set of multicuts. A multicut of G is a subset M ⊆ E of edges such that, for every (chordless) cycle C ⊆ E of G, we have |M ∩ C| 6= 1. An example is depicted in Fig. 1. For any graph G, a one-to-one relation exists between the decompositions and the multicuts of G. The multicut induced by a decomposition is the set of edges that straddle distinct components. Multicuts are useful in the study of decompositions as the characteristic function x ∈ {0, 1}E of a multicut x−1(1) of G makes explicit, for every pair {v, w} ∈ E of neighboring nodes, whether v and w are in distinct components. To make explicit also for nonneighboring nodes, specifically, for all {v, w} ∈ E′ with\n*Equal contribution 1Max Planck Institute for Informatics, Saarbrücken, Germany. Correspondence to: Bjoern Andres <andres@mpi-inf.mpg.de>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nE ⊆ E′ ⊆ ( V 2 ) , whether v andw are in distinct components, we define a lifting of the multicuts of G to multicuts of G′ = (V,E′). The multicuts of G′ lifted from G are still in one-to-one relation with the decompositions of G. Yet, they are a more expressive model of these decompositions than the multicuts of G. We apply lifted multicuts in three ways:\nFirstly, we study problems related to the definition of a class of decompositions by must-cut or must-join constraints (Section 4). Such constraints have applications where defining a decomposition totally is an ambiguous and tedious task, e.g., in the field of image segmentation. The first problem is to decide whether a set of such constraints is consistent, i.e., whether a decomposition of the given graph exists that satisfies the constraints. We show that this decision problem is NP-complete in general and can be solved efficienty for a subclass of constraints. The second problem is to decide whether a consistent set of must-join and must-cut constraints is maximally specific, i.e., whether no such constraint can be added without changing the set of decompositions that satisfy the constraints. We show that this decision problem is NP-hard in general and can be solved efficienty for a subclass of constraints. This finding is relevant for comparing the classes of decompositions definable by mustjoin and must-cut constraints by certain metrics, which is the next topic.\nAs a second application of lifted multicuts, we study the comparison of decompositions and classes of decompositions by metrics (Section 5). To obtain a metric on the set of all decompositions of a given graph, we define a metric on a set of lifted multicuts that characterize these decompositions.\nBy lifting to different graphs, we obtain different metrics, two of which are well-known and here generalized. To extend this metric to the classes of decompositions definable by must-join and must-cut constraints, we define a metric on partial lifted multicuts that characterize these classes, connecting results of Sections 4 and 5. We show that computing this metric is NP-hard in general and efficient for a subclass of must-join and must-cut constraints. These findings have implications on the applicability of must-join and must-cut constraints as a form of supervision, more specifically, on the practicality of certain error metrics and loss functions.\nAs a third application of lifted multicuts, we study the optimization of graph decompositions by minimum cost lifted multicuts. The minimum cost lifted multicut problem is a generalization of the correlation clustering problem. Its applications in the field of computer vision are mentioned below. To tackle this problem, we establish some properties of some facets of lifted multicut polytopes (Fig. 2 and 3), define efficient separation procedures and apply these in a branch-and-cut algorithm."
  }, {
    "heading": "1.1. Related Work",
    "text": "Initial motivation to study decompositions of a graph by multicuts came from the field of polyhedral optimization. Multicut polytopes are studied by Grötschel & Wakabayashi (1989); Deza et al. (1991; 1992); Chopra & Rao (1993; 1995) and Deza & Laurent (1997) who characterize several classes of their facets.\nThe binary linear program whose feasible solutions are all multicuts of a graph is known as the correlation clustering problem from the work of Bansal et al. (2004) and Demaine et al. (2006) who establish its APX-hardness and a logarithmic approximation. The stability of its solutions is analyzed by Nowozin & Jegelka (2009). Generalizations to multilinear objective functions are studied by Kim et al. (2014) and Kappes et al. (2016). The problem remains NP-hard for planar graphs (Voice et al., 2012; Bachrach et al., 2013) where it admits a PTAS (Klein et al., 2015) and relaxations that are often tight in practice (Yarkony et al., 2012).\nThe lifting of multicuts we define makes path connectedness explicit. For a single component, this is studied by Nowozin & Lampert (2010) who introduce the connected subgraph polytope and outer relaxations. Applications of the minimum cost lifted multicut problem and experimental comparisons to the correlation clustering problem in the field of computer vision are by Keuper et al. (2015) and Tang et al. (2017) who find feasible solutions by local search (Keuper et al., 2015; Levinkov et al., 2017), and by Beier et al. (2017) who find feasible solutions by consensus optimization (Beier et al., 2016). The complexity of several decision problems related to clustering with must-join and must-cut constraints is established by Davidson & Ravi (2007). Well-known metrics on the set of all decompositions of a graph are the metric of Rand (1971) and the variation of information (Meilă, 2007)."
  }, {
    "heading": "2. Multicuts",
    "text": "Definition 1 Let G = (V,E) be any graph. A subgraph G′ = (V ′, E′) of G is called a component of G iff G′ is non-empty, node-induced1, and connected2. A partition Π of V is called a decomposition of G iff, for every U ∈ Π, the subgraph (U,E ∩ ( U 2 ) ) of G induced by U is connected (and hence a component of G).\nFor any graph G, we denote by DG ⊂ 22 V\nthe set of all decompositions ofG. Useful in the study of decompositions are the multicuts of a graph: Definition 2 For any graph G = (V,E), a subset M ⊆ E of edges is called a multicut of G iff, for every cycle C ⊆ E of G, we have |C ∩M | 6= 1. Lemma 1 (Chopra & Rao, 1993) It is sufficient in Def. 2 to consider only the chordless cycles.\nFor any graph G, we denote by MG ⊆ 2E the set of all multicuts of G. One reason why multicuts are useful in\n1That is: E′ = E ∩ ( V ′\n2 ) 2We do not require a component to be maximal w.r.t. the sub-\ngraph relation.\nthe study of decompositions is that, for every graph G, a one-to-one relation exists between the decompositions and the multicuts of G. An example is depicted in Fig. 1: Lemma 2 For any graph G = (V,E), the map φG : DG → 2E defined by (1) is a bijection from DG to MG.\n∀Π ∈ DG ∀{v, w} ∈ E : {v, w} ∈ φG(Π) ⇔ ∀U ∈ Π(v /∈ U ∨ w /∈ U) (1)\nAnother reason why multicuts are useful in the study of decompositions is that, for any graph G = (V,E) and any decomposition Π of G, the characteristic function of the multicut induced by Π is a 01-encoding of Π of fixed length |E|. Lemma 3 (Chopra & Rao, 1993) For any graph G = (V,E) and any x ∈ {0, 1}E , the set x−1(1) of those edges that are labeled 1 is a multicut of G iff (2) holds. It is sufficient in (2) to consider only chordless cycles.\n∀C ∈ cycles(G) ∀e ∈ C : xe ≤ ∑\ne′∈C\\{e}\nxe′ (2)\nFor any graph G = (V,E), we denote by XG the set of all x ∈ {0, 1}E that satisfy (2)."
  }, {
    "heading": "2.1. Complete Graphs",
    "text": "The decompositions of a complete graph KV := (V, ( V 2 ) ) are precisely the partitions of the node set V (by Def. 1). The multicuts of a complete graph KV relate one-to-one to the equivalence relations on V : Lemma 4 For any set V and the complete graph KV , the map ψ : MKV → 2V×V defined by (3) is a bijection between MKV and the set of all equivalence relations on V .\n∀M ∈MKV ∀v, w ∈ V : (v, w) ∈ ψ(M) ⇔ {v, w} /∈M (3)\nThe bijection between the decompositions of a graph and the multicuts of a graph (Lemma 2) specializes, for complete graphs, to the well-known bijection between the partitions of a set and the equivalence relations on the set (by Lemma 4). In this sense, decompositions and multicuts of graphs generalize partitions of sets and equivalence relations on sets."
  }, {
    "heading": "3. Lifted Multicuts",
    "text": "For any graph G = (V,E), the characteristic function x ∈ XG of a multicut x−1(1) of G makes explicit, for every pair {v, w} ∈ E of neighboring nodes, whether v and w are in distinct components. To make explicit also for nonneighboring nodes, specifically, for all {v, w} ∈ E′ with E ⊆ E′ ⊆ ( V 2 ) , whether v andw are in distinct components, we define a lifting of the multicuts of G to multicuts of G′ = (V,E′):\nDefinition 3 For any graphs G = (V,E) and G′ = (V,E′) with E ⊆ E′, the composed map λGG′ := φG′ ◦ φ−1G is called the lifting of multicuts from G to G′.\nFor any graphsG = (V,E) andG′ = (V,E′) withE ⊆ E′, we introduce the notation FGG′ := E′ \\ E, for brevity. Lemma 5 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any x ∈ {0, 1}E′ , the set x−1(1) is a multicut of G′ lifted from G iff\n∀C ∈ cycles(G)∀e ∈ C : xe ≤ ∑\ne′∈C\\{e}\nxe′ (4)\n∀vw ∈ FGG′ ∀P ∈ vw-paths(G) : xvw ≤ ∑ e∈P xe (5)\n∀vw ∈ FGG′ ∀C ∈ vw-cuts(G) : 1− xvw ≤ ∑ e∈C (1− xe)\n(6)\nFor any graphs G = (V,E) and G′ = (V,E′) with E ⊆ E′ we denote by XGG′ the set of all x ∈ {0, 1}E ′ that satisfy (4)–(6)."
  }, {
    "heading": "4. Partial Lifted Multicuts",
    "text": "As a first application of lifted multicuts, we study the class of decompositions of a graph definable by must-join and must-cut constraints. For this, we consider partial functions. For any set E, a partial characteristic function of subsets of E is a function from any subset F ⊆ E to {0, 1}. With some abuse of notation, we denote the set of all partial characteristic functions of subsets of E by {0, 1, ∗}E :=⋃ F⊆E{0, 1}F . For any x ∈ {0, 1, ∗}E , we denote the domain of x by domx := x−1({0, 1}).\nFor any connected graph G = (V,E) whose decompositions we care about and any graph G′ = (V,E′) with E ⊆ E′, we consider a partial function x̃ ∈ {0, 1, ∗}E′ . For any {v, w} ∈ dom x̃, we constrain the nodes v and w to the same component if x̃vw = 0 and to distinct components if x̃vw = 1."
  }, {
    "heading": "4.1. Consistency",
    "text": "A natural question to ask is whether a decomposition of the graph G exists that satisfies these constraints. We show that this decision problem is NP-complete.\nDefinition 4 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′, and any x̃ ∈ {0, 1, ∗}E′ , the elements of\nXGG′ [x̃] := {x ∈ XGG′ | ∀e ∈ dom x̃ : xe = x̃e} (7)\nare called the completions of x̃ in XGG′ . In addition, x̃ is called consistent and a partial characterization of multicuts\nof G′ lifted from G iff\nXGG′ [x̃] 6= ∅ . (8)\nWe denote the set of all partial characterizations of multicuts of G′ lifted from G by\nX̃GG′ := { x̃ ∈ {0, 1, ∗}E ′ ∣∣∣XGG′ [x̃] 6= ∅} . (9)\nTheorem 1 Deciding consistency is NP-complete.\nLemma 6 Consistency can be decided efficiently if E ⊆ dom x̃ or\n∀vw ∈ dom x̃ \\ E : x̃vw = 1 ∨ ∃P ∈ vw-path(G)∀e ∈ P : x̃e = 0 (10)"
  }, {
    "heading": "4.2. Specificity",
    "text": "A less obvious question to ask for any partial characterization x̃ of multicuts of G′ lifted from G is whether x̃ is maximally specific for its completions in XGG′ . In other words, is there no edge e ∈ E′ \\ dom x̃ such that, for any completions x, x′ of x̃ in XGG′ , we have xe = x′e, i.e., an edge that could be included in dom x̃ without changing the set of completions of x̃ in XGG′? We show that deciding maximal specificity is NP-hard.\nDefinition 5 Let G = (V,E) a connected graph and G′ = (V,E′) a graph with E ⊆ E′. For any x̃ ∈ X̃GG′ , the edges\nE′[x̃] := {e ∈ E′ | ∀x, x′ ∈ XGG′ [x̃] : xe = x′e} (11)\nare called decided. The edges E′ \\ E′[x̃] are called undecided. Moreover, x̃ is called maximally specific iff3\nE′[x̃] ⊆ dom x̃ . (12)\nTheorem 2 Deciding maximal specificity is NP-hard.\nLemma 7 Maximal specificity can be decided efficiently if E′ = E or E ⊆ dom x̃.\nBelow, we justify the term maximal specificity and define an operation that maps any partial characterization of lifted multicuts to one that is maximally specific.\nDefinition 6 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, the relation ≤ on X̃GG′ defined by (13) is called the specificity of partial characterizations of multicuts of G′ lifted from G.\n∀x̃, x̃′ ∈ X̃GG′ : (13) x̃ ≤ x̃′ ⇔ dom x̃ ⊆ dom x̃′ ∧ ∀e ∈ dom x̃ : x̃e = x̃′e 3Note that (12) is equivalent to E′[x̃] = dom x̃, as E′[x̃] ⊇\ndom x̃ holds by definition of E′[x̃].\nLemma 8 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, specificity is a partial order on X̃GG′ .\nNote that two partial characterizations x̃, x̃′ ∈ X̃GG′ with the same completions XGG′ [x̃] = XGG′ [x̃′] need not be comparable w.r.t.≤. For example, consider the graphsG,G′ from Fig. 3, consider x̃ : e1 7→ 0, e2 7→ 0 and x̃′ : f 7→ 0. Nevertheless, we have the following lemma. Lemma 9 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′, any x̃ ∈ X̃GG′ and\nX̃GG′ [x̃] := { x̃′ ∈ X̃GG′ ∣∣∣XGG′ [x̃′] = XGG′ [x̃]} (14) a maximum of X̃GG′ [x̃] w.r.t. ≤ exists and is unique. Moreover, x̃ is maximally specific in the sense of Def. 5 iff x̃ is maximal w.r.t. ≤ in X̃GG′ [x̃]. Definition 7 Let G = (V,E) be a connected graph and let G′ = (V,E′) be a graph with E ⊆ E′. For any x̃ ∈ X̃GG′ , we call the unique maximum of X̃GG′ [x̃] w.r.t.≤ the closure of x̃ w.r.t. G and G′ and denote it by clGG′ x̃.\nWe denote by X̂GG′ the set of all maximally specific partial characterizations of multicuts of G′ lifted from G, i.e.:\nX̂GG′ := { x̃ ∈ X̃GG′ ∣∣∣ x̃ = clGG′ x̃} . (15) Theorem 3 For any x̃, x̃′ ∈ X̃GG′ , we have XGG′ [x̃] = XGG′ [x̃\n′]⇔ X̃GG′ [x̃] = X̃GG′ [x̃′]⇔ clGG′ x̃ = clGG′ x̃′. Lemma 10 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any x ∈ XG, the closure y := clGG′ x of x w.r.t. G and G′ coincides with the lifting of the multicut x−1(1) of G to the multicut y−1(1) of G′, i.e.\n(clGG′ x) −1(1) = λGG′(x −1(1)) . (16)\nTheorem 4 Computing closures is NP-hard. Lemma 11 In the special case thatE′ = E orE ⊆ dom x̃, the closure can be computed efficiently."
  }, {
    "heading": "5. Metrics",
    "text": ""
  }, {
    "heading": "5.1. Metrics on Decompositions",
    "text": "As a second application of lifted multicuts, we compare decompositions of a given graph by comparing lifted multicuts that characterize these decompositions. We compare these lifted multicuts by comparing their characteristic functions by Hamming metrics: For any E 6= ∅ and any e ∈ E, we define d1e, d 1 E : {0, 1}E × {0, 1}E → N + 0 by the forms\nd1e(x, x ′) = { 0 ifxe = x′e 1 otherwise\n(17)\nd1E(x, x ′) = ∑ e′∈E d1e′(x, x ′) . (18)\nTheorem 5 For any connected graph G = (V,E), any graph G′ = (V,E′), any µ : E′ → R+, the set E′′ := E ∪ E′ and the graph G′′ := (V,E′′), the function dµE′ : XGG′′ ×XGG′′ → R+0 of the form (19) is a pseudo-metric on XGG′′ . Iff G′ is a supergraph of G, i.e., iff E ⊆ E′, dµE′ is a metric on XGG′′ .\ndµE′(x, x ′) := ∑ e∈E′ µe d 1 e(x, x ′) (19)\nBy the one-to-one relation between decompositions and multicuts (Lemma 2), dµE′ induces a pseudo-metric on the set DG of all decompositions of G. Two special cases are well-known: For E′ = E and µ = 1, we have dµE′ = d 1 E , which is the Hamming metric (18) on the multicuts that characterize the decompositions, also known as the boundary metric on decompositions. For E′ = ( V 2 ) and µ = 1, d1E′ specializes to the metric of Rand (1971). Between these extremes, i.e., for E ⊆ E′ ⊆ ( V 2 ) , the metric dµE′ can be used to analyze more specifically how two decompositions of the same graph differ. We propose an analysis w.r.t. the distance δvw of nodes v and w in G, i.e., w.r.t. the length of a shortest vw-path in G. For this, we denote by δG := max{δvw : vw ∈ ( V 2 ) } the diameter of G.\nDefinition 8 For any connected graph G = (V,E) and any n ∈ N, let E[n] := {vw ∈ ( V 2 ) | δvw = n} the set of pairs of nodes of distance n in G. Moreover, let µn : E[n]→ Q+ the constant function that maps any vw ∈ E[n] to 1/|E[n]|. For any connected graph G = (V,E), we call the sequence(\ndµ n\nE[n] ) n∈{1,...,δG}\n(20)\nthe spectrum of pseudo-metrics on decompositions of G. For E′ := ( V 2 ) and µ : E′ → Q+ : vw 7→ 1/(δG|E[δvw]|), we call the metric dµE′ the δ-metric on decompositions of G.\nAn example of a spectrum of pseudo-metrics is depicted in Fig. 4. For any two decompositions Π,Π′ of a connected graph G and suitable lifted multicuts x, x′ characterizing these decompositions, dµ n\nE[n](x, x ′) equals the fraction of\npairs of nodes at distance n in G that are either cut by Π and joined by Π′, or cut by Π′ and joined by Π. I.e., the pseudometric dµ n\nE[n] compares decompositions of G specifically w.r.t. the distance n in G. The δ-metric compares decompositions w.r.t. all distances, and each distance is weighted equally. This is in contrast to Rand’s metric which is also a comparison w.r.t. all distances but each distance is weighted by the number of pairs of nodes that have this distance."
  }, {
    "heading": "5.2. Metrics on Classes of Decompositions",
    "text": "We compare classes of decompositions definable by mustjoin and must-cut constraints by comparing partial lifted\nmulticuts that characterize these decompositions. To compare partial lifted multicuts, we compare their partial characteristic functions by an extension of the Hamming metric: For any E 6= ∅, any e ∈ E and any θ ∈ R+0 , we define dθe, d θ E : {0, 1, ∗}E × {0, 1, ∗}E → R + 0 such that for all x̃, x̃′ ∈ {0, 1, ∗}E :\ndθe(x̃, x̃ ′) =  1 if e ∈ dom x̃ ∧ e ∈ dom x̃′ ∧ x̃e 6= x̃′e 0 if e ∈ dom x̃ ∧ e ∈ dom x̃′ ∧ x̃e = x̃′e 0 if e /∈ dom x̃ ∧ e /∈ dom x̃′\nθ otherwise (21)\ndθE(x̃, x̃ ′) = ∑ e′∈E dθe′(x̃, x̃ ′) . (22)\nTheorem 6 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any θ ∈ [ 12 , 1], the function d̃θE′ : X̃GG′ × X̃GG′ → R + 0 of the form\nd̃θE′(x̃, x̃ ′) := dθE′(clGG′ x̃, clGG′ x̃ ′) (23)\nis a pseudo-metric on X̃GG′ and a metric on X̂GG′ . Moreover, for any x̃, x̃′ ∈ X̃GG′ :\nX̃GG′ [x̃] = X̃GG′ [x̃ ′] ⇔ d̃θE′(x̃, x̃′) = 0 . (24)\nBy the one-to-one relation between decompositions and multicuts (Lemma 2), every partial characterization of a lifted multicut x̃ ∈ X̃GG′ defines a class of decompositions of the graph G, namely those defined by the lifted multicuts characterized by XGG′ [x̃]. By Theorem 6, d̃θE′ with θ ∈ [ 12 , 1] well-defines a metric on these classes of decompositions and hence a means of comparing the classes of decompositions definable by must-join and must-cut constraints. Computing d̃θE′(x, x\n′) involves computing the closures of x and x′ and is therefore NP-hard (by Theorem 4)."
  }, {
    "heading": "6. Polyhedral Optimization",
    "text": "As a third and final application of lifted multicuts, we turn to the optimization of graph decompositions by lifted multicuts of minimum cost.\nDefinition 9 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any c : E′ → R, the instance of the minimum cost lifted multicut problem w.r.t. G, G′ and c is the optimization problem\nmin {∑ e∈E′ cexe ∣∣∣∣∣ x ∈ XGG′ } . (25)\nIf E′ = E, (25) specializes to the minimum cost multicut problem w.r.t. G′ and c that is also known as graph partition or correlation clustering. If E′ ⊃ E, the minimum cost lifted multicut problem w.r.t. G, G′ and c differs from the minimum cost multicut problem w.r.t. G′ and c. It has a smaller feasible set XGG′ ⊂ XG′ , as we have shown in Section 3 and depicted for the smallest example in Fig. 2 and 3. Unlike the minimum cost multicut problem w.r.t. G′ and c, the minimum cost lifted multicut problem w.r.t.G,G′ and c is such that any feasible solution x ∈ XGG′ indicates by xvw = 0 that the nodes v and w are connected in G by a path of edges labeled 0. See also Fig. 5. This property can be used to penalize by cvw > 0 precisely those decompositions of G for which v and w are in distinct components. For nodes v and w that are not neighbors in G, such costs are sometimes called non-local attractive.\nTo solve instances of the APX-hard minimum cost lifted multicut problem by means of a branch-and-cut algorithm, we study the geometry of lifted multicut polytopes.\nDefinition 10 (Deza & Laurent, 1997) For any graph G = (V,E), the convex hull ΞG := convXG of XG in RE is called the multicut polytope of G.\nDefinition 11 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, ΞGG′ := convXGG′ is called the lifted multicut polytope w.r.t. G and G′.\nExamples are shown in Fig. 2 and 3, respectively. In general, the lifted multicut polytope ΞGG′ w.r.t. graphs G and G′ (Fig. 3) is a subset of the multicut polytope ΞG′ of the graph G′ (Fig. 2). By Lemma 5, the system of cycle inequalities\n(2) for G′ and cut inequalities (6) for G and G′ is redundant as a description ofXGG′ and thus of ΞGG′ . Below, we study the geometry of ΞGG′ ."
  }, {
    "heading": "6.1. Dimension",
    "text": "Theorem 7 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, dim ΞGG′ = |E′|.\nWe prove Theorem 7 by constructing |E′|+ 1 multicuts of G′ lifted from G whose characteristic functions are affine independent points. The strategy is to construct, for any e ∈ E′, an x ∈ XGG′ with xe = 0 and “as many ones as possible”. The challenge is that edges cannot be labeled independently. In particular, for f ∈ FGG′ , xf = 0 can imply, for certain f ′ ∈ FGG′ \\ {f}, that xf ′ = 0, as illustrated in Fig. 6. This structure is made explicit below, in Def. 12 and 13 and Lemmata 12 and 13.\nDefinition 12 For any connected graph G = (V,E) and any graph G′ = (V,E′) such that E ⊆ E′, the sequence (Fn)n∈N of subsets of FGG′ defined below is called the hierarchy of FGG′ with respect to G:\n(a) F0 = ∅ (b) For any n ∈ N and any {v, w} = f ∈ FGG′ : {v, w} ∈ Fn iff there exists a vw-path in G such that, for any distinct nodes v′ and w′ in the path such that {v′, w′} 6= {v, w}, either {v′, w′} 6∈ FGG′ or there exists a natural number j < n such that {v′, w′} ∈ Fj .\nLemma 12 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any f ∈ FGG′ , there exists an n ∈ N such that f ∈ Fn. Definition 13 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, the map ` : FGG′ → N such that ∀f ∈ FGG′∀n ∈ N : `(f) = n ⇔ f ∈ Fn ∧ f 6∈ Fn−1 is called the level function of FGG′ . Lemma 13 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and for any f ∈ FGG′ , there exists an x ∈ XGG′ , called f -feasible, such that\n(a) xf = 0 (b) xf ′ = 1 for all f ′ ∈ FGG′ \\ {f} with `(f ′) ≥ `(f)."
  }, {
    "heading": "6.2. Facets",
    "text": "We characterize those edges e ∈ E′ for which the inequality xe ≤ 1 defines a facet of the lifted multicut polytope ΞGG′ . Theorem 8 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any e ∈ E′, the inequality xe ≤ 1 defines a facet of ΞGG′ iff there is no {v, w} = f ∈ FGG′ such that e connects a pair of v-w-cutvertices4.\n4For any graph G = (V,E) and any v, w ∈ V , a v-w-cutvertex is a node u ∈ V that lies on every vw-path of G.\nNext, we give conditions that contribute to identifying those edges e ∈ E′ for which the inequality 0 ≤ xe defines a facet of the lifted multicut polytope ΞGG′ .\nTheorem 9 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′ and any e ∈ E′, the following assertions hold: In case e ∈ E, the inequality 0 ≤ xe defines a facet of ΞGG′ iff there is no triangle in G′ containing e. In case uv = e ∈ FGG′ , the inequality 0 ≤ xe defines a facet of ΞGG′ only if the following necessary conditions hold:\n(a) There is no triangle in G′ containing e. (b) The distance of any pair of u-v-cut-vertices except {u, v} is at least 3 in G′. (c) There is no triangle of nodes s, s′, t in G′ such that {s, s′} is a u-v-separating node set and t is a u-v-cutvertex.\nNext, we characterize those inequalities of (4) and (5) that are facet-defining for ΞGG′ . Chopra & Rao (1993) have shown that an inequality of (2) defines a facet of the multicut polytope ΞG iff the cycle C is chordless. We establish a similar characterization of those inequalities of (4) and (5) that define a facet of the lifted multicut polytope ΞGG′ . For clarity, we introduce some notation: For any cycle C of G and any e ∈ C, let\nSGG′(e, C) := x ∈ XGG′ ∣∣∣∣∣∣xe = ∑ e′∈C\\{e} xe′  (26) ΣGG′(e, C) := convSGG′(e, C) . (27)\nFor any vw = f ∈ FGG′ and any vw-path P in G, let\nSGG′(f, P ) := { x ∈ XGG′ ∣∣∣∣∣xvw = ∑ e∈P xe } (28)\nΣGG′(f, P ) := convSGG′(f, P ) . (29)\nTheorem 10 For any connected graph G = (V,E) and any graph G′ = (V,E′) with E ⊆ E′, the following assertions hold:\n(a) For any cycle C in G and any e ∈ C, the polytope ΣGG′(e, C) is a facet of ΞGG′ iff C is chordless in G′. (b) For any edge vw = f ∈ FGG′ and any vw-path P in G, the polytope ΣGG′(f, P ) is a facet of ΞGG′ iff P ∪ {f} is chordless in G′.\nInequalities defined by cycles in G′ that contain more than one edge from the set FGG′ do not occur in (4) or (5). They are valid for ΞGG′ as they are valid for ΞG′ ⊇ ΞGG′ . They define a (non-trivial) facet of ΞGG′ only if the cycle is chordless (as chordal cycles are not even facet-defining for ΞG′). At the same time, chordlessness is not a sufficient condition for facet-definingness of non-trivial cycles. For example, in Fig. 6a, the cycle inequality xf2 ≤ xf3 +xv1v2 is dominated by the (non-trivial) valid inequality xf2 ≤ xf3 .\nNext, we consider the cut inequalities (6). Examples of cuts that are not facet-defining for ΞGG′ are shown in Fig. 4 in the appendix. To constrain the class of cuts that are facet-defining, we introduce additional notation: For any connected graph G = (V,E), any distinct nodes v, w ∈ V and any C ∈ vw-cuts(G), we denote by\nG(v, C) = (V (v, C), E(v, C)) (30) G(w,C) = (V (w,C), E(w,C)) (31)\nthe largest components of the graph (V,E \\ C) that contain v and w, respectively. By definition of a vw-cut5, we have\nV (v, C) ∩ V (w,C) = ∅ (32) ∧ V (v, C) ∪ V (w,C) = V . (33)\nWe denote by FGG′(vw,C) the set of those edges in FGG′ , except vw, that cross the vw-cut C of G, i.e.\nFGG′(vw,C) := {f ∈ FGG′ \\ {vw} | f 6⊆ V (v, C)∧ f 6⊆ V (w,C)} . (34)\nWe denote by G′(vw,C) := (V, FGG′(vw,C) ∪ C) the subgraph of G′ that comprises all edges from FGG′(vw,C) and C. Finally, we define\nSGG′(vw,C) := { x ∈ XGG′ ∣∣∣∣∣1− xvw = ∑ e∈C (1− xe) } (35)\nΣGG′(vw,C) := convSGG′(vw,C) . (36)\nDefinition 14 For any connected graph G = (V,E), any distinct v, w ∈ V and any C ∈ vw-cuts(G), a component (V ∗, E∗) of G is called properly (vw,C)-connected iff\nv ∈ V ∗ ∧ w ∈ V ∗ ∧ |E∗ ∩ C| = 1 . (37) 5For any graph G = (V,E) and any distinct nodes v, w ∈ V , a vw-cut of G is a minimal (with respect to inclusion) set C ⊆ E such that v and w are not connected in (V,E \\ C).\nIt is called improperly (vw,C)-connected iff\nV ∗ ⊆ V (v, C) ∨ V ∗ ⊆ V (w,C) . (38)\nIt is called (vw,C)-connected iff it is properly or improperly (vw,C)-connected.\nFor any (vw,C)-connected component (V ∗, E∗) of G, we denote by FV ∗ := {v′w′ = f ′ ∈ FGG′(vw,C) | v′ ∈ V ∗∧ w′ ∈ V ∗} the set of those edges v′w′ = f ′ ∈ FGG′(vw,C) such that (V ∗, E∗) is also (v′w′, C)-connected.\nTheorem 11 For any connected graph G = (V,E), any graph G′ = (V,E′) with E ⊆ E′, any vw = f ∈ FGG′ and any C ∈ vw-cuts(G), ΣGG′(vw,C) is a facet of ΞGG′ only if the following necessary conditions hold:\nC1 For any e ∈ C, there exists a (vw,C)-connected component (V ∗, E∗) of G such that e ∈ E∗.\nC2 For any ∅ 6= F ⊆ FGG′(vw,C), there exists an edge e ∈ C and (vw,C)-connected components (V ∗, E∗) and (V ∗∗, E∗∗) of G such that e ∈ E∗ and e ∈ E∗∗ and |F ∩ FV ∗ | 6= |F ∩ FV ∗∗ |.\nC3 For any f ′ ∈ FGG′(vw,C), any ∅ 6= F ⊆ FGG′(vw,C) \\ {f ′} and any k ∈ N, there exist (vw,C)-connected components (V ∗, E∗) and (V ∗∗, E∗∗) with f ′ ∈ FV ∗ and f ′ /∈ FV ∗∗ such that\n|F ∩ FV ∗ | 6= k or |F ∩ FV ∗∗ | 6= 0 . (39)\nC4 For any v′ ∈ V (v, C), any w′ ∈ V (w,C) and any v′w′-path P = (VP , EP ) in G′(vw,C), there exists a properly (vw,C)-connected component (V ∗, E∗) of G such that\n(v′ /∈ V ∗ ∨ ∃w′′ ∈ VP ∩ V (w,C) : w′′ /∈ V ∗) ∧ (w′ /∈ V ∗ ∨ ∃v′′ ∈ VP ∩ V (v, C) : v′′ /∈ V ∗) .\n(40)\nC5 For any cycle Y = (VY , EY ) in G′(vw,C), there exists a properly (vw,C)-connected component (V ∗, E∗) of G such that\n(∃v′ ∈ VY ∩ V (v, C) : v′ /∈ V ∗) ∧ (∃w′ ∈ VY ∩ V (w,C) : w′ /∈ V ∗) . (41)"
  }, {
    "heading": "6.3. Algorithms",
    "text": "To study the relevance of geometric properties established above, we compare two separation procedures, α and β, for lifted multicut polytopes. We implement these for the branch-and-cut algorithm in the software Gurobi. Our code is available at https://github.com/bjoern-andres/graph. The\nprocedure α is canonical and serves as a reference. It separates infeasible points by any of the inequalities (4)–(6). Violated inequalities of (4) and (5) are found by searching for shortest chordless paths. Violated inequalities of (5) are found by searching for minimum vw-cuts. The procedure β is less canonical: It separates infeasible points by some cycle inequalities w.r.t. G′ (cf. Theorem 10) and by cut inequalities (6). Violated cycle inequalities of G′ are found by first seaching for paths and cycles as before but then replacing sub-paths by chords in G′. Violated cut-inequalities are found as before but added to the problem only conditionally: For each violated inequality of (6) that we find and the corresponding {v, w} ∈ FGG′ and C ∈ vw-cuts(G), we search for a vw-path P in G′ such that one of the cycle inequalities for the cycle formed by P and {v, w} is violated. If it exists, only the cycle inequality is added. Otherwise, the cut-inequality is added. The advantage of β over α can be seen in Fig. 7 for an instance of the min cost lifted multicut problem by Keuper et al. (2015) with |V | = 126, |E| = 229 and |E′| = 1860."
  }, {
    "heading": "7. Conclusion",
    "text": "By studying the set of all decompositions (clusterings) of a graph through its characterization as a set of lifted multicuts, we have gained three insights: 1. Toward the definition of classes of decompositions by must-join and must-cut constraints, we have seen that consistency and maximal specificity are NP-hard to decide. 2. Toward the comparison of decompositions by metrics, we have defined a generalization of Rand’s metric and the boundary metric that enables more detailed analyses of how two decompositions of the same graph differ. This metric extends to classes of decompositions definable by must-join and must-cut constraints for which it is NP-hard to compute. 3. Toward the optimization of graph decompositions by minimum cost lifted multicuts, we have established some properties of some facets of lifted multicut polytopes. These properties have led us to efficient separation procedures and a branch-and-cut algorithm for the minimum cost lifted multicut problem."
  }],
  "year": 2017,
  "references": [{
    "title": "Contour detection and hierarchical image segmentation",
    "authors": ["Arbeláez", "Pablo", "Maire", "Michael", "Fowlkes", "Charless C", "Malik", "Jitendra"],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
    "year": 2011
  }, {
    "title": "Optimal coalition structure generation in cooperative graph games",
    "authors": ["Bachrach", "Yoram", "Kohli", "Pushmeet", "Kolmogorov", "Vladimir", "Zadimoghaddam", "Morteza"],
    "venue": "In AAAI,",
    "year": 2013
  }, {
    "title": "Correlation clustering",
    "authors": ["Bansal", "Nikhil", "Blum", "Avrim", "Chawla", "Shuchi"],
    "venue": "Machine Learning,",
    "year": 2004
  }, {
    "title": "An efficient fusion move algorithm for the minimum cost lifted multicut problem",
    "authors": ["Beier", "Thorsten", "Andres", "Bjoern", "Köthe", "Ullrich", "Hamprecht", "Fred A"],
    "venue": "In ECCV,",
    "year": 2016
  }, {
    "title": "The partition problem",
    "authors": ["Chopra", "Sunil", "M.R. Rao"],
    "venue": "Mathematical Programming,",
    "year": 1993
  }, {
    "title": "Facets of the k-partition polytope",
    "authors": ["Chopra", "Sunil", "M.R. Rao"],
    "venue": "Discrete Applied Mathematics,",
    "year": 1995
  }, {
    "title": "Intractability and clustering with constraints",
    "authors": ["Davidson", "Ian", "S.S. Ravi"],
    "venue": "In ICML,",
    "year": 2007
  }, {
    "title": "Correlation clustering in general weighted graphs",
    "authors": ["Demaine", "Erik D", "Emanuel", "Dotan", "Fiat", "Amos", "Immorlica", "Nicole"],
    "venue": "Theoretical Computer Science,",
    "year": 2006
  }, {
    "title": "Clique-web facets for multicut polytopes",
    "authors": ["Deza", "Michel Marie", "Grötschel", "Martin", "Laurent", "Monique"],
    "venue": "Mathematics of Operations Research,",
    "year": 1992
  }, {
    "title": "A cutting plane algorithm for a clustering problem",
    "authors": ["Grötschel", "Martin", "Wakabayashi", "Yoshiko"],
    "venue": "Mathematical Programming,",
    "year": 1989
  }, {
    "title": "Higher-order segmentation via multicuts",
    "authors": ["Kappes", "Jörg Hendrik", "Speth", "Markus", "Reinelt", "Gerhard", "Schnörr", "Christoph"],
    "venue": "Computer Vision and Image Understanding,",
    "year": 2016
  }, {
    "title": "Efficient decomposition of image and mesh graphs by lifted multicuts",
    "authors": ["Keuper", "Margret", "Levinkov", "Evgeny", "Bonneel", "Nicolas", "Lavoué", "Guillaume", "Brox", "Thomas", "Andres", "Bjoern"],
    "venue": "In ICCV,",
    "year": 2015
  }, {
    "title": "Image segmentation using higher-order correlation clustering",
    "authors": ["Kim", "Sungwoong", "Yoo", "Chang D", "Nowozin", "Sebastian", "Kohli", "Pushmeet"],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
    "year": 2014
  }, {
    "title": "Correlation clustering and two-edge-connected augmentation for planar graphs",
    "authors": ["Klein", "Philip N", "Mathieu", "Claire", "Zhou", "Hang"],
    "venue": "In Symposium on Theoretical Aspects of Computer Science,",
    "year": 2015
  }, {
    "title": "Joint graph decomposition and node labeling by local search",
    "authors": ["Levinkov", "Evgeny", "Uhrig", "Jonas", "Tang", "Siyu", "Omran", "Mohamed", "Insafutdinov", "Eldar", "Kirillov", "Alexander", "Rother", "Carsten", "Brox", "Thomas", "Schiele", "Bernt", "Andres", "Bjoern"],
    "year": 2017
  }, {
    "title": "Comparing clusteringsan information based distance",
    "authors": ["Meilă", "Marina"],
    "venue": "Journal of Multivariate Analysis,",
    "year": 2007
  }, {
    "title": "Solution stability in linear programming relaxations: Graph partitioning and unsupervised learning",
    "authors": ["Nowozin", "Sebastian", "Jegelka", "Stefanie"],
    "venue": "In ICML,",
    "year": 2009
  }, {
    "title": "Global interactions in random field models: A potential function ensuring connectedness",
    "authors": ["Nowozin", "Sebastian", "Lampert", "Christoph H"],
    "venue": "SIAM Journal on Imaging Sciences,",
    "year": 2010
  }, {
    "title": "Objective criteria for the evaluation of clustering methods",
    "authors": ["Rand", "William M"],
    "venue": "Journal of the American Statistical Association,",
    "year": 1971
  }, {
    "title": "Multiple people tracking by lifted multicut and person re-identification",
    "authors": ["Tang", "Siyu", "Andriluka", "Mykhaylo", "Andres", "Bjoern", "Schiele", "Bernt"],
    "venue": "In CVPR,",
    "year": 2017
  }, {
    "title": "Coalition structure generation over graphs",
    "authors": ["Voice", "Thomas", "Polukarov", "Maria", "Jennings", "Nicholas R"],
    "venue": "Journal of Artificial Intelligence Research,",
    "year": 2012
  }, {
    "title": "Fast planar correlation clustering for image segmentation",
    "authors": ["Yarkony", "Julian", "Ihler", "Alexander", "Fowlkes", "Charless C"],
    "venue": "In ECCV,",
    "year": 2012
  }],
  "id": "SP:a65b4ca798c36ef72f9c2f97fc97078d3ecb9a80",
  "authors": [{
    "name": "Andrea Horňáková",
    "affiliations": []
  }, {
    "name": "Jan-Hendrik Lange",
    "affiliations": []
  }, {
    "name": "Bjoern Andres",
    "affiliations": []
  }],
  "abstractText": "We study the set of all decompositions (clusterings) of a graph through its characterization as a set of lifted multicuts. This leads us to practically relevant insights related to the definition of classes of decompositions by must-join and must-cut constraints and related to the comparison of clusterings by metrics. To find optimal decompositions defined by minimum cost lifted multicuts, we establish some properties of some facets of lifted multicut polytopes, define efficient separation procedures and apply these in a branchand-cut algorithm.",
  "title": "Analysis and Optimization of Graph Decompositions by Lifted Multicuts"
}