{
  "sections": [{
    "text": "β̂ := arg min β\n∑n j=1`(x > j β; yj) + λR(β), (1)\nwhere xi ∈ Rp and yi ∈ R denote the ith feature and response variable respectively. Let ` and R be the loss function and regularizer, β denote the unknown weights, and λ be a regularization parameter. Finding the optimal choice of λ is a challenging problem in high-dimensional regimes where both n and p are large. We propose two frameworks to obtain a computationally efficient approximation ALO of the leave-one-out cross validation (LOOCV) risk for nonsmooth losses and regularizers. Our two frameworks are based on the primal and dual formulations of (1). We prove the equivalence of the two approaches under smoothness conditions. This equivalence enables us to justify the accuracy of both methods under such conditions. We use our approaches to obtain a risk estimate for several standard problems, including generalized LASSO, nuclear norm regularization, and support vector machines. We empirically demonstrate the effectiveness of our results for non-differentiable cases."
  }, {
    "heading": "1. Introduction",
    "text": ""
  }, {
    "heading": "1.1. Motivation",
    "text": "Consider a standard prediction problem in which a dataset {(yj ,xj)}nj=1 ⊂ R× Rp is employed to learn a model for inferring information about new datapoints that are yet to be observed. One of the most popular classes of learning\n*Equal contribution 1Department of Statistics, Columbia University, New York, USA 2Mathematics Department and Operation Research Center, Massachusetts Institute of Technology, Massachusetts, USA 3Google Research, New York, USA. Correspondence to: Shuaiwen Wang <sw2853@columbia.edu>, Wenda Zhou <wz2335@columbia.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nschemes, especially in high-dimensional settings, studies the following optimization problem:\nβ̂ := arg min β n∑ j=1 `(x>j β; yj) + λR(β), (2)\nwhere ` : R2 → R is the loss function, R : Rp → R is the regularizer, and λ is the tuning parameter that specifies the amount of regularization. By applying an appropriate regularizer in (2), we are able to achieve better bias-variance trade-off and pursue special structures such as sparsity and low rank structure. However, the performance of such techniques hinges upon the selection of tuning parameters.\nThe most generally applicable tuning method is cross validation (Stone, 1974). One common choice is k-fold cross validation, which however presents potential bias issues in high-dimensional settings where n is comparable to p. For instance, the phase transition phenomena that happen in such regimes (Amelunxen et al., 2014; Donoho et al., 2009; Donoho & Tanner, 2005) indicate that any data splitting may cause dramatic effects on the solution of (2) (see Figure 1 for an example). Hence, the risk estimates obtained from k-fold cross validation may not be reliable. The bias issues of k-fold cross validation may be alleviated by choosing the number of folds k to be large. However, such schemes are computationally demanding and may not be useful for emerging high-dimensional applications. An alternative choice of cross validation is LOOCV, which is unbiased in high-dimensional problems. However, the computation of LOOCV requires training the model n times, which is unaffordable for large datasets.\nThe high computational complexity of LOOCV has motivated researchers to propose computationally less demanding approximations of the quantity. Early examples offered approximations for the case R(β) = 12‖β‖ 2 2 and the loss function being smooth (Allen, 1974; O’sullivan et al., 1986; Le Cessie & Van Houwelingen, 1992; Cawley & Talbot, 2008; Meijer & Goeman, 2013; Opper & Winther, 2000). In (Beirami et al., 2017), the authors considered such approximations for smooth loss functions and smooth regularizers. In this line of work, the accuracy of the approximations was either not studied or was only studied in the n large, p fixed regime. In a recent paper, (Rad & Maleki, 2018) employed a similar approximation strategy to obtain approx-\nimate leave-one-out formulas for smooth loss functions and smooth regularizers. They show that under some mild conditions, such approximations are accurate in high-dimensional settings. Unfortunately, the approximations offered in (Rad & Maleki, 2018) only cover twice differentiable loss functions and regularizers. On the other hand, numerous modern regularizers, such as generalized LASSO and nuclear norm, and also many loss functions are not smooth.\nIn this paper, we propose two powerful frameworks for calculating an approximate leave-one-out estimator (ALO) of the LOOCV risk that are capable of offering accurate parameter tuning even for non-differentiable losses and regularizers. Our first approach is based on the smoothing and quadratic approximation of the primal problem (2). The second approach is based on the approximation of the dual of (2). While the two approaches consider different approximations that happen in different domains, we will show that when both ` and r are twice differentiable, the two frameworks produce the same ALO formulas, which are also the same as the formulas proposed in (Rad & Maleki, 2018).\nWe use our platforms to obtain concise formulas for several popular examples including generalized LASSO, support vector machine (SVM) and nuclear norm minimization. As will be clear from our examples, despite of the equivalence of the two frameworks for smooth loss functions and regularizers, the technical aspects of the derivations involved for obtaining ALO formulas have major variations in different examples. Finally, we present extensive simulations to confirm the accuracy of our formulas on various important machine learning models. Code is available at github.com/wendazhou/alocv-package."
  }, {
    "heading": "1.2. Other Related Work",
    "text": "The importance of parameter tuning in learning systems has encouraged many researchers to study the problem from different perspectives. In addition to cross validation, other approaches have been proposed including Stein’s unbiased risk estimate (SURE), Akaike information criterion (AIC), and Mallow’s Cp. While AIC is designed for smooth para-\nmetric models, SURE has been extended to emerging optimization problems, such as generalized LASSO and nuclear norm minimization (Candes et al., 2013; Dossal et al., 2013; Tibshirani et al., 2012; Vaiter et al., 2017; Zou et al., 2007).\nUnlike cross validation which approximates the out-ofsample prediction error, SURE, AIC, and Cp offer estimates for in-sample prediction error (Hastie et al., 2009). This makes cross validation more appealing for many learning systems. Furthermore, unlike ALO, both SURE andCp only work on linear models (and not generalized linear models) and their unbiasedness is only guaranteed under the Gaussian model for the errors. There has been little success in extending SURE beyond this model (Efron, 2004).\nAnother class of parameter tuning schemes are based on approximate message passing (Bayati et al., 2013; Mousavi et al., 2017; Obuchi & Kabashima, 2016). As pointed out in (Obuchi & Kabashima, 2016), this approach is intuitively related to LOOCV. It offers consistent parameter tuning in high-dimensions (Mousavi et al., 2017), but the results strongly depend on the independence of the elements ofX ."
  }, {
    "heading": "1.3. Notation",
    "text": "Lowercase and uppercase bold letters denote vectors and matrices, respectively. For subsets A ⊂ {1, 2, . . . , n} and B ⊂ {1, 2, . . . , p} of indices and a matrixX , letXA,· and X·,B denote the submatrices that include only rows of X in A, and columns of X in B respectively. Let {ai}i∈S denote the vector whose components are ai for i ∈ S. We may omit S, in which case we consider all indices valid in the context. For a function f : R → R, let ḟ , f̈ denote its 1st and 2nd derivatives. For a vector a, we use diag[a] to denote a diagonal matrix A with Aii = ai. Finally, let ∇R and∇2R denote the gradient and Hessian of a function R : Rp → R."
  }, {
    "heading": "2. Preliminaries",
    "text": ""
  }, {
    "heading": "2.1. Problem Description",
    "text": "In this paper, we study the statistical learning models in form (2). For each value of λ, we evaluate the following LOOCV risk estimate with respect to some error function d:\nlooλ := 1\nn n∑ i=1 d(yi,x > i β̂ /i), (3)\nwhere β̂/i is the solution of the leave-i-out problem\nβ̂/i := arg min β ∑ j 6=i `(x>j β; yj) + λR(β). (4)\nCalculating (4) requires training the model n times, which may be time-consuming in high-dimensions. As an alternative, we propose an estimator β̃/i to approximate β̂/i based\non the full-data estimator β̂ to reduce the computational complexity. We consider two frameworks for obtaining β̃/i, and denote the corresponding risk estimate by:\naloλ := 1\nn n∑ i=1 d(yi,x > i β̃ /i). (5)\nThe estimates we obtain will be called approximated leaveone-out (ALO) throughout the paper."
  }, {
    "heading": "2.2. Primal and Dual Correspondence",
    "text": "The objective function of penalized regression problem with loss ` and regularizer R is given by:\nP (β) := n∑ j=1 `(x>j β; yj) +R(β). (6)\nHere and subsequently, we absorb the value of λ into R to simplify the notation. We also consider the Lagrangian dual problem, which can be written in the form:\nmin θ∈Rn D(θ) := n∑ j=1 `∗(−θj ; yj) +R∗(X>θ), (7)\nwhere `∗ and R∗ denote the Fenchel conjugates 1 of ` and R respectively. See the derivation in Appendix A.\nIt is known that under mild conditions, (6) and (7) are equivalent (Boyd & Vandenberghe, 2004). In this case, we have the primal-dual correspondence relating the primal optimal β̂ and the dual optimal θ̂:\nβ̂ ∈ ∂R∗(X>θ̂), X>θ̂ ∈ ∂R(β̂),\nx>j β̂ ∈ ∂`∗(−θ̂j ; yj), −θ̂j ∈ ∂`(x>j β̂; yj), (8)\nwhere ∂f denotes the set of subgradients of a function f . Below we will use both primal and dual perspectives for approximating looλ."
  }, {
    "heading": "3. Approximation in the Dual Domain",
    "text": ""
  }, {
    "heading": "3.1. The First Example: LASSO",
    "text": "Let us first start with a simple example that illustrates our dual method in deriving an approximate leave-one-out (ALO) formula for the standard LASSO. The LASSO estimator, first proposed in (Tibshirani, 1996), can be formulated as the penalized regression framework in (6) by setting `(µ; y) = (µ− y)2/2, and R(β) = λ‖β‖1.\nWe recall the general formulation of the dual for penalized regression problems (7), and note that in the case of the\n1The Fenchel conjugate f∗ of a function f is defined as f∗(x) := supy{〈x, y〉 − f(y)}.\nLASSO we have:\n`∗(θi; yi) = 1\n2 (θi−yi)2, R∗(β) = { 0 if ‖β‖∞ ≤ λ, +∞ otherwise.\nIn particular, we note that the solution of the dual problem (7) can be obtained from:\nθ̂ = Π∆X (y). (9)\nHere Π∆X denotes the projection onto ∆X , where ∆X is the polytope given by:\n∆X = {θ ∈ Rn : ‖X>θ‖∞ ≤ λ}.\nLet us now consider the leave-i-out problem. Unfortunately, the dimension of the dual problem is reduced by 1 for the leave-i-out problem, making it difficult to leverage the information from the full-data solution to approximate the leave-i-out solution. We augment the leave-i-out problem with a virtual ith observation that does not affect the result of the optimization, but restores the dimensionality of the problem.\nMore precisely, let ya be the same as y, except that its ith coordinate is replaced by ŷ/ii = x > i β̂\n/i, the leave-i-out predicted value. We note that the leave-i-out solution β̂/i is also the solution for the following augmented problem:\nmin β∈Rp n∑ j=1 `(x>j β; ya,j) +R(β). (10)\nLet θ̂/i be the corresponding dual solution of (10). Then, by (9), we know that\nθ̂/i = Π∆X (ya).\nAdditionally, the primal-dual correspondence (8) gives that θ̂/i = ya −Xβ̂/i, which is the residual in the augmented problem, and hence that θ̂/ii = 0. These two features allow us to characterize the leave-i-out predicted value ŷ/ii :\ne>i Π∆X ( y − (yi − ŷ/ii )ei ) = 0 (11)\nwhere ei denotes the ith standard vector. Solving exactly for the above equation is in general a procedure that is computationally comparable to fitting the model, which may be expensive. However, we may attempt to obtain an approximate solution of (11) by linearizing the projection operator at the full data solution θ̂, or equivalently performing a single Newton step to solve the leave-i-out problem from the full data solution. The approximate leave-i-out fitted value ỹ /i i is thus given by:\nỹ /i i = yi − θ̂i Jii , (12)\nwhere J denotes the Jacobian of the projection operator Π∆X at the full data problem y. We can substitute the x>i β̃\n/i in (5) with the ỹ/i found above to obtain our ALO risk estimates. Note that ∆X is a polytope, and thus the projection onto ∆X is almost everywhere locally affine (Tibshirani et al., 2012). Furthermore, it is straightforward to calculate the Jacobian of Π∆X . Let E = {j : |X>j θ̂| = λ} be the equicorrelation set (where Xj denotes the jth column of X). Then the projection at the full data problem y is locally given by a projection onto the orthogonal complement of the span of X·,E , thus giving J = I−X·,E(X>·,EX·,E)−1X>·,E . We can then obtain ỹ/i by plugging J in (12). Finally, by replaceing x>i β̃ /i with ỹ /i i in (5) we obtain an estimate of the risk."
  }, {
    "heading": "3.2. General Case",
    "text": "In this section we extend the dual approach outlined in Section 3.1 to more general loss functions and regularizers.\nGeneral regularizers Let us first extend the dual approach to other regularizers, while the loss function remains `(µ, y) = (µ− y)2/2. In this case the dual problem (7) has the following form:\nmin θ\n1\n2 n∑ j=1 (θj − yj)2 +R∗(X>θ). (13)\nWe note that the optimal value of θ is by definition the value of the proximal operator of R∗(X>·) at y:\nθ̂ = proxR∗(X>·)(y).\nFollowing the argument of Section 3.1, we obtain\nỹ /i i = yi − θ̂i Jii , (14)\nwith J now denoting the Jacobian of proxR∗(X>·). We note that the Jacobian matrix J exists almost everywhere, because the non-expansiveness of the proximal operator guarantees its almost-everywhere differentiability (Combettes & Pesquet, 2011). In particular, if y has distribution which is absolutely continuous with respect to the Lebesgue measure, J exists with probability 1. This approach is particularly useful when R is a norm, as its Fenchel conjugate is then the convex indicator of the unit ball of the dual norm, and the proximal operator reduces to a projection operator.\nGeneral smooth loss Let us now assume we have a convex smooth loss in (6), such as those that appear in generalized linear models. As we are arguing from a secondorder perspective by considering Newton’s method, we will expand the loss as a quadratic form around the full data\nsolution. We will thus consider the approximate problem obtained by expanding `∗ around the dual optimal θ̂:\nmin θ\n1\n2 n∑ j=1 ῭∗(−θ̂j ; yj)\n( θj−θ̂j−\n˙̀∗(−θ̂j ; yj) ῭∗(−θ̂j ; yj)\n)2 +R∗(X>θ).\n(15)\nThe constant term has been removed from (15) for simplicity. We have reduced the problem to that of a weighted `2 loss which may be further reduced to a simple `2 problem by a change of variable and a rescaling of X . Indeed, let K\nbe the diagonal matrix such that Kjj = √\n῭∗(−θ̂j ; yj), and note that we have: ˙̀∗(−θ̂j ; yj) = x>j β̂ := ŷj by the primaldual correspondence (8). Consider the change of variable u = Kθ to obtain:\nmin u\n1\n2 n∑ j=1 uj − θ̂j ῭∗(−θ̂j ; yj) + ŷj√ ῭∗(−θ̂j ; yj) 2+R∗(X>K−1u). We may thus reduce to the `2 loss case in (13) with a modifiedX and y:\nXu = K −1X, yu =  θ̂j ῭∗(−θ̂j ; yj) + ŷj√῭∗(−θ̂j ; yj)  j . (16)\nSimilar to (14), the ALO formula in the case of general smooth loss can be obtained as ỹ/ii = Kiiỹ /i u,i, with\nỹ /i u,i = yu,i − Kiiθ̂i Jii , (17)\nwhere J is the Jacobian of proxR∗(X>u ·)."
  }, {
    "heading": "4. Approximation in the Primal Domain",
    "text": ""
  }, {
    "heading": "4.1. Smooth Loss and Regularizer",
    "text": "To obtain looλ we need to solve\nβ̂/i := arg min β ∑ j 6=i `(x>j β; yj) +R(β). (18)\nAssuming β̂/i is close to β̂, we can take a Newton step from β̂ towards β̂/i to obtain its approximation β̃/i as:\nβ̃/i = β̂+ [∑ j 6=i xjx > j ῭(x>j β̂; yj)+∇2R(β̂) ]−1 xi ˙̀(x > i β̂; yi).\n(19)\nWe have by the matrix inversion lemma (Hager, 1989):\nx>i β̃ /i = x>i β̂ +\nHii\n1−Hii ῭(x>i β̂; yi) ˙̀(x>i β̂; yi), (20)\nH = X[X>diag[{῭(x>i β̂; yi)}i]X +∇2R(β̂)]−1X>. (21)\nThis is the formula reported in (Rad & Maleki, 2018). By calculating β̂ and H in advance, we can cheaply approximate the leave-i-out prediction for all i and efficiently evaluate the LOOCV risk. On the other hand, in order to use the above strategy, twice differentiability of both the loss and the regularizer is necessary in a neighborhood of β̂. However, this assumption is violated for many machine learning models including LASSO, Nuclear norm, and SVM. In the next two sections, we introduce a smoothing technique which lifts the scope of the above primal approach to nondifferentiable losses and regularizers."
  }, {
    "heading": "4.2. Nonsmooth Loss and Smooth Regularizer",
    "text": "In this section we study the piecewise smooth loss functions and twice differentiable regularizers. Such problems arise in SVM (Cortes & Vapnik, 1995) and robust regression (Huber, 1973). Before proceeding further, we clarify our assumptions on the loss function.\nDefinition 4.1. A singular point of a function is called qth order, if at this point the function is q times differentiable, but its (q + 1)th order derivative does not exist.\nBelow we assume the loss ` is piecewise twice differentiable with k zero-order singularities v1, . . . , vk ∈ R. The existence of singularities prohibits us from directly applying strategies in (19) and (20), where twice differentiability of ` and R is necessary. A natural solution is to first smooth the loss `, then apply the framework in Section 4.1 to the smoothed version and finally reduce the smoothness to recover the ALO formula for the original nonsmooth problem.\nAs the first step, consider the following smoothing idea:\n`h(µ; y) =: 1\nh\n∫ `(u; y)φ((µ− u)/h)du,\nwhere h > 0 is fixed and φ is a smooth symmetric function with the following properties:\nNormalization: ∫ φ(w)dw = 1, φ(w) ≥ 0, φ(0) > 0;\nCompact support: supp(φ) = [−C,C] for some C > 0.\nNow plug in this smooth version `h into (18) to obtain the following formula from (19):\nGh := ∑ j 6=i xjx > j ῭ h(x > j β̂h; yj) +∇2R(β̂h),\nβ̃ /i h := β̂h +G −1 h xi ˙̀ h(x > i β̂h; yi).\n(22)\nwhere β̂h is the minimizer on the full data from loss `h and R. β̃/ih is a good approximation to the leave-i-out estimator β̂/ih based on smoothed loss `h. Setting h → 0, we have `h(µ, y) converge to `(µ, y) uniformly in the region of interest (see Appendix C.1 for the proof), implying\nthat limh→0 β̃ /i h serves as a good estimator of limh→0 β̂ /i h , which is heuristically close to the true leave-i-out β̂/i. Equation (22) can be simplified in the limit h → 0. We define the sets of indices V and S for the samples at singularities and smooth parts respectively:\nV := {j : x>j β̂ = vt for some t ∈ {1, . . . , k}}, S := {1, . . . , n} \\ V.\nWe characterize the limit of x>i β̃ /i h below. Theorem 4.1. Under some mild conditions, as h→ 0,\nx>i β̃ /i h → x > i β̂ + aig`,i\nwhere\nai =  Wii 1−Wii ῭(x>i β̂;yi) if i ∈ S,\n1 [(XV ·Y −1X>V ·) −1]ii if i ∈ V,\nY = ∇2R(β̂) +X>S·diag[{῭(x>j β̂)}j∈S ]XS·, Wii = x > i Y −1xi − x>i Y −1X>V,·(XV,·Y −1X>V,·)−1XV,·Y −1xi.\nFor i ∈ S, g`,i = ˙̀(x>i β̂; yi), and for i ∈ V , we have:\ng`,V = (XV,·X > V,·) −1XV,·[∇R(β̂)− ∑ j∈S xj ˙̀(x > j β̂; yj)].\nWe can obtain the ALO estimate of prediction error by plugging x>i β̂ + aig`,i instead of x > i β̃\n/i in (5). The conditions and proof of Theorem 4.1 can be found in Appendix C.3."
  }, {
    "heading": "4.3. Nonsmooth Regularizer and Smooth Loss",
    "text": "The smoothing technique proposed in the last section can also handle many nonsmooth regularizers. In this section we focus on separable regularizers R, defined as R(β) = ∑p l=1 r(βl), where r : R → R is piecewise twice differentiable with finite number of zero-order singularities in v1, . . . , vk ∈ R. (Examples on non-separable regularizers are studied in Section 6.) We further assume the loss function ` to be twice differentiable and denote by A = {l : β̂l 6= vt, for any t ∈ {1, . . . , k}} the active set.\nFor the coordinates of β̂ that lie inA, our objective function, constrained to these coordinates, is locally twice differentiable. Hence we expect β̂/iA to be well approximated by the ALO formula using β̂A. On the other hand, components not in A are trapped at singularities. As long as they are not on the boundary of being in or out of the singularities, we expect these locations of β̂/i to stay at the same values.\nTechnically, consider a similar smoothing scheme for r:\nrh(w) = 1\nh\n∫ r(u)φ((w − u)/h)du,\nand let Rh(β) = ∑p l=1 rh(βl). We then consider the ALO formula of Model (18) with regularizer Rh:\nGh := ∑ j 6=i xjx > j ῭(x>j β̂h; yj) +∇2Rh(β̂h),\nβ̃ /i h := β̂h +G −1 h xi ˙̀ h(x > i β̂; yi).\n(23)\nSetting h→ 0, (23) reduces to a simplified formula which heuristically serves as a good approximation to the true leave-i-out estimator β̂/i, stated as the following theorem:\nTheorem 4.2. Under some mild conditions, as h→ 0,\nx>i β̃ /i h → x > i β̂ +\nHii ˙̀(x > i β̂; yi)\n1−Hii ῭(x>i β̂; yi) ,\nwith\nH =X·,A[X > ·,Adiag[{῭(x>i β̂; yi)}i]X·,A+∇2R(β̂A)]−1X>·,A.\nThe conditions and proof of Theorem 4.2 can be found in the Appendix C.2.\nRemark 4.1. For nonsmooth problems, higher order singularities do not cause issues: the set of tuning values which cause β̂l (for regularizer) or x>j β̂ (for loss) to fall at those higher order singularities has measure zero.\nRemark 4.2. For both nonsmooth losses and regularizers, we need to invert some matrices in the ALO formula. Although the invertibility does not seem guaranteed in the general formula, as we apply ALO to specific models, the structures of the loss and/or the regularizer ensures this invertibility. For example, for LASSO, we have that the size of the active set |E| ≤ min(n, p). Remark 4.3. We note that the dual approach is typically powerful for models with smooth losses and norm-type regularizers, such as the SLOPE norm and the generalized LASSO. On the other hand, the primal approach is valuable for models with nonsmooth loss or when the Hessian of the regularizer is feasible to calculate. Such regularizers often exhibit some type of separability or symmetry, such as in the case of SVM or nuclear norm."
  }, {
    "heading": "5. Equivalence Between Primal and Dual Methods",
    "text": "Although the primal and dual methods may be harder or easier to carry out depending on the specific problem at hand, one may wonder if they always obtain the same result. In this section, we outline a unifying view for both methods, and state an equivalence theorem.\nAs both the primal and dual methods are based on a firstorder approximation strategy, we will study them not as approximate solutions to the leave-i-out problem, but will\ninstead show that they are exact solutions to a surrogate leave-i-out problem. Indeed, recall that the leave-i-out problem is given by (4), which cannot be solved in closed form. However, we note that the solution does exist in closed form in the case where both ` and R are quadratic functions.\nWe may thus consider the approximate leave-i-out problem, where both ` and R have been replaced in the leave-i-out problem (4) by their quadratic expansion at β̂:\nmin β/i ∑ j 6=i ˜̀(x>j β /i; yj) + R̃(β /i). (24)\nWhen both ` and R are twice differentiable at the full data solution, ˜̀and R̃ correspond to their respective second order Taylor expansions at β̂. When ` or R is not twice differentiable at the full data solution, we have seen that it is still possible to obtain an ALO estimator through the proximal map (in the case of the dual) or through smoothing arguments (in the case of the primal). The corresponding quadratic surrogates may then be formulated as partial quadratic functions, i.e. convex quadratic functions restricted to an affine subspace. However, due to space limitations we only focus on twice differentiable losses and regularizers here.\nThe way we obtain β̃/i in (19) indicates that the primal formula in (20) and (21) are the exact leave-i-out solution of the surrogate primal problem (24). On the other hand, we may also wish to consider the surrogate dual problem, by replacing `∗ andR∗ by their quadratic expansion at full data dual solution θ̂ in the dual problem (7). One may possibly worry that the surrogate dual problem is then different from the dual of the surrogate primal problem (24). This does not happen, and we have the following theorem. Theorem 5.1. Let ` and R be twice differentiable convex functions. Let ˜̀and R̃ denote the quadratic surrogates of the loss and regularizer at β̂, and let ˜̀∗D and R̃ ∗ D denote the quadratic surrogates of the conjugate loss and regularizer at the dual full data solution θ̂. We have that the following problems are equivalent (have the same minimizer):\nminθ ∑n j=1 ˜̀∗(−θj ; yj) + R̃∗(X>θ), (25)\nminθ ∑n j=1 ˜̀∗ D(−θj ; yj) + R̃∗D(X>θ). (26)\nAdditionally, we note that the dual method described in Section 3 solves the surrogate dual problem (26).\nTheorem 5.2. LetXu, yu be as in (16), and let ỹ /i u,i be the transformed ALO obtained in (17). Let ỹa be the same as yu except ỹa,i = ỹ /i u,i. Then ỹa satisfies\n[proxg̃(ỹa)]i = 0, (27)\nwhere g̃(u) = R̃∗(X>u u) and R̃ denotes the quadratic surrogate of the regularizer. In particular, ỹ/ii = Kiiỹ /i u,i is the exact leave-i-out predicted value for the surrogate problem in Theorem 5.1.\nWe refer the reader to Appendix B for the proofs. These two theorems imply that for twice differentiable losses and regularizers, the frameworks we laid out in Sections 3 and 4 lead to exactly the same ALO formulas."
  }, {
    "heading": "6. Applications",
    "text": ""
  }, {
    "heading": "6.1. Generalized LASSO",
    "text": "The generalized LASSO (Tibshirani & Taylor, 2011) is a generalization of the LASSO problem which captures many applications such as the fused LASSO (Tibshirani et al., 2005), `1 trend filtering (Kim et al., 2009) and wavelet smoothing in a unified framework. The generalized LASSO problem solves the following penalized regression problem:\nmin β\n1\n2 n∑ j=1 (yj − x>j β)2 + λ‖Dβ‖1. (28)\nwhere the regularizer is parameterized by a fixed matrix D ∈ Rm×p which captures the desired structure in the data. We note that the regularizer is a semi-norm. Hence we can formulate the dual problem as a projection. In fact, a dual formulation of (28) can be obtained as (see Appendix D):\nmin θ,u\n1 2 ‖θ − y‖22 s.t. ‖u‖∞ ≤ λ andX>θ = D>u.\nThe dual optimal solution satisfies θ̂ = Π∆X (y), where ∆X is the polytope given by:\n∆X = {θ ∈ Rn : ∃u, ‖u‖∞ ≤ λ andX>θ = D>u}.\nThe projection onto the polytope C = {D>u : ‖u‖∞ ≤ λ} is given in (Tibshirani & Taylor, 2011) as locally being the projection onto the affine space orthogonal to the nullspace of D·,−E , where E = {i : |ûi| = λ} and −E = {1, . . . , p} \\ E. Since ∆X = [X>]−1C is the inverse image of C under the linear map given byX>, the projection onto ∆X is given locally by the projection onto the affine space normal to the space spanned by the columns of [X>]+nullD·,−E , provided X has full column rank. Here, [X>]+ denotes the Moore-Penrose pseudoinverse of X>. To obtain a spanning set of this space, we consider A = XB, where B is a set of vectors spanning the nullspace ofD·,−E . This allows us to computeH = AA+, the projection onto the normal space required to compute the ALO."
  }, {
    "heading": "6.2. Nuclear Norm",
    "text": "Consider the following matrix sensing problem\nB̂ := arg min B\n1\n2 n∑ j=1 (yj − 〈Xj ,B〉)2 + λ‖B‖∗ (29)\nwith B,Xj ∈ Rp1×p2 . 〈X,B〉 = trace(X>B) denotes the inner product. We use ‖ · ‖∗ for nuclear norm, which is defined as the sum of the singular values of a matrix. The nuclear norm is a unitarily invariant function of the matrix (Lewis, 1995). Such functions are only indirectly related to the components of the matrix, making their analysis difficult even when they are smooth, and exacerbating the difficulties when they are non-smooth such as in the case of the nuclear norm. In particular, the smoothing framework described in Section 4.3 cannot be applied directly.\nWe are nonetheless able to leverage the specific structure of such functions and apply the smoothing trick to the singular values to obtain the following theorem. For more details on the derivation, please refer to Appendix E.3. Theorem 6.1. Consider the nuclear-norm penalized matrix regression problem (29), and let B̂ = Ûdiag[σ̂]V̂ > be the SVD of the full data estimator B̂, with Û ∈ Rp1×p1 , V̂ ∈ Rp2×p2 . Let m = rank(B̂) be the number of nonzero σ̂j’s for B̂. Let B̃ /i h denote the approximate of B̂\n/i obtained from the smoothed problem. Then, as h→ 0\n〈Xi, B̃/ih 〉 → 〈Xi, B̂〉+ Hii\n1−Hii (〈Xi, B̂〉 − yi),\nH = X ·,E [X>·,EX ·,E + λG]−1X > ·,E ,\nwith X ∈ Rn×p1p2 and G ∈ Rm(p1+p2−m)×m(p1+p2−m) a symmetric matrix given by:\nX j,kl =Û>·,kXjV̂·,l,\nGkl,st =  0 s = t = k = l ≤ m 1 σ̂s+σ̂t 1 ≤ s 6= t ≤ m, (k, l) = (s, t) 1 σ̂s 1 ≤ s ≤ m < t ≤ p2, (k, l) = (s, t) 1 σ̂t 1 ≤ t ≤ m < s ≤ p1, (k, l) = (s, t) − 1σ̂s+σ̂t 1 ≤ s 6= t ≤ m, (k, l) = (t, s) − gr[σ̂t]σ̂s 1 ≤ s ≤ m < t ≤ p2, (k, l) = (t, s) − gr[σ̂s]σ̂t 1 ≤ t ≤ m < s ≤ p2, (k, l) = (t, s) 0 otherwise.\n(30)\nwhere for t > m, σ̂t = 0 and gr[σ̂t] is the corresponding subgradient at this singular value, which can be obtained through the SVD of 1λ ∑n j=1(yj − 〈Xj , B̂〉)Xj . The set E is then defined as:\nE = {(k, l) : k ≤ m or l ≤ m}.\nNote that the indices of G and the index set E are consistent."
  }, {
    "heading": "6.3. Linear SVM",
    "text": "The linear SVM optimization can be written as\narg min β n∑ j=1 (1− yjx>j β)+ + λ 2 ‖β‖22,\nwith yj ∈ {−1, 1} and (·)+ = max{·, 0}. Note that this is a special case of the problem we studied in Section 4.2. Here, `(u; yj) = (1− yju)+ has only one zero order singularity at yj . Using Theorem 4.1 and simplifying the expressions, we obtain the following ALO formula for SVM:\nx>i β̃ /i = x>i β̂ + aig`,i,\nwhere\nai =\n{ 1 λx > i (Ip −X>V,·(XV,·X>V,·)−1XV,·)xi i ∈ S,(\nλ[(XV,·X > V,·) −1]ii\n)−1 i ∈ V,\nand for i ∈ S, g`,i = −yi if yix>i β̂ < 1, g`,i = 0 if yix > i β̂ > 1, and for i ∈ V\ng`,V = (XV,·X > V,·) −1XV,·[λβ̂ + ∑ j:yjx>j β̂<1 yjxj ].\nRecall that V = {j : x>j β̂ = yj} and S = [1, . . . , n]\\V ."
  }, {
    "heading": "7. Numerical Experiments",
    "text": "We illustrate the performance of ALO through three experiments. The first two compare the ALO risk estimate with that of LOOCV. The third experiment compares the computational complexity of ALO with that of LOOCV. We have also evaluated the performance of ALO on real-world datasets. Due to lack of space, these results are presented in Appendix F.2. For the first experiment (Figure 2a), we run ALO and LOOCV for the three models studied in Section 6 (using fused LASSO (Tibshirani et al., 2005) as a special case of generalized LASSO) and compare their risk estimates under the settings n > p and n < p respectively. The full details of the experiments are provided in Appendix F.\nFor the second experiment (Figure 2b), we consider the risk estimates for LASSO from ALO and LOOCV under settings with model mis-specification, heavy-tail noise and correlated design. For all three cases, ALO approximates LOOCV well.\nIn general, we observe that the estimates given by ALO are close to LOOCV, although the performance may deteriorate\nfor very small values of λ, as is clear in the fused-LASSO (n < p) example. These values of λ correspond to “dense” solutions, and are far from the optimal choice. Hence, such inaccuracies do not harm the parameter tuning algorithm.\nOur last experiment compares the computational complexity of ALO with that of LOOCV. In Table 1, we provide the timing of LASSO for different values of n and p. The time required by ALO, which involves a single fit and a matrix inversion (in the construction ofH matrix), is in all experiments no more than twice that of a single fit. We refer the reader to Appendix F for the details of this experiment."
  }, {
    "heading": "8. Discussion",
    "text": "ALO offers a highly efficient approach for parameter tuning and risk estimation for a large class of statistical machine learning models. We focus on nonsmooth models and propose two general frameworks for calculating ALO. One is from the primal perspective, the other from the dual.\nBy approximating LOOCV, ALO inherits desirable properties of LOOCV in high-dimensional settings where n and p are comparable. In particular, ALO can overcome the bias issues that k-fold cross validation displays in these settings."
  }, {
    "heading": "Acknowledgements",
    "text": "We acknowledge computing resources from Columbia University’s Shared Research Computing Facility project, which is supported by NIH Research Facility Improvement Grant 1G20RR030893-01, and associated funds from the New York State Empire State Development, Division of Science Technology and Innovation (NYSTAR) Contract C090171, both awarded April 15, 2010."
  }],
  "year": 2018,
  "references": [{
    "title": "The relationship between variable selection and data agumentation and a method for prediction",
    "authors": ["D.M. Allen"],
    "year": 1974
  }, {
    "title": "Living on the edge: Phase transitions in convex programs with random data",
    "authors": ["D. Amelunxen", "M. Lotz", "M.B. McCoy", "J.A. Tropp"],
    "venue": "Information and Inference: A Journal of the IMA,",
    "year": 2014
  }, {
    "title": "Estimating lasso risk and noise level",
    "authors": ["M. Bayati", "M.A. Erdogdu", "A. Montanari"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Templates for convex cone problems with applications to sparse signal recovery",
    "authors": ["S.R. Becker", "E.J. Candès", "M.C. Grant"],
    "venue": "Math. Program. Comput.,",
    "year": 2011
  }, {
    "title": "On optimal generalizability in parametric learning",
    "authors": ["A. Beirami", "M. Razaviyayn", "S. Shahrampour", "V. Tarokh"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Convex optimization",
    "authors": ["S. Boyd", "L. Vandenberghe"],
    "year": 2004
  }, {
    "title": "Unbiased risk estimates for singular value thresholding and spectral estimators",
    "authors": ["E.J. Candes", "C.A. Sing-Long", "J.D. Trzasko"],
    "venue": "IEEE transactions on signal processing,",
    "year": 2013
  }, {
    "title": "Efficient approximate leaveone-out cross-validation for kernel logistic regression",
    "authors": ["G.C. Cawley", "N.L. Talbot"],
    "venue": "Machine Learning,",
    "year": 2008
  }, {
    "title": "Libsvm: a library for support vector machines",
    "authors": ["Chang", "C.-C", "Lin", "C.-J"],
    "venue": "ACM transactions on intelligent systems and technology (TIST),",
    "year": 2011
  }, {
    "title": "Proximal Splitting Methods in Signal Processing, pp. 185–212",
    "authors": ["P.L. Combettes", "Pesquet", "J.-C"],
    "year": 2011
  }, {
    "title": "Neighborliness of randomly projected simplices in high dimensions",
    "authors": ["D.L. Donoho", "J. Tanner"],
    "venue": "Proceedings of the National Academy of Sciences of the United States of America,",
    "year": 2005
  }, {
    "title": "Messagepassing algorithms for compressed sensing",
    "authors": ["D.L. Donoho", "A. Maleki", "A. Montanari"],
    "venue": "Proceedings of the National Academy of Sciences,",
    "year": 2009
  }, {
    "title": "The degrees of freedom of the lasso for general design matrix",
    "authors": ["C. Dossal", "M. Kachour", "M. Fadili", "G. Peyré", "C. Chesneau"],
    "venue": "Statistica Sinica,",
    "year": 2013
  }, {
    "title": "The estimation of prediction error: covariance penalties and cross-validation",
    "authors": ["B. Efron"],
    "venue": "Journal of the American Statistical Association,",
    "year": 2004
  }, {
    "title": "CVX: Matlab software for disciplined convex programming, version 2.1",
    "authors": ["M. Grant", "S. Boyd"],
    "year": 2014
  }, {
    "title": "Result analysis of the nips 2003 feature selection challenge",
    "authors": ["I. Guyon", "S. Gunn", "A. Ben-Hur", "G. Dror"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2005
  }, {
    "title": "Updating the inverse of a matrix",
    "authors": ["W.W. Hager"],
    "venue": "SIAM review,",
    "year": 1989
  }, {
    "title": "Elements of Statistical Learning, chapter Model Assessment and Selection",
    "authors": ["T. Hastie", "R. Tishirani", "J. Friedman"],
    "venue": "Springer-Verlag New York,",
    "year": 2009
  }, {
    "title": "Robust regression: asymptotics, conjectures and monte carlo",
    "authors": ["P.J. Huber"],
    "venue": "The Annals of Statistics,",
    "year": 1973
  }, {
    "title": "Primal-dual firstorder methods withO(1/ ) iteration-complexity for cone programming",
    "authors": ["G. Lan", "Z. Lu", "R.D.C. Monteiro"],
    "venue": "Mathematical Programming,",
    "year": 2011
  }, {
    "title": "Ridge estimators in logistic regression",
    "authors": ["S. Le Cessie", "J.C. Van Houwelingen"],
    "venue": "Applied statistics,",
    "year": 1992
  }, {
    "title": "The convex analysis of unitarily invariant matrix functions",
    "authors": ["A.S. Lewis"],
    "venue": "Journal of Convex Analysis,",
    "year": 1995
  }, {
    "title": "Efficient approximate k-fold and leave-one-out cross-validation for ridge regression",
    "authors": ["R.J. Meijer", "J.J. Goeman"],
    "venue": "Biometrical Journal,",
    "year": 2013
  }, {
    "title": "Symmetric gauge functions and unitarily invariant norms",
    "authors": ["L. Mirsky"],
    "venue": "Quarterly Journal of Mathematics,",
    "year": 1960
  }, {
    "title": "Consistent parameter estimation for lasso and approximate message passing",
    "authors": ["A. Mousavi", "A. Maleki", "Baraniuk", "R. G"],
    "venue": "The Annals of Statistics,",
    "year": 2017
  }, {
    "title": "Cross validation in lasso and its acceleration",
    "authors": ["T. Obuchi", "Y. Kabashima"],
    "venue": "Journal of Statistical Mechanics: Theory and Experiment,",
    "year": 2016
  }, {
    "title": "Gaussian processes and svm: Mean field results and leave-one-out",
    "authors": ["M. Opper", "O. Winther"],
    "year": 2000
  }, {
    "title": "Automatic smoothing of regression functions in generalized linear models",
    "authors": ["F. O’sullivan", "B.S. Yandell", "W.J. Raynor Jr."],
    "venue": "Journal of the American Statistical Association,",
    "year": 1986
  }, {
    "title": "URL http://www",
    "authors": ["J. Qian", "T. Hastie", "J. Friedman", "R. Tibshirani", "Simon", "N. Glmnet for matlab"],
    "venue": "stanford. edu/ ̃ hastie/glmnet matlab, 2013.",
    "year": 2013
  }, {
    "title": "A scalable estimate of the extrasample prediction error via approximate leave-one-out",
    "authors": ["K. Rad", "A. Maleki"],
    "venue": "arXiv preprint arXiv:1801.10243,",
    "year": 2018
  }, {
    "title": "Convex analysis",
    "authors": ["R.T. Rockafellar"],
    "year": 1970
  }, {
    "title": "Cross-validatory choice and assessment of statistical predictions",
    "authors": ["M. Stone"],
    "venue": "Journal of the royal statistical society. Series B (Methodological), pp",
    "year": 1974
  }, {
    "title": "Regression shrinkage and selection via the lasso",
    "authors": ["R. Tibshirani"],
    "venue": "Journal of the Royal Statistical Society. Series B (Methodological), pp",
    "year": 1996
  }, {
    "title": "Sparsity and smoothness via the fused lasso",
    "authors": ["R. Tibshirani", "M. Saunders", "S. Rosset", "J. Zhu", "K. Knight"],
    "venue": "J. R. Stat. Soc. Ser. B Stat. Methodol.,",
    "year": 2005
  }, {
    "title": "The solution path of the generalized lasso",
    "authors": ["R.J. Tibshirani", "J. Taylor"],
    "venue": "Ann. Statist.,",
    "year": 2011
  }, {
    "title": "Degrees of freedom in lasso problems",
    "authors": ["R.J. Tibshirani", "J Taylor"],
    "venue": "The Annals of Statistics,",
    "year": 2012
  }, {
    "title": "The degrees of freedom of partly smooth regularizers",
    "authors": ["S. Vaiter", "C. Deledalle", "J. Fadili", "G. Peyré", "C. Dossal"],
    "venue": "Annals of the Institute of Statistical Mathematics,",
    "year": 2017
  }, {
    "title": "Das asymptotische verteilungsgestez der eigenwert linearer partieller differentialgleichungen (mit einer anwendung auf der theorie der hohlraumstrahlung)",
    "authors": ["L. Weyl"],
    "venue": "Mathematische Annalen,",
    "year": 1912
  }, {
    "title": "Inverting modified matrices",
    "authors": ["M.A. Woodbury"],
    "venue": "Memorandum report,",
    "year": 1950
  }, {
    "title": "On the degrees of freedom of the lasso",
    "authors": ["H. Zou", "T. Hastie", "R Tibshirani"],
    "venue": "The Annals of Statistics,",
    "year": 2007
  }],
  "id": "SP:efd6f6109e4fbef727ea9ccb54aa374ef6e3510a",
  "authors": [{
    "name": "Shuaiwen Wang",
    "affiliations": []
  }, {
    "name": "Wenda Zhou",
    "affiliations": []
  }, {
    "name": "Haihao Lu",
    "affiliations": []
  }, {
    "name": "Arian Maleki",
    "affiliations": []
  }, {
    "name": "Vahab Mirrokni",
    "affiliations": []
  }],
  "abstractText": "Consider the following class of leaning schemes: β̂ := arg min β ∑n j=1`(x > j β; yj) + λR(β), (1) where xi ∈ R and yi ∈ R denote the i feature and response variable respectively. Let ` and R be the loss function and regularizer, β denote the unknown weights, and λ be a regularization parameter. Finding the optimal choice of λ is a challenging problem in high-dimensional regimes where both n and p are large. We propose two frameworks to obtain a computationally efficient approximation ALO of the leave-one-out cross validation (LOOCV) risk for nonsmooth losses and regularizers. Our two frameworks are based on the primal and dual formulations of (1). We prove the equivalence of the two approaches under smoothness conditions. This equivalence enables us to justify the accuracy of both methods under such conditions. We use our approaches to obtain a risk estimate for several standard problems, including generalized LASSO, nuclear norm regularization, and support vector machines. We empirically demonstrate the effectiveness of our results for non-differentiable cases.",
  "title": "Approximate Leave-One-Out for Fast Parameter Tuning in High Dimensions"
}