{
  "sections": [{
    "heading": "1. Introduction",
    "text": "In typical machine learning problems like image classification it is assumed that an image clearly represents a category (a class). However, in many real-life applications multiple instances are observed and only a general statement of the category is given. This scenario is called multiple instance learning (MIL) (Dietterich et al., 1997; Maron & Lozano-Pérez, 1998) or, learning from weakly annotated data (Oquab et al., 2014). The problem of weakly annotated data is especially apparent in medical imaging (Quellec et al., 2017) (e.g., computational pathology, mammography or CT lung screening) where an image is typically described by a single label (benign/malignant) or a Region Of Interest (ROI) is roughly given.\nMIL deals with a bag of instances for which a single class label is assigned. Hence, the main goal of MIL is to learn a\n*Equal contribution 1University of Amsterdam, the Netherlands. Correspondence to: Maximilian Ilse <m.ilse@uva.nl>, Jakub M. Tomczak <j.m.tomczak@uva.nl>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nmodel that predicts a bag label, e.g., a medical diagnosis. An additional challenge is to discover key instances (Liu et al., 2012), i.e., the instances that trigger the bag label. In the medical domain the latter task is of great interest because of legal issues1 and its usefulness in clinical practice. In order to solve the primary task of a bag classification different methods are proposed, such as utilizing similarities among bags (Cheplygina et al., 2015b), embedding instances to a compact low-dimensional representation that is further fed to a bag-level classifier (Andrews et al., 2003; Chen et al., 2006), and combining responses of an instance-level classifier (Ramon & De Raedt, 2000; Raykar et al., 2008; Zhang et al., 2006). Only the last approach is capable of providing interpretable results. However, it was shown that the instance level accuracy of such methods is low (Kandemir & Hamprecht, 2015) and in general there is a disagreement among MIL methods at the instance level (Cheplygina et al., 2015a). These issues call into question the usability of current MIL models for interpreting the final decision.\nIn this paper, we propose a new method that aims at incorporating interpretability to the MIL approach and increasing its flexibility. We formulate the MIL model using the Bernoulli distribution for the bag label and train it by optimizing the log-likelihood function. We show that the application of the Fundamental Theorem of Symmetric Functions provides a general procedure for modeling the bag label probability (the bag score function) that consists of three steps: (i) a transformation of instances to a low-dimensional embedding, (ii) a permutation-invariant (symmetric) aggregation function, and (iii) a final transformation to the bag probability. We propose to parameterize all transformations using neural networks (i.e., a combination of convolutional and fully-connected layers), which increases the flexibility of the approach and allows to train the model in an endto-end manner by optimizing an unconstrained objective function. Last but not least, we propose to replace widelyused permutation-invariant operators such as the maximum operator max and the mean operator mean by a trainable weighted average where weights are given by a two-layered neural network. The two-layered neural network corre-\n1According to the European Union General Data Protection Regulation (taking effect 2018), a user should have the right to obtain an explanation of the decision reached.\nsponds to the attention mechanism (Bahdanau et al., 2014; Raffel & Ellis, 2015). Notably, the attention weights allow us to find key instances, which could be further used to highlight possible ROIs. In the experiments we show that our model is on a par with the best classical MIL methods on common benchmark MIL datasets, and that it outperforms other methods on a MNIST-based MIL problem as well as two real-life histopathology image datasets. Moreover, in the image datasets we provide empirical evidence that our model can indicate key instances."
  }, {
    "heading": "2. Methodology",
    "text": ""
  }, {
    "heading": "2.1. Multiple instance learning (MIL)",
    "text": "Problem formulation In the classical (binary) supervised learning problem one aims at finding a model that predicts a value of a target variable, y ∈ {0, 1}, for a given instance, x ∈ RD. In the case of the MIL problem, however, instead of a single instance there is a bag of instances, X = {x1, . . . ,xK}, that exhibit neither dependency nor ordering among each other. We assume that K could vary for different bags. There is also a single binary label Y associated with the bag. Furthermore, we assume that individual labels exist for the instances within a bag, i.e., y1, . . . , yK and yk ∈ {0, 1}, for k = 1, . . . ,K, however, there is no access to those labels and they remain unknown during training. We can re-write the assumptions of the MIL problem in the following form:\nY =\n{ 0, iff ∑ k yk = 0,\n1, otherwise. (1)\nThese assumptions imply that a MIL model must be permutation-invariant. Further, the two statements could be re-formulated in a compact form using the maximum operator:\nY = max k {yk}. (2)\nLearning a model that tries to optimize an objective based on the maximum over instance labels would be problematic at least for two reasons. First, all gradient-based learning methods would encounter issues with vanishing gradients. Second, this formulation is suitable only when an instancelevel classifier is used.\nIn order to make the learning problem easier, we propose to train a MIL model by optimizing the log-likelihood function where the bag label is distributed according to the Bernoulli distribution with the parameter θ(X) ∈ [0, 1], i.e., the probability of Y = 1 given the bag of instances X .\nMIL approaches In the MIL setting the bag probability θ(X) must be permutation-invariant since we assume neither ordering nor dependency of instances within a bag. Therefore, the MIL problem can be considered in terms of\na specific form of the Fundamental Theorem of Symmetric Functions with monomials given by the following theorem (Zaheer et al., 2017):\nTheorem 1. A scoring function for a set of instances X , S(X) ∈ R, is a symmetric function (i.e., permutationinvariant to the elements in X), if and only if it can be decomposed in the following form:\nS(X) = g ( ∑ x∈X f(x) ) , (3)\nwhere f and g are suitable transformations.\nThis theorem provides a general strategy for modeling the bag probability using the decomposition given in (3). A similar decomposition with max instead of sum is given by the following theorem (Qi et al., 2017):\nTheorem 2. For any ε > 0, a Hausdorff continuous symmetric function S(X) ∈ R can be arbitrarily approximated by a function in the form g ( maxx∈X f(x) ) , where max is the element-wise vector maximum operator and f and g are continuous functions, that is:\n|S(X)− g ( max x∈X f(x) ) | < ε. (4)\nThe difference between Theorems 1 and 2 is that the former is a universal decomposition while the latter provides an arbitrary approximation. Nonetheless, they both formulate a general three-step approach for classifying a bag of instances: (i) a transformation of instances using the function f , (ii) a combination of transformed instances using a symmetric (permutation-invariant) function σ, (iii) a transformation of combined instances transformed by f using a function g. Finally, the expressiveness of the score function relies on the choice of classes of functions for f and g.\nIn the MIL problem formulation the score function in both theorems is the probability θ(X) and the permutationinvariant function σ is referred to as the MIL pooling. The choice of functions f , g and σ determines a specific approach to modeling the label probability. For a given MIL operator there are two main MIL approaches:\n(i) The instance-level approach: The transformation f is an instance-level classifier that returns scores for each instance. Then individual scores are aggregated by MIL pooling to obtain θ(X). The function g is the identity function.\n(ii) The embedding-level approach: The function f maps instances to a low-dimensional embedding. MIL pooling is used to obtain a bag representation that is independent of the number of instances in the bag. The bag representation is further processed by a bag-level classifier to provide θ(X).\nIt is advocated in (Wang et al., 2016) that the latter approach is preferable in terms of the bag level classification performance. Since the individual labels are unknown, there is a threat that the instance-level classifier might be trained insufficiently and it introduces additional error to the final prediction. The embedding-level approach determines a joint representation of a bag and therefore it does not introduce additional bias to the bag-level classifier. On the other hand, the instance-level approach provides a score that can be used to find key instances i.e., the instances that trigger the bag label. Liu et al. (2012) were able to show that a model that is successfully detecting key instances is more likely to achieve better bag label predictions. We will show how to modify the embedding-level approach to be interpretable by using a new MIL pooling."
  }, {
    "heading": "2.2. MIL with Neural Networks",
    "text": "In classical MIL problems it is assumed that instances are represented by features that do not require further processing, i.e., f is the identity. However, for some tasks like image or text analysis additional steps of feature extraction are necessary. Additionally, Theorem 1 and 2 indicate that for a flexible enough class of functions we can model any permutation-invariant score function. Therefore, we consider a class of transformations that are parameterized by neural networks fψ(·) with parameters ψ that transform the k-th instance into a low-dimensional embedding, hk = fψ(xk), where hk ∈ H such that H = [0, 1] for the instance-based approach andH = RM for the embeddingbased approach.\nEventually, the parameter θ(X) is determined by a transformation gφ : HK → [0, 1]. In the instance-based approach the transformation gφ is simply the identity, while in the embedding-based approach it could be also parameterized by a neural network with parameters φ. The former approach is depicted in Figure 6(a) and the latter in Figure 6(b) in the Appendix.\nThe idea of parameterizing all transformations using neural networks is very appealing because the whole approach can be arbitrarily flexible and it can be trained end-to-end by backpropagation. The only restriction is that the MIL pooling must be differentiable."
  }, {
    "heading": "2.3. MIL pooling",
    "text": "The formulation of the MIL problem requires the MIL pooling σ to be permutation-invariant. As shown in Theorem 1 and 2, there are two MIL pooling operators that ensure the score function (i.e., the bag probability) to be a symmetric function, namely, the maximum operator:\n∀m=1,...,M : zm = max k=1,...,K {hkm}, (5)\nand the mean operator:2\nz = 1\nK K∑ k=1 hk. (6)\nIn fact, other operators could be used such as, the convex maximum operator (i.e., log-sum-exp) (Ramon & De Raedt, 2000), Integrated Segmentation and Recognition (Keeler et al., 1991), noisy-or (Maron & Lozano-Pérez, 1998) and noisy-and (Kraus et al., 2016). These MIL pooling operators could replace max in Theorem 2 and proofs would follow in a similar manner (see Supplementary in (Qi et al., 2017) for a detailed proof for the maximum operator). All of these operators are differentiable, hence, they could be easily used as a MIL pooling layer in a deep neural network architecture."
  }, {
    "heading": "2.4. Attention-based MIL pooling",
    "text": "All MIL pooling operators mentioned in the previous section have a clear disadvantage, namely, they are pre-defined and non-trainable. For instance, the max-operator could be a good choice in the instance-based approach but it might be inappropriate for the embedding-based approach. Similarly, the mean operator is definitely a bad MIL pooling to aggregate instance scores, although, it could succeed in calculating the bag representation. Therefore, a flexible and adaptive MIL pooling could potentially achieve better results by adjusting to a task and data. Ideally, such MIL pooling should also be interpretable, a trait that is missing in all operators mentioned in Section 2.3.\nAttention mechanism We propose to use a weighted average of instances (low-dimensional embeddings) where weights are determined by a neural network. Additionally, the weights must sum to 1 to be invariant to the size of a bag. The weighted average fulfills the requirements of the Theorem 1 where the weights together with the embeddings are part of the f function. Let H = {h1, . . . ,hK} be a bag of K embeddings, then we propose the following MIL pooling:\nz = K∑ k=1 akhk, (7)\nwhere:\nak = exp{w> tanh\n( Vh>k ) }\nK∑ j=1 exp{w> tanh ( Vh>j ) } , (8)\nwhere w ∈ RL×1 and V ∈ RL×M are parameters. Moreover, we utilize the hyperbolic tangent tanh(·) element-wise non-linearity to include both negative and positive values for proper gradient flow. The proposed construction allows to discover (dis)similarities among instances.\n2Notice that the weight 1 K can be seen as a part of the f function.\nInterestingly, the proposed MIL pooling corresponds to a version of the attention mechanism (Lin et al., 2017; Raffel & Ellis, 2015). The main difference is that typically in the attention mechanism all instances are sequentially dependent while here we assume that all instances are independent. Therefore, a naturally arising question is whether the attention mechanism could work without sequential dependencies among instances, and if it will not learn the mean operator. We will address this issue in the experiments.\nGated attention mechanism Furthermore, we notice that the tanh(·) non-linearity could be inefficient to learn complex relations. Our concern follows from the fact that tanh(x) is approximately linear for x ∈ [−1, 1], which could limit the final expressiveness of learned relations among instances. Therefore, we propose to additionally use the gating mechanism (Dauphin et al., 2016) together with tanh(·) non-linearity that yields:\nak = exp{w>\n( tanh ( Vh>k ) sigm ( Uh>k )) }\nK∑ j=1 exp{w> ( tanh ( Vh>j ) sigm ( Uh>j )) } , (9)\nwhere U ∈ RL×M are parameters, is an element-wise multiplication and sigm(·) is the sigmoid non-linearity. The gating mechanism introduces a learnable non-linearity that potentially removes the troublesome linearity in tanh(·).\nFlexibility In principle, the proposed attention-based MIL pooling allows to assign different weights to instances within a bag and hence the final representation of the bag could be highly informative for the bag-level classifier. In other words, it should be able to find key instances. Moreover, application of the attention-based MIL pooling together with the transformations f and g parameterized by neural networks makes the whole model fully differentiable and adaptive. These two facts make the proposed MIL pooling a potentially very flexible operator that could model an arbitrary permutation-invariant score function. The proposed attention mechanism together with a deep MIL model is depicted in Figure 6(c) in the Appendix.\nInterpretability Ideally, in the case of a positive label (Y = 1), high attention weights should be assigned to instances that are likely to have label yk = 1 (key instances). Namely, the attention mechanism allows to easily interpret the provided decision in terms of instance-level labels. In fact, the attention network does not provide scores as the instance-based classifier does but it can be considered as a proxy to that. The attention-based MIL pooling bridges the instance-level approach and the embedding-level approach.\nFrom the practical point of view, e.g., in the computational pathology, it is desirable to provide ROIs together with the final diagnosis to a doctor. Therefore, the attention mechanism is potentially of great interest in practical applications."
  }, {
    "heading": "3. Related work",
    "text": "MIL pooling Typically, MIL approaches utilize either the mean pooling or the max pooling, while the latter is mostly used (Feng & Zhou, 2017; Pinheiro & Collobert, 2015; Zhu et al., 2017). Both operators are non-trainable which potentially limits their applicability. There are MIL pooling operators that contain global adaptive parameters, such as noisy-and (Kraus et al., 2016), however, their flexibility is restricted. We propose a fully trainable MIL pooling that adapts to new instances.\nMIL with neural networks In the classical work on MIL it is assumed that instances are represented by precomputed features and there is very little need to apply additional feature extraction. Nevertheless, recent work on utilizing fully-connected neural networks in MIL shows that it could still be beneficial (Wang et al., 2016). Similarly, in computer vision the idea of MIL combined with deep learning significantly improves final accuracy (Oquab et al., 2014). In this paper, we follow this line of research since it allows to apply a flexible class of transformations that can be trained end-to-end by backpropagation.\nMIL and attention The attention mechanism is widely used in deep learning for image captioning (Xu et al., 2015) or text analysis (Bahdanau et al., 2014; Lin et al., 2017). In the context of the MIL problem it has rarely been used and only in a very limited form. In (Pappas & Popescu-Belis, 2014) an attention-based MIL was proposed but attention weights were trained as parameters of an auxiliary linear regression model. This idea was further expanded and the linear regression model was replaced by a one-layer neural network with single output (Pappas & Popescu-Belis, 2017). The attention-based MIL operator was used very recently in (Qi et al., 2017), however, the attention was calculated using the dot product and it performed worse than the max operator. Here, we propose to use a two-layered neural network to learn the MIL operator and we show that it outperforms commonly used MIL pooling operators.\nMIL for medical imaging The MIL seems to perfectly fit medical imaging where processing a whole image consisting of billions of pixels is computationally infeasible. Moreover, in the medical domain it is very difficult to obtain pixel-level annotations, that drastically reduces number of available data. Therefore, it is tempting to divide a medical image into smaller patches that could be further considered as a bag with a single label (Quellec et al., 2017). This idea attracts a great interest in the computational histopathology where patches could correspond to cells that are believed to indicate malignant changes (Sirinukunwattana et al., 2016). Different MIL approaches were used for histopathology data, such as, Gaussian processes (Kandemir et al., 2014; 2016) or a two-stage approach with neural networks and EM algorithm to determine instance classes (Hou et al., 2016).\nOther applications of MIL methods in medical imaging are mammography (nodule) classification (Zhu et al., 2017) and microscopy cell detection (Kraus et al., 2016). In this paper, we show that the proposed attention-based deep MIL approach can be used not only to provide the final diagnosis but also to indicate ROIs in a histopathology slide."
  }, {
    "heading": "4. Experiments",
    "text": "In the experiments we aim at evaluating the proposed approach: a MIL model parameterized with neural networks and a (gated) attention-based pooling layer (’Attention’ and ’Gated-Attention’). We evaluate our approach on a number of different MIL datasets: five MIL benchmark datasets (MUSK1, MUSK2, FOX, TIGER, ELEPHANT), an MNIST-based image dataset (MNIST-BAGS) and two reallife histopathology datasets (BREAST CANCER, COLON CANCER). We want to verify two research questions in the experiments: (i) whether our approach achieves the best performance or is comparable to the best performing method, (ii) if our method can provide interpretable results by using the attention weights that indicate key instances or ROIs.\nIn order to obtain a fair comparison we use a common evaluation methodology, i.e., 10-fold-cross-validation, and five repetitions per experiment. In the case of MNIST-BAGS we use a fixed division into training and test set. In order to create test bags we solely sampled images from the MNIST test set. During training we only used images from the MNIST training set. For all experiments we use modified versions of models that have shown high classification performance on the individual datasets (Wang et al., 2016; LeCun et al., 1998; Sirinukunwattana et al., 2016). The MIL pooling layers are either located before the last layer of the model (the embedded-based approach) or after last layer of the model (the instance-based approach). If an attention-based MIL pooling layer is used the number of parameters in V was determined using a validation set. We tested the following dimensions (L): 64, 128 and 256. The different dimensions only resulted in minor changes of the model’s performance. For layers using the gated attention mechanism V and U have the same number of parameters. Finally, all layers were initialized according to Glorot & Bengio (2010) and biases were set to zero.\nWe compare our approach to various MIL methods on MIL benchmark datasets. On the image datasets our method is compared with instance-level and embedding-level neural networks and commonly used MIL pooling layers (max and mean). In the following, we are using ’Instance+max/mean’ and ’Embedding+max/mean’ to indicate networks that are build from convolutional layers and fully-connected layers. In contrast to networks purely build from fully-connected layers, referred to as ’mi-Net’ and ’MI-Net’ (Wang et al., 2016).\nOn MNIST-BAGS we include a SVM-based MIL model, called (MI-SVM). We do not present results of MI-SVM on the histopathology datasets since we could not train (including hyperparameter search and five times 10-fold-crossvalidation procedure) the model in a reasonable amount of time.3 In order to compare the bag level performance we use the following metrics: the classification accuracy, precision, recall, F-score, and the area under the receiver operating characteristic curve (AUC)."
  }, {
    "heading": "4.1. Classical MIL datasets",
    "text": "Details In the first experiment we aim at verifying whether our approach can compete with the best MIL methods on historically important benchmark datasets. Since all five datasets contain precomputed features and only a small number of instances and bags, neural networks are most likely not well suited. First we predict drug activity (MUSK1 and MUSK2). A molecule has the desired drug effect if and only if one or more of its conformations bind to the target binding site. Since molecules can adopt multiple shapes, a bag is made up of shapes belonging to the same molecule (Dietterich et al., 1997). The three remaining datasets, ELEPHANT, FOX and TIGER, contain features extracted from images. Each bag consists of a set of segments of an image. For each category, positive bags are images that contain the animal of interest, and negative bags are images that contain other animals (Andrews et al., 2003). For detailed information on the number of bags, instances and features in each dataset see Section 6.3 in the Appendix.\nIn our experiments we use the same architecture, optimizer and hyperparameters as in the MI-Net model (Wang et al., 2016).\nResults and discussion The results of the experiment are 3Learning a single MI-SVM took approximately one week due to the large number of patches.\npresented in Table 1. Our approaches (Attention and GatedAttention) are comparable with the best performing classical MIL methods (notice the standard error of the mean)."
  }, {
    "heading": "4.2. MNIST-bags",
    "text": "Details The main disadvantage of the classical MIL benchmark datasets is that instances are represented by precomputed features. In order to consider a more challenging scenario, we propose to investigate a dataset that is created using the well-known MNIST image dataset. A bag is made up of a random number of 28× 28 grayscale images taken from the MNIST dataset. The number of images in a bag is Gaussian-distributed and the closest integer value is taken. A bag is given a positive label if it contains one or more images with the label ’9’. We chose ’9’ since it can be easily mistaken with ’7’ or ’4’. We investigate the influence of the number of bags in the training set as well as the average number of instances per bag on the prediction performance. During evaluation we use a fixed number of 1000 test bags. For all experiments a LeNet5 model is used (LeCun et al., 1998), see Table 8 and 9 in the Appendix. The models are trained with the Adam optimization algorithm (Kingma & Ba, 2014). We keep the default parameters for β1 and β2, see Table 10 in the Appendix. In addition, we compare our method with a SVM-based MIL method (MI-SVM) (Andrews et al., 2003) that uses a Gaussian kernel on raw pixel features4.\nIn the experiments we use different numbers of the mean bag size, namely, 10, 50 and 100, and the variance 2, 10, 20, respectively. Moreover, we use varying numbers of training bags, i.e., 50, 100, 150, 200, 300, 400, 500. These different settings allow us to verify how different number of training bags and different number of instances influence MIL models. We compare instance-based and embedding-based approaches parameterized with a neural network (LeNet5) with mean and max MIL pooling. We use AUC as the evaluation metric.\nResults and discussion The results of AUC for the mean bag sizes equal to 10, 50 and 100 are presented in Figure 1, 2 and 3, respectively, and detailed results are given in the Appendix. The findings of the experiment are the following: First, the proposed attention-based deep MIL approach performs much better than other methods in the small sample size regime. Moreover, when there is a small effective size of the training set that corresponds to 50-150 bags for around 10 instances per bag (see Figure 1) or 50-100 bags in the case of on average 50 instances in a bag (see Figure 2), our method still achieves significantly higher AUC than all other methods. Second, we notice that our approach is more flexible and obtained better results than the SVM-\n4We use code provided with (Doran & Ray, 2014): https: //github.com/garydoranjr/misvm\nbased approach in all cases except large effective sample sizes (see Figure 3). Third, the embedding-based models performed better than the instance-based models. However, for a sufficient number of training images (number of training bags and training instances per bag) all models achieve very similar results. Fourth, the mean operator performs significantly worse than the max operator. However, the embedding-based model with the mean operator converged eventually to the best value but always later than the one with max. See Section 6.4 in the Appendix for details.\nThe results of this experiment indicate that for a smallsample size regime our approach is preferable to others. Since attention serves as a gradient update filter during backpropagation (Wang et al., 2017), instances with higher weights will contribute more to learning the encoder network of instances. This is especially important since medical imaging problems contain only a small number of cases. In general, the more instances are in a bag the easier the MIL task becomes, since the MIL assumption states that every instance in a negative bag is negative. For example, a negative bag of size 100 from the MNIST-bags dataset will include about 11 negative examples per class.\nFinally, we present an exemplary result of the attention mechanism in Figure 4. In this example a bag consists of 13 images. For each digit the corresponding attention weight is given by the trained network. The bag is properly predicted as positive and all nines are correctly highlighted. Hence, the attention mechanism works as expected. More examples are given in the Appendix."
  }, {
    "heading": "4.3. Histopathology datasets",
    "text": "Details An automatic detection of cancerous regions in hematoxylin and eosin (H&E) stained whole-slide images is a task with high clinical relevance. Current supervised approaches utilize pixel-level annotations (Litjens et al., 2017). However, data preparation requires large amount of time from pathologists which highly interferes with their daily routines. Hence, a successful solution working with weak labels would hold a great promise to reduce the workload of the pathologists. In the following, we perform two experiments on classifying weakly-labeled real-life histopathol-\nogy images of the breast cancer dataset (BREAST CANCER) (Gelasca et al., 2008) and the colon cancer dataset (COLON CANCER) (Sirinukunwattana et al., 2016).\nBREAST CANCER consists of 58 weakly labeled 896× 768 H&E images. An image is labeled malignant if it contains breast cancer cells, otherwise it is benign. We divide every image into 32 × 32 patches. This results in 672 patches per bag. A patch is discarded if it contains 75% or more of white pixels.\nCOLON CANCER comprises 100 H&E images. The images originate from a variety of tissue appearance from both normal and malignant regions. For every image the majority of nuclei of each cell were marked. In total there are 22,444 nuclei with associated class label, i.e. epithelial, inflammatory, fibroblast, and miscellaneous. A bag is composed of 27×27 patches. Furthermore, a bag is given a positive label if it contains one or more nuclei from the epithelial class. Tagging epithelial cells is highly relevant from a clinical point of view, since colon cancer originates from epithelial cells (Ricci-Vitiani et al., 2007).\nFor both datasets we use the model proposed in (Sirinukunwattana et al., 2016) for the transformation f . All models are trained with the Adam optimization algorithm (Kingma & Ba, 2014). Due to the limited amount of data samples in both datasets we performed data augmentation to prevent overfitting. See the Appendix for further details.\nResults and discussion We present results in Table 2 and 3 for BREAST CANCER and COLON CANCER, respectively. First, we notice that the obtained results confirm our findings in MNIST-BAGS experiment that our approach outperforms all other methods. A trend that is especially visible in the small-sample size regime of the MNIST-BAGS. Surprisingly, the embedding-based method with the max pooling failed almost completely on BREAST CANCER but in general this dataset is difficult due to high variability of slides and small number of cases. The proposed method is not only most accurate but it also received the highest recall. High recall is especially important in the medical domain since false negatives could lead to severe consequences including patient fatality. We also notice that the gated-attention mechanism performs better than the plain attention mechanism on BREAST CANCER while these two behave similarly on COLON CANCER.\nEventually, we present the usefulness of the attention mechanism in providing ROIs. In Figure 5 we show a histopathology image divided into patches containing (mostly) single cells. We create a heatmap by multiplying patches by its corresponding attention weight. Although only image-level annotations are used during training, there is a substantial matching between the heatmap in Figure 5(d) and the ground truth in Figure 5(c). Additionally, we notice that\nthe instance-based classifier tends to select only a small subset of positive patches (see Figure 10(e) in Appendix) that confirms low instance accuracy of the instance-based approach discussed in (Kandemir & Hamprecht, 2015). For\nmore examples please see the Appendix.\nThe obtained results again confirm that the proposed approach attains high predictive performance and allows to properly highlight ROIs. Moreover, the attention weights can be used to create a reliable heatmap."
  }, {
    "heading": "5. Conclusion",
    "text": "In this paper, we proposed a flexible and interpretable MIL approach that is fully parameterized by neural networks. We outlined the usefulness of deep learning for modeling a permutation-invariant bag score function in terms of the Fundamental Theorem of Symmetric Functions. Moreover, we presented a trainable MIL pooling based on the (gated) attention mechanism. We showed empirically on five MIL datasets, one image corpora and two real-life histopathology datasets that our method is on a par with the best performing methods or performs the best in terms of different evaluation metrics. Additionally, we showed that our approach provides an interpretation of the decision by presenting ROIs, which is extremely important in many practical applications.\nWe strongly believe that the presented line of research is worth pursuing further. Here we focused on a binary MIL problem, however, the multi-class MIL is more interesting and challenging (Feng & Zhou, 2017). Moreover, in some applications it is worth to consider repulsion points (Scott et al., 2005), i.e., instances for which a bag is always negative, or assume dependencies among instances within a bag (Zhou et al., 2009). We leave investigating these issues for future research."
  }, {
    "heading": "Acknowledgements",
    "text": "The authors are very grateful to Rianne van den Berg for insightful remarks and discussions.\nMaximilian Ilse was funded by the Nederlandse Organisatie voor Wetenschappelijk Onderzoek (Grant DLMedIa: Deep Learning for Medical Image Analysis).\nJakub Tomczak was funded by the European Commission within the Marie Skodowska-Curie Individual Fellowship (Grant No. 702666, ”Deep learning and Bayesian inference for medical imaging”)."
  }],
  "references": [{
    "title": "Support vector machines for multiple-instance learning",
    "authors": ["Andrews", "Stuart", "Tsochantaridis", "Ioannis", "Hofmann", "Thomas"],
    "venue": "In NIPS, pp",
    "year": 2003
  }, {
    "title": "Neural machine translation by jointly learning to align and translate",
    "authors": ["Bahdanau", "Dzmitry", "Cho", "Kyunghyun", "Bengio", "Yoshua"],
    "venue": "arXiv preprint arXiv:1409.0473,",
    "year": 2014
  }, {
    "title": "MILES: Multiple-instance learning via embedded instance selection",
    "authors": ["Chen", "Yixin", "Bi", "Jinbo", "Wang", "James Ze"],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
    "year": 1931
  }, {
    "title": "Label stability in multiple instance learning",
    "authors": ["Cheplygina", "Veronika", "Sørensen", "Lauge", "Tax", "David MJ", "de Bruijne", "Marleen", "Loog", "Marco"],
    "venue": "In MICCAI,",
    "year": 2015
  }, {
    "title": "Multiple instance learning with bag dissimilarities",
    "authors": ["Cheplygina", "Veronika", "Tax", "David MJ", "Loog", "Marco"],
    "venue": "Pattern Recognition,",
    "year": 2015
  }, {
    "title": "Language modeling with gated convolutional networks",
    "authors": ["Dauphin", "Yann N", "Fan", "Angela", "Auli", "Michael", "Grangier", "David"],
    "venue": "arXiv preprint arXiv:1612.08083,",
    "year": 2016
  }, {
    "title": "Solving the multiple instance problem with axis-parallel rectangles",
    "authors": ["Dietterich", "Thomas G", "Lathrop", "Richard H", "LozanoPérez", "Tomás"],
    "venue": "Artificial intelligence,",
    "year": 1997
  }, {
    "title": "A theoretical and empirical analysis of support vector machine methods for multipleinstance classification",
    "authors": ["Doran", "Gary", "Ray", "Soumya"],
    "venue": "Machine Learning,",
    "year": 2014
  }, {
    "title": "Deep MIML Network",
    "authors": ["Feng", "Ji", "Zhou", "Zhi-Hua"],
    "venue": "In AAAI,",
    "year": 2017
  }, {
    "title": "Evaluation and benchmark for biological image segmentation",
    "authors": ["Gelasca", "Elisa Drelie", "Byun", "Jiyun", "Obara", "Boguslaw", "Manjunath", "BS"],
    "venue": "In IEEE International Conference on Image Processing,",
    "year": 2008
  }, {
    "title": "Understanding the difficulty of training deep feedforward neural networks",
    "authors": ["Glorot", "Xavier", "Bengio", "Yoshua"],
    "venue": "In AISTATS, pp",
    "year": 2010
  }, {
    "title": "Patch-based convolutional neural network for whole slide tissue image classification",
    "authors": ["Hou", "Le", "Samaras", "Dimitris", "Kurc", "Tahsin M", "Gao", "Yi", "Davis", "James E", "Saltz", "Joel H"],
    "venue": "In CVPR,",
    "year": 2016
  }, {
    "title": "Computer-aided diagnosis from weak supervision: a benchmarking study",
    "authors": ["Kandemir", "Melih", "Hamprecht", "Fred A"],
    "venue": "Computerized Medical Imaging and Graphics,",
    "year": 2015
  }, {
    "title": "Empowering multiple instance histopathology cancer diagnosis by cell graphs",
    "authors": ["Kandemir", "Melih", "Zhang", "Chong", "Hamprecht", "Fred A"],
    "venue": "In MICCAI,",
    "year": 2014
  }, {
    "title": "Variational Weakly Supervised Gaussian Processes",
    "authors": ["Kandemir", "Melih", "Haußmann", "Manuel", "Diego", "Ferran", "Rajamani", "Kumar T", "van der Laak", "Jeroen", "Hamprecht", "Fred A"],
    "year": 2016
  }, {
    "title": "Integrated segmentation and recognition of hand-printed numerals",
    "authors": ["Keeler", "James D", "Rumelhart", "David E", "Leow", "Wee Kheng"],
    "venue": "In NIPS,",
    "year": 1991
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["Kingma", "Diederik P", "Ba", "Jimmy"],
    "venue": "arXiv preprint arXiv:1412.6980,",
    "year": 2014
  }, {
    "title": "Classifying and segmenting microscopy images with deep multiple instance learning",
    "authors": ["Kraus", "Oren Z", "Ba", "Jimmy Lei", "Frey", "Brendan J"],
    "venue": "Bioinformatics, 32(12):i52–",
    "year": 2016
  }, {
    "title": "Gradient-based learning applied to document recognition",
    "authors": ["LeCun", "Yann", "Bottou", "Léon", "Bengio", "Yoshua", "Haffner", "Patrick"],
    "venue": "Proceedings of the IEEE,",
    "year": 1998
  }, {
    "title": "A structured self-attentive sentence embedding",
    "authors": ["Lin", "Zhouhan", "Feng", "Minwei", "Santos", "Cicero Nogueira dos", "Yu", "Mo", "Xiang", "Bing", "Zhou", "Bowen", "Bengio", "Yoshua"],
    "year": 2017
  }, {
    "title": "Key instance detection in multi-instance learning",
    "authors": ["Liu", "Guoqing", "Wu", "Jianxin", "Zhou", "Zhi-Hua"],
    "venue": "In JMLR,",
    "year": 2012
  }, {
    "title": "A framework for multiple-instance learning",
    "authors": ["Maron", "Oded", "Lozano-Pérez", "Tomás"],
    "venue": "In NIPS, pp",
    "year": 1998
  }, {
    "title": "Weakly supervised object recognition with convolutional neural networks",
    "authors": ["Oquab", "Maxime", "Bottou", "Léon", "Laptev", "Ivan", "Sivic", "Josef"],
    "venue": "In NIPS,",
    "year": 2014
  }, {
    "title": "Explaining the stars: Weighted multiple-instance learning for aspectbased sentiment analysis",
    "authors": ["Pappas", "Nikolaos", "Popescu-Belis", "Andrei"],
    "venue": "In EMNLP, pp",
    "year": 2014
  }, {
    "title": "Explicit Document Modeling through Weighted Multiple-Instance Learning",
    "authors": ["Pappas", "Nikolaos", "Popescu-Belis", "Andrei"],
    "venue": "Journal of Artificial Intelligence Research,",
    "year": 2017
  }, {
    "title": "From image-level to pixel-level labeling with convolutional networks",
    "authors": ["Pinheiro", "Pedro O", "Collobert", "Ronan"],
    "venue": "In CVPR, pp",
    "year": 2015
  }, {
    "title": "PointNet: Deep learning on point sets for 3d classification and segmentation",
    "authors": ["Qi", "Charles R", "Su", "Hao", "Mo", "Kaichun", "Guibas", "Leonidas J"],
    "year": 2017
  }, {
    "title": "Multiple-instance learning for medical image and video analysis",
    "authors": ["Quellec", "Gwenole", "Cazuguel", "Guy", "Cochener", "Beatrice", "Lamard", "Mathieu"],
    "venue": "IEEE Reviews in Biomedical Engineering,",
    "year": 2017
  }, {
    "title": "Feed-forward networks with attention can solve some long-term memory problems",
    "authors": ["Raffel", "Colin", "Ellis", "Daniel PW"],
    "year": 2015
  }, {
    "title": "Multi instance neural networks",
    "authors": ["Ramon", "Jan", "De Raedt", "Luc"],
    "venue": "In ICML Workshop on Attribute-value and Relational Learning,",
    "year": 2000
  }, {
    "title": "Bayesian multiple instance learning: automatic feature selection and inductive transfer",
    "authors": ["Raykar", "Vikas C", "Krishnapuram", "Balaji", "Bi", "Jinbo", "Dundar", "Murat", "Rao", "R Bharat"],
    "venue": "In ICML, pp",
    "year": 2008
  }, {
    "title": "Identification and expansion of human colon-cancer-initiating cells",
    "authors": ["Ricci-Vitiani", "Lucia", "Lombardi", "Dario G", "Pilozzi", "Emanuela", "Biffoni", "Mauro", "Todaro", "Matilde", "Peschle", "Cesare", "De Maria", "Ruggero"],
    "year": 2007
  }, {
    "title": "Quantification of histochemical staining by color deconvolution",
    "authors": ["Ruifrok", "Arnout C", "Johnston", "Dennis A"],
    "venue": "Analytical and Quantitative Cytology and Histology,",
    "year": 2001
  }, {
    "title": "On generalized multiple-instance learning",
    "authors": ["Scott", "Stephen", "Zhang", "Jun", "Brown", "Joshua"],
    "venue": "International Journal of Computational Intelligence and Applications,",
    "year": 2005
  }, {
    "title": "Residual Attention Network for Image Classification",
    "authors": ["Wang", "Fei", "Jiang", "Mengqing", "Qian", "Chen", "Yang", "Shuo", "Li", "Cheng", "Zhang", "Honggang", "Xiaogang", "Tang", "Xiaoou"],
    "year": 2017
  }, {
    "title": "Revisiting multiple instance neural networks",
    "authors": ["Wang", "Xinggang", "Yan", "Yongluan", "Tang", "Peng", "Bai", "Xiang", "Liu", "Wenyu"],
    "venue": "Pattern Recognition,",
    "year": 2016
  }, {
    "title": "Scalable algorithms for multi-instance learning",
    "authors": ["Wei", "Xiu-Shen", "Wu", "Jianxin", "Zhou", "Zhi-Hua"],
    "venue": "IEEE Transactions on Neural Networks and Learning Systems,",
    "year": 2017
  }, {
    "title": "Show, attend and tell: Neural image caption generation with visual attention",
    "authors": ["Xu", "Kelvin", "Ba", "Jimmy", "Kiros", "Ryan", "Cho", "Kyunghyun", "Courville", "Aaron", "Salakhudinov", "Ruslan", "Zemel", "Rich", "Bengio", "Yoshua"],
    "venue": "In ICML, pp. 2048–2057,",
    "year": 2015
  }, {
    "title": "Multiple instance boosting for object detection",
    "authors": ["Zhang", "Cha", "Platt", "John C", "Viola", "Paul A"],
    "venue": "In NIPS,",
    "year": 2006
  }, {
    "title": "Em-dd: An improved multiple-instance learning technique",
    "authors": ["Zhang", "Qi", "Goldman", "Sally A"],
    "venue": "In NIPS,",
    "year": 2002
  }, {
    "title": "Multiinstance learning by treating instances as non-iid samples",
    "authors": ["Zhou", "Zhi-Hua", "Sun", "Yu-Yin", "Li", "Yu-Feng"],
    "venue": "In ICML, pp",
    "year": 2009
  }, {
    "title": "Deep multi-instance networks with sparse label assignment for whole mammogram classification",
    "authors": ["Zhu", "Wentao", "Lou", "Qi", "Vang", "Yeeleng Scott", "Xie", "Xiaohui"],
    "venue": "In MICCAI,",
    "year": 2017
  }],
  "id": "SP:3257db734a16da255c29711713f564adea1d2009",
  "authors": [{
    "name": "Maximilian Ilse",
    "affiliations": []
  }, {
    "name": "Jakub M. Tomczak",
    "affiliations": []
  }, {
    "name": "Max Welling",
    "affiliations": []
  }],
  "abstractText": "Multiple instance learning (MIL) is a variation of supervised learning where a single class label is assigned to a bag of instances. In this paper, we state the MIL problem as learning the Bernoulli distribution of the bag label where the bag label probability is fully parameterized by neural networks. Furthermore, we propose a neural network-based permutation-invariant aggregation operator that corresponds to the attention mechanism. Notably, an application of the proposed attention-based operator provides insight into the contribution of each instance to the bag label. We show empirically that our approach achieves comparable performance to the best MIL methods on benchmark MIL datasets and it outperforms other methods on a MNIST-based MIL dataset and two real-life histopathology datasets without sacrificing interpretability.",
  "title": "Attention-based Deep Multiple Instance Learning"
}