{
  "sections": [{
    "heading": "1. Introduction",
    "text": "A classical estimation problem in many scientific inquiries is the well-studied change point detection problem where one tries to estimate when some properties of a sequence of random variables changes. This local property is of prime importance in many learning tasks such as signal segmentation (Abou-Elailah et al., 2016; Kim et al., 2009), change point detection in comparative genomics for early cancer diagnosis (Lai et al., 2005), and modeling and forecasting of changes in financial data (Lavielle & TeyssiÃĺre, 2006; Spokoiny, 2009).\nFor other applications, one needs more than this local answer and is interested in a more general overview of the time series where for instance earlier data samples behave like new ones creating a clustering effect. Examples of this are found in: electricity market data, where prices\n1KTH Royal Institute of Technology, Stockholm, Sweden. Correspondence to: Othmane Mazhar <othmane@kth.se>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nmight have different behavior corresponding to different price regimes that might reappear depending on some triggering events; signal partitioning with some parts of the signal sharing similar properties; and speech segmentation with different alternating sources. Generally speaking, it is of interest in these situations to determine not only the changes but also the clusters for a more precise description of the inhomogeneous time series.\nParametric models for solving the change point detection problem have been proposed in Cleynen & Lebarbier (2014) and Rigaill et al. (2012). However, in dealing with the change point and clustering problem we would naturally require that our solution does not assume any knowledge of the number of changes nor the actual number of clusters, as these numbers would evolve over time, so we expect new changes in the process to happen and new clusters to form as N , the number of samples, grows. Thus, any practical procedure should be able to estimate these numbers and also have adaptive guarantees with respect to how fast these numbers grow. Similar setups for change point detection have been the subject of study by Harchaoui & Cappé (2007), Arlot et al. (2016) and Garreau & Arlot (2017) who use characteristic kernels for detecting changes in the distribution, while from a computational standpoint a more effective implementation has been proposed by Celisse et al. (2017). In this study, we will restrict ourselves to an iid (independent and identically distributed) Gaussian sequence model of the data with known variance, noting that the same study can be done using kernels and that the algorithm we develop can be effectively implemented using the same procedure as in (Celisse et al., 2017), as explained later in the paper.\nTwo other related lines of research, but which we do not explore here, are on-line algorithms for segmentation and L1-regularized segmentation. We refer the reader to (Tartakovsky et al., 2014) for an extensive review of on-line algorithms. Data segmentation using the L1-penalty was introduced by Rudin et al. (1992). The one-dimensional case, corresponding to the Fussed LASSO, has been studied in (Tibshirani et al., 2005) and (Rennie & Dobson, 1969) and an efficient algorithm has been proposed by Arnold & Tibshirani (2016). More recent results can be found in (Dalalyan et al., 2017) for the one-dimensional case and (Hütter & Rigollet, 2016) for two-dimensional case.\nMain contribution: The generalized setting of change point detection while clustering the segments for sequences\nof data points does not seem to have been previously studied. In this work, we propose a two-pass dynamic programming algorithm for selecting an adequate model from a collection of candidate models. We motivate the choice of the algorithm computationally by showing that it runs in O(N2D + D4) time (where D is an upper bound on the number of change points), statistically by showing that it can be seen as an approximation of a computationally hard MAP optimization problem for which we can derive an oracle inequality that guarantees low sample complexity, consistency and adaptivity, and practically by testing the model on simulation data.\nStructure of the paper: In Section 2 we formulate the problem as one of nonparametric model selection from a family of models over all partitions of the data set. After some preliminaries and notations are given in Section 3, we propose in Section 4 a two-pass dynamic programming algorithm as a computationally effective relaxation of the optimization criterion and analyze its computational cost. We then put the model selection problem in a Bayesian framework in Section 5, and use a Laplace-type approximation to derive as optimization criterion the maximum a-posteriori probability. In Section 6 we derive an oracle inequality for the criterion that our algorithm is approximating, and study its properties. Experimental results showing that the clusters and segments can be effectively estimated are presented in Section 7 using simulation data."
  }, {
    "heading": "2. Problem formulation",
    "text": "Let Y be a measurable space and Y1, Y2, . . . , YN ∈ Y denote random variables with distributions PYi . Our goal is on one hand to detect changes in the sequence of distribution measures (PYi) N i=1 and on the other hand to cluster the data points coming from the same process. Hence we put random variables between two consecutive changes in the same segment, and we think of random variables of the same segment or different segments as belonging to the same cluster if they are the realization of the same process.\nOne important case both in theory and in practice is the uniform constant design model were the Yis depend on deterministic variables uniformly spaced on a grid Xi = i for i ∈ J1, NK := {1, . . . , N} through a regression function f∗ with an additive iid random noise ( i)Ni=1. Taking the distribution of the i’s as N (0, σ2) with known variance, we end up with the following Gaussian sequence model:\nYi = f ∗ i + i, for i ∈ J1, NK. (1)\nHere we are placed in a regression setting of the form Y = f∗+ , where Y = [Y1 · · · YN ]T , f∗ = [f∗1 · · · f∗N ]T and = [ 1 · · · N ]T ∼ N (0, σ2IN ), and we are interested in estimating f∗ as a piecewise constant function that takes limited number of values.\nWe emphasize that it is unlikely that the data correspond exactly to a piecewise constant function plus independent\nrandom Gaussian noise and that we are in this low dimensional hidden structure exactly, yet there might exist a good sparse linear approximation. Hence our search is not for an exact model, rather we are trying to select the best model in a collection of candidates, as we explain in the next section."
  }, {
    "heading": "3. Preliminaries and notation",
    "text": "We would like to perform dimensionality reduction by exploiting the hidden structure on the data sequence Y1, Y2, . . . , YN . To do this we split it into different segments while also putting the segments sharing the same mean into the same cluster. Hence if we knew the clusters our problem reduces to fitting a constant to a set of observations over each cluster. Observe that if f∗ is constant over parts of J1, NK, then it determines a clustering of Y1, Y2, . . . , YN over the values where it is constant. Hence, we can think about the problem as, first determining the clustering of the Y1, Y2, . . . , YN which would result in a partition π of J1, NK, and then choosing the best value of f̂ over each part as our estimate. So f∗ belong to the subspace Fπ: subspace of functions that are constant over the parts of the partition π.\nTo formalize this, let M be an index set over the collection of partitions ΠN of J1, NK; given m ∈ M, denote by Fm the subspace of functions that are constant over the parts of πm. Our goal is two-fold: find m̂ as the index estimate of Fm̂, the subspace where the estimate of f∗ lives, and from Fm̂ compute f̂m̂ as our estimate. We represent a partition π as an unordered collection of its subsets π = {[1], [2], . . . , [|π|]} with [k] being the kth-equivalent class, -part or -cluster, and |π| the cardinality of the partition. Every part [k] can be seen as the union of segments [k] = {[k1], [k2], . . . , [k|[k]|]} where (ki) |[k]| i=1 is the collection of maximal intervals in [k] that we call segments of the kth-cluster. The last element in each segment [ki] is called a change point. We define d′m := |πm|−1 = dim(Fm)−1 as the clustering dimension. Even though this choice might create some confusion it will be consistent the notations used in the proofs of sections 5 and 6. Also we define d′′m = |πm|0 := |∪ d′m+1 k=1 [k]| as the change point dimension.\nTo link partitions to subspaces let el := (0, . . . , 1, . . . , 0) be the lth-component of the standard orthonormal basis of RN , and define for a subset A of J1, NK the vector 1A :=∑ l∈A el. For [k], the k\nth cluster of πm, with a slight abuse of notation we define 1[k] := ∑|[k]| i=1 eki , and observe that Fm = span{1[k] : k ∈ πm}, which is consistent with the definition of the clustering dimension d′m := |πm| − 1 = dim(Fm)− 1.\nWe define 〈f∗〉 := span{f∗}, S1 ⊕ S2 as the direct sum of the two vector space S1 and S2, and S1 S2 as their direct difference. PS denotes the (orthogonal) projection operator onto the subspace S. We also define the partitions inclusion as m1 ⊂ m2 if Fm1 ⊂ Fm2 , or equivalently if\nπm2 is finer than πm1 . Example 1. Consider the signal f∗ of Figure 1, whose partition is\nπ = {[1]; [2]; [3]; [4]; [5]},\nwhere\n[1] = J615, 678K ∪ J821, 926K ∪ J1019, 1211K ∪ J1753, 2000K [2] = J1, 100K ∪ J679, 820K ∪ J1212, 1280K [3] = J101, 214K ∪ J505, 614K ∪ J926, 1018K ∪ J1281, 1600K [4] = J215, 504K [5] = J1601, 1752K.\nHence, d′π = 4 and d ′′ π = 12 for this signal.\nWe also denote by CNk the binomial coefficient that gives the number of ways, disregarding order, that k objects can be chosen from among N objects. This is given by\nCNk := N !\nk!(N − k)! . (2)\nThe Stirling numbers of the second kind, S(N, k), correspond to the number of ways to partition a set of N objects into k non-empty subsets, or, similarly, to the number of different equivalence relations with precisely k equivalence classes that can be defined on an set of N elements.\nWe are precisely interested in the case where the element set is J1, NK and the distance between every two elements in each equivalence class is at least 2; we denote the number of such equivalent classes by S2(N, k). S(N, k) and S2(N, k) satisfy the following recurrence relations:\nS(N, k) = S(N − 1, k − 1) + kS(N − 1, k), N > k, S2(N, k) = S(N − 1, k − 1), N, k > 2. (3)\nFor the proofs of these results, we refer the reader to (Graham et al., 1988) and (Mohr & Porter, 2009)."
  }, {
    "heading": "4. Two-pass dynamic programming for change point detection and clustering",
    "text": "To solve the change point and clustering problem, a natural approach is to consider the minimization of a criterion of the form,\nCrit(m) = ‖y − f̂m‖22 + σ2K pen(m). (4)\nUniqueness, continuity and stability properties of similar criterion have been studied in (O. et al.), we restrict to a penalty term pen(d′m, d ′′ m) := pen(m) depending only on d′ and d′′ and a multiplicative tuning parameter K. Indeed, as we shall see the penalty can be chosen such that the minimizer f̂m̂ of (4) behaves like an approximation to a maximum a-posteriori estimator (MAP), and also, the average expected risk 1NE[‖f̂m̂− f\n∗‖22]→ 0 for a large class of signals f∗, namely, those corresponding to models with d′ 6 d′′ = o(N/ lnN), i.e., f∗ is a consistent estimator for those signals. The specific form of pen(m) will be derived in the next section, based on an oracle inequality that will guarantee consistency and adaptivity of our estimator.\nAlthough the estimator f̂m̂ enjoys good statistical properties, from a computational stand it would involve the exploration ofM. The setM is identified with the collection of all the partitions of J1, NK, whose number asymptotically behaves like O(NeN/ lnN), rendering the minimization of the criterion (4) computationally challenging. A way to bypass this issue for the change point only detection problem is via dynamic programming (Harchaoui & Cappé, 2007); this approach works in this simplified setup since there is a natural ordering for exploring the subproblems, which does not hold here. To overcome this, we will relax the criterion in such a way to create a subproblem ordering and thus derive a computationally feasible approximation. The proposed new method is outlined in Algorithm 1.\nLet ȳ[k] := ( ∑ i∈[k] Yi)/|[k]|, the average of the elements of Y in the [k]-th part. Notice that, given πm := {[1]; [2]; . . . ; [d′m − 1]}, we have\nPFm Y = d′m−1∑ k=1 〈Y,1[k]〉 ‖1[k]‖2 1[k] = d′m−1∑ k=1 ȳ[k]1[k].\nThe minimization of criterion (4) can then be equivalently written as\nmin m∈M Crit(m)\n= min m∈M\n{‖y − PFm Y ‖22 + σ2K pen(d′m, d′′m)}\n= min 06d′\n6d′′6D  min|m|=d′ |m|0=d′′ ‖y − PFm Y ‖22 + σ2K pen(d′, d′′)  ,\nAlgorithm 1 Two-Pass Dynamic Programming Algorithm input data points (yi)Ni=1, maximum number of changes D and\npenalty strength K. 1:\nȳ[k,l] :=\n∑l i=k Yi k − l + 1\nR[k,l] := l∑ i=k (yi − ȳ[k,l])2, 1 6 k 6 l 6 N.\n2: for d = 1 to D do 3: use the dynamic programming recurrence in (9) and a\nbacktracking step to compute\nCd(N) := min |m̄|=d\n‖Y − PFm̄ Y ‖ 2, (5)\nm̃d ∈ arg min |m̄|=d ‖Y − PFm̄ Y ‖ 2.\n4: end for 5: for d = 1 to D do 6: m̃d =: {0 6 i1 < i2 < · · · < id < N}\n(αk) d k=0 := (ik+1 − ik)d0, (i0 = 0, id+1 = N).\n7: sort (ȳ[1,i1], ȳ[i1+1,i2], . . . , ȳ[id+1,N ]). 8: ( ȳ(k) )d k=0 := ordered sequence of (ȳ[ik+1,ik+1]) d k=0\n(α(k)) d k=0 := corresponding permuted (αk) d k=0 according to permutation φd.\n9: ȳ(k,l) := ∑l i=k α(i)ȳ(i)∑l−1 i=k α(i) and R̄[k,l] := ∑l i=k α(i)(ȳ(i) −\nȳ(k,l)) 2, 1 6 k 6 l 6 d.\n10: for δ = 1 to d do 11: use the dynamic programming recurrence in (10) and a\nbacktracking step to compute\nG(d,δ) := min m∈Mȳm̃,δ\n‖PFm̄ Y − PFm PFm̄ Y ‖ 2, (6)\n˜̃m(d,δ) ∈ arg min m∈Mȳm̃δ ‖PFm̄ Y − PFm PFm̄ Y ‖ 2.\n12: end for 13: end for 14: B(d,δ) := Cd+G(d,δ) +σ2K pen((d, δ)), 1 6 δ 6 d 6 D. 15: (d̂, δ̂) := arg min\n16δ6d6D B(d,δ).\n16: reconstruct m(d̂,δ̂) from m̃d̂ and ˜̃m(d̂,δ̂). output value of criterion Crit(m(d̂,δ̂)) = B(d̂,δ̂) and selected\nmodel for change points and clusters m(d̂,δ̂).\nwhere D is a reasonable upper bound on the number of change points. As we shall see later, from a statistical point of view there is no need to explore all possible values of d′ and d′′, since the statistical guarantees only hold in a regime where d′ 6 d′′ = o(N/ lnN).\nWe define πm̄ to be the partition having as elements all the segments of πm and instead of computing the minimum exactly we will take a greedy step by defining\nm̃ := arg min |m̄|=d′′\n‖Y − PFm̄ Y ‖2\nand defining Mm̃,d′ := {m ∈ M : m ⊂ m̃, |m| = d′}, which can be identified with the collection of all partitions of J1, d′′K into d′ sets. We restrict further this collection to partitions π satisfying what we call the clustering property, which states that if I1, I2 and I are segments in some (possibly different) parts of π, then\n{I1, I2 ∈ [k] ȳI1 6 ȳI 6 ȳI2 ⇒ I ∈ [k]. (7)\nThis sub-collection will be denoted asMȳm̃,d′ . Simply put, this property says that the partitions considered are those that respect the ordering of (ȳ[ik+1,ik+1]) d′′\nk=0, since if two segments I1, I2 belong to [k], and the segment I satisfies ȳI1 6 ȳI 6 ȳI2 , then it should also be in cluster [k].\nThis leads to the following upper bound, whose detailed derivation is given in appendix B:\nmin m∈M Crit(m) 6 min 06d′′6D { min |m|=d′′ ‖Y − PFm Y ‖2\n+ min 06d′6d′′\nm∈Mȳm̃,d′′\n‖PFm̃ Y − PFm PFm̃ Y ‖2\n+ σ2K pen(d′, d′′) } .\nTherefore, we can define the following relaxation for the minimization of the criterion in (4):\nCritr(d ′′) := min |m|=d′′ ‖Y − PFm Y ‖2\n+ min 06d′6d′′\nm∈Mȳm̃,d′′\n{ ‖PFm̃ Y − PFm PFm̃ Y ‖2\n+ σ2K pen(d′m, d ′′ m)\n} . (8)\nand our algorithm computes min 06d′′6D\nCritr(d ′′) and returns\nm(d̂,δ̂). From this last definition we observe that\nmin m∈M Crit(m) 6 Crit(m(d̂,δ̂)) = min06d′′6D Critr(d\n′′).\nThus, obtainingm(d̂,δ̂) ensures making progress toward the minimization of Crit(m). The Two-Pass Dynamic Programming Algorithm 1 is aimed at doing this by computing the value of the minimum in (8) and returning a solution m̂ = m(d̂,δ̂) in the following way:\nDetails of Main Steps in Algorithm 1\n• Step 3: It computes Cd(n) defined in (9) for all d and n to obtain Cd(N) for all d ∈ J1, NK. It does so by using a dynamic programming algorithm that computes recursively for all 2 6 d 6 D and d 6 n 6 N the following recurrence, similar to the one in Hawkins (1976):\nC1(n) := R[1,n] (9)\nCd(n) := min i∈Jd,nK\n{Cd−1(i− 1) +R[i,n]}, d > 2.\n• Step 7: For all values of d, it sorts the obtained segments according to their levels to yield ( ȳ(k) )d 0 , and it keeps track\nof the segments’ sizes as (αk)dk=0 = (ik+1 − ik)d0 .\n• Step 11: It runs a modified dynamic programming recurrence on ( ȳ(k) )d 0\nthat uses weights according to the sizes (α(k)) d 0 . It does so using the following recurrence for all 1 6 δ 6 t 6 d:\nG(t,1) := R̄[1,t], (10)\nG(t,δ) := min i∈Jδ,tK\n{G(i−1,δ−1) + R̄[i,t]}, δ > 2.\n• Step 15: It computes the minimum in (8) and finds for which model it is attained by solving the minimization problem:\n(d̂, δ̂) := arg min 16δ6d6D B(d,δ).\n• Step 16: It finally reconstructs m(d̂,δ̂) from m̃d̂ and ˜̃m(d̂,δ̂) using the permutation φ(d̂).\nThis algorithm can be thought of as an efficient way to compute the relaxation in (8), based on solving the change point detection problem in (5) using the dynamic programming recurrence of (9), followed by a solving a clustering problem in (6) using the dynamic programming recurrence of (10).\nThe next theorem shows that Algorithm 1 correctly solves the minimization problem in (8) and explicits its time and space complexity. Theorem 4.1. Let (yi)Ni=1 ⊂ R, D ∈ N and K > 0. Then,\n• for all 1 6 d 6 D,\nm̃d ∈ arg min |m̄|=d ‖Y − PFm̄ Y ‖2,\n• for all 1 6 δ 6 d 6 D,\n˜̃m(d,δ) ∈ arg min m∈Mȳm̃δ ‖PFm̄ Y − PFm PFm̄ Y ‖2.\nFurthermore, Algorithm 1 correctly solves the minimization problem in (8), with time and space complexity O(N3 +D4) and O(N2 +D3), respectively.\nProof. See Appendix B.\nThe time and space complexity can be improved to O(N2D +D4) and O(DN +D3), respectively. We refer the reader to the discussion after the proof in Appendix B for the derivation of this result. In this way we obtain a computationally feasible algorithm that finds the minimum in (8) and returns an approximation to the criterion in (4). In the next section, we will motivate the use of Algorithm 1 from a statistical point of view by showing that the minimization of criterion (4) can be viewed as an approximate maximum a-posteriori estimator."
  }, {
    "heading": "5. Model selection criterion for change point detection and clustering",
    "text": "In this part, we provide a derivation of the optimization criterion in (4). We start by proposing a Bayesian model selection scheme, which is later inverted to arrive at an integral form of the maximum a-posteriori probability (MAP) estimator. Then we use a Laplace approximation to derive turn the MAP into an optimization problem of the desired form.\nHere we show that the proposed selection criterion in (4) follows naturally from a Bayesian reasoning. For this, we model the data as being the outcome of the following sampling model. The observation Y is generated from a multivariate Gaussian of mean F and variance σ2IN as described by (1). For the random variable F , given that it belongs to a subspace Fm, we choose an absolutely continuous measure Ld′m with respect to λd′m , the Lebesgue measure on Rd′m+1, such that dLd′m = lf/mdλd ′ m+1 =\nd′m+1∏ k=1 (lfk/mdλ) with lf1/m = · · · = lfd′m+1/m. Later we will see that the choice lf/m will not matter in comparison to the order of approximation, nevertheless we would like it to be a bounded continuous prior satisfying some additional conditions given in Lemma 2, even though we might be chosen as an improper prior. On the family of models M we impose a categorical distribution measure PM as prior, with a weight pm for model m. Thus, we obtain the following sampling model for the data1:\nY/F ∼ N (F, σ2IN ) F/m ∼ Ld ′ m (11)\nm ∼ PM = Categorical((pm)m∈M).\nSince Y , F and m are now random variables, it makes sense to compute µm/Y , the posterior distribution of m\n1Here and in the sequel, the dependence of pm and PM on the number of samples N is omitted, for simplicity of notation.\ngiven Y , and maximize it, to arrive at a MAP estimate of m given bellow.\npm/Y =\npm ∫ f∈Fm φN ( Y − f σ ) lf/m(f)df\n∑ m′∈M pm′ ∫ f ′∈Fm φN ( Y − f ′ σ ) lf/m′(f ′)df ′ .\n(12)\nFor the complete derivation of the formula in 12 we refer you to appendix B.\nStarting from the a-posteriori distribution (12) we can derive an approximation for the MAP as follows:\npm/Y ∝ pm ∫ f∈Fm φN ( Y − f σ ) lf/m(f)df\n= pm d′m+1∏ k=1\n1\n(2πσ2) |[k]| 2\n(13)\n· ∫ R exp ( − ‖y[k] − fk1[k]‖22 2σ2 ) lfk/m(fk)dfk.\nIn the last step of (13) we define y[k] as the vector obtained from the entries of y corresponding to cluster [k]. To obtain an approximation of the MAP estimate as a solution of a criterion of the form (4) we need the result of lemma 2 stated and proved in Appendix C using a Laplace approximation type of argument. We then obtain the following upper bound for the MAP for all K > 1 :\nCritMAP(m) 6 ‖y − PFm y‖22\n2σ2\n+K ( ln 1\npm +\n1 2 (d′m + 1) ln N\nd′m\n) +O(d′m). (14)\nThe complete derivation of (14) can be found in Appendix C. Now we define our approximate MAP criterion as:\nCrit(m) = ‖y − PFm y‖22 + σ2K pen(m),\npen(m) = ( 2 ln 1\npm + (d′m + 1) ln\nN\nd′m\n) . (15)\nIn the next section, we finish the specification of the penalty term by providing the probabilities pm over the space of models. To do so we will exhibit an oracle inequality satisfied by the estimator that minimizes (4), and choose a probability mass function (pm) that gives a reasonable upper bound on the expected quadratic risk defined below."
  }, {
    "heading": "6. Oracle inequality and upper bound for the risk",
    "text": "The standard way of assessing the performance of a statistical algorithm is by comparing its performance to a reasonable oracle. For this we use as a measure of performance\nof an estimator f̂ the expected quadratic risk:\nRn(f̂) = E[‖f̂ − f∗‖22].\nIn the case of the change point detection and clustering problem, the comparison should be non-asymptotic, reflecting our lack of knowledge about both the clustering dimension and the change point dimension. For this we state below a non-asymptotic oracle inequality for Crit(m) using an oracle with remainder of the form:\ninf m∈M {Rn(PFm y) + om(1)}.\nThis type of oracle has access to f∗ and chooses the m that minimizes the risk criterion up to a remainder term.\nTo derive this we finish the specification of Crit(m) by providing an appropriate prior pm. The intuition behind our choice is the following. Defining r̂m = ‖y − f̂m‖22 and pen(m) = 2σ2 ln 1pm + σ 2(d′m + 1) ln N d′m\nwe see that the criterion (15) is of the form:\nCrit(m) = r̂m + pen(m).\nThe number of models in the family M having the same values of d′m and d ′′ m grows exponentially with those dimensions. Thus for fix d′m and d ′′ m we might find a model with low r̂m just because of randomness since some of them will deviate largely from their means, which would correspond to an over-fitting case, this was the problem of case with the traditional AIC type of estimators. Therefore, we need to penalize models of high dimensions more by taking into account the number of models with same dimensions. On the other hand we want this penalty to be as small as possible this way we give more importance to the fitting term r̂m. In particular we would prefer the term 2σ2 ln 1pm to stay close to σ\n2(d′+1) ln Nd′ at least for values of d′m close to d ′′ m. Our choice for pm, useful inequalities and a complete discussion of the role of pm as a prior and tuning parameter for the risk can be found in Appendix D. From Lemmas 3 and 4, the following oracle inequality can be derived for f̂m̂:\nTheorem 6.1 (Oracle inequality for f̂m̂). With M restricted to models such that ed′m 6 N and for the choice of K = 3a, pm as in 3, pen(m) as in 15 and m̂ ∈ M corresponding to\nm̂ ∈ arg min m∈M ‖y − f̂m‖22 + σ2K pen(m), (16)\nWe obtain for all a > 1,\nEf∗ [‖PFm̂ Y − f∗‖2] 6\narg min m∈M\n{ a\na− 1 Ef∗ [‖PFm Y − f∗‖2]\n+ a2σ2\na− 1\n( 7 + 3(d′m + 1) ln N\nd′m + 6 ln\n1\npm\n)} . (17)\nProof. See Appendix D.\nBy investigating the oracle inequality, one notices that for an optimal choice of a one has to make a trade-off between the performance of the oracle part and the bias part of the inequality. In general this trade-off is not possible to optimize since the value of the oracle part is not available to us and depends on the variance of the noise. In practice, one can use the SLOPE heuristic introduced in Lebarbier (2002) and described in Baudry et al. (2012) and in (Arlot & Massart, 2009). In our case, the value of the tuning parameter can be chosen independently of the variance of the noise and we can use the value of a for which we know that our estimator f̂m̂ will perform well.\nCorollary 6.1. For the set of models described in 6.1 with f∗ ∈ Fm∗ the following properties hold:\n• Adaptation and Risk Upper bound: The following adaptive upper bound in terms of d′m∗ and d ′′ m∗ holds\nfor a = 2:\nEf∗ [‖PFm̂ Y − f ∗‖2] 6 4σ2 ( 7 + 3(d′m∗ + 1) ln N\nd′m∗\n+ 6 ( d′m∗ ln[d ′′ m∗e 13 6 ] + d′′m∗ ln[d ′ m∗e 2] + d′′m∗ ln N\nd′′m∗\n)) .\n• Consistency: If d′′m∗ = o(N/ lnN), then limN→∞N −1Ef∗ [‖f̂m̂ − f∗‖2] = 0.\nProof. See Appendix D.\nWe notice that the consistency condition d′′m∗ = o(N/ lnN) is within the restriction on the models in theorem 6.1, hence there is no loss of generality of having only models with ed′m 6 N in M since for other models we cannot guarantee convergent mean square risk anyway. In the special case d′m∗ = d ′′ m∗ , i.e when the change point and clustering problem reduces to a change point only problem, Kernel methods have comparable accuracy (Celisse et al., 2017). The interesting case is when the numbers are different, we gain a logarithmic factor in accuracy with almost the same computational cost. In the next section, we validate these theoretical guarantees by a series of tests on simulated data to get a sense of how tight the oracle inequality is, which signals are difficult to estimate and how the algorithm behaves in practice."
  }, {
    "heading": "7. Experimental results",
    "text": "Consider first an experiment based data generated randomly according to the setup of (1) with the same change points of Example 1. This is considered to be an easy case since d′m∗ = 4 < d ′′ m∗ = 12 N = 2000, which is within the range of signals for which the consistency result of Corollary 6.1 holds.\nThe experiments in Figure 2 show that the algorithm is quite robust to the level of noise as measured by the signalto-noise ratio S/N = magnitude of smallest jump in f ∗\nσ2 . We observe that the difference between the ground truth f∗ and f̂m̂ is quite small even for small S/N levels such as S/N = 0.5 and the change point locations do not vary appreciably; in fact, for this experiment, S/N = 0.3 seems to be the limiting case for which the algorithm performs well, and for lower values the risk upper-bound in Corollary 6.1 becomes loose when σ increases. Also, we note that an S/N of 0.5 is quite low for this kind of problems. In particular, algorithms relying on the L1-penalty such as Fussed LASSO do not achieve this kind of performance on the simpler task of change point only detection, while on the other hand, they are more computational efficient (Xin et al., 2014).\nFigure 3 illustrates a difficult case, where we reduced the number of observation by segment by scaling down the signal f∗ to a support of size N = 500. Now we are outside of the useful regime of Corollary 6.1 and we notice that the second segment J15, 53K is wider than what it should since the first change point at 25 was detected at 14; also the segment J206, 237K belongs to cluster [4] while it is actually in cluster [3] in the original signal f∗. Nevertheless we can observe an interesting property for segment J324, 346K, namely, that the end point 346 does not correspond to any real change point, yet this segment belongs to the optimal solution of the 1st dynamic programming pass. On the other hand the 2nd dynamic programming pass puts it in the same cluster [3] as J347, 399K, turning them into one single segment of cluster [3]. This behavior actually is the norm for the algorithm, where false changes are often detected in difficult signals in the 1st\ndynamic programming pass but are removed after the 2nd pass. These kinds of false discoveries are actually one of the weaknesses of many change point only detection algorithms like Fussed LASSO, and they have been studied in (Levy-leduc & Harchaoui, 2008), (Rinaldo, 2009) and (Rojas & Wahlberg, 2014). In the last experiment,\nwe run Algorithm 1 300 times with the parameter values d′m∗ = 4 < d ′′ m∗ = 12 N = 2000 and signal-to-noise ratio S/N = 1; Figure 4 summarizes the results. In the top histogram we notice that the algorithm successfully detects the change points most of the time; in fact, the achieved accuracy was number of change points correctly detectednumber of change points detected ≈ 0.8528. The\nmiddle histogram shows the placement of estimated clusters and the true values of the clusters; we observe that the true values lie in a small neighborhood of the estimated values for every cluster. In the bottom histogram we observe that the theoretical upper bound on the average mean square error –in this case 12.1575– found in Corollary 6.1 is very conservative and most of the 300 estimates –given by ‖f̂m̂−f\n∗‖2 N – are significantly smaller."
  }, {
    "heading": "8. Conclusions",
    "text": "In this work, we considered a novel problem related to change point detection where we have to address the simultaneous task of segmenting and clustering the observed signal. Our approach has been to view this problem as a non-parametric model selection problem on the set of all possible partitions. We derived for this the computationally tractable Algorithm 1, that computes a relaxation of the penalized minimization of criterion (4), and we justified it from a statistical standpoint by showing that this minimization can be viewed as an approximate MAP. This approximate MAP estimate enjoys the properties of being adaptive and consistent in the sense of Corollary 6.1. We finally justified the use of Algorithm 1 by simulation data that shows some useful properties of the resulting estimate and validates the theoretical guarantees.\nOne extension of this work concerns developing a more complete analysis of Algorithm 1, to obtain consistency results on the number and locations of the change points and clusters. Another possible extension relates to the use of Algorithm 1 in the non-scalar case; this was already explored for change point only detection in (Arlot et al., 2016) through the use of characteristic kernels (Sriperumbudur et al., 2011). We believe that the same approach can be adopted here except that we cannot perform the sorting step; this can be overcome using a Kernel clustering algorithm (Filipponea et al., 2008) or a spectral version of it (Schölkopf et al., 1998) for the second stage. Finally, the remark after Figure 3 hints to the possibility of using a combined algorithm starting with the sparse solution of Fussed LASSO and running the 2nd dynamic programming pass of our algorithm as a way to boost the performance of Fussed LASSO to get rid of false discoveries. This would be still computationally attractive according to the comment after Theorem 4.1, since the solution of Fussed LASSO has a small number of changes."
  }],
  "year": 2018,
  "references": [{
    "title": "Detection of abrupt changes in spatial relationships in video sequences",
    "authors": ["A. Abou-Elailah", "V. Gouet-Brunet", "I. Bloch"],
    "venue": "In International Conference on Pattern Recognition Applications and Methods,",
    "year": 2016
  }, {
    "title": "Data-driven calibration of penalties for least-squares regression",
    "authors": ["S. Arlot", "P. Massart"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2009
  }, {
    "title": "Efficient implementations of the generalized lasso dual path algorithm",
    "authors": ["T.B. Arnold", "R.J. Tibshirani"],
    "venue": "Journal of Computational and Graphical Statistics,",
    "year": 2016
  }, {
    "title": "Concentration Inequalities: A Nonasymptotic Theory of Independence",
    "authors": ["S. Boucheron", "G. Lugosi", "P. Massart"],
    "year": 2013
  }, {
    "title": "New efficient algorithms for multiple change-point detection with kernels",
    "authors": ["A. Celisse", "G. Marot", "M. Pierre-Jean", "G. Rigaill"],
    "year": 2017
  }, {
    "title": "Norms of Gaussian sample functions",
    "authors": ["B.S. Cirel’son", "I.A. Ibragimov", "V.N. Sudakov"],
    "venue": "In Proceedings of the Third Japan-USSR Symposium on Probability Theory, pp",
    "year": 1976
  }, {
    "title": "Segmentation of the Poisson and negative binomial rate models: a penalized estimator",
    "authors": ["A. Cleynen", "E. Lebarbier"],
    "venue": "Probability and Statistics,",
    "year": 2014
  }, {
    "title": "Introduction to Algorithms, Third Edition",
    "authors": ["T.H. Cormen", "C.E. Leiserson", "R.L. Rivest", "Stein", "C. (eds"],
    "year": 2009
  }, {
    "title": "On the prediction performance of the Lasso",
    "authors": ["A.S. Dalalyan", "M. Hebiri", "J. Lederer"],
    "year": 2017
  }, {
    "title": "A survey of kernel and spectral methods for clustering",
    "authors": ["M. Filipponea", "F. Camastrab", "F. Masullia", "S. Rovetta"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2008
  }, {
    "title": "Consistent change-point detection with kernels",
    "authors": ["D. Garreau", "S. Arlot"],
    "year": 2017
  }, {
    "title": "Algorithm Design: Foundations, Analysis, and Internet Examples",
    "authors": ["M.T. Goodrich", "Tamassia", "R. (eds"],
    "year": 2001
  }, {
    "title": "Retrospective multiple change-point estimation with kernels",
    "authors": ["Z. Harchaoui", "O. Cappé"],
    "venue": "IEEE/SP Workshop on Statistical Signal Processing (SSP ’07),",
    "year": 2007
  }, {
    "title": "Point estimation of the parameters of piecewise regression models",
    "authors": ["Hawkins", "Douglas M"],
    "venue": "Journal of the Royal Statistical Society. Series C (Applied Statistics),",
    "year": 1976
  }, {
    "title": "Detection of abrupt changes in spatial relationships in video sequences",
    "authors": ["J. Hütter", "P. Rigollet"],
    "venue": "In 29th Annual Conference on Learning Theory, PMLR",
    "year": 2016
  }, {
    "title": "Using labeled data to evaluate change detectors in a multivariate streaming environment",
    "authors": ["A.Y. Kim", "C. Marzban", "D.B. Percival", "W. Stuetzle"],
    "venue": "Signal Processing,",
    "year": 2009
  }, {
    "title": "Comparative analysis of algorithms for identifying amplifications and deletions in array",
    "authors": ["W.R. Lai", "M.D. Johnson", "R. Kucherlapati", "P.J. Park"],
    "venue": "CGH data. Bioinformatics,",
    "year": 2005
  }, {
    "title": "Detection of multiple change-points in multivariate time series",
    "authors": ["M. Lavielle", "G. TeyssiÃĺre"],
    "venue": "Lithuanian Mathematical Journal,",
    "year": 2006
  }, {
    "title": "Quelques approches pour la d’etection de ruptures a horizon fini",
    "authors": ["E. Lebarbier"],
    "venue": "PhD thesis, FacultÃl’ des Sciences d’Orsay (Essonne), Universite Paris-Sud,",
    "year": 2002
  }, {
    "title": "Catching change-points with lasso",
    "authors": ["C. Levy-leduc", "Z. Harchaoui"],
    "venue": "In Advances in Neural Information Processing Systems",
    "year": 2008
  }, {
    "title": "Concentration Inequalities and Model Selection",
    "authors": ["P. Massart"],
    "venue": "Springer-Verlag Berlin Heidelberg,",
    "year": 2003
  }, {
    "title": "Applications of chromatic polynomials involving Stirling numbers",
    "authors": ["A. Mohr", "T.D. Porter"],
    "venue": "Journal of Combinatorial Mathematics and Combinatorial Computing,",
    "year": 2009
  }, {
    "title": "Complexity penalized least squares estimators: Analytical results",
    "authors": ["A. Wittich", "G. Kempe", "Winkler", "Liebscher"],
    "venue": "Mathematische Nachrichten,",
    "year": 2005
  }, {
    "title": "On Stirling numbers of the second kind",
    "authors": ["B.C. Rennie", "A.J. Dobson"],
    "venue": "Journal of Combinatorial Theory,",
    "year": 1969
  }, {
    "title": "Exact posterior distributions and model selection criteria for multiple change-point detection problems",
    "authors": ["G. Rigaill", "E. Lebarbier", "S. Robin"],
    "venue": "Statistics and Computing,",
    "year": 2012
  }, {
    "title": "Properties and refinements of the fused lasso",
    "authors": ["A. Rinaldo"],
    "venue": "The Annals of Statistics,",
    "year": 2009
  }, {
    "title": "On change point detection using the fused lasso method",
    "authors": ["C.R. Rojas", "B. Wahlberg"],
    "year": 2014
  }, {
    "title": "Nonlinear total variation based noise removal algorithms",
    "authors": ["L.I. Rudin", "S. Osher", "E. Fatemi"],
    "venue": "Physica D: Nonlinear Phenomena,",
    "year": 1992
  }, {
    "title": "Nonlinear component analysis as a kernel eigenvalue problem",
    "authors": ["B. Schölkopf", "A. Smola", "K.R. Müller"],
    "venue": "Neural Computation,",
    "year": 1998
  }, {
    "title": "Multiscale local change point detection with applications to value-at-risk",
    "authors": ["V. Spokoiny"],
    "venue": "The Annals of Statistics,",
    "year": 2009
  }, {
    "title": "Universality, characteristic kernels and rkhs embedding of measures",
    "authors": ["B.K. Sriperumbudur", "K. Fukumizu", "G.R.G. Lanckriet"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2011
  }, {
    "title": "Hypothesis Testing and Changepoint Detection",
    "authors": ["A. Tartakovsky", "I.V. Nikiforov", "M. Basseville"],
    "venue": "Chapman and Hall, Monographs on Statistics and Applied Probability,",
    "year": 2014
  }, {
    "title": "Sparsity and smoothness via the fused lasso",
    "authors": ["R. Tibshirani", "M. Saunders", "S. Rosset", "J. Zhu", "K. Knight"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2005
  }, {
    "title": "Efficient generalized fused lasso and its application to the diagnosis of alzheimerâĂŹs disease",
    "authors": ["B. Xin", "Y. KawaharaâĂă", "Y. Wang", "W. Gao"],
    "venue": "In Proceedings of the Twenty-Eighth AAAI Conference on Artificial Intelligence,",
    "year": 2014
  }],
  "id": "SP:59831fdf67d2a058575295d00aad89321e42938a",
  "authors": [{
    "name": "Othmane Mazhar",
    "affiliations": []
  }, {
    "name": "Cristian R. Rojas",
    "affiliations": []
  }, {
    "name": "Carlo Fischione",
    "affiliations": []
  }, {
    "name": "Mohammad Reza Hesamzadeh",
    "affiliations": []
  }],
  "abstractText": "We address a generalization of change point detection with the purpose of detecting the change locations and the levels of clusters of a piecewise constant signal. Our approach is to model it as a nonparametric penalized least square model selection on a family of models indexed over the collection of partitions of the design points and propose a computationally efficient algorithm to approximately solve it. Statistically, minimizing such a penalized criterion yields an approximation to the maximum a-posteriori probability (MAP) estimator. The criterion is then analyzed and an oracle inequality is derived using a Gaussian concentration inequality. The oracle inequality is used to derive on one hand conditions for consistency and on the other hand an adaptive upper bound on the expected square risk of the estimator, which statistically motivates our approximation. Finally, we apply our algorithm to simulated data to experimentally validate the statistical guarantees and illustrate its behavior.",
  "title": "Bayesian Model Selection for Change Point Detection and Clustering"
}