{
  "sections": [{
    "text": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 4395–4404 Brussels, Belgium, October 31 - November 4, 2018. c©2018 Association for Computational Linguistics\n4395"
  }, {
    "heading": "1 Introduction",
    "text": "People interact with each other and as a result form relationships. These relationships range from weak (e.g., John talking to a waiter to order a drink) to strong (e.g., John and his best friend discussing career options). Traditionally, information extraction systems target, among others, relationships between people, e.g., PARENT, SIBLING, OTHER-PERSONAL, OTHERPROFESSIONAL (Doddington et al., 2004).\nExtracting a label describing the general relationship between two entities—often called relation type—is useful for tasks such as summarization (Jijkoun et al., 2004) and question answering (White et al., 2001). Only assigning a relation type, however, does not account for nuances in the relationship between two individuals. First, a relationship can be characterized beyond a relation type. For example, people having a PROFESSIONAL relationship may be spatially near or distant (working at the same or different offices), and have an equal or hierarchical relationship (two software developers or a developer and the CEO). Second, relationships are defined by multiple interactions, and the fine-grained characteristics of interactions do not necessarily mirror the characteristics of the corresponding relationship.\nFor example, software developers having a cooperative PROFESSIONAL relationship may have a heated interaction in a meeting that does not affect the long-term PROFESSIONAL relationship. Similarly, the same software developers having a taskoriented PROFESSIONAL relationship may have occasionally pleasure oriented interactions (e.g., when they go out for drinks on Fridays).\nThis kind of fine-grained characteristics of interactions and relationships are called dimensions in social science (Wish et al., 1976). Social scientists have also studied language usage and how people interact with each other depending on their relationship. For example, Gibbs (2000) studies irony (sarcasm, hyperbole, understatement, etc.) in communications among friends, and Snyder and Stukas Jr (1999) analyze the expectations in social interactions (e.g., interactions between strangers tend to be more formal) as well as the consequences of breaking expectations. In the social sciences, however, researchers mostly focus on how people act (e.g., how they talk to each other and about each other) and how people perceive interactions and relationships. In general, they do not attempt to automatically characterize interactions or relationships from language usage.\nIn this paper, we characterize the interactions between people and the resulting relationships. The main contributions of this paper are: (a) a set of dimensions to characterize interactions and relationships, including dimensions previously defined in the social sciences and two novel dimensions; (b) annotations of these dimensions for all interactions and relationships in 24 episodes of the TV show Friends (Season 1); (c) corpus analysis including agreements, label distributions and correlations; and (d) experimental results showing that classifiers grounded on language usage (and discarding the names of people being considered) are successful at automating the task."
  }, {
    "heading": "2 Previous Work",
    "text": "Within natural language processing, there have been several recent efforts working with relationships between people. Voskarides et al. (2015) extract human-readable descriptions of relations in a knowledge graph. Unlike the work presented here, they experiment with a proprietary knowledge graph and rely heavily on features extracted from the graph. Iyyer et al. (2016) propose an unsupervised algorithm to extract relationship trajectories of fictional characters. Bracewell et al. (2012) introduce social acts (e.g., agreement, undermining) designed to characterize relationships exhibiting adversarial and collegial behavior (similar to our cooperative vs. competitive dimension). None of these works distinguish between interactions and relationships, characterize interactions and relationships with dimensions, or consider all interactions between two people.\nIn our previous work, we characterize interpersonal relationships with dimensions (Rashid and Blanco, 2017). In this paper, we improve upon our previous effort as follows. First, we distinguish between interpersonal interactions and relations. Second, we work with dialogues thus the same people interact with each other many times.\nThere have been a few studies on analyzing language usage when people communicate. For example, Danescu-Niculescu-Mizil et al. (2012) study how power differences affect language style in online communities, and Prabhakaran and Rambow (2014) present a classifier to detect power relationships in email threads. Similarly, Gilbert (2012) explores how people in hierarchical relationships communicate through email, and Bramsen et al. (2011) focus on identifying power relationships in social networks. Politeness in online forums has also been studied (Danescu-NiculescuMizil et al., 2013). While power (similar to our equal vs. hierarchical dimension, Section 3) and politeness could be considered dimensions, these works exploit structural and linguistic features derived from communications between two individuals. Unlike all of them, we distinguish between and characterize interactions and relationships, and automate the task using only information derived from language usage.\nInformation extraction systems target, among others, relationships between people. There have been many evaluations (Grishman and Sundheim, 1996; Doddington et al., 2004; Kulick et al., 2014;\nSurdeanu and Heng, 2014), and there are two main approaches. Traditionally, relationships are defined before training takes place (e.g., PARENT, FRIENDS), and systems are trained using supervised machine learning (Yu and Lam, 2010; Nguyen et al., 2016; West et al., 2014). On the other hand, open information extraction (Wu and Weld, 2010; Angeli et al., 2015) has emerged as an unsupervised domain-independent approach to extract relations. Regardless of details, these previous works extract explicit relationships and do not attempt to characterize instances of relationships with dimensions. Additionally, they do not distinguish between interactions and relationships."
  }, {
    "heading": "3 Interpersonal Interactions and Relationships",
    "text": "In this paper, we work with transcripts of conversations and define interaction and relationship as follows. An interaction between two people x and y exists for each conversation turn by either x or y referring to the other person. A relationship between two people x and y exists if there is at least one interaction between them. One could understand a relationship between x and y as the association defined by a sequence of interactions between x and y. Beyond these definitions, we do not impose any restriction on what constitutes an interaction or relationship: interactions occur each time two people refer to each other in their speech (even if they are not talking to each other), and one or more interactions constitute a relationship.\nInteractions and relationships between people have been extensively studied in psychology and social sciences in general. The right set of dimensions is not agreed upon (Wish et al., 1976; Deutsch, 2011; Adamopoulos, 2012), and we argue that it depends on the domain of interest (e.g., personal diaries vs. news articles covering politics). We note that dimensions apply to interactions and relationships between specific people (i.e., instances of interactions and relationships), not relation types. For example, a KINSHIP relationship between x and y could be intense or superficial (depending on x and y) and a particular interaction of that relationship may be spatially near or distant (even for the same x and y).\nThe dimensions we work with are briefly summarized in Table 1 and described below. All but two dimensions are defined in previous work in the social sciences (see references in Table 1).\nDimensions of Interactions. We consider four dimension of interactions between people, i.e., when a speaker refers to a person in a conversation:\n• Cooperative vs. Competitive. A interaction is cooperative if both people (a) have a common interest or goal, (b) like each other, (c) benefit from the interaction, or (d) think alike or share similar views. Otherwise, the interaction is competitive. • Active vs. Passive. An interaction is active if both people communicate directly. Otherwise, the interaction is passive. For example, when John talks to Bill about Mary, John and Bill have an active interaction, and John and Mary have a passive interaction. • Concurrent vs. Nonconcurrent. An interaction is concurrent if both people are involved in an event or action at the same time (the event does not need to be a communicating event). Otherwise, the interaction is nonconcurrent. For example, when John talks to Bill about a trip with Mary, John and Mary have a concurrent interaction, but when John talks to Bill about Paul’s house, John and Paul have a nonconcurrent interaction. • Spatially Near vs. Distant. An interaction is spatially near (or near for short) if the interaction is concurrent and both people are at the same location during the event in which they are involved. Otherwise, the interaction is spatially distant (or distant for short).\nDimensions of Relationships. We consider five dimensions of relationships between people:\n• Equal vs. Hierarchical. A relationship is equal if both people (a) have the same social status, (b) are at the same level in the power\nstructure, (c) share similar responsibilities, or (d) have the same role. Otherwise, the relationship is hierarchical. • Intense vs. Superficial. A relationship is intense if both people interact with each other frequently, i.e., they are involved repeatedly. Otherwise, the relationship is superficial. • Pleasure vs. Task Oriented. A relationship is pleasure oriented if both people interact socially and their relationship is not bound by professional rules or regulations. Otherwise, the relationship is task oriented. • Intimate vs. Unintimate. A relationship is intimate if both people are emotionally close and warm to each other. Otherwise, the relationship in unintimate. • Temporary vs. Enduring. A relationship is temporary if it lasts less than a day. A relationship is enduring if it last over a month. Otherwise (if it lasts more than a day and less than a month), this dimension is undefined."
  }, {
    "heading": "4 Annotating Dimensions of Interactions and Relationships",
    "text": "Annotating dimensions of interactions and relationships requires a corpus in which the same people interact several times. We augment an existing corpus of scripts from the TV show Friends (Chen and Choi, 2016). More specifically, we work with the 24 episodes from Season 1 because they:\n• contain a large number of conversation turns (9,168, see counts per episode in Table 2); • involve many characters (42 characters speak at least 100 conservation turns, see the characters that interact the most in Table 2, and the full list in the supplementary materials);\n• include speaker information (i.e., we have access to who says what); and • include annotations linking each mention of people in each conversation turn to the actual person (the name of the person).\nBeyond size, the main motivation to use this corpus is the last item above: starting from scratch with another corpus of dialogues would require a substantially larger annotation effort. We refer the reader to the afore-cited paper for details, but the original corpus clusters mentions to people such as guy, my brother and he together with other mentions of the same person. The original corpus is publicly available,1 and we release our annotations as stand-alone annotations.2"
  }, {
    "heading": "4.1 Selecting Pairs of People",
    "text": "The corpus we start with makes it straightforward to select pairs of people whose interactions and corresponding relationships will be annotated. We consider as interactions all instances of somebody mentioning (or referring to) somebody else in a conversation turn. We consider as relationships individuals who interact at least once. Note that we do not (a) distinguish between x mentioning y and y mentioning x, and (b) consider as an interaction x talking to y unless the conversation turn contains a mention to y (the mention need not be the actual name, it could be a pronoun or any nominal mention). Our rationale is as follows. First, all dimensions of interactions are symmetric; and all dimensions of relationships are symmetric except equal vs. hierarchical. Second, the characters of Friends refer to each other explicitly at least once in most conversations and scenes, either using first names or the pronoun you. Thus we are considering as an interaction most verbal exchanges.\nTable 2 shows basic counts per episode. We show the number of interactions, unique relationships (i.e., interactions between unique pairs of people), and the pair of people who interact the most. The supplementary materials include an extended table listing the number of times each pair of people interact per episode."
  }, {
    "heading": "4.2 Annotation Process",
    "text": "The annotations were done one episode at a time. Annotators were presented with the full transcript of the episode including speaker informa-\n1https://github.com/emorynlp/ character-mining\n2http://www.cse.unt.edu/˜blanco/\ntion (who speaks what?) and the names of the individuals mentioned in each conversation turn (who do speakers talk about?). Annotators read each episode from the beginning, and annotate dimensions of interactions and relationships after each interaction. Regarding interactions, they were instructed to annotate dimensions taking into account the language of the current conversation turn. Regarding relationships, they were instructed to annotate dimensions taking into account all previous conversation turns within the same episode. For example, if previous turns state that Rachel and Monica are best friends, the relationship will continue to be annotated intense even if an interaction does not indicate so (until a turn indicates that they are not friends, if applicable).\nWe discovered during pilot annotations that the value for a dimension sometimes cannot be determined. For example, if the first interaction between Rachel and Monica is Rachel: How are [you]Monica doing?, we cannot tell if the relationship is temporary or enduring. We note, however, that all interaction after we find out that they are best friends (as long as they remain best friends) will be annotated enduring. Hereafter, we refer to dimensions by the first descriptor in Table 1, and use 1 if the first descriptor of a dimension is true, -1 if the second descriptor is true, and 0 if neither the first nor the second descriptor can be chosen. Annotation Quality. The annotations were done by two graduate students in computational linguis-\ntics. First, they did pilot annotations to better define the dimensions (Section 3). After several iterations, both of them annotated 3 episodes (15% of all interactions). Table 4 presents the interannotator agreements. Cohen’s κ range between 0.77 and 0.89, and most (7 out of 9) are above 0.80, which is considered perfect agreement. Values between 0.60 and 0.80 are considered substantial (Artstein and Poesio, 2008). The remaining episodes were annotated once."
  }, {
    "heading": "4.3 Annotation Examples",
    "text": "We present annotation examples in Table 3. The interactions in conversation turns 1 and 2 are competitive: Phoebe is ridiculing Paul by asking Monica if he eats chalk, and Ross is confronting an unnamed woman. In turn (3), Monica refers to Phoebe with affection (as the latter sleeps), thus the interaction is cooperative. Turns (4–6) exemplify concurrent vs. nonconcurrent. In (4), Rachel is inquiring whether she can meet Alan (Monica’s boyfriend), and Rachel and Alan are not involved in the same event (at this point, the meeting may or may not happen). In (5–6), however the speaker and second party are involved directly in a communication event. In examples (4–6), the values for active are the same as for concurrent.\nTurns 7–12 present examples for dimensions of relationships. Examples 7 and 9 are fairly straightforward: previous interactions reveal that Joey is\nan adult and Monica’s father is indeed Mr. Geller. Example 8 is annotated equal, as Chandler and Ross are friends based on previous interactions (the use of pal also helps). Examples 10–12 require more explanation, as additional information beyond the current conversation turn is required (recall that dimensions of relationships are annotated taking into account the previous turns within the same episode, Section 4.2). Dr. Franzblau is the doctor of a friend’s ex-wife, so Monica and him have a superficial relationship (Turn 10). At the point Turn (11) is spoken by Chandler, she and Aurora are strangers, so they have a superficial relationship. In (12), previous conversations reveal that Monica and Rachel are close friends, and they interact often (intense)."
  }, {
    "heading": "5 Corpus Analysis",
    "text": "The pie charts in Figure 1 present the label distributions per dimension. Regarding interactions, we note that (a) values for all dimensions can be determined almost always (the percentages of 0 (unknown) are almost zero), and (b) the first descriptor is much more common in all dimensions. These percentages do not represent the distribution of interactions between people in general: the scripts of the TV show Friends mostly contain conversation between friends. Regarding relationships, we observe a larger percentage of 0 (unknown) although values of all dimension can be determined most of the time (labels 1 and -1, indicating that the first or second descriptor apply). Most dimensions are biased towards 1 (the only exception is temporary, as most relationships are\nenduring), especially pleasure oriented and equal (91.2% and 84.8%). Again, these distributions would be different if we worked with other sources of dialogue than the TV show Friends.\nMany of the dimensions we consider in this work are intuitively correlated. For example, concurrent interactions must be active, and pleasure oriented interactions are probably also equal. We note, however, that interactions can be passive and concurrent, e.g., in (Monica talking to Joey) [He]Paul is just [a guy]Paul I am dating!, Monica and Paul have a passive and concurrent interaction (they are dating, but they are not talking to each other). Table 5 shows Pearson correlations between all dimensions of interactions and relationships. Most correlations are under 0.3 (29 out\nof 36), although some pairs do have high correlations. In particular, active interactions tend to be both concurrent (0.81) and spatially near (0.71), and spatially near interactions tend to be concurrent (0.89). Regarding relationships, intimate correlates with intense (0.75), pleasure oriented with equal (0.50), and temporary with both superficial (0.52) and intimate (0.54).\nFinally, Figure 2 shows the most salient words of dimensions spatially near and intense. We calculated salience using tf-idf (Schütze et al., 2008). Interactions containing derogatory words (e.g., pig, bugs, pretending, cheating) tend to be distant, and near interactions contain mostly neutral and nicer words such as friends, sweatheart and please. We also note that cognitive verbs and nouns (e.g., thinking, figured (out), looking (into), cause), as well as important events (birthday, thanksgiving) and slang usage (e.g., whaddya) signal intense relationships."
  }, {
    "heading": "6 Experiments and Results",
    "text": "We experimented with SVM classifiers with RBF kernel to predict dimensions of interactions and relationships. We divided the 24 episodes into train (episodes 1–20) and test (21–24), and trained one classifier per dimension using scikit-learn (Pe-\ndregosa et al., 2011). Each classifier is trained with three labels: 1 (1st descriptor), -1 (2nd descriptor) and 0 (unknown). The SVM parameters (C and γ) were tuned using 10-fold crossvalidation with the train split, and results are reported using the test split.\nNote that different pairs of people interact more or less in each episode (Table 2). Thus, the classifiers are grounded on general language usage and not modeling who talks and who is talked about. We also experimented with LSTMs taking as input the current conversation turn and previous turns, but do not report results because SVM classifiers yielded better results.\nFeature Set. We use a combination of features extracted directly from the conversation turn, sentiment lexica and context. Specifically, we extract (a) the first word in the conversation turn, (b) bag-of-words features (binary flags and tf-idf scores), and (c) the root verb, and flags indicating the presence of exclamation, question marks and negation cues from (Morante and Daelemans, 2012) (other). Regarding sentiment, we extract flags indicating whether the turn has a positive, negative or neutral word in the list by Hamilton et al. (2016), the sentiment score of the turn (summation of sentiment scores per token over number of tokens in the turn), and a flag indicating whether the turn contains a negative word from the list by Hu and Liu (2004). Regarding context, we extract bag-of-words features from the previous conversation turn in which the same people interact (not necessarily the preceding turn)."
  }, {
    "heading": "6.1 Results",
    "text": "Table 6 shows the overall results (average of all dimensions) obtained with the majority baseline and several feature combinations. All feature combinations outperform the baseline. Sentiment features are not beneficial, leading to the conclusion that sentiment does not correlate with dimensions of interactions and relationships between people. This may look surprising at first sight, but recall that our dimensions capture much more than if two people get along (Table 1). Finally the bagof-words features from the previous turn in which the same people interacted bring a small improvement (F: 0.70 vs. 0.72).\nWe show results per dimension for the best feature combination (all) in Table 7. Despite the label\ndistributions are biased (Figure 1), the system predicts most labels for most dimensions except the very biased ones (cooperative, equal and pleasure oriented). Note that 0 (unknown) does not allow us to determine the value of a dimension, and the low results with this label are not a concern."
  }, {
    "heading": "7 Conclusions",
    "text": "This paper presents the task of characterizing interactions and relationships between people. We work with dialogue transcripts, and define an interaction as a speaker referring to somebody else, and a relationship as a sequence of one or more interactions. Unlike previous work (Section 2), we target all interactions and relationships, and use dimensions that are applicable to any interaction or relationship regardless of the underlying type (e.g., SIBLINGS, FRIENDS, DOCTOR-PATIENT).\nWe have presented an annotation effort on 24 episodes of the popular TV show Friends (Season 1). The total number of conversation turns is 9,168, and the total number of interactions is 2,331. The label distribution per dimension shows that the labels are unbalanced, but a relatively straightforward SVM is able to outperform the majority baseline (F: 0.62 vs. 0.72, Table 6). Features extracted using well-known sentiment lexica yield no improvements, leading to the conclusion that the dimensions we work with capture information beyond whether two people get along.\nCrucially, values for the dimensions we work with can be determined most of the time (Figure 1, labels 1 and -1). Since we do not impose any restriction on the interactions or relationships we work with, we conclude that these dimensions may be universally applicable."
  }],
  "year": 2018,
  "references": [{
    "title": "The emergence of social meaning: A theory of action construal",
    "authors": ["John Adamopoulos."],
    "venue": "Handbook of Social Resource Theory, pages 255–272. Springer.",
    "year": 2012
  }, {
    "title": "Leveraging linguistic structure for open domain information extraction",
    "authors": ["Gabor Angeli", "Melvin Jose Johnson Premkumar", "Christopher D. Manning."],
    "venue": "Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics",
    "year": 2015
  }, {
    "title": "Inter-coder agreement for computational linguistics",
    "authors": ["Ron Artstein", "Massimo Poesio."],
    "venue": "Comput. Linguist., 34(4):555–596.",
    "year": 2008
  }, {
    "title": "Annotation of adversarial and collegial social actions in discourse",
    "authors": ["David B. Bracewell", "Marc T. Tomlinson", "Mary Brunson", "Jesse Plymale", "Jiajun Bracewell", "Daniel Boerger."],
    "venue": "Proceedings of the Sixth Linguistic Annotation Workshop, LAW VI",
    "year": 2012
  }, {
    "title": "Extracting social power relationships from natural language",
    "authors": ["Philip Bramsen", "Martha Escobar-Molano", "Ami Patel", "Rafael Alonso."],
    "venue": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Tech-",
    "year": 2011
  }, {
    "title": "Character identification on multiparty conversation: Identifying mentions of characters in tv shows",
    "authors": ["Yu-Hsin Chen", "Jinho D. Choi."],
    "venue": "Proceedings of the 17th Annual Meeting of the Special Interest Group on Discourse and Dialogue, pages 90–",
    "year": 2016
  }, {
    "title": "Echoes of power: Language effects and power differences in social interaction",
    "authors": ["Cristian Danescu-Niculescu-Mizil", "Lillian Lee", "Bo Pang", "Jon Kleinberg."],
    "venue": "Proceedings of the 21st International Conference on World Wide Web,",
    "year": 2012
  }, {
    "title": "A computational approach to politeness with application to social factors",
    "authors": ["Cristian Danescu-Niculescu-Mizil", "Moritz Sudhof", "Dan Jurafsky", "Jure Leskovec", "Christopher Potts."],
    "venue": "Proceedings of the 51st Annual Meeting of the Association for Compu-",
    "year": 2013
  }, {
    "title": "Interdependence and psychological orientation",
    "authors": ["Morton Deutsch."],
    "venue": "Conflict, Interdependence, and Justice, pages 247–271. Springer.",
    "year": 2011
  }, {
    "title": "The automatic content extraction",
    "authors": ["George Doddington", "Alexis Mitchell", "Mark Przybocki", "Lance Ramshaw", "Stephanie Strassel", "Ralph Weischedel"],
    "year": 2004
  }, {
    "title": "Irony in talk among friends",
    "authors": ["Raymond W Gibbs."],
    "venue": "Metaphor and symbol, 15(1-2):5–27.",
    "year": 2000
  }, {
    "title": "Phrases that signal workplace hierarchy",
    "authors": ["Eric Gilbert."],
    "venue": "Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, CSCW ’12, pages 1037–1046, New York, NY, USA. ACM.",
    "year": 2012
  }, {
    "title": "Message understanding conference-6: A brief history",
    "authors": ["Ralph Grishman", "Beth Sundheim."],
    "venue": "Proceedings of the 16th Conference on Computational Linguistics - Volume 1, COLING ’96, pages 466– 471, Stroudsburg, PA, USA. Association for Com-",
    "year": 1996
  }, {
    "title": "Inducing domain-specific sentiment lexicons from unlabeled corpora",
    "authors": ["William L. Hamilton", "Kevin Clark", "Jure Leskovec", "Dan Jurafsky."],
    "venue": "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 595–605,",
    "year": 2016
  }, {
    "title": "Mining and summarizing customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of the Tenth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD ’04, pages 168–177, New York, NY, USA. ACM.",
    "year": 2004
  }, {
    "title": "Feuding families and former friends: Unsupervised learning for dynamic fictional relationships",
    "authors": ["Mohit Iyyer", "Anupam Guha", "Snigdha Chaturvedi", "Jordan Boyd-Graber", "Hal Daumé III."],
    "venue": "Proceedings of the 2016 Conference of the North Ameri-",
    "year": 2016
  }, {
    "title": "Information extraction for question answering: Improving recall through syntactic patterns",
    "authors": ["Valentin Jijkoun", "Maarten de Rijke", "Jori Mur."],
    "venue": "Proceedings of the 20th International Conference on Computational Linguistics, COLING ’04, Strouds-",
    "year": 2004
  }, {
    "title": "Personal relationships: Their structures and processes",
    "authors": ["Harold H Kelley."],
    "venue": "Psychology Press.",
    "year": 2013
  }, {
    "title": "Interannotator agreement for ere annotation",
    "authors": ["Seth Kulick", "Ann Bies", "Justin Mott."],
    "venue": "Proceedings of the Second Workshop on EVENTS: Definition, Detection, Coreference, and Representation, pages 21–25, Baltimore, Maryland, USA. Associa-",
    "year": 2014
  }, {
    "title": "Conandoyle-neg: Annotation of negation cues and their scope in conan doyle stories",
    "authors": ["Roser Morante", "Walter Daelemans."],
    "venue": "Proceedings of the Eighth International Conference on Language Resources and Evaluation (LREC-2012),",
    "year": 2012
  }, {
    "title": "Stranse: a novel embedding model of entities and relationships in knowledge bases",
    "authors": ["Dat Quoc Nguyen", "Kairit Sirts", "Lizhen Qu", "Mark Johnson."],
    "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association for Computa-",
    "year": 2016
  }, {
    "title": "Scikit-learn: Machine learning",
    "authors": ["F. Pedregosa", "G. Varoquaux", "A. Gramfort", "V. Michel", "B. Thirion", "O. Grisel", "M. Blondel", "P. Prettenhofer", "R. Weiss", "V. Dubourg", "J. Vanderplas", "A. Passos", "D. Cournapeau", "M. Brucher", "M. Perrot", "E. Duchesnay"],
    "year": 2011
  }, {
    "title": "Predicting power relations between participants in written dialog from a single thread",
    "authors": ["Vinodkumar Prabhakaran", "Owen Rambow."],
    "venue": "Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Pa-",
    "year": 2014
  }, {
    "title": "Dimensions of interpersonal relationships: Corpus and experiments",
    "authors": ["Farzana Rashid", "Eduardo Blanco."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, pages 2297–2306, Copenhagen, Denmark.",
    "year": 2017
  }, {
    "title": "Introduction to information retrieval, volume 39",
    "authors": ["Hinrich Schütze", "Christopher D Manning", "Prabhakar Raghavan."],
    "venue": "Cambridge University Press.",
    "year": 2008
  }, {
    "title": "Interpersonal processes: The interplay of cognitive, motivational, and behavioral activities in social interaction",
    "authors": ["Mark Snyder", "Arthur A Stukas Jr."],
    "venue": "Annual review of psychology, 50(1):273–303.",
    "year": 1999
  }, {
    "title": "Overview of the english slot filling track at the tac2014 knowledge base population evaluation",
    "authors": ["Mihai Surdeanu", "Ji Heng."],
    "venue": "Proceedings of the TAC-KBP 2014 Workshop.",
    "year": 2014
  }, {
    "title": "Learning to explain entity relationships in knowledge graphs",
    "authors": ["Nikos Voskarides", "Edgar Meij", "Manos Tsagkias", "Maarten de Rijke", "Wouter Weerkamp."],
    "venue": "Proceedings of the 53rd Annual Meeting of the Association for Computational Lin-",
    "year": 2015
  }, {
    "title": "Knowledge base completion via search-based question answering",
    "authors": ["Robert West", "Evgeniy Gabrilovich", "Kevin Murphy", "Shaohua Sun", "Rahul Gupta", "Dekang Lin."],
    "venue": "Proceedings of the 23rd International Conference on World Wide Web, WWW ’14,",
    "year": 2014
  }, {
    "title": "Multidocument summarization via information extraction",
    "authors": ["Michael White", "Tanya Korelsky", "Claire Cardie", "Vincent Ng", "David Pierce", "Kiri Wagstaff."],
    "venue": "Proceedings of the First International Conference on Human Language Technology Research,",
    "year": 2001
  }, {
    "title": "Perceived dimensions of interpersonal relations",
    "authors": ["Myron Wish", "Morton Deutsch", "Susan J Kaplan."],
    "venue": "Journal of Personality and Social Psychology, 33(4):409.",
    "year": 1976
  }, {
    "title": "Open information extraction using wikipedia",
    "authors": ["Fei Wu", "Daniel S. Weld."],
    "venue": "Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, ACL ’10, pages 118–127, Stroudsburg, PA, USA. Association for Computa-",
    "year": 2010
  }, {
    "title": "Jointly identifying entities and extracting relations in encyclopedia text via a graphical model approach",
    "authors": ["Xiaofeng Yu", "Wai Lam."],
    "venue": "Proceedings of the 23rd International Conference on Computational Linguistics: Posters, COLING ’10, pages",
    "year": 2010
  }],
  "id": "SP:c1afcd0140b84f8e310625ee23f9dac4dc50f921",
  "authors": [{
    "name": "Farzana Rashid",
    "affiliations": []
  }, {
    "name": "Eduardo Blanco",
    "affiliations": []
  }],
  "abstractText": "This paper presents a set of dimensions to characterize the association between two people. We distinguish between interactions (when somebody refers to somebody in a conversation) and relationships (a sequence of interactions). We work with dialogue scripts from the TV show Friends, and do not impose any restrictions on the interactions and relationships. We introduce and analyze a new corpus, and present experimental results showing that the task can be automated.",
  "title": "Characterizing Interactions and Relationships between People"
}