{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Clustering is perhaps the most fundamental problem in unsupervised learning. Many clustering algorithms have been proposed in the literature (Jain et al., 1999), including Kmeans, spectral clustering, Gaussian mixture models and hierarchical clustering, to solve problems with respect to a wide range of cluster shapes. However, much research has pointed out that these methods all suffer from instabilities. For example, the formulation of K-means is NP-hard and the typical way to solve it is the Lloyds method, which\n1ECE, North Carolina State University, Raleigh, NC 2CSE, Chalmers University of Technology, Göteborg, Sweden 3IMES, MIT, Cambridge, MA 4CSA, IISc, Bangalore, India. Correspondence to: Ashkan Panahi <panahi1986@gmail.com>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nrequires randomly initializing the clusters. However, one needs to know the number of clusters in advance and different initializations may lead to significantly different final cluster results.\nLindsten et al. (2011) and Hocking et al. (2011) proposed the following convex optimization procedure for clustering, called SON (“Sum of norms” clustering) by the former and Clusterpath by the latter;\nmin {ui∈Rm}\n1\n2 n∑ i=1 ‖xi − ui‖22 + λ ∑ i<j ‖ui − uj‖2 (1)\nThe main idea of the formulation is that if input data points xi and xj belong to the same cluster, then their corresponding centroids ui and uj should be forced to be the same. Intuitively, this is due to the fact that the second term is a regularization term that enforces zeroes in the vector consisting of entries ‖ui − uj‖ and can be seen as a generalization of the fused Lasso penalty. From another point of view, the regularization term can be seen as an `1,2 norm, i.e., the sum of `2 norms. Such a group norm is known to encourage block sparse solutions (Bach et al., 2012). Thus for many pairs (i, j), we expect to enforce ui = uj .\nLindsten et al. (2011) used an off–the–shelf convex solver, CVX to generate solution paths. Hocking et al. (2011) introduced three distinct algorithms for the three most commonly encountered norms. For the `1 norm, the objective function separates, and they solve the convex clustering problem by the exact path following method designed for the fused lasso. For the `1 and `2 norms, they employ subgradient descent in conjunction with active sets. Recently, Chi & Lange (2015); Chen et al. (2015) introduce two similar generic frameworks for minimizing the convex clustering objective function with an arbitrary norm. One approach solves the problem by the alternating direction method of multipliers (ADMM), while the other solves it by the alternating minimization algorithm (AMA). However both algorithms have issues with scalablity.\nMoreover, none of these papers provide any theoretical guarantees about the cluster recovery property of the algorithm. The first theoretical result on cluster recovery was shown by Zhu et al. (2010): if the samples are drawn from\ntwo cubes, each being one cluster, then SON can provably recover the clusters provided that the distance between the two cubes is larger than a threshold which depends (linearly) on the size of the cube and the ratio of numbers of samples in each cluster. Unfortunately, the conditions for recovery represent an extremely narrow special case: only two clusters which both have to be cubes. Moreover in their paper, there is no algorithm or analysis of the speed of convergence. No other theoretical guarantees for SON are known previously.\nHere we develop a new algorithm in the spirit of recent advances in stochastic methods for large scale optimization (Bottou et al., 2016) to solve the optimization problem (1). We give a convergence analysis and provide quite general cluster recovery guarantees.\nThere has been a flurry of advances (Johnson & Zhang, 2013; Defazio et al., 2014; Schmidt et al., 2016) in developing algorithms for solving optimization problems for the case when the objective consists of the sum of two convex functions: one is the average of a large number of smooth component functions, and the other is a general convex function that admits a proximal mapping (and the whole objective function is strongly convex). The optimization (1) is of this form but here we exploit the structure of (1) further by observing that the second function can also be split into component functions. This results in an incremental algorithm with proximal iterations consisting of very simple and natural steps. Our algorithm can be seen as a special case of the methods of Bertsekas (2011). We compute the proximal operator in closed form to yield very simple and cheap iterations. Using the fact that the proximal operator is non-expansive, we refine and strengthen Bertsekas’ convergence results. The stochastic incremental nature of our algorithm makes it highly suited to large scale problems (Bottou et al., 2016) in contrast to the methods in Chi & Lange (2015); Chen et al. (2015).\nWe show that the SON formualation (1) provides strong cluster recovery properties that go far beyond the special case considered in Zhu et al. (2010). Our cluster recovery conditions are similar in spirit to the unifying general conditions recently formulated in A. Kumar (2010); P.Awasthi (2012) of the form that the means of the clusters are well– separated, i.e., the distance between the means of any two clusters is at least Ω(k) standard deviations (the notion of standard deviations is based on the spectral norm of the matrix whose rows represent the difference between a point and the mean of the cluster to which it belongs). Besides containing the result of Zhu et al. (2010) as a special case, the condition essentially recovers the well known cluster recovery conditions for paradigm examples such as mixtures of Gaussians and planted partition models. The algorithms in A. Kumar (2010); P.Awasthi (2012) are based on\nan SVD-based initialization followed by applying Lloyd’s K–means algorithm, so K must be known in advance. Our method does not need to knowK and is independent of any initialization.\nA summary of our contributions are:\n• We develop a new incremental proximal algorithm for the SON optimization problem (1).\n• We give a convergence analysis for our algorithm that refines and strengthens the analysis in Bertsekas (2011).\n• We show that the SON formulation (1) provides strong cluster recovery guarantees that is far more general than previously known recovery results, essentially similar to the recently discovered unifying center separation conditions.\n• We give experimental results giving evidence that our algorithm produces clusters of comparable quality to previous methods but scales much better to large scale problems."
  }, {
    "heading": "2. Related Work",
    "text": "The SON formulation first appeared in (Lindsten et al., 2011) and in closely related forms in Hocking et al. (Hocking et al., 2011). Lindsten et al (Lindsten et al., 2011) used an off–the–shelf convex solver, CVX to generate solution paths. Hocking et al. (Hocking et al., 2011) introduced three distinct algorithms for the three most commonly encountered norms. For the `1 norm, the objective function separates, and they solve the convex clustering problem by the exact path following method designed for the fused lasso. For the `1 and `2 norms, they employ subgradient descent in conjunction with active sets. Neither provides any theoretical results on cluster recovery. Chi et al (Chi & Lange, 2015; Chen et al., 2015) introduce two similar generic frameworks for minimizing the convex clustering objective function with an arbitrary norm. One approach solves the problem by the alternating direction method of multipliers (ADMM), while the other solves it by the alternating minimization algorithm (AMA). The first (and only) theoretical results on cluster recovery are in (Zhu et al., 2010) but this is a very simple special case of exactly two cube shaped clusters that are well separated. This work also does not develop a specialized algorithm for the SON formulation."
  }, {
    "heading": "3. Cluster Recovery",
    "text": "To express our results, we first review few definitions: Definition 1. Take a finite set X = {x1, x2, . . . , xn} ⊂ Rm and its partitioning V = {V1, V2, . . . , VK}, where each\nVk is a subset of X . We say that a map φ on X perfectly recovers V when φ(xi) = φ(xj) is equivalent to xi, xj belonging to the same cluster, or in other words, there exist distinct vectors v1, v2, . . . , vK such that φ(xi) = vα holds whenever xi ∈ Vα. Definition 2. For any set S ⊂ Rm, its diameter is defined as\nD(S) = sup{‖x− y‖2 | x, y ∈ S}.\nMoreover, for any finite set T ⊂ Rm we define its separation as\nd(T ) = min{‖x− y‖2 | x, y ∈ S, x 6= y}\nand its Euclidean centroid as\nc(T ) =\n∑ x∈T x\n|V | .\nFinally, for any family of mutually disjoint finite sets T = {Ti ⊂ Rm}, we define C(T ) = {c(Ti)}. Definition 3. Take a finite set X = {x1, x2, . . . , xn} ⊂ Rm and its partitioning V = {V1, V2, . . . , VK}. We call a partitioning W = {W1,W2, . . . ,WL} of X a coarsening of V if each partition Wl is obtained by taking the union of a number of partitions Vk. Further, W is called the trivial coarsening of V if W has exactly one element, i.e. W = {X}. Otherwise, it is called a non-trivial coarsening.\nBased on the above definitions, our result can be explained as follows:\nTheorem 1. Consider a finite set X = {xi ∈ Rm | i = 1, 2, ..., n} of vectors and its partitioning V = {V1, V2, . . . , VK}. Take the SON optimization in (1). Denote its optimal solution by {ūi} and define the map φ : xi → φ(xi) = ūi.\n1. If\nmax V ∈V\nD(V ) |V | ≤ λ ≤ d(C(V)) 2n √ K ,\nthen the map φ perfectly recovers V .\n2. If\nmax V ∈V\nD(V )\n|V | ≤ λ ≤ max V ∈V ‖c(X)− c(V )‖2 |X| − |V | ,\nthen the map φ perfectly recovers a non-trivial coarsening of V .\nProof. We introduce associated centroid optimization:\nmin {vα∈Rm}\n1\n2 K∑ i=1 ‖vα − cα‖22nα + λ ∑ α 6=β nαnβ‖cα − cα‖2\n(2)\nwhere\ncα =\n∑ i∈Vα xi\nnα\nWe prove the following results, which clearly imply Theorem 1:\n1. Suppose that for every α ∈ [K],\nmax i,j∈Vα\n‖xi − xj‖ nα ≤ λ.\nThen, ui = vα for i ∈ Vα is a global solution of the SON clustering.\n2. If all cαs are distinct and d2n√K ≥ λ where d = min α 6=β ‖cα − cβ‖, then all centroids vα are distinct.\n3. If max α ‖cα−c‖ n−nα ≥ λ where c = n∑ i=1 xi/n, then at least\ntwo centroids vα are distinct.\nTo prove the above, notice that the solution of the centroid optimization satisfies\ncα − vα = λ ∑ β nβzα,β\nwhere ‖zα,β‖ ≤ 1, zα,β = −zβ,α and whenever vα 6= vβ , the relation zα,β =\nvα−vβ ‖vα−vβ‖2 holds. Now, for the solution\nui = vα for i ∈ Vα, define\nz′ij = { zα,β α 6= β xi−xj λnα α = β ,\nwhere i ∈ Vα, j ∈ Vβ . It is easy to see that ‖z′ij‖2 ≤ 1, z′ij = −z′ji and whenever ui 6= uj , we have that z′ij = ui−uj ‖ui−uj‖2 . Further for each i,\nλ ∑ j z′i,j = λ ∑ β zα,βnβ + ∑ j∈Vα xi − xj nα\n= cα − vα + xi − cα = xi − vα = xi − ui This shows that the local optimality conditions for the SON optimization holds and proves item a.\nFor item b, denote the solution of the centroid optimization by vα(λ) and notice that the solution of SON consists of distinct elements vα = cα and is continuous at λ = 0. Hence, vα:s remain distinct in an interval λ ∈ [0, λ1). Take λ0 as the supremum of all possible λ1:s. Hence, the solution in λ ∈ [0, λ0) contains distinct element and at λ = λ0 contains two equal elements (otherwise, one can extend [0, λ0) to some [0, λ0+ ), which is against λ being supremum). Now, notice that for λ ∈ [0 λ0) the objective\nfunction is smooth at the optimal point. Hence, vα(λ) is differentiable and satisfies\nδ = [ dvα dλ ] α = H−1 ∂g ∂λ (3)\nwhere [. ]α and [. ]α,β denote block vectors and block matrices respectively. Moreover, H and g are the Hessian and the gradient of the objective function at the optimal point. It is possible, by explicitly expanding H and g, to show that ‖δ‖2 ≤ n √ K (see the supplementary material for more detailed derivations). Hence, ∥∥∥∥dvαdλ ∥∥∥∥ 2 ≤ ‖δ‖2 ≤ √ Kn\nThis yields for λ < λ0 to\n‖vα(λ)− vβ(λ)‖2 = ∥∥∥∥∥∥cα − cβ + λ∫\n0\n( dvα dλ − dvβ dλ ) dλ ∥∥∥∥∥∥ 2\n≥ ‖cα − cβ‖2 − λ∫\n0\n∥∥∥∥dvαdλ − dvβdλ ∥∥∥∥ 2 dλ\n≥ d− 2nλ √ K\nSince at λ = λ0, we have that vα = vβ for some α 6= β, we get that d − 2nλ0 √ K ≤ 0 or λ0 ≥ d/2n √ K. this proves item b.\nFor item c, Take a value of λ, where v1 = v2 = . . . = vK . It is simple to see that in this case vα = c. The optimality condition leads to\nc− cα = λ ∑ β 6=α zα,βnβ\nHence, ‖c− cα‖2 ≤ λ(n− nα). This proves item c.\nRemark 1. The study in Zhu et al. (2010) establishes some results for the special case of two clusters in rectangular boxes. In this special case, we observe that our result improves theirs.\nProof. Consider the notation in Zhu et al. (2010) with two clusters V1, V2 and notice that λ = α/2 (α denotes regularization parameter in Zhu et al. (2010)). Moreover, D(Vi) ≤ ‖si‖ as ‖si‖ is the diameter of the rectangle surrounding Vi. We observe that\nw1,2 n ≥ D(Vi)\n2n3−i ( ni−1 n2i ) + 1\nn3−i + ni ≥ D(Vi) ni\nfor i = 1, 2, which shows that the condition λ ≥ w1,2n in Zhu et al. (2010) is tighter than λ ≥ maxD(V )/|V | in ours. On the other hand,\n‖c(Vi)− c(X)‖ n− ni = ‖c(Vi)− c(V1)n1+c(V2)n2n1+n2 ‖ n− ni\n= ‖c(V1)− c(V2)‖2\nn (4)\n= d(C(V))\nn\nHence, the condition λ ≤ d(C(V))n in Zhu et al. (2010) is the same as our condition λ ≤ ‖c(Vi)−c(X)‖n−ni .\nRemark 2. The second result in Theorem 1 reflects a hierarchical structure in the SON clusters: Under weaker condition than the first part, SON may merge some clusters and provide larger clusters than the true ones. In a recursive way, SON clustering can be applied to each of these large clusters to refine them, which improves the guarantees in Theorem 1. We postpone careful study of this method to future work."
  }, {
    "heading": "3.1. Comparison with Center Separation Conditions",
    "text": "Recently, there have been a number of theoretical results of the form that if we have data points generated by a mixture of K probability distributions, then one can cluster the data points into the K clusters, one corresponding to each component, provided the means of the different components are well–separated. There are different notions of well-separated, but mainly, the (best known) results can be qualitatively stated as: “If the means of every pair of densities are at least poly(K) standard deviations apart, then we can learn the mixture in polynomial time.”. These results generally make heavy use of the generative model and particular properties of the distributions (Indeed, many of them specialize to Gaussians or independent Bernoulli trials).\nKumar and Kannan (A. Kumar, 2010) and Awasthi and Sheffet (P.Awasthi, 2012) unified these into a general deterministic condition which can be roughly stated as follows: “If the means of every pair of clusters are at least Ω(K) times standard deviations apart, then we can learn the mixture in polynomial time.” Here the spectral norm of the matrix A − C scaled by 1√\nn plays the role of standard\ndeviation, whereA is the data matrix and C is the matrix of cluster centers. More formally, for any two distinct clusters α, β,\n‖c(Vα)− c(Vβ)‖2 ≥ K (\n1 √ nα + 1 √ nβ\n) ‖A− C‖ (5)\nOur condition is similar in spirit:\n‖c(Vα)− c(Vβ)‖2 ≥ √ K\n( n\nnα d(Vα)\n) (6)\nIf nα ≥ wn for all clusters α, then this becomes\n‖c(Vα)− c(Vβ)‖2 ≥ √ K\nw d(Vα). (7)\nIn the sequel, we specialize the above discussion in a number of examples and provide an explicit comparison of our result with the center separation condition. In some cases, our condition is slightly tighter than the center separation guarantees, but we remind that the latter is obtained by applying K-means and a SVD-based initialization, which can be intractable in large problems, while our techniques scales with the problem size more suitably."
  }, {
    "heading": "3.1.1. MIXTURES OF GAUSSIANS",
    "text": "Suppose we have a mixture of K Gaussians in d dimensions with mixture weights w1, · · · , wK , let w := mini wi and let µ1, · · · , µK denote their means respectively. If we have n = Ω(poly(d/w)) points sampled from this mixture distribution, then with high probability, the center separation condition is satisfied if:\n‖µr − µs‖ ≥ cKσ√ w polylog(d/w).\nHere σ is the maximum variance in any direction of any of the Gaussians. Our cluster recovery condition (7) is satisfied if:\n‖µr − µs‖ ≥ cKσ\nw polylog(n)."
  }, {
    "heading": "3.1.2. PLANTED PARTITION MODEL",
    "text": "In the planted partition model of McSherry, a set of n points is implicitly partitioned into K groups. There is an (unknown) K ×K matrix of probabilities P . We are given a graph G on these n points, where an edge between two vertices from groups r and s is present with probability Pr,s. We can consider these n points x1, · · · , xn ∈ Rn where coordinate j in xi is 1 if (i, j) ∈ G and 0 otherwise. The center µr of cluster r has in coordinate j the value Pr,ψ(j), where ψ(j) is the cluster vertex j belongs to. Kumar and Kannan show that the center separation condition holds with probability at least 1− δ if:\n‖µr − µs‖ ≥ cσ2K( 1\nw + log\nn δ )\nwhere c is a large constant, w is such that every group has size at least w · n and σ2 := maxr,s Pr,s. Our center separation condition (7) is satisfied if:\n‖µr − µs‖ ≥ c σ2K\nw\n√ n"
  }, {
    "heading": "3.1.3. REGULAR AND DIRECTED CLUSTERS",
    "text": "Besides the stochastic models, we take a closer look at the result in A. Kumar (2010) and identify deterministic cases where the SON has better performance than the proved bounds for K-means. These cases essentially guarantee that the term ‖A−C‖ in (5) remains large and the bound therein becomes highly restrictive:\nDefinition 4. We say that a partition V = {V1, V2, . . . , VK} of X = {x1, x2, . . . , xn} is (δ, γ)−expanded if\n|{x ∈ V | ‖x− c(V )‖2 ≥ δ}| ≥ γ|V |.\nWe further say that this partition is (w,D, , γ)-regular if for all V ∈ V we have D(V ) ≥ D, |V | ≥ wn and it is ( D, γ)−expanded. Definition 5. We say that a set X = {x1, x2, . . . , xn} is θ−directed if there exists a unit vector v ∈ Rm such that∑\nx∈X\\{c(X)}\n|vT (x− c(X))|2\n‖x− c(X)‖22 ≥ θ|X|\nFor a (w,D, , γ)-regular partition, the bound in (5) implies d(C(V)) ≥ 2cK D √ γn√\nmwn . This is because\n‖A− C‖2 = σmax ( n∑ i=1 δiδ T i ) ≥\nTr (\nn∑ i=1 δiδ T i ) m\n=\nn∑ i=1 ‖δi‖22\nm = γ 2D2\nn\nm\n(8)\nwhere δi = xi − c(Vα) for i ∈ Vα. Notice that our conditions can be implied by d(C(V)) ≥ 2nD √ K\nwn . Hence,SON can improve K-means if m ≤ wKc2γ 2, which means that the number of clusters K is large and the smallest fraction of cluster size w is Ω(1).\nIf the (w,D, , γ)-regular partition is further θ−directed we may improve the previous bounds as\nσmax ( n∑ i=1 δiδ T i ) ≥ ∑ x∈X |vT δi|2 ≥ γ 2D2nθ\nHence (5) implies d(C(V)) ≥ 2cK D √ γθn√\nwn . This means that\nSON improves K-means if wK ≥ 1c2 2γθ , i.e. the number of clusters is higher than a fixed value."
  }, {
    "heading": "4. Stochastic Splitting Algorithm",
    "text": "Our implementation is identical to the so-called proximalbased incremental technique in Bertsekas (2011), which is\nperformed in a way that it requires little amount of calculations (precisely O(m) and independent of other parameters) in each iteration. The proximal-based incremental method is a variant of the stochastic gradient technique, in problems where many terms in the objective function are not differentiable, and the local gradient steps are replaced by local proximal operators. To perform the proximalbased incremental method, we first write the SON objective function as\nΦ(u1, u2, . . . , un) = ∑ i<j φij(ui, uj)\nwhere\nφij(ui, uj) = 1\n2n ‖xi−ui‖22+\n1\n2n ‖xj−uj‖22+λ‖ui−uj‖.\nThen, we introduce and explicitly calculate the proximal operator Π(µ)ij of φij with step size µ as\nΠ (µ) ij (ui, uj) =\narg min u′i,u ′ j\nφij(u ′ i, u ′ j) + 1 2µ‖u ′ i − ui‖22 + 12µ‖u ′ j − uj‖22\n= Tλµ(ui + µxi, uj + µxj), (9)\nwhere we also introduce the pairwise soft-thresholding operator Tη(y, z) ={ (\ny + η z−y‖z−y‖2 , z + η y−z ‖y−z‖2 ) ‖y − z‖ ≥ 2η(\ny+z 2 , y+z 2\n) ‖y − z‖ < 2η ,\n(10) and the final equality is obtained by the local optimality conditions and straightforward calculations. Our algorithm simply consists in iteratively applying randomly selected proximal operators. This is depicted in Algorithm 1.\nAlgorithm 1 Stochastic Splitting Algorithm Input: The data vectors {xk}nk=1 and step sizes {µk}∞k=1 Initialization: Set u1, u2, . . . , un arbitrarily (we use u1 = u2 = . . . = un = 0) for k = 1, 2, . . . do\nSelect a pair (i, j) with i < j uniformly randomly. Update (ui, uj)← Π(µk)ij (ui, uj)\nend for"
  }, {
    "heading": "4.1. Convergence Analysis",
    "text": "Convergence of proximal-based incremental method is discussed in Bertsekas (2011). We further elaborate on the convergence by further exploitation of the nonexpansiveness property of proximal operators. This allows us to complement the result in Bertsekas (2011) in the following two directions: First, we establish convergence in\nthe probability sense (uniform convergence), while the result in Bertsekas (2011) is pointwise. Second, we prove guaranteed speed of convergence with probability one. We present these results by the following theorem. In this theorem, we consider fixed data dimensionm and bounded data vectors (i.e. ‖xk‖ ≤ C for some absolute constant C). Theorem 2.\n1. Assume that {µk} is non-increasing ∞∑ 0 µk = ∞ and\n∞∑ 0 µ2k < ∞. Then, the sequence Uk converges to Ũ in the following strong probability sense:\n∀ > 0; lim k→∞ Pr ( sup l≥k ‖Ul − Ũ‖2F > ) = 0 (11)\n2. Take µk = µ1kα for k = 1, 2, . . . and 2 3 < α < 1. For\nsufficiently small values of > 0 the relation ‖Ul − Ũ‖2F = O ( n4\nl3α−2− ) holds for every l, n with probability 1.\nProof. We skip many steps in our proof for lack of space. These steps can be found in the supplement. Denote by Uk a matrix where the ith column is the value of ui at the kth iteration. Define\nψµ(U) = E (Uk+1 | Uk = U, µk = µ) , (12)\nStarting from Ū0 = U0 (the initialization of the algorithm), we define the characteristic sequence {Ūk}∞k=0 by the following iteration:\nŪk+1 = ψµk(Ūk)\nOur proof is based on the following two results, which we prove in the supplementary material:\ni We have that\nPr ( sup k ‖Uk − Ūk‖2F + ∞∑ l=k µ2l > λ ) ≤ ∞∑ k=0 µ2k λ\n(13)\nii Define Ũ as the unique optimal solution of the SON optimization and suppose that {µk} is a non-increasing sequence. There exists a universal constant a such that ‖Ūk − Ũ‖2F is upper bounded by\na k−1∑ l=0 µ2l e − 2 n2 k−1∑ s=l+1 µs + ‖U0 − Ũ‖2Fe − 2 n2 k−1∑ s=0 µs\nTo prove Theorem 2, define Uk = {Ūkl }∞l=0 as the sequence obtained by starting from Ūk0 = Uk and applying\nŪkl+1 = ψµl+k(Ū k l )\nTake arbitrary (non-zero) positive numbers , δ. Take λ such that λ ≥ 2δ ∞∑ l=0 µ2l . Take some values l0, k which we specialize later. Now, we define two outcomes H1 and H2:\nH1 : ∀k ≥ 0; ‖Uk − Ũ‖2F ≤ λ\nH2 : ∀l ≥ 0; ‖Ūkl −Ul+k‖ ≤\n4\nFrom item (i), it is simple to see that Pr(Hc1) and Pr(H c 2) are less than δ/2. Furthermore we can show by (ii) that under H1 ∩H2 and suitable l0, k:\n∀l > l0; ‖Ul+k−Ũ‖22 ≤ 2(‖Ul+k−Ūkl ‖2F+‖Ūkl −Ũ‖2F)\n≤ 2( 4 + 4 ) =\nThis is detailed in the supplement. We conclude that\nPr( sup l>l0+k\n‖Ul − Ũ‖22 > ) ≤ Pr(Hc1) + Pr(Hc2) ≤ δ\nwhich proves part (1) of Theorem.\nFor part (2), define kr = rγ , λr = r−β , where γ = 1− 2 1−α , β < γ(2α− 1)− 1, and the outcomes:\nQr : sup l≥0 ‖Ul+kr − Ū kr l ‖ 2 F > λr.\nBy item (i), we have that ∞∑ r=1 Pr(Qr) < ∞. Hence by Borel-Cantelli lemma, Qcr0 , Q c r0+1, Q c r0+2, . . . simultaneously hold for some r0 with probability 1. For simplicity and without loss of generality, we assume that r0 = 0 as it does not affect the asymptotic rate. Then for any r > 0, we have that\nsup l≥0 ‖Ul+kr − Ū kr l ‖ 2 F ≤ λr\nIn particular,\n‖Ukr+1 − Ū kr lr ‖2F ≤ λr\nwhere lr = kr+1 − kr. From item (ii), we also conclude that\n‖Ūkrlr − Ũ‖ 2 F ≤ A lr−1∑ t=0\n1 (t+ kr)2α e −2a\nlr−1∑ s=t+1 1 (s+kr)α\n+‖Ukr − Ũ‖2Fe −2a\nlr−1∑ s=0 1 (s+kr)α\nwhere we introduce µ1 = bn2 and A = 4an4b2 for simplicity. This leads to\n‖Ukr+1 − Ũ‖2F ≤ LeLk 1−α r −Lk 1−α r+1 ‖Ukr − Ũ‖2F+\n2λr +A lr∑ t=0\n1\n(t+ kr)2α eL(kr+t)\n1−α−Lk1−αr+1\nwhere L is a suitable constant with different values at different occurrences. Postponing few more steps to the supplementary material, we obtain that\n‖Ukr − Ũ‖2F ≤ L log r rβ− 2 ≤ L rβ−\nTake kr < l ≤ kr+1. We obtain that\n‖Ul − Ũ‖22 ≤ 2(‖Ukr − Ũ‖22 + ‖Ukr −Ul‖22)\n≤ 2λr + L rβ− ≤ L rβ− ≤ L l β− γ\nBy taking β = γ(2α− 1)− 1, we obtain part (2)."
  }, {
    "heading": "5. Experiments",
    "text": "We evaluate the proposed stochastic splitting algorithm in the task of clustering points generated by Gaussians mixture models. We compare the results to the exact algorithm proposed by Lindsten et al. (2011) in terms of a) the quality of the produced clustering and b) the time spent solving the optimization problem. The results of both algorithms are dense embeddings of the points that are then thresholded to form clusters. The clusters are the largest subsets of nodes such that the maximum pairwise distance within the subset is less than τ . The stochastic splitting algorithm is implemented as in Algorithm 1. We observed in practice\nthat a heuristic for adaptively setting the step-size improved robustness and rate of convergence. Specifically, the step size was reduced by a constant factor whenever the average change in the objective over successive rounds in a small window was positive. If the same average was negative, but small in absolute value, the step size was increased by a small constant factor.\nThe data is generated from Gaussian mixture models with two components in R2 where the means are separated by d = √\n2 and the variance σ2 is varied. The number of samples is also varied, to illustrate the computational gains of the stochastic splitting method. As pointed out by Lindsten et al. (2011), the choice of the regularization parameter λ is perhaps the most challenging hurdle in applying SON clustering. Choosing λ too high might result in a single large cluster, and choosing it too low may cause each point to be represented by its own cluster. While this problem is of great importance in applications, we focus on the relative performance of the Lindsten et al. (2011) algorithm (CVX) and stochastic splitting (SS). We report the adjusted Rand index (Rand, 1971) as measure of cluster quality, and would like to emphasize that this does not rely on identifying the number of clusters beforehand.\nResults The results of the experiments are presented in Figures 1 and 2. We see in Figure 1 that the quality of the clustering produced by the stochastic splitting algorithm is comparable to that of the exact algorithm. This pattern is consistant across choices of σ, where a high σ implies low sample separation between the clusters. We also note that the range of λ for which the stochastic splitting algorithm achieves as good result as the exact algorithm is less wide than for the exact. We believe this is due to the stochastic nature of the algorithm which makes the resulting embedding clusters less separated than in the exact version. Deviations from the optimal embedding could be magnified by the thresholding step, effectively making the stochastic algorithm more sensitive to the choice of threshold, and in effect the quality more sensitive to the choice of λ. In these\nexperiments, the same threshold was used for both algorithms, but tailored choices could be considered given an appropriate selection criterion.\nFurthermore, we see in Figure 2 that the running time of the stochastic splitting algorithm is lower than that of the exact algorithm, and grows significantly slower. While the stochastic splitting algorithm could in principle be implemented in time constant in the number of samples, and instead determined by the number of iterations, the adaptive stepsize used to improve performance requires evaluation of the objective value which scales with the number of samples. This could be improved by subsampling the terms in the objective function, but this was not done here."
  }, {
    "heading": "6. Conclusions",
    "text": "We developed a stochastic incremental algorithm based on proximal iterations for the SON convex relaxtion of clustering that is highly suited to large scale problems and gave an analysis of its convergence propertis. We also gave quite general theoretical guaranteees for exact recovery of clusters similar to the unifying proximity condition in approximation algorithms that covers paradigm models for clustering data.\nIt has not escaped our attention that our algorithm can easily be adapted to incorporate similarity weights as used in Chi & Lange (2015); Chen et al. (2015); Hocking et al. (2011) and that it is amenable to acceleration using variance reduction and other techniques. The cluster recovery conditions can also be extended to cover almost perfect recovery i.e. correctly clustering all except a small fraction of points. A more complete experimental evaluation of our algorithm and comparison to others will be included in a longer version of the paper."
  }, {
    "heading": "Acknowledgements",
    "text": "This work is supported in part by the Swedish Foundation for Strategic Research (SSF)."
  }],
  "year": 2017,
  "references": [{
    "title": "Clustering with spectral norm and the kmeans algorithm",
    "authors": ["A. Kumar", "R. Kannan"],
    "venue": "In FOCS,",
    "year": 2010
  }, {
    "title": "Optimization with sparsity-inducing penalties",
    "authors": ["F. Bach", "R. Jenatton", "J. Mairal", "G. Obozinski"],
    "venue": "Foundation and Trends in Machine Learning,",
    "year": 2012
  }, {
    "title": "Incremental proximal methods for large scale convex optimization",
    "authors": ["D. Bertsekas"],
    "venue": "Math. Program.,",
    "year": 2011
  }, {
    "title": "Optimization methods for large-scale machine learning",
    "authors": ["Bottou", "Léon", "Curtis", "Frank E", "Nocedal", "Jorge"],
    "venue": "Technical report,",
    "year": 2016
  }, {
    "title": "Convex clustering: An attractive alternative to hierarchical clustering",
    "authors": ["Chen", "Gary K", "Chi", "Eric C", "Ranola", "John M.O", "Lange", "Kenneth"],
    "venue": "PLoS Computational Biology,",
    "year": 2015
  }, {
    "title": "Splitting methods for convex clustering",
    "authors": ["Chi", "Eric C", "Lange", "Kenneth"],
    "venue": "Journal of Computational and Graphical Statistics,",
    "year": 2015
  }, {
    "title": "A fast incremental gradient method with support for non-strongly convex composite objectives",
    "authors": ["A. Defazio", "F.F. Bach", "S. Lacoste-Julien"],
    "venue": "In NIPS,",
    "year": 2014
  }, {
    "title": "Clusterpath: an algorithm for clustering using convex fusion penalties",
    "authors": ["T. Hocking", "Vert", "J-P", "F. Bach", "A. Joulin"],
    "venue": "In ICML,",
    "year": 2011
  }, {
    "title": "Data clustering: A review",
    "authors": ["A.K. Jain", "M.N. Murty", "P.J. Flynn"],
    "venue": "ACM Comput. Surv.,",
    "year": 1999
  }, {
    "title": "Accelerating stochastic gradient descent using predictive variance reduction",
    "authors": ["R. Johnson", "T. Zhang"],
    "venue": "In NIPS,",
    "year": 2013
  }, {
    "title": "Clustering using sum-ofnorms regularization: With application to particle filter output computation",
    "authors": ["F. Lindsten", "H. Ohlsson", "L. Ljung"],
    "year": 2011
  }, {
    "title": "Improved spectral norm bounds for clustering",
    "authors": ["P.Awasthi", "O Sheffet"],
    "venue": "In APPROX-RANDOM,",
    "year": 2012
  }, {
    "title": "Objective criteria for the evaluation of clustering methods",
    "authors": ["Rand", "William M"],
    "venue": "Journal of the American Statistical association,",
    "year": 1971
  }, {
    "title": "Minimizing finite sums with the stochastic average gradient",
    "authors": ["M. Schmidt", "Roux", "N. Le", "F. Bach"],
    "venue": "Mathematical Programming,",
    "year": 2016
  }, {
    "title": "Convex optimization procedure for clustering: Theoretical revisit",
    "authors": ["C. Zhu", "H. Xu", "C. Leng", "S. Yan"],
    "venue": "In NIPS,",
    "year": 2010
  }],
  "id": "SP:c72b2e3ef1e5c7c8ea4ff45c61d265b62f03c3de",
  "authors": [{
    "name": "Ashkan Panahi",
    "affiliations": []
  }, {
    "name": "Devdatt Dubhashi",
    "affiliations": []
  }, {
    "name": "Fredrik D. Johansson",
    "affiliations": []
  }, {
    "name": "Chiranjib Bhattacharyya",
    "affiliations": []
  }],
  "abstractText": "Standard clustering methods such as K–means, Gaussian mixture models, and hierarchical clustering, are beset by local minima, which are sometimes drastically suboptimal. Moreover the number of clustersK must be known in advance. The recently introduced sum–of–norms (SON) or Clusterpath convex relaxation of k-means and hierarchical clustering shrinks cluster centroids toward one another and ensure a unique global minimizer. We give a scalable stochastic incremental algorithm based on proximal iterations to solve the SON problem with convergence guarantees. We also show that the algorithm recovers clusters under quite general conditions which have a similar form to the unifying proximity condition introduced in the approximation algorithms community (that covers paradigm cases such as Gaussian mixtures and planted partition models). We give experimental results to confirm that our algorithm scales much better than previous methods while producing clusters of comparable quality.",
  "title": "Clustering by Sum of Norms: Stochastic Incremental Algorithm, Convergence and Cluster Recovery"
}