{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Data privacy has become an increasingly important issue in the age of data science. Differential Privacy (DP), proposed in 2006 by Dwork et al.,(Dwork et al., 2006), provide a solid foundation and rigorous standard for private data analysis. Since then, there has been extensive literature studying the fundamental trade-offs between differential privacy and accuracy for query answering (Hardt & Rothblum, 2010; Hardt et al., 2012; Thaler et al., 2012; Wang\n*Equal contribution 1Key Laboratory of Machine Perception, MOE, School of EECS, Peking University, Beijing, China. Correspondence to: Kai Zheng <zhengk92@pku.edu.cn>, Wenlong Mou <mouwenlong@pku.edu.cn>, Liwei Wang <wanglw@cis.pku.edu.cn>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\net al., 2016), machine learning (Chaudhuri & Monteleoni, 2008; Chaudhuri et al., 2011; Rubinstein et al., 2012; Wang et al., 2015), and statistical inference (Lei, 2011; Smith, 2011). For more details on DP results, please refer to the excellent monograph written by Dwork and Roth (Dwork & Roth, 2014). Intuitively, a DP algorithm uses randomized response to defend against adversary, so that change of one of data points could not be detected.\nDespite the prevailing success of this notion in academia, its applicability in data science practice could be limited. For example, if data analysts just promise to follow the differential privacy constraints, user will not feel their privacy are preserved. The promise could not be validated; the mechanisms are complicated; and even worse: users do not trust the data collector at all. Unfortunately, most of differential privacy algorithms are based on adding noise calibrated to stability of loss function, which essentially requires access to original data.\nBorrowing ideas from classical wisdom on collecting sensitive survey data (Warner, 1965), Local Differential Privacy (LDP) (Kasiviswanathan et al., 2008; Duchi et al., 2013b) was proposed as a stronger notion of privacy to resolve this problem. LDP requires each of data points to be passed through a noisy channel during collection. This channel will ensure one can hardly tell anything about the user based on what he have sent. The practical advantage of LDP is obvious: users will be comfortable sending their sensitive information through noisy channels, which are transparent and reliable; additionally, users can choose their own privacy parameters, making it possible to associate with economic value. Therefore, this line of research has attracted lots of attention (Duchi et al., 2013a;b; Kairouz et al., 2014; Bassily & Smith, 2015; Kairouz et al., 2016).\nDespite the analogy in definition, the way in which LDP achieves accurate results are fundamentally different from classical DP. Essentially, the information collected from each user is almost completely noisy, from which one needs to obtain accurate results. The only way to do that is to make the independently distributed noise cancel out with each other in some sense. With sand being washed away by waves, golds begin to appear.\nTwo local privacy notions have been discussed in existing literature: the interactive model allows the algorithm to collect data sequentially, and decide what to ask based on information from previously asked users. The non-interactive model, on the contrary, requires all data to be collected at once, with no interactive queries allowed. Apparently the non-interactive model is strictly stronger, and prohibition on interactive queries rules out most of SGD-type approaches, making the problem significantly harder. However, non-interactive LDP is more useful in real-world applications, as opportunities of interactive queries may not be available in most settings.\nIn existing literature, learning and inference under interactive and non-interactive LDP therefore are exhibiting different appearances. In the interactive world, LDP is promised with connection to Statistical Query (SQ) model (Kearns, 1998), from its very beginning (Kasiviswanathan et al., 2011). SQ algorithms for a wide range of convex ERM problems were proposed by (Feldman et al., 2017), implying good risk bounds for LDP. (Duchi et al., 2013b) established matching upper and lower bounds for convex risk minimization problems. On the other hand, very few has been done in the non-interactive setting. Existing works primarily focus on basic estimation problems such as means and discrete densities (Duchi et al., 2013a; 2016; Bassily & Smith, 2015), or some function calculations (Kairouz et al., 2015b). Most of important modern learning and inference tasks, including estimation in linear models and convex ERM, are still poorly understood in non-interactive local DP settings.\nFor the high-dimensional world, where d n while some low-complexity constraints are imposed, we may hope the error induced by privacy constraints to be logarithmically dependent upon d. In classical differential privacy literature, this has been be addressed using different techniques, guarantee error bounds logarithmically dependent on dimension (Talwar et al., 2015; Smith & Thakurta, 2013). However, lower bounds have been shown in local privacy model even for high-dimensional 1-sparse mean estimation, ruling out any good guarantees (Duchi et al., 2016). The lower bound result illustrates fundamental difficulties of local differential privacy. But if we still want to do highdimensional learning under local privacy, are there additional assumptions that helps?\nTherefore, the starting point of this work lies on making learning possible under the non-interactive LDP setting, which is the hardest yet the most useful. We initiate the first attempt towards a broad range of learning tasks beyond simple distribution estimation. In particular, we investigate two important classes of problems under non-interactive LDP: (1) High-dimensional sparse linear regression and mean estimation; (2) Generalized linear models. Our fo-\ncus is to design corresponding mechanisms and study their convergence rates with respect to the number and dimension of data. One can also consider optimal mechanisms in terms of privacy parameters like (Geng & Viswanath, 2014), which is of independent interests.\nOur Contributions: In this paper, we propose several efficient algorithms for learning and estimation problems under non-interactive LDP model, with good theoretical guarantees. In the following we summarize our contributions.\n(1) High Dimensional Estimation: One of exciting findings in this paper is about local privacy for highdimensional data. Roughly speaking, convergence rate with logarithmic dependence on the dimension can be attained under LDP, if we assume data points are `2 bounded. This is in sharp contrast with information-theoretic lower bounds for 1-sparse mean estimation for `∞ bounded data (Duchi et al., 2016). Valid algorithms are presented for both sparse mean estimation and sparse linear regression, respectively. Intuitively, non-interactivity doesn’t bring about additional difficulties, since the loss functions are quadratic forms. However, if we directly add noise to each of data points and send it to the server, the aggregated noise will lead to linear dependence on the dimension. Thus we adopt the random projection technique, and send the noisy version of projected data to the server. Based on the aggregated information, we can approximately recover the optimal solution via linear inverse problem.\n(2) Learning Smooth Generalized Linear Models: Generalized linear problems which has additional smooth properties (we call the loss with respect to it as smooth generalized linear loss (SGLL), see rigorous definition in section 2) include many common loss functions, such as logistic loss, square loss, etc. Optimizing such losses are intuitively much more difficult in non-interactive LDP model, as the loss can be an arbitrary function wTx. This even makes it difficult for us to obtain an unbiased estimator for objective function, or its gradient. As a result, when we aggregate the loss of noisy data together, it is even hard to ensure it converge to the population loss. Approximation theory techniques are introduced to tackle this problem. In particular, we use polynomials of wTx to approximate nonlinear coefficients of gradients. Chebyshev bases, instead of Taylor series, are used to get faster convergence within an arbitrary domain. Then we are able to build inexact stochastic gradient oracles to arbitrarily specified accuracy. SIGM algorithm in (Dvurechensky & Gasnikov, 2016) is exploited to find the minimizer with inexact gradients.\nOther Related Work: Local privacy dates back to (Warner, 1965), who uses random responses to protect privacy in surveys. In recent LDP literature, both (Duchi et al., 2013a) and (Kairouz et al., 2016) studied density estimation methods and their theoretical behaviors in\nLDP model. Rather than statistical setting in above two work, (Bassily & Smith, 2015) considered how to produce frequent items and corresponding frequencies of a dataset in local model. Besides, (Kairouz et al., 2014) investigated optimality of LDP mechanisms based on information theoretical measures for statistical discrimination.\nApproximation techniques are commonly used in DP literature. (Thaler et al., 2012) employed polynomials for marginal queries. (Wang et al., 2016) leveraged trigonometric polynomials to answer smooth queries. (Zhang et al., 2012) also used polynomial approximations and get basic convergence results in standard DP model. Besides, the random projection and recovery has also been used in DP learning (Kasiviswanathan & Jin, 2016) and local DP histogram estimation (Bassily & Smith, 2015).\nIn standard DP model, both high-dimensional sparse estimation and generalized linear model have been intensively studied. (Kifer et al., 2012) and (Smith & Thakurta, 2013) considered the convergence of private LASSO estimator under RSC and incoherence assumptions. (Talwar et al., 2015) considered constrained ERM of sparse linear regression, and obtained Õ(log d/n2/3) rate using private Frank-Wolfe. Above results assume `∞-bounded data. By stronger assumption of `2 bounded data, (Kasiviswanathan & Jin, 2016) gave a general framework for high dimensional empirical risk minimization (ERM) problem. There are several works to estimate generalized linear model under DP, with a particular emphasis on logistic regression. Objective and output perturbation are used to get low excess risks (Chaudhuri & Monteleoni, 2008; Chaudhuri et al., 2011). Both (Bassily et al., 2014) and (Zhang et al., 2017) considered concrete private algorithms to solve ERM. None of these existing results extends directly to non-interactive LDP setting."
  }, {
    "heading": "2. Preliminaries",
    "text": "Some notations: [p] = {1, 2, · · · , p}. Vectors are written in bold symbol, such as x,w. x represents univariate number, which has no relation with x. For a vector x = [x1, x2, · · · , xd]T , xk represents the power of each element. B2(r) = {x| ‖x‖2 6 r}. Denote S+ as the semipositive matrix space, ProjS+(·) means projecting a matrix to S+ in terms of Frobenius norm (i.e. eliminate all negative eigenvalues). For an univariate function f(x), f (k)(x) represents its k-th derivative, and define∥∥f (k)∥∥ T := ∫ 1 −1 |f(k+1)(x)|√\n1−x2 dx. For the reason of limited space, all omitted proof can be found in the supplementary."
  }, {
    "heading": "2.1. Local Differential Privacy",
    "text": "Here we adopt the LDP definition given in (Bassily & Smith, 2015).\nDefinition 1. A mechanismQ : V → Z is said to be ( , δ)local differential private or ( , δ)-LDP, if for any v,v′ ∈ V , and any (measurable) subset S ⊂ Z , there is\nPr[Q(v) ∈ S] 6 e Pr[Q(v′) ∈ S] + δ\nJust the same with basic results in DP (Dwork & Roth, 2014), there are corresponding basic results for LDP: Lemma 1 (Gaussian Mechanism). If V = {v ∈ Rd| ‖v‖2 6 1}, then Q(v) = v + e is ( , δ)-LDP, where e ∈ Rd, and e ∼ N (0, σ2Id), σ = 2 √ 2 ln(1.25/δ)/ . Lemma 2 (Composition Theorem1). Let Qi : V → Zi be an ( i, δi)-LDP mechanism for i ∈ [k]. Then if Q[k] : V →∏k i=1Zi is defined to be Q[k](v) = (Q1(v), . . . ,Qk(v)),\nthen Q[k] is ( ∑k i=1 i, ∑k i=1 δi)-LDP.\nThe following simple mechanism add Gaussian noise to preserve LDP of a vector, which serves as a basic tool in LDP learning and estimation.\nAlgorithm 1 Basic Private Vector mechanism Input: A vector x ∈ Rd, privacy parameter , δ for LDP Output: Private vector z\n1: Setting σ = √ 2 ln(1.25/δ) 2: if ‖x‖2 > 1 then 3: x = x/ ‖x‖2 4: end if 5: z ← x+ e, where e ∼ N (0, σ2Id)\nTheorem 1. Algorithm 1 preserves ( , δ)-LDP."
  }, {
    "heading": "3. High Dimensional and Non-parametric Learning via Random Projections",
    "text": "In this section we consider three learning problems under non-interactive LDP: Mean Estimation and Linear Regression in High-dimensions, as well as Kernel Ridge Regression. Using random projection techniques, we are able to get logarithmic dependence on d in high-dimensional settings, and also to get good guarantees for Kernel version. The first problem is considered in statistical settings, as we need to assume a sparse mean vector. The latter two problems are considered as ERM problems, which can easily be translated to population risk using uniform convergence."
  }, {
    "heading": "3.1. High-dimensional Mean Estimation",
    "text": "In this section, we propose a non-interactive LDP mechanism for high-dimensional sparse mean estimation problem. By assuming `2 bounded data points, and `1 bounded\n1Note one can also use the advanced composition mechanism (Kairouz et al., 2015a) with a refined analysis, but the main dependence over n and d will remain nearly the same.\npopulation mean, we can get error rates with logarithmic dependence on d. Our results are in sharp contrast with the lower bound for `2-bounded general mean estimation under standard DP (Bassily et al., 2014), as well as the lower bound for `∞-bounded 1-sparse mean estimation under local DP (Duchi et al., 2016). It can be easily seen that our method extends to mean estimation problem for arbitrary low-complexity constraint set in high dimensions. We state our results in `1 setting to keep the arguments clear. Our problem adopts a statistical estimation setting as follows:\n`2-bounded sparse mean estimation Suppose there is an unknown distribution D supported on B(0, 1), with ‖ED(x)‖1 ≤ Λ. The `2-bounded sparse mean estimation problem requires us to produce an estimator θ̂ that makes ‖θ − ED(x)‖2 small with high probability.\nAlgorithm 2 LDP `1 Constrained Mean Estimation Input: x1,x2, · · · ,xn ∼ i.i.d.D Output: Estimator z\nSet p = dΛ √ ne, and m = d18 log 1δ e Sample G ∼ 1√pN (0, 1) p×d. for User i do Collect yi = Gxi + ri, with ri ∼ i.i.d.N (0, 2 log(1.25/δ) 2 Ip) end for for j ∈ {1, 2, · · · ,m} do Sj = { 1 + (j−1)nm , 2 + (j−1)n m , · · · , jn m } .\nLet µj = 1|Sj | ∑ i∈Sj yi.\nend for LetM = {µ1,µ2, · · · ,µm}. for j ∈ {1, 2, · · · ,m} do\nLet rj = min { r : |B`1(µj , r) ∩M| ≥ m2 } .\nend for Let j∗ = arg minj rj , and u = µj∗ Solve the following convex program:\narg min z ‖z‖1\ns.t.‖Gz − u‖1 ≤ 100p log(nd/δ)\n√ m\nn\n(1)\nIn Algorithm 2 we describe our data collection procedure and estimation algorithm. We are primarily using two techniques: random projection and recovery from lowcomplexity structures; median-of-mean estimator to boost failure probability. The privacy argument is directly implication of Theorem 1.\nIntuitively, adding noise to each entry of mean vector will result in error rate’s linear dependence on d. Thus we adopt the random projection technique to send a compressed version of data vector through the noisy chan-\nnel. This locally private estimation procedure can be viewed as a variant of noisy compressed sensing, where `2 recovery rate is fundamentally controlled by the Gaussian Mean Width of constraint set (Vershynin, 2015). Though the distribution has bounded support, the concentration for mean estimation is dimension-dependent, while dimension-independent Markov Inequalities hold. To tackle this problem, we employ Median-of-Mean estimator to get exponential tails (Hsu & Sabato, 2016).\nWe first give the following bound on the error in projected space.\nLemma 3. Let x1,x2, · · · ,xn ∼ i.i.d.D with µ = ED[x] and supp(D) ⊆ B(0, 1). Let G and {yi}ni=1 defined in the above procedure. For each of group Sj fixed, we have the following with probability 2/3:∥∥∥ 1|Sj | ∑\nyi∈Sj\nyi −Gµ ∥∥∥ 1 ≤ O ( p log(nd) √ |Sj | ) (2)\nThe aggregation step in Algorithm 2 is a high-dimensional generalization of Median-of-Mean estimator used in heavy-tailed statistics. The tail properties are guaranteed in the following lemma:\nLemma 4 (Proposition 9 in (Hsu & Sabato, 2016)). Suppose in metric space X , a set of points M = [θ1,θ2, · · · ,θm] ∼ i.i.d.D, with Pr[dX (θi,θ) ≥ ] ≤ 23 . Let θ̂ be generated from the following procedure: ri = min { r : |BX (θi, r) ∩M| ≥ m2 } ,and θ̂ = arg minθi ri. Then we have:\nPr[dX (θ̂,θ) ≥ 3 ] ≤ e− m 18\nSince the original data are i.i.d. samples from underlying distribution, small group with fixed indices should also be i.i, d.. Therefore µ1,µ2, · · · ,µk are i.i.d.. Combining Lemma 3 and Lemma 4 we get the following result:\nCorollary 1. The vector u constructed in Algorithm 2 satisfies the following with probability 1− δ:\n‖u−Gµ‖1 ≤ O ( p log(nd/δ) √ m\nn\n) (3)\nThen we turn to the recovery of original mean estimator. The primary tool we are using are General M∗ bound in (Vershynin, 2015).\nLemma 5 (Theorem 6.2 in (Vershynin, 2015), High Probability Version). For unknown vector x ∈ K ⊆ Rd, let G ∼ 1√pN (0, 1)\np×d. Noisy vector ν ∈ Rp with ‖ν‖1 ≤ σ. Let y = Gx + ν. By solving the following optimization problem:\narg min x′ ‖x′‖K s.t. ‖Gx′ − y‖1 ≤ σ (4)\nwhere ‖·‖K denotes the Minkowski functional of K. Then we can get the following with probability 1− δ\n‖x− x′‖2 ≤ O ( w(K) + σ + log 1δ√\np ) where w(K) denotes the Gaussian width of K.\nBy putting these results together we get the bound on estimation loss:\nTheorem 2. Algorithm 2 outputs z satisfying the following with probability 1− δ:\n‖z − µ‖2 ≤ O ( log nd\nδ\n√ log 1\nδ\n( Λ2\n2n\n) 1 4 )"
  }, {
    "heading": "3.2. Sparse Linear Regression",
    "text": "In this section, we consider empirical loss of sparse linear regression, i.e. L(w;D) = 12n ∑n i=1(x T i w − yi)2, where D = {(xi, yi)|i ∈ [n]}, ‖xi‖2 6 1, yi ∈ [−1, 1]. 2.\nDefine w∗ = argminw∈C L(w;D), where C = {w| ‖w‖1 6 1}. We want to obtain a vector wpriv ∈ C within non-interactive LDP model, such that the empirical excess risk L(wpriv;D) − L(w∗;D) has polynomial dependences on log d and 1n .\nAs in the case of high-dimensional mean estimation, directly manipulating in the original high dimensional feature space will introduce large noise, hence we use a subGaussian random matrix Φ ∈ Rm×d to project original data (i.e. vectors in Rd) into the low dimensional space (i.e. Rm) first, then perturb each data in low dimensional space (i.e. Basic Private Vector mechanism given in Algorithm 1) which protects local privacy, and send it to the server.\nHaving obtained private synopsis, the server then reconstruct an unbiased estimator for objective function according to these private synopsis. We subtract a quadratic term to ensure unbiasedness and project to PSD matrices to preserve convexity. To show good approximation guarantee, we make use of RIP bounds for random projection. As the loss function is determined by inner products between w and data, it could be uniformly preserved in projected space, which guarantees the accuracy of solution estimated with local privacy. Apparently, our methods also imply bounds with general low-complexity constraint set that preserves RIP.\nOur private learning mechanism is given in Algorithm 3 and any random projection matrix can be used here. The privacy argument directly follows from Private Vector Mechanism and composition.\n2Our methods suits to any radius of x and y.\nAlgorithm 3 LDP `1 Constrained Linear Regression Input: Personal data (x, y), parameter , δ, projection ma-\ntrix Φ ∈ Rd×m Output: Learned classifier wpriv ∈ Rd\n1: for Each user i = 1, . . . , n do 2: zi ← Basic Private Vector (ΦTxi, /2, δ/2) 3: vi ← Basic Private Vector (yi, /2, δ/2) 4: end for 5: Setting Z = [z1, · · · , zn]T , σ = 2 √ 2 ln(2.5/δ)\n, Q = ProjS+(Z\nTZ − nσ2Im),v = [v1, · · · , vn]T 6: wpriv ← argminw∈C L̂(w;Z,v), where L̂(w;Z,v) := 12n (Φ Tw)TQ(ΦTw)− 1nv TZΦTw\nIn fact, as original data is in L2 ball, and random projection preserves norms with high probabilty, hence steps 2-4 in Algorithm 1 will be executed with very low probability.\nDenote the true objective function in low dimensional space L̄(w; X̄,y) := 12n ∥∥X̄ΦTw∥∥2 − 1nyT X̄ΦTw, where X̄ = [x1, · · · ,xn]TΦ,w ∈ C. Let ŵ∗ := argminw∈C L̄(w; X̄,y). The following lemma gives the accuracy of private solution wpriv when reduced into low dimensional space:\nLemma 6. Under the assumptions made in this section, given projection matrix Φ, with high probability over the randomness of private mechanism, we have\nL̄(wpriv; X̄,y)− L̄(ŵ∗; X̄,y) 6 Õ (√ m\nn 2\n) (5)\nNow, combined with RIP bound for random projection, we can move on to prove the empirical excess risk of sparse linear regression: Theorem 3. Under the assumption in this section, setm = Θ (√ n 2 log d ) , then with high probability , there is\nL(wpriv)− L(w∗) = Õ\n(( log d\nn 2\n)1/4)\nNote (Talwar et al., 2015) assume data is in L∞ ball, while both (Kasiviswanathan & Jin, 2016) and ours assume data is in L2 ball. However, in LDP model, (Duchi et al., 2016) show it was impossible to obtain polynomial dependences over log d for `0 mean estimation problem if data is in L∞ ball."
  }, {
    "heading": "3.3. Infinite Dimension: Kernel Ridge Regression",
    "text": "Previous method mainly applies to data with finite dimensional features. However, it is common to use kernel trick in practice. This brings about new difficulties for LDP learning, as we could not add noise in the Hilbert space.\nIn this subsection, we take kernel ridge regression as an example to show how to use Random Fourier Features (RFF) (Rahimi et al., 2007) to deal with such cases caused by shift-invariant kernels (i.e. k(x,y) = k(x − y)). Note our technique also suits to similar problems.\nFix a shift-invariant kernel k(·, ·), denote the Hilbert space implicitly defined asH , and the corresponding feature map as Φ : Rd → H . Let the Hilbert space corresponding to the random Fourier feature map be Ĥ ⊂ Rdp , and its feature map Φ̂ : Rd → Ĥ , where dp is the RFF projection dimension. Given a subset X ⊂ Rd and data D = {(xi, yi)|xi ∈ X , i ∈ [n]}, for any f ∈ H, g ∈ Ĥ , define loss functions in H and Ĥ as follows:\nLH(f) := C\n2n ∑ i ∥∥fTΦ(xi)− yi∥∥22 + 12 ‖f‖2H (6) LĤ(g) := C\n2n ∑ i ∥∥∥gT Φ̂(xi)− yi∥∥∥2 2 + 1 2 ‖g‖2Ĥ (7)\nwhere C is the regularization parameter. Denote f∗ = argminf∈H LH(f), g\n∗ = argming∈Ĥ LĤ(g), G as the Lipschitz constant of square loss, which depends on the bounded norm of features. Kernel ridge regression try to optimize formula (6), while after using RFF, we try to solve formula (7) in non-interactive LDP model, which can be easily tackled with similar mechanisms like sparse linear regression above. Borrow the key result in (Rubinstein et al., 2012) (restated in lemma 7 below), which used RFF to design private mechanims for SVM in DP model, it becomes easy to prove guarantees for kernel ridge regression in our setting (see Corollary 2).\nLemma 7 ((Rubinstein et al., 2012)). Suppose dual variables with respect to f∗, g∗ are L1 norm bounded by some r > 0, and supx1,x2∈X |Φ(x1)\nTΦ(x2) − (Φ̂(x1))\nT Φ̂(x2)| 6 γ, then there is supx∈X |Φ(x)T f∗ − (Φ̂(x))T g∗| 6 rγ + 2 √ (CG+ r/2)rγ.\nCorollary 2. Algorithm 4 satisfies ( , δ)-LDP, and by setting dp = Õ (√ dn 2 ) , with high probability, there is\nLĤ(ŵ priv)−LH(f∗) 6 Õ\n(( d\nn 2\n)1/4)\nsup x∈X |Φ(x)T f∗−(Φ̂(x))T ŵpriv| 6 Õ\n(( d\nn 2\n)1/8)"
  }, {
    "heading": "4. Learning Smooth Generalized Linear Model",
    "text": "In this section, we consider learning smooth generalized linear model in non-interactive LDP setting. Noninteractive LDP learning for this problem is essentially difficult, as it is even hard to obtain an unbiased estimator of\nAlgorithm 4 LDP kernel mechanism Input: Personal data (xi, yi), i ∈ [n], random feature’s\ndimension dp, shift-invariant kernel k(x1,x2) = k(x1 − x2) with Fourier transform f(s) = 1 2π ∫ e−js\nTxk(x)dx, privacy parameter , δ Output: Private output ŵpriv ∈ Rdp\n1: Draw i.i.d. samples s1, s2, . . . , sdp ∈ Rd from f(s) and b1, b2, . . . , bdp ∈ R from the uniform distribution on [0, 2π] 2: for i = 1, . . . , n do 3: Construct low dimensional random feature Φ̂(xi) =√\n1 dp [ cos(sT1 xi + b1), . . . , cos(s T dp xi + bdp) ]′ ∈\nĈ := [ − √ 1 dp , √ 1 dp ]dp ⊂ Rdp\n4: zi ← Basic Private Vector (Φ̂(xi), /2, δ/2) 5: vi ← Basic Private Vector (yi, /2, δ/2) 6: end for 7: Setting Z = [z1, · · · , zn]T , σ = 2 √ 2 ln(2.5/δ)\n, Q = ProjS+(Z TZ − nσ2Idp),v = [v1, · · · , vn]T\n8: ŵpriv ← argminŵ L̂(ŵ;Z,v), where L̂(ŵ;Z,v) := 12nŵ TQŵ − 1nv TZŵ\ngradient. We resolve this problem using Chebyshev polynomial expansion, which requires additional smoothness assumptions. Fortunately these assumptions are naturally satisfied by a broad range of learning tasks.\nWe will first define the Smooth GLM loss family with appropriate assumptions. Our definition could be shown with connection to exponential family GLM, which is commonly used in machine learning. We also illustrate our algorithm and guarantees with logistic regression.\nDefinition 2. (Absolutely Smooth Functions) We say that an univariate function h(x) is absolutely smooth, if for any r > 0, f(x) := h(rx) satisfies the following properties: there exist functions µ1(k; r), µ2(k; r), which are polynomial on k and µ2(k; r) = O(kr), such that for any k ∈ N+, there is:\n(1) f(x), f ′(x), . . . , f (k−1)(x) are absolutely continuous on [−1, 1];\n(2) ∥∥f (k)(x)∥∥\nT 6 µ1(k; r) · µ2(k; r)k.\nDefinition 3. (Smooth Generalized Linear Loss, SGLL) A loss function `(w;x, y), is called smooth generalized linear loss, if for any given data (x, y), `(w;x, y) is convex and β-smooth with respect tow, and there exist absolutely smooth functions h1(x), h2(x), such that `(w;x, y) = −yh1(xTw) + h2(xTw).\nIt will be convenient to consider population risk directly. Now, we adopt standard setting of learning problems,\nwhere each data point (x, y) is drawn from some underlying unknown distribution D and ‖x‖2 6 1. Given a SGLL `(w;x, y), the population loss is defined as L(w) := E(x,y)∼D`(w;x, y). For simplicity, instead of assuming w belongs to B2(r), we use the following equivalent notation: `(w;x, y) = −yh1(rxTw) + h2(rx\nTw), and the constraint set for w is C = B2(1). Denote G(w;x, y) = ∇`(w;x, y) = rm(w;x, y)x, where m(w;x, y) = h′2(rx\nTw) − yh′1(rxTw). Suppose E(x,y)∼D[‖G(w;x, y)− g(w)‖ 2 2] 6 σ 2 0 , where g(w) = ∇L(w). This is a common assumption in stochastic optimization literature, such as (Bubeck et al., 2015).\nGiven any α > 0, we hope to design a noninteractive local DP mechanism with low sample complexity, such that the final output point wpriv satisfies L(wpriv)− L(w∗) 6 α.\nFor GLM loss functions, it is easy to see that the stochastic gradient evaluated on w with data point xi is at the same direction with xi. So adding isotropic noise to xi provides ”unbiased” information about direction of stochastic gradient. However, the magnitude is a nonlinear function of wTxi, making it hard for SGD even to converge to population minimizer. This is why we seek to find polynomial approximation of the magnitude of gradients.\nTo estimate the magnitude of gradients, we use Chebyshev polynomials to approximate nonlinear univariate function fi(x) = h ′ i(rx), where x ∈ [−1, 1]. For brevity of notations, we just use f(x) to represent either f1(x) or f2(x). Denote the Chebyshev approximation with degree p as f̂p(x) = 12 + ∑p k=1 akTk(x), where Tk(x) is the k-\nth Chebyshev polynomial, and ak = 2π ∫ 1 −1 f(x)Tk(x)√ 1−x2 dx is the corresponding coefficient. According to existing results about Chebyshev approximations and some calculations, we have the following lemma:\nLemma 8. Given any α > 0, by setting k = c ln 1α , p = dk+ eµ2(k; r)e, where c is a constant, we have∥∥∥f̂p(x)− f(x)∥∥∥\n∞ 6 α\nThe Chebyshev approximations with degree p for fi(x) (i = 1, 2) are denoted as f̂ip(x) = 12 + ∑p k=1 aikTk(x) =∑p\nk=0 cikx k, where cik is the coefficient of term xk. Now\nwe approximate m(w;x, y) and G(w;x, y) as follows:\nm̂(w;x, y) :=− yf̂1p(rxTw) + f̂2p(rxTw)\n= p∑ k=0 (c2k − c1ky)(rxTw)k\nĜ(w;x, y) :=rm̂(w;x, y)x\nWith these approximations, we state our mechanism in Algorithm 5, where Basic Private Vector mechanism is given\nin Algorithm 1. Note an important trick in Step 6-8 of Algorithm 5, is that: we run basic private mechanism p times, to obtain fresh private copies of the same vector x, which are then used to calculate an unbiased estimation of Ĝ(w;x, y) with variance as low as possible (i.e. line 8 in Algorithm 6).The LDP property of Algorithm 5 is given as follows: The privacy proof directly follows from Basic\nAlgorithm 5 LDP SGLD Mechanism - Collection Input: Personal data (x, y), expansion order p, privacy pa-\nrameter , δ Output: Private synopsis b = {zyi, zj |i ∈ {0} ∪ [p], j ∈\n[p(p+ 1)/2]} sent to the server 1: Setting y = 4(p+1) , δy = δ 4(p+1) , 1 = p(p+1) , δ1 =\nδ p(p+1)\n2: z0 ← Basic Private Vector(x, /4, δ/4) 3: for i = 0, 1, . . . , p do 4: zyj ← Basic Private Vector(y, y, δy) 5: end for 6: for j = 1, . . . , p(p+1)2 do 7: zj ← Basic Private Vector(x, 1, δ1) 8: end for\nVector Mechanism and Composition Theorem.\nTheorem 4. LDP SGLD Mechanism 5 preserves ( , δ)LDP.\nHaving obtained the private synopsis sent by all uers, now the server can construct a stochastic inexact gradient oracle (defined in Defintion 4) for any point w ∈ C, as stated in Algorithm 6.\nDefinition 4. (Dvurechensky & Gasnikov, 2016) For an objective function f(w), a (γ, β, σ) stochastic oracle returns a turple (Fγ,β,σ(w; ξ), Gγ,β,σ(w; ξ)), such that:\nEξ[Fγ,β,σ(w; ξ)] = fγ,β,σ(w) Eξ[Gγ,β,σ(w; ξ)] = gγ,β,σ(w)\nEξ[‖Gγ,β,σ(w; ξ)− gγ,β,σ(w)‖2] 6 σ2\n0 6 h(v,w) 6 β\n2 ‖v −w‖2 + γ,∀v,w ∈ C\nwhere h(v,w) = f(v)−fγ,β,σ(w)−〈gγ,β,σ(w),v −w〉.\nFor any (x, y) in the domain, as loss function `(w;x, y) is convex and β-smooth with respect to w, we can prove the following lemma:\nLemma 9. For any γ > 0, setting k = c ln 4rγ , p = dk + 2µ2(k; r)e, then Algorithm 6 outputs a (γ, β, σ) stochastic oracle defined in Definition 4, where σ = Õ ( σ0 + γ + p2p+1(4r)p+1 p+2 ) .\nAlgorithm 6 LDP SGLD Mechanism - Learning Input: Private synopsis b = {zy, zj |j ∈ {0} ∪ [p(p +\n1)/2]} of each user, public coefficients {c1k, c2k|k ∈ {0} ∪ [p]}, initial point w1 Output: Learned classifier wpriv 1: for s = 1, . . . , n do 2: \\\\ Construct stochastic inexact gradient 3: \\\\ Denote the private synopsis of user s as b above\nfor abbreviation 4: Set t0 = 1 5: for j = 1, . . . , p do 6: tj = ∏j(j+1)/2 i=j(j−1)/2+1(w T s zi) 7: end for\n8: G̃(ws; b)← ( p∑ k=0 (c2k − c1kzyj)tkrk+1 ) z0\n9: \\\\ One update via SIGM 10: Run one iteration of SIGM algorithm with G̃(ws, b) and obtain ws+1 11: end for 12: Set wpriv := wn+1\nBased on above (γ, β, σ) stochastic oracle, and the algorithm proposed in SIGM paper (Dvurechensky & Gasnikov, 2016) (omitted here, due to the limitation of space), our complete learning algorithm is given in Algorithm 6. Before proving our sample complexity, we state the basic convergence result of SIGM algorithm:\nLemma 10 ((Dvurechensky & Gasnikov, 2016)). Assume a function f(w) (suppose constrain set is W) is endowed with a (γ, β, σ) stochastic oracle, then the sequence wk (corresponds to yk in the original paper) generated by the SIGM algorithm satisfies:\nE[f(wk)]− f(w∗) 6 O ( σ√ k + γ ) where expectation is over the randomness of the stochastic oracle and w∗ = argminw∈W f(w).\nThe accuracy results directly follows from the quality of inexact stochastic gradient oracle we constructed, and the convergence result of SIGM.\nTheorem 5. Consider smooth generalized linear loss. For any setting α > 0, by setting γ = α2 , k = c ln 4r γ , p = dk + 2µ2(k; r)e in Algorithm 5, 6, if\nn > O ( ( 8r\nα )4r ln ln(8r/α)\n( 4r )2cr ln(8r/α)+2( 1\nα2 2\n)) ,\nwe can achieve loss guarantee L(wpriv)− L(w∗) 6 α\nAs we can see, learning in non-interactive LDP model is more difficult than interactive form, especially when loss is\nhighly nonlinear, we even can not obtain an unbiased estimation either for objective function or gradients. However, our method shows it possible to learn smooth GLM with quasi-polynomial sample complexity."
  }, {
    "heading": "4.1. Example: Learning Logistic Regression",
    "text": "Either from the view of exponential family generalized linear model or the concrete loss function, it is not difficult to see logistic loss belongs to SGLL. For example, in logistic regression, `(w;x, y) = log(1 + e−yw Tx) =\n− ( y 2w Tx ) + ( 1 2w Tx+ ln(1 + e−w Tx) ) . So we let h1(x) = x 2 , h2(x) = x 2 +ln(1+e\n−x). As we know logistic loss is convex and β-smooth for some parameter β, and the absolutely smooth property of linear function is obvious, hence once we prove f(x) = ln(1 + e−x) is absolutely smooth, then logistic loss satisfies the definition of SGLL.\nProposition 1. f(x) = ln(1 + e−x) is absolutely smooth with µ1(k; r) = r √ 4kπ3, µ2(k; r) = rk e\nHence, we can use private mechanisms (5,6) to learn logistic regression.\nTheorem 6. Consider Logistic regression problem with `(w;x, y) = log(1 + exp(−ywTx)) For any α > 0, by setting γ = α2 , k = c ln 4r γ , p = dk + 2µ2(k; r)e,\nif n > O (\n( 8rα ) 4r ln ln(8r/α)\n( 4r )2cr ln(8r/α)+2 ( 1 α2 2 )) in\nAlgorithm 5, 6, we can achieve L(wpriv)− L(w∗) 6 α."
  }, {
    "heading": "5. Conclusions",
    "text": "In this paper, we consider how to design efficient algorithms for common learning and estimation problems under non-interactive LDP model. In particular, for sparse linear regression and mean estimation problem, we propose efficient algorithms and prove the polynomial dependence of excess risk or square error over log d and 1n , which is exactly to be expected in high dimensional case. We also extend our methods to nonparametric case and show good bounds for Kernel Ridge Regression.\nFor more difficult smooth generalized linear loss optimization problems, we use private Chebyshev approximations to estimate gradients of the objective loss, combined with existing inexact gradient descent methods to obtain final outputs. The sample complexity of our mechanism is quasi-polynomial with respect to 1α , where α is the desired population excess risk.\nAn interesting open problem is whether our theoretical guarantees are optimal. If not, how to improve them while preserving the efficiency in non-interactive LDP model. We think these problems are critical to understand LDP in the future."
  }, {
    "heading": "Acknowledgments",
    "text": "This work was partially supported by National Basic Research Program of China (973 Program) (grant no. 2015CB352502), NSFC (61573026). We would like to thank the anonymous reviewers for their valuable comments on our paper."
  }],
  "year": 2017,
  "references": [{
    "title": "Local, private, efficient protocols for succinct histograms",
    "authors": ["Bassily", "Raef", "Smith", "Adam"],
    "venue": "In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing,",
    "year": 2015
  }, {
    "title": "Private empirical risk minimization: Efficient algorithms and tight error bounds",
    "authors": ["Bassily", "Raef", "Smith", "Adam", "Thakurta", "Abhradeep"],
    "venue": "In Foundations of Computer Science (FOCS),",
    "year": 2014
  }, {
    "title": "Privacy-preserving logistic regression",
    "authors": ["K. Chaudhuri", "C. Monteleoni"],
    "venue": "In Conference on Neural Information Processing Systems, British Columbia,",
    "year": 2008
  }, {
    "title": "Differentially private empirical risk minimization",
    "authors": ["K. Chaudhuri", "C. Monteleoni", "A.D. Sarwate"],
    "venue": "The Journal of Machine Learning Research,",
    "year": 2011
  }, {
    "title": "Local privacy and minimax bounds: Sharp rates for probability estimation",
    "authors": ["Duchi", "John", "Wainwright", "Martin J", "Jordan", "Michael I"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Minimax optimal procedures for locally private estimation",
    "authors": ["Duchi", "John", "Wainwright", "Martin", "Jordan", "Michael"],
    "venue": "arXiv preprint arXiv:1604.02390,",
    "year": 2016
  }, {
    "title": "Local privacy and statistical minimax rates",
    "authors": ["Duchi", "John C", "Jordan", "Michael I", "Wainwright", "Martin J"],
    "venue": "In Foundations of Computer Science (FOCS),",
    "year": 2013
  }, {
    "title": "Stochastic intermediate gradient method for convex problems with stochastic inexact oracle",
    "authors": ["Dvurechensky", "Pavel", "Gasnikov", "Alexander"],
    "venue": "Journal of Optimization Theory and Applications,",
    "year": 2016
  }, {
    "title": "Calibrating noise to sensitivity in private data analysis",
    "authors": ["C. Dwork", "F. McSherry", "K. Nissim", "A. Smith"],
    "venue": "In Theory of cryptography,",
    "year": 2006
  }, {
    "title": "The optimal mechanism in differential privacy",
    "authors": ["Geng", "Quan", "Viswanath", "Pramod"],
    "venue": "In Information Theory (ISIT),",
    "year": 2014
  }, {
    "title": "A multiplicative weights mechanism for privacy-preserving data analysis",
    "authors": ["M. Hardt", "G.N. Rothblum"],
    "venue": "In IEEE Symposium on Foundations of Computer Science,",
    "year": 2010
  }, {
    "title": "A simple and practical algorithm for differentially private data release",
    "authors": ["M. Hardt", "K. Ligett", "F. Mcsherry"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2012
  }, {
    "title": "Loss minimization and parameter estimation with heavy tails",
    "authors": ["Hsu", "Daniel", "Sabato", "Sivan"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }, {
    "title": "Extremal mechanisms for local differential privacy",
    "authors": ["Kairouz", "Peter", "Oh", "Sewoong", "Viswanath", "Pramod"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2014
  }, {
    "title": "The composition theorem for differential privacy",
    "authors": ["Kairouz", "Peter", "Oh", "Sewoong", "Viswanath", "Pramod"],
    "venue": "In Proceedings of The 32nd International Conference on Machine Learning,",
    "year": 2015
  }, {
    "title": "Secure multi-party differential privacy",
    "authors": ["Kairouz", "Peter", "Oh", "Sewoong", "Viswanath", "Pramod"],
    "venue": "In Advances in Neural Information Processing Systems, pp. 2008–2016,",
    "year": 2015
  }, {
    "title": "Discrete distribution estimation under local privacy",
    "authors": ["Kairouz", "Peter", "Bonawitz", "Keith", "Ramage", "Daniel"],
    "venue": "In Proceedings of The 33rd International Conference on Machine Learning,",
    "year": 2016
  }, {
    "title": "What can we learn privately",
    "authors": ["S.P. Kasiviswanathan", "H.K. Lee", "K. Nissim", "S. Raskhodnikova", "A. Smith"],
    "venue": "In IEEE Symposium on Foundations of Computer Science,",
    "year": 2008
  }, {
    "title": "What can we learn privately",
    "authors": ["Kasiviswanathan", "Shiva Prasad", "Lee", "Homin K", "Nissim", "Kobbi", "Raskhodnikova", "Sofya", "Smith", "Adam"],
    "venue": "SIAM Journal on Computing,",
    "year": 2011
  }, {
    "title": "Efficient noise-tolerant learning from statistical queries",
    "authors": ["Kearns", "Michael"],
    "venue": "Journal of the ACM (JACM),",
    "year": 1998
  }, {
    "title": "Private convex empirical risk minimization and highdimensional regression",
    "authors": ["Kifer", "Daniel", "Smith", "Adam", "Thakurta", "Abhradeep"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2012
  }, {
    "title": "Differentially private m-estimators",
    "authors": ["J. Lei"],
    "venue": "In Advances in Neural Information Processing Systems, pp",
    "year": 2011
  }, {
    "title": "Random features for large-scale kernel machines",
    "authors": ["Rahimi", "Ali", "Recht", "Benjamin"],
    "venue": "In NIPS,",
    "year": 2007
  }, {
    "title": "Learning in a large function space: Privacy-preserving mechanisms for svm learning",
    "authors": ["B. Rubinstein", "P.L. Bartlett", "L. Huang", "N. Taft"],
    "venue": "Journal of Privacy and Confidentiality,",
    "year": 2012
  }, {
    "title": "Privacy-preserving statistical estimation with optimal convergence rates",
    "authors": ["A. Smith"],
    "venue": "In ACM Symposium on Theory of Computing,",
    "year": 2011
  }, {
    "title": "Differentially private model selection via stability arguments and the robustness of the lasso",
    "authors": ["Smith", "Adam", "Thakurta", "Abhradeep"],
    "venue": "J Mach Learn Res Proc Track,",
    "year": 2013
  }, {
    "title": "Nearly optimal private lasso",
    "authors": ["Talwar", "Kunal", "Thakurta", "Abhradeep", "Zhang", "Li"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Faster algorithms for privately releasing marginals",
    "authors": ["J. Thaler", "J. Ullman", "S. Vadhan"],
    "venue": "In International Colloquium on Automata, Languages, and Programming,",
    "year": 2012
  }, {
    "title": "Estimation in high dimensions: a geometric perspective",
    "authors": ["Vershynin", "Roman"],
    "venue": "In Sampling theory, a renaissance,",
    "year": 2015
  }, {
    "title": "Privacy for free: Posterior sampling and stochastic gradient monte carlo",
    "authors": ["Y. Wang", "S.E. Fienberg", "A.J. Smola"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2015
  }, {
    "title": "Differentially private data releasing for smooth queries",
    "authors": ["Z. Wang", "C. Jin", "K. Fan", "J. Zhang", "J. Huang", "Y. Zhong", "L. Wang"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }, {
    "title": "Randomized response: A survey technique for eliminating evasive answer bias",
    "authors": ["Warner", "Stanley L"],
    "venue": "Journal of the American Statistical Association,",
    "year": 1965
  }, {
    "title": "Efficient private erm for smooth objectives",
    "authors": ["Zhang", "Jiaqi", "Zheng", "Kai", "Mou", "Wenlong", "Wang", "Liwei"],
    "venue": "arXiv preprint arXiv:1703.09947,",
    "year": 2017
  }, {
    "title": "Functional mechanism: regression analysis under differential privacy",
    "authors": ["Zhang", "Jun", "Zhenjie", "Xiao", "Xiaokui", "Yang", "Yin", "Winslett", "Marianne"],
    "venue": "Proceedings of the VLDB Endowment,",
    "year": 2012
  }],
  "id": "SP:f158a0828c9956f2888f9aaa4f71c94c28c40a82",
  "authors": [{
    "name": "Kai Zheng",
    "affiliations": []
  }, {
    "name": "Wenlong Mou",
    "affiliations": []
  }, {
    "name": "Liwei Wang",
    "affiliations": []
  }],
  "abstractText": "Non-interactive Local Differential Privacy (LDP) requires data analysts to collect data from users through noisy channel at once. In this paper, we extend the frontiers of Non-interactive LDP learning and estimation from several aspects. For learning with smooth generalized linear losses, we propose an approximate stochastic gradient oracle estimated from non-interactive LDP channel using Chebyshev expansion, which is combined with inexact gradient methods to obtain an efficient algorithm with quasi-polynomial sample complexity bound. For the high-dimensional world, we discover that under `2-norm assumption on data points, high-dimensional sparse linear regression and mean estimation can be achieved with logarithmic dependence on dimension, using random projection and approximate recovery. We also extend our methods to Kernel Ridge Regression. Our work is the first one that makes learning and estimation possible for a broad range of learning tasks under noninteractive LDP model.",
  "title": "Collect at Once, Use Effectively: Making Non-interactive Locally Private Learning Possible"
}