{
  "sections": [{
    "text": "Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics, pages 325–335, Baltimore, Maryland, USA, June 23-25 2014. c©2014 Association for Computational Linguistics"
  }, {
    "heading": "1 Introduction",
    "text": "The ability to extract sentiment from text is crucial for many opinion-mining applications such as opinion summarization, opinion question answering and opinion retrieval. Accordingly, extracting sentiment at the fine-grained level (e.g. at the sentence- or phrase-level) has received increasing attention recently due to its challenging nature and its importance in supporting these opinion analysis tasks (Pang and Lee, 2008).\nIn this paper, we focus on the task of sentencelevel sentiment classification in online reviews. Typical approaches to the task employ supervised\nmachine learning algorithms with rich features and take into account the interactions between words to handle compositional effects such as polarity reversal (e.g. (Nakagawa et al., 2010; Socher et al., 2013)). Still, their methods can encounter difficulty when the sentence on its own does not contain strong enough sentiment signals (due to the lack of statistical evidence or the requirement for background knowledge). Consider the following review for example,\n1. Hearing the music in real stereo is a true reve-\nlation. 2. You can feel that the music is no longer\nconstrained by the mono recording. 3. In fact, it\nis more like the players are performing on a stage\nin front of you ...\nExisting feature-based classifiers may be effective in identifying the positive sentiment of the first sentence due to the use of the word revelation, but they could be less effective in the last two sentences due to the lack of explicit sentiment signals. However, if we examine these sentences within the discourse context, we can see that: the second sentence expresses sentiment towards the same aspect – the music – as the first sentence; the third sentence expands the second sentence with the discourse connective In fact. These discourse-level relations help indicate that sentence 2 and 3 are likely to have positive sentiment as well.\nThe importance of discourse for sentiment analysis has become increasingly recognized. Most existing work considers discourse relations between adjacent sentences or clauses and incorporates them as constraints (Kanayama and Nasukawa, 2006; Zhou et al., 2011) or features in classifiers Trivedi and Eisenstein (2013; Lazaridou et al. (2013). Very little work has explored long-distance discourse relations for sentiment analysis. Somasundaran et al. (2008) defines coreference relations on opinion targets and applies them to constrain the polarity of sentences.\n325\nHowever, the discourse relations were obtained from fine-grained annotations and implemented as hard constraints on polarity.\nObtaining sentiment labels at the fine-grained level is costly. Semi-supervised techniques have been proposed for sentence-level sentiment classification (Täckström and McDonald, 2011a; Qu et al., 2012). However, they rely on a large amount of document-level sentiment labels that may not be naturally available in many domains.\nIn this paper, we propose a sentence-level sentiment classification method that can (1) incorporate rich discourse information at both local and global levels; (2) encode discourse knowledge as soft constraints during learning; (3) make use of unlabeled data to enhance learning. Specifically, we use the Conditional Random Field (CRF) model as the learner for sentence-level sentiment classification, and incorporate rich discourse and lexical knowledge as soft constraints into the learning of CRF parameters via Posterior Regularization (PR) (Ganchev et al., 2010). As a framework for structured learning with constraints, PR has been successfully applied to many structural NLP tasks (Ganchev et al., 2009; Ganchev et al., 2010; Ganchev and Das, 2013). Our work is the first to explore PR for sentiment analysis. Unlike most previous work, we explore a rich set of structural constraints that cannot be naturally encoded in the feature-label form, and show that such constraints can improve the performance of the CRF model.\nWe evaluate our approach on the sentencelevel sentiment classification task using two standard product review datasets. Experimental results show that our model outperforms state-ofthe-art methods in both the supervised and semisupervised settings. We also show that discourse knowledge is highly useful for improving sentence-level sentiment classification."
  }, {
    "heading": "2 Related Work",
    "text": "There has been a large amount of work on sentiment analysis at various levels of granularity (Pang and Lee, 2008). In this paper, we focus on the study of sentence-level sentiment classification. Existing machine learning approaches for the task can be classified based on the use of two ideas. The first idea is to exploit sentiment signals at the sentence level by learning the relevance of sentiment and words while taking into account the context in which they occur: Nakagawa et\nal. (2010) uses tree-CRF to model word interactions based on dependency tree structures; Choi and Cardie (2008) applies compositional inference rules to handle polarity reversal; Socher et al. (2011) and Socher et al. (2013) compute compositional vector representations for words and phrases and use them as features in a classifier.\nThe second idea is to exploit sentiment signals at the inter-sentential level. Polanyi and Zaenen (2006) argue that discourse structure is important in polarity classification. Various attempts have been made to incorporate discourse relations into sentiment analysis: Pang and Lee (2004) explored the consistency of subjectivity between neighboring sentences; Mao and Lebanon (2007),McDonald et al. (2007), and Täckström and McDonald (2011a) developed structured learning models to capture sentiment dependencies between adjacent sentences; Kanayama and Nasukawa (2006) and Zhou et al. (2011) use discourse relations to constrain two text segments to have either the same polarity or opposite polarities; Trivedi and Eisenstein (2013) and Lazaridou et al. (2013) encode the discourse connectors as model features in supervised classifiers. Very little work has explored long-distance discourse relations. Somasundaran et al. (2008) define opinion target relations and apply them to constrain the polarity of text segments annotated with target relations. Recently, Zhang et al. (2013) explored the use of explanatory discourse relations as soft constraints in a Markov Logic Network framework for extracting subjective text segments.\nLeveraging both ideas, our approach exploits sentiment signals from both intra-sentential and inter-sentential context. It has the advantages of utilizing rich discourse knowledge at different levels of context and encoding it as soft constraints during learning.\nOur approach is also semi-supervised. Compared to the existing work on semi-supervised learning for sentence-level sentiment classification (Täckström and McDonald, 2011a; Täckström and McDonald, 2011b; Qu et al., 2012), our work does not rely on a large amount of coarse-grained (document-level) labeled data, instead, distant supervision mainly comes from linguisticallymotivated constraints.\nOur work also relates to the study of posterior regularization (PR) (Ganchev et al., 2010). PR has been successfully applied to many structured NLP\ntasks such as dependency parsing, information extraction and cross-lingual learning tasks (Ganchev et al., 2009; Bellare et al., 2009; Ganchev et al., 2010; Ganchev and Das, 2013). Most previous work using PR mainly experiments with featurelabel constraints. In contrast, we explore a rich set of linguistically-motivated constraints which cannot be naturally formulated in the feature-label form. We also show that constraints derived from the discourse context can be highly useful for disambiguating sentence-level sentiment."
  }, {
    "heading": "3 Approach",
    "text": "In this section, we present the details of our proposed approach. We formulate the sentence-level sentiment classification task as a sequence labeling problem. The inputs to the model are sentencesegmented documents annotated with sentencelevel sentiment labels (positive, negative or neutral) along with a set of unlabeled documents. During prediction, the model outputs sentiment labels for a sequence of sentences in the test document. We utilize conditional random fields and use Posterior Regularization (PR) to learn their parameters with a rich set of context-aware constraints.\nIn what follows, we first briefly describe the framework of Posterior Regularization. Then we introduce the context-aware constraints derived based on intuitive discourse and lexical knowledge. Finally we describe how to perform learning and inference with these constraints."
  }, {
    "heading": "3.1 Posterior Regularization",
    "text": "PR is a framework for structured learning with constraints (Ganchev et al., 2010). In this work, we apply PR in the context of CRFs for sentencelevel sentiment classification.\nDenote x as a sequence of sentences within a document and y as a vector of sentiment labels associated with x. The CRF model the following conditional probabilities:\npθ(y|x) = exp(θ · f(x,y)) Zθ(x)\nwhere f(x,y) are the model features, θ are the model parameters, and Zθ(x) = ∑ y exp(θ · f(x,y)) is a normalization constant. The objective function for a standard CRF is to maximize the log-likelihood over a collection of labeled doc-\numents plus a regularization term:\nmax θ L(θ) = max θ ∑ (x,y) log pθ(y|x)− ||θ|| 2 2 2δ2\nPR makes the assumption that the labeled data we have is not enough for learning good model parameters, but we have a set of constraints on the posterior distribution of the labels. We can define the set of desirable posterior distrbutions as\nQ = {q(Y) : Eq[φ(X,Y)] = b} (1) where φ is a constraint function, b is a vector of desired values of the expectations of the constraint functions under the distribution q 1. Note that the distribution q is defined over a collection of unlabeled documents where the constraint functions apply, and we assume independence between documents.\nThe PR objective can be written as the original model objective penalized with a regularization term, which minimizes the KL-divergence between the desired model posteriors and the learned model posteriors with an L2 penalty 2 for the constraint violations.\nmax θ L(θ)−min q∈Q {KL(q(Y)||pθ(Y|X))\n+ β||Eq[φ(X,Y)]− b||22} (2)\nThe objective can be optimized by an EM-like scheme that iteratively solves the minimization problem and the maximization problem. Solving the minimization problem is equivalent to solving its dual since the objective is convex. The dual problem is\narg max λ λ · b− logZλ(X)− 14β ||λ|| 2 2 (3)\nWe optimize the objective function 2 using stochastic projected gradient, and compute the learning rate using AdaGrad (Duchi et al., 2010)."
  }, {
    "heading": "3.2 Context-aware Posterior Constraints",
    "text": "We develop a rich set of context-aware posterior constraints for sentence-level sentiment analysis by exploiting lexical and discourse knowledge. Specifically, we construct the lexical constraints by extracting sentiment-bearing patterns\n1In general, inequality constraints can also be used. We focus on the equality constraints since we found them to express the sentiment-relevant constraints well.\n2Other convex functions can be used for the penalty. We use L2 norm because it works well in practice. β is a regularization constant\nwithin sentences and construct the discourse-level constraints by extracting discourse relations that indicate sentiment coherence or sentiment changes both within and across sentences. Each constraint can be formulated as equality between the expectation of a constraint function value and a desired value set by prior knowledge. The equality is not strictly enforced (due to the regularization in the PR objective 2). Therefore all the constraints are applied as soft constraints. Table 1 provides intuitive description and examples for all the constraints used in our model.\nLexical Patterns The existence of a polaritycarrying word alone may not correctly indicate the polarity of the sentence, as the polarity can be reversed by other polarity-reversing words. We extract lexical patterns that consist of polar words and negators 3, and apply the heuristics based on compositional semantics (Choi and Cardie, 2008) to assign a sentiment value to each pattern.\nWe encode the extracted lexical patterns along with their sentiment values as feature-label constraints. The constraint function can be written as\nφw(x, y) = ∑ i fw(xi, yi)\nwhere fw(xi, yi) is a feature function which has value 1 when sentence xi contains the lexical pattern w and its sentiment label yi equals to the expected sentiment value and has value 0 otherwise. The constraint expectation value is set to be the prior probability of associating w with its sentiment value. Note that sentences with neutral sentiment can also contain such lexical patterns. Therefore we allow the lexical patterns to be assigned a neutral sentiment with a prior probability r0 (we compute this value as the empirical probability of neutral sentiment in the training documents). Using the polarity indicated by lexical patterns to constrain the sentiment of sentences is quite aggressive. Therefore we only consider lexical patterns that are strongly discriminative (many opinion words in the lexicon only indicate sentiment with weak strength). The selected lexical patterns include a handful of seed patterns (such as “pros” and “cons”) and the lexical patterns that have high precision (larger then 0.9) of predicting sentiment in the training data.\n3The polar words are identified using the MPQA lexicon and the negators are identified using a handful of seed words extended by the General Inquirer dictionary and WordNet as described in (Choi and Cardie, 2008).\nDiscourse Connectives. Lexical patterns can be limited in capturing contextual information since they only look at interactions between words within an expression. To capture context at the clause or sentence level, we consider discourse connectives, which are cue phrases or words that indicate discourse relations between adjacent sentences or clauses. To identify discourse connectives, we apply a discourse tagger trained on the Penn Discourse Treebank (Prasad et al., 2008) 4 to our data. Discourse connectives are tagged with four senses: Expansion, Contingency, Comparison, Temporal.\nDiscourse connectives can operate at both intrasentential and inter-sentential level. For example, the word “although” is often used to connect two polar clauses within a sentence, while the word “however” is often used to at the beginning of the sentence to connect two polar sentences. It is important to distinguish these two types of discourse connectives. We consider a discourse connective to be intra-sentential if it has the Comparison sense and connects two polar clauses with opposite polarities (determined by the lexical patterns). We construct a feature-label constraint for each intra-sentential discourse connective and set its expected sentiment value to be neutral.\nUnlike the intra-sentential discourse connectives, the inter-sentential discourse connectives can indicate sentiment transitions between sentences. Intuitively, discourse connectives with the senses of Expansion (e.g. also, for example, furthermore) and Contingency (e.g. as a result, hence, because) are likely to indicate sentiment coherence; discourse connectives with the sense of Comparison (e.g. but, however, nevertheless) are likely to indicate sentiment changes. This intuition is reasonable but it assumes the two sentences connected by the discourse connective are both polar sentences. In general, discourse connectives can also be used to connect non-polar (neutral) sentences. Thus it is hard to directly constrain the posterior expectation for each type of sentiment transitions using inter-sentential discourse connectives.\nInstead, we impose constraints on the model posteriors by reducing constraint violations. We\n4http://www.cis.upenn.edu/˜epitler/ discourse.html\ndefine the following constraint function:\nφc,s(x, y) = ∑ i fc,s(xi, yi, yi−1)\nwhere c denotes a discourse connective, s indicates its sense, and fc,s is a penalty function that takes value 1.0 when yi and yi−1 form a contradictory sentiment transition, that is, yi 6=polar yi−1 if s ∈ {Expansion,Contingency}, or yi =polar yi−1 if s = Comparison. The desired value for the constraint expectation is set to 0 so that the model is encouraged to have less constraint violations.\nOpinion Coreference Sentences in a discourse can be linked by many types of coherence relations (Jurafsky et al., 2000). Coreference is one of the commonly used relations in written text. In this work, we explore coreference in the context of sentence-level sentiment analysis. We consider a set of polar sentences to be linked by the opinion coreference relation if they contain coreferring opinion-related entities. For example, the following sentences express opinions towards “the speaker phone”, “The speaker phone” and “it” respectively. As these opinion targets are coreferential (referring to the same entity “the speaker phone”), they are linked by the opinion coreference relation 5.\nMy favorite features are the speaker phone and the radio. The speaker phone is very functional. I use it in the car, very audible even with freeway noise.\n5In general, the opinion-related entities include both the opinion targets and the opinion holders. In this work, we only consider the targets since we experiment with singleauthor product reviews. The opinion holders can be included in a similar way as the opinion targets.\nOur coreference relations indicated by opinion targets overlap with the same target relation introduced in (Somasundaran et al., 2009). The differences are: (1) we encode the coreference relations as soft constraints during learning instead of applying them as hard constraints during inference time; (2) our constraints can apply to both polar and non-polar sentences; (3) our identification of coreference relations is automatic without any fine-grained annotations for opinion targets.\nTo extract coreferential opinion targets, we apply Stanford’s coreference system (Lee et al., 2013) to extract coreferential mentions in the document, and then apply a set of syntactic rules to identify opinion targets from the extracted mentions. The syntactic rules correspond to the shortest dependency paths between an opinion word and an extracted mention. We consider the 10 most frequent dependency paths in the training data. Example dependency paths include nsubj(opinion, mention), nobj(opinion, mention), and amod(mention, opinion).\nFor sentences connected by the opinion coreference relation, we expect their sentiment to be consistent. To encode this intuition, we define the following constraint function:\nφcoref (x, y) = ∑\ni,ant(i)=j,j≥0 fcoref (xi, xj , yi, yj)\nwhere ant(i) denotes the index of the sentence which contains an antecedent target of the target mentioned in sentence i (the antecedent relations over pairs of opinion targets can be constructed using the coreference resolver), and fcoref is a penalty function which takes value 1.0 when the expected sentiment coherency is violated, that is, yi 6=polar yj . Similar to the inter-sentential dis-\ncourse connectives, modeling opinion coreference via constraint violations allows the model to handle neutral sentiment. The expected value of the constraint functions is set to 0.\nListing Patterns Another type of coherence relations we observe in online reviews is listing, where a reviewer expresses his/her opinions by listing a series of statements followed by a sequence of numbers. For example, “1. It’s smaller than the ipod mini .... 2. It has a removable battery ....”. We expect sentences connected by a listing to have consistent sentiment. We implement this constraint in the same form as the coreference constraint (the antecedent assignments are constructed from the numberings).\nGlobal Sentiment Previous studies have demonstrated the value of document-level sentiment in guiding the semi-supervised learning of sentence-level sentiment (Täckström and McDonald, 2011b; Qu et al., 2012). In this work, we also take into account this information and encode it as posterior constraints. Note that these constraints are not necessary for our model and can be applied when the document-level sentiment labels are naturally available.\nBased on an analysis of the Amazon review data, we observe that sentence-level sentiment usually doesn’t conflict with the document-level sentiment in terms of polarity. For example, the proportion of negative sentences in the positive documents is very small compared to the proportion of positive sentences. To encode this intuition, we define the following constraint function:\nφg(x, y) = n∑ i δ(yi 6=polar g)/n\nwhere g ∈ {positive, negative} denotes the sentiment value of a polar document, n is the total number of sentences in x, and δ is an indicator function. We hope the expectation of the constraint function takes a small value. In our experiments, we set the expected value to be the empirical estimate of the probability of “conflicting” sentiment in polar documents using the training data."
  }, {
    "heading": "3.3 Training and Inference",
    "text": "During training, we need to compute the constraint expectations and the feature expectations under the auxiliary distribution q at each gradient step.\nWe can derive q by solving the dual problem in 3:\nq(y|x) = exp(θ · f(x,y) + λ · φ(x,y)) Zλ,θ(X) (4)\nwhere Zλ,θ(X) is a normalization constant. Most of our constraints can be factorized in the same way as factorizing the model features in the firstorder CRF model, and we can compute the expectations under q very efficiently using the forwardbackward algorithm. However, some of our discourse constraints (opinion coreference and listing) can break the tractable structure of the model. For constraints with higher-order structures, we use Gibbs Sampling (Geman and Geman, 1984) to approximate the expectations. Given a sequence x, we sample a label yi at each position i by computing the unnormalized conditional probabilities p(yi = l|y−i) ∝ exp(θ · f(x,yi = l,y−i) + λ · φ(x,yi = l,y−i)) and renormalizing them. Since the possible label assignments only differ at position i, we can make the computation efficient by maintaining the structure of the coreference clusters and precomputing the constraint function for different types of violations.\nDuring inference, we find the best label assignment by computing arg maxy q(y|x). For documents where the higher-order constraints apply, we use the same Gibbs sampler as described above to infer the most likely label assignment, otherwise, we use the Viterbi algorithm."
  }, {
    "heading": "4 Experiments",
    "text": "We experimented with two product review datasets for sentence-level sentiment classification: the Customer Review (CR) data (Hu and Liu, 2004)6 which contains 638 reviews of 14 products such as cameras and cell phones, and the Multi-domain Amazon (MD) data from the test set of Täckström and McDonald (2011a) which contains 294 reivews from 5 different domains. As in Qu et al. (2012), we chose the books, electronics and music domains for evaluation. Each domain also comes with 33,000 extra reviews with only document-level sentiment labels.\nWe evaluated our method in two settings: supervised and semi-supervised. In the supervised setting, we treated the test data as unlabeled data and performed transductive learning. In the semisupervised setting, our unlabeled data consists of\n6Available at http://www.cs.uic.edu/˜liub/ FBS/sentiment-analysis.html.\nboth the available unlabeled data and the test data. For each domain in the MD dataset, we made use of no more than 100 unlabeled documents in which our posterior constraints apply. We adopted the evaluation schemes used in previous work: 10- fold cross validation for the CR dataset and 3-fold cross validation for the MD dataset. We also report both two-way classification (positive vs. negative) and three-way classification results (positive, negative or neutral). We use accuracy as the performance measure. In our tables, boldface numbers are statistically significant by paired t-test for p < 0.05 against the best baseline developed in this paper 7.\nWe trained our model using a CRF incorporated with the proposed posterior constraints. For the CRF features, we include the tokens, the partof-speech tags, the prior polarities of lexical patterns indicated by the opinion lexicon and the negator lexicon, the number of positive and negative tokens and the output of the vote-flip algorithm (Choi and Cardie, 2009). In addition, we include the discourse connectives as local or transition features and the document-level sentiment labels as features (only available in the MD dataset).\nWe set the CRF regularization parameter σ = 1 and set the posterior regularization parameter β and γ (a trade-off parameter we introduce to balance the supervised objective and the posterior regularizer in 2) by using grid search 8. For approximation inference with higher-order constraints, we perform 2000 Gibbs sampling iterations where the first 1000 iterations are burn-in iterations. To make the results more stable, we construct three Markov chains that run in parallel, and select the sample with the largest objective value.\nAll posterior constraints were developed using the training data on each training fold. For the MD dataset, we also used the dvd domain as additional labeled data for developing the constraints.\nBaselines. We compared our method to a number of baselines: (1) CRF: CRF with the same set of model features as in our method. (2) CRFINF: CRF augmented with inference constraints. We can incorporate the proposed constraints (constraints derived from lexical patterns and discourse connectives) as hard constraints into CRF during\n7Significance test was not conducted over the previous methods as we do not have their results for each fold.\n8We conducted 10-fold cross-validation on each training fold with the parameter space: β : [0.01, 0.05, 0.1, 0.5, 1.0] and γ : [0.1, 0.5, 1.0, 5.0, 10.0].\ninference by manually setting λ in equation 4 to a large value,9. When λ is large enough, it is equivalent to adding hard constraints to the viterbi inference. To better understand the different effects of lexical and discourse constraints, we report results for applying only the lexical constraints (CRFINFlex) as well as results for applying only the discourse constraints (CRF-INFdisc). (3) PRlex: a variant of our PR model which only applies the lexical constraints. For the three-way classification task on the MD dataset, we also implemented the following baselines: (4) VOTEFLIP: a rulebased algorithm that leverages the positive, negative and neutral cues along with the effect of negation to determine the sentence sentiment (Choi and Cardie, 2009). (5) DOCORACLE: assigns each sentence the label of its corresponding document."
  }, {
    "heading": "4.1 Results",
    "text": "We first report results on a binary (positive or negative) sentence-level sentiment classification task. For this task, we used the supervised setting and performed transductive learning for our model. Table 2 shows the accuracy results. We can see\n9We set λ to 1000 for the lexical constraints and -1000 to the discourse connective constraints in the experiments\nthat PR significantly outperforms all other baselines in both the CR dataset and the MD dataset (average accuracy across domains is reported). The poor performance of CRF-INFlex indicates that directly applying lexical constraints as hard constraints during inference could only hurt the performance. CRF-INFdisc slightly outperforms CRF but the improvement is not significant. In contrast, both PRlex and PR significantly outperform CRF, which implies that incorporating lexical and discourse constraints as posterior constraints is much more effective. The superior performance of PR over PRlex further suggests that the proper use of discourse information can significantly improve accuracy for sentence-level sentiment classification.\nWe also analyzed the model’s performance on a three-way sentiment classification task. By introducing the “neutral” category, the sentiment classification problem becomes harder. Table 4 shows the results in terms of accuracy for each domain in the MD dataset. We can see that both PR and PRlex significantly outperform all other baselines in all domains. The rule-based baseline VOTEFLIP gave the weakest performance because it has no prediction power on sentences with no opinion words. DOCORACLE performs much better than VOTEFLIP and performs especially well on the Music domain. This indicates that the documentlevel sentiment is a very strong indicator of the sentence-level sentiment label. For the CRF baseline and its invariants, we observe a similar performance trend as in the two-way classification task: there is nearly no performance improvement from applying the lexical and discourseconnective-based constraints during CRF inference. In contrast, both PRlex and PR provide substantial improvements over CRF. This con-\nfirms that encoding lexical and discourse knowledge as posterior constraints allows the featurebased model to gain additional learning power for sentence-level sentiment prediction. In particular, incorporating discourse constraints leads to consistent improvements to our model. This demonstrates that our modeling of discourse information is effective and that taking into account the discourse context is important for improving sentence-level sentiment analysis. We also compare our results to the previously published results on the same dataset. HCRF (Täckström and McDonald, 2011a) and MEM (Qu et al., 2012) are two state-of-the-art semi-supervised methods for sentence-level sentiment classification. We can see that our best model PR gives the best results in most categories.\nTable 4 shows the results in terms of F1 scores for each sentiment category (positive, negative and neutral). We can see that the PR models are able to provide improvements over all the sentiment categories compared to all the baselines in general. We observe that the DOCORACLE baseline provides very strong F1 scores on the positive and negative categories especially in the Books and Music domains, but very poor F1 on the neutral category. This is because it over-predicts the polar sentences in the polar documents, and predicts no polar sentences in the neutral documents. In contrast, our PR models provide more balanced F1 scores among all the sentiment categories. Compared to the CRF baseline and its variants, we found that the PR models can greatly improve the precision of predicting positive and negative sentences, resulting in a significant improvement on the positive/negative F1 scores. However, the improvement on the neutral category is modest. A plausible explanation is that most of our constraints focus on discriminating polar sentences. They can help reduce the errors of misclassifying polar sentences, but the model needs more constraints in order to distinguish neutral sentences from polar sentences. We plan to address this issue in future work."
  }, {
    "heading": "4.2 Discussion",
    "text": "We analyze the errors to better understand the merits and limitations of the PR model. We found that the PR model is able to correct many CRF errors caused by the lack of labeled data. The first row in Table 5 shows an example of such errors.\nThe lexical features return and exchange may be good indicators of negative sentiment for the sentence. However, with limited labeled data, the CRF learner can only associate very weak sentiment signals to these features. In contrast, the PR model is able to associate stronger sentiment signals to these features by leveraging unlabeled data for indirect supervision. A simple lexicon-based constraint during inference time may also correct this case. However, hard-constraint baselines can hardly improve the performance in general because the contributions of different constraints are not learned and their combination may not lead to better predictions. This is also demonstrated by the limited performance of CRF-INF in our experiments.\nWe also found that the discourse constraints play an important role in improving the sentiment prediction. The lexical constraints alone are often not sufficient since their coverage is limited by the sentiment lexicon and they can only constrain sentiment locally. On the contrary, discourse constraints are not dependent on sentiment lexicons, and more importantly, they can provide sentiment preferences on multiple sentences at the same time. When combining discourse constraints with features from different sentences, the PR model becomes more powerful in disambiguating sentiment. The second example in Table 5 shows that the PR model learned with discourse constraints correctly predicts the sentiment of two sentences where no lexical constraints apply.\nHowever, discourse constraints are not always helpful. One reason is that they do not constrain the neutral sentiment. As a result they could not help disambiguate neutral sentiment from polar sentiment, such as the third example in Table 5. This is also a problem for most of our lexical constraints. In general, it is hard to learn reliable indicators for the neutral sentiment. In the MD dataset, a neutral label may be given because the sentence\ncontains mixed sentiment or no sentiment or it is off-topic. We plan to explore more refined constraints that can deal with the neutral sentiment in future work. Another limitation of the discourse constraints is that they could be affected by the errors of the discourse parser and the coreference resolver. A potential way to address this issue is to learn discourse constraints jointly with sentiment. We plan to study this in future research."
  }, {
    "heading": "5 Conclusion",
    "text": "In this paper, we propose a context-aware approach for learning sentence-level sentiment. Our approach incorporates intuitive lexical and discourse knowledge as expressive constraints while training a conditional random field model via posterior regularization. We explore a rich set of context-aware constraints at both intra- and intersentential levels, and demonstrate their effectiveness in the analysis of sentence-level sentiment. While we focus on the sentence-level task, our approach can be easily extended to handle sentiment analysis at finer levels of granularity. Our experiments show that our model achieves better accuracy than existing supervised and semi-supervised models for the sentence-level sentiment classification task."
  }, {
    "heading": "Acknowledgments",
    "text": "This work was supported in part by DARPA-BAA12-47 DEFT grant #12475008 and NSF grant BCS-0904822. We thank Igor Labutov for helpful discussion and suggestions; Oscar Täckström and Lizhen Qu for providing their Amazon review datasets; and the anonymous reviewers for helpful comments and suggestions."
  }],
  "year": 2014,
  "references": [{
    "title": "Alternating projections for learning",
    "authors": ["Kedar Bellare", "Gregory Druck", "Andrew McCallum"],
    "year": 2009
  }, {
    "title": "Learning with compositional semantics as structural inference for subsentential sentiment analysis",
    "authors": ["Yejin Choi", "Claire Cardie."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing, pages 793–801. Association",
    "year": 2008
  }, {
    "title": "Adapting a polarity lexicon using integer linear programming for domain-specific sentiment classification",
    "authors": ["Yejin Choi", "Claire Cardie."],
    "venue": "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing: Volume 2-",
    "year": 2009
  }, {
    "title": "Adaptive subgradient methods for online learning and stochastic optimization",
    "authors": ["John Duchi", "Elad Hazan", "Yoram Singer."],
    "venue": "Journal of Machine Learning Research, 12:2121–2159.",
    "year": 2010
  }, {
    "title": "Crosslingual discriminative learning of sequence models with posterior regularization",
    "authors": ["Kuzman Ganchev", "Dipanjan Das"],
    "year": 2013
  }, {
    "title": "Dependency grammar induction via bitext projection constraints",
    "authors": ["Kuzman Ganchev", "Jennifer Gillenwater", "Ben Taskar."],
    "venue": "Proceedings of the ACL-IJCNLP, pages 369–377.",
    "year": 2009
  }, {
    "title": "Posterior regularization for structured latent variable models",
    "authors": ["Kuzman Ganchev", "Joao Graça", "Jennifer Gillenwater", "Ben Taskar."],
    "venue": "The Journal of Machine Learning Research, 99:2001–2049.",
    "year": 2010
  }, {
    "title": "Stochastic relaxation, gibbs distributions, and the bayesian restoration of images",
    "authors": ["Stuart Geman", "Donald Geman."],
    "venue": "Pattern Analysis and Machine Intelligence, IEEE Transactions on, (6):721–741.",
    "year": 1984
  }, {
    "title": "Mining and summarizing customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of the tenth ACM SIGKDD international conference on Knowledge discovery and data mining, pages 168–177. ACM.",
    "year": 2004
  }, {
    "title": "Speech and language processing: An introduction to natural language processing, computational linguistics, and speech recognition, volume 2",
    "authors": ["Dan Jurafsky", "James H Martin", "Andrew Kehler", "Keith Vander Linden", "Nigel Ward."],
    "venue": "MIT Press.",
    "year": 2000
  }, {
    "title": "Fully automatic lexicon expansion for domainoriented sentiment analysis",
    "authors": ["Hiroshi Kanayama", "Tetsuya Nasukawa."],
    "venue": "Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing, pages 355–363. Association",
    "year": 2006
  }, {
    "title": "A bayesian model for joint unsupervised induction of sentiment",
    "authors": ["Angeliki Lazaridou", "Ivan Titov", "Caroline Sporleder"],
    "year": 2013
  }, {
    "title": "Deterministic coreference resolution based on entity-centric, precision-ranked rules",
    "authors": ["Heeyoung Lee", "Angel Chang", "Yves Peirsman", "Nathanael Chambers", "Mihai Surdeanu", "Dan Jurafsky"],
    "year": 2013
  }, {
    "title": "Isotonic conditional random fields and local sentiment flow",
    "authors": ["Yi Mao", "Guy Lebanon."],
    "venue": "Advances in neural information processing systems, 19:961.",
    "year": 2007
  }, {
    "title": "Structured models for fine-to-coarse sentiment analysis",
    "authors": ["Ryan McDonald", "Kerry Hannan", "Tyler Neylon", "Mike Wells", "Jeff Reynar."],
    "venue": "Annual Meeting-Association For Computational Linguistics, volume 45, page 432.",
    "year": 2007
  }, {
    "title": "Dependency tree-based sentiment classification using crfs with hidden variables",
    "authors": ["Tetsuji Nakagawa", "Kentaro Inui", "Sadao Kurohashi."],
    "venue": "Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Associa-",
    "year": 2010
  }, {
    "title": "A sentimental education: Sentiment analysis using subjectivity summarization based on minimum cuts",
    "authors": ["Bo Pang", "Lillian Lee."],
    "venue": "Proceedings of the 42nd annual meeting on Association for Computational Linguistics, page 271. Association for Com-",
    "year": 2004
  }, {
    "title": "Opinion mining and sentiment analysis",
    "authors": ["Bo Pang", "Lillian Lee."],
    "venue": "Now Pub.",
    "year": 2008
  }, {
    "title": "Contextual valence shifters",
    "authors": ["Livia Polanyi", "Annie Zaenen."],
    "venue": "Computing attitude and affect in text: Theory and applications, pages 1–10. Springer.",
    "year": 2006
  }, {
    "title": "The penn discourse treebank",
    "authors": ["Rashmi Prasad", "Nikhil Dinesh", "Alan Lee", "Eleni Miltsakaki", "Livio Robaldo", "Aravind K Joshi", "Bonnie L Webber"],
    "year": 2008
  }, {
    "title": "A weakly supervised model for sentence-level semantic orientation analysis with multiple experts",
    "authors": ["Lizhen Qu", "Rainer Gemulla", "Gerhard Weikum."],
    "venue": "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Process-",
    "year": 2012
  }, {
    "title": "Semi-supervised recursive autoencoders for predicting sentiment distributions",
    "authors": ["Richard Socher", "Jeffrey Pennington", "Eric H Huang", "Andrew Y Ng", "Christopher D Manning."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Lan-",
    "year": 2011
  }, {
    "title": "Recursive deep models for semantic compositionality over a sentiment treebank",
    "authors": ["Richard Socher", "Alex Perelygin", "Jean Y Wu", "Jason Chuang", "Christopher D Manning", "Andrew Y Ng", "Christopher Potts."],
    "venue": "Proceedings of EMNLP.",
    "year": 2013
  }, {
    "title": "Discourse level opinion interpretation",
    "authors": ["Swapna Somasundaran", "Janyce Wiebe", "Josef Ruppenhofer."],
    "venue": "Proceedings of the 22nd International Conference on Computational Linguistics-Volume 1, pages 801–808. Association for Computational Lin-",
    "year": 2008
  }, {
    "title": "Supervised and unsupervised methods in employing discourse relations for improving opinion polarity classification",
    "authors": ["Swapna Somasundaran", "Galileo Namata", "Janyce Wiebe", "Lise Getoor."],
    "venue": "Proceedings of the 2009 Conference on Empirical",
    "year": 2009
  }, {
    "title": "Discovering fine-grained sentiment with latent variable structured prediction models",
    "authors": ["Oscar Täckström", "Ryan McDonald."],
    "venue": "Advances in Information Retrieval, pages 368–374. Springer.",
    "year": 2011
  }, {
    "title": "Semisupervised latent variable models for sentence-level sentiment analysis",
    "authors": ["Oscar Täckström", "Ryan McDonald"],
    "year": 2011
  }, {
    "title": "Discourse connectors for latent subjectivity in sentiment analysis",
    "authors": ["Rakshit Trivedi", "Jacob Eisenstein."],
    "venue": "Proceedings of NAACL-HLT, pages 808–813.",
    "year": 2013
  }, {
    "title": "Fast dropout training",
    "authors": ["Sida Wang", "Christopher Manning."],
    "venue": "Proceedings of the 30th International Conference on Machine Learning (ICML13), pages 118–126.",
    "year": 2013
  }, {
    "title": "Discourse level explanatory relation extraction from product reviews using firstorder logic",
    "authors": ["Qi Zhang", "Jin Qian", "Huan Chen", "Jihua Kang", "Xuanjing Huang"],
    "year": 2013
  }, {
    "title": "Unsupervised discovery of discourse relations for eliminating intra-sentence polarity ambiguities",
    "authors": ["Lanjun Zhou", "Binyang Li", "Wei Gao", "Zhongyu Wei", "Kam-Fai Wong."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language",
    "year": 2011
  }],
  "id": "SP:66ff19af88c81e0f3582ac65359a0543a16e1ac8",
  "authors": [{
    "name": "Bishan Yang",
    "affiliations": []
  }, {
    "name": "Claire Cardie",
    "affiliations": []
  }],
  "abstractText": "This paper proposes a novel context-aware method for analyzing sentiment at the level of individual sentences. Most existing machine learning approaches suffer from limitations in the modeling of complex linguistic structures across sentences and often fail to capture nonlocal contextual cues that are important for sentiment interpretation. In contrast, our approach allows structured modeling of sentiment while taking into account both local and global contextual information. Specifically, we encode intuitive lexical and discourse knowledge as expressive constraints and integrate them into the learning of conditional random field models via posterior regularization. The context-aware constraints provide additional power to the CRF model and can guide semi-supervised learning when labeled data is limited. Experiments on standard product review datasets show that our method outperforms the state-of-theart methods in both the supervised and semi-supervised settings.",
  "title": "Context-aware Learning for Sentence-level Sentiment Analysis with Posterior Regularization"
}