{
  "sections": [{
    "text": "Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics, pages 1437–1447, Baltimore, Maryland, USA, June 23-25 2014. c©2014 Association for Computational Linguistics"
  }, {
    "heading": "1 Introduction",
    "text": "Time expressions present a number of challenges for language understanding systems. They have rich, compositional structure (e.g., “2nd Friday of July”), can be easily confused with non-temporal phrases (e.g., the word “May” can be a month name or a verb), and can vary in meaning in different linguistic contexts (e.g., the word “Friday” refers to different dates in the sentences “We met on Friday” and “We will meet on Friday”). Recovering the meaning of time expressions is therefore challenging, but provides opportunities to study context-dependent language use. In this paper, we present the first context-dependent semantic parsing approach for learning to identify and interpret time expressions, addressing all three challenges.\nExisting state-of-the-art methods use handengineered rules for reasoning about time expressions (Strötgen and Gertz, 2013). This includes both detection, identifying a phrase as a time expression, and resolution, mapping such a phrase into a standardized time value. While rule-based approaches provide a natural way to express expert knowledge, it is relatively difficult to en-\n∗Work conducted at the University of Washington.\ncode preferences between similar competing hypotheses and provide prediction confidence. Recently, methods for learning probabilistic semantic parsers have been shown to address such limitations (Angeli et al., 2012; Angeli and Uszkoreit, 2013). However, these approaches do not account for any surrounding linguistic context and were mainly evaluated with gold standard mentions.\nWe propose to use a context-dependent semantic parser for both detection and resolution of time expressions. For both tasks, we make use of a hand-engineered Combinatory Categorial Grammar (CCG) to construct a set of meaning representations that identify the time being described. For example, this grammar maps the phrase “2nd Friday of July” to the meaning representation intersect(nth(2 , friday), july), which encodes the set of all such days. Detection is then performed with a binary classifier to prune the set of text spans that can be parsed with the grammar (e.g., to tell that “born in 2000” has a time expression but “a 2000 piece puzzle” does not). For resolution, we consider mentions sequentially and use a log-linear model to select the most likely meaning for each. This choice depends on contextual cues such as previous time expressions and the tense of the governing verb (e.g., as required to correctly resolve cases like “We should meet on the 2nd Friday of July”).\nSuch an approach provides a good balance between hand engineering and learning. For the relatively closed-class time expressions, we demonstrate that it is possible to engineer a high quality CCG lexicon. We take a data-driven approach for grammar design, preferring a grammar with high coverage even if it results in parsing ambiguities. We then learn a model to accurately select between competing parses and incorporate signals from the surrounding context, both more difficult to model with deterministic rules.\nFor both problems, we learn from TimeML an-\n1437\nnotations (Pustejovsky et al., 2005), which mark mentions and the specific times they reference. Training the detector is a supervised learning problem, but resolution is more challenging, requiring us to reason about latent parsing and context-dependent decisions.\nWe evaluate performance in two domains: the TempEval-3 corpus of newswire text (Uzzaman et al., 2013) and the WikiWars corpus of Wikipedia history articles (Mazur and Dale, 2010). On these benchmark datasets, we present new state-of-theart results, with error reductions of up to 28% for the detection task and 21% for the end-to-end task."
  }, {
    "heading": "2 Formal Overview",
    "text": "Time Expressions We follow the TIMEX3 standard (Pustejovsky et al., 2005) for defining time expressions within documents. Let a document D = 〈w1, . . . , wn〉 be a sequence of n words wi and a mention m = (i, j) indicate start and end indices for a phrase 〈wi, . . . , wj〉 in D. Define a time expression e = (t, v) to include both a temporal type t and value v.1 The temporal type t ∈ {Date, Time, Duration, Set} can take one of four possible values, indicating if the expression e is a date (e.g., “January 10, 2014”), time (e.g., “11:59 pm”), duration (e.g., “6 months”), or set (e.g., “every year”). The value v is an extension of the ISO 8601 standard, which encodes the time that mentionm refers to in the context provided by document D. For example, in a document written on Tuesday, January 7, 2014, “Friday,” “three days later,” and “January 10th” would all resolve to the value 2014-01-10. The time values are similarly defined for a wide range of expressions, such as underspecified dates (e.g., XXXX-01-10 for “Janunary 10th” when the year is not inferable from context) and durations (P2D for “two days”).\nTasks Our goal is to find all time expressions in an input document. We divide the problem into two parts: detection and resolution. The detection problem is to take an input documentD and output a mention set M = {mi | i = 1 . . . n} of phrases in D that describe time expressions. The resolution problem (often also called normalization) is, given a document D and a set of mentions M , to\n1Time expressions also have optional modifier values for non-TIMEX properties (e.g., the modifier would contain EARLY for the phrase “early march”). We do recover these modifiers but omit them from the discussion since they are not part of the official evaluation metrics.\nmap each m ∈ M to the referred time expression e. This paper addresses both of these tasks.\nApproach We learn separate, but related, models for detection and resolution. For both tasks, we define the space of possible compositional meaning representations Z , where each z ∈ Z defines a unique time expression e. We use a log-linear CCG (Steedman, 1996; Clark and Curran, 2007) to rank possible meanings z ∈ Z for each mention m in a document D, as described in Section 4. Both detection (Section 5) and resolution (Section 6) rely on the semantic parser to identify likely mentions and resolve them within context. For learning we assume access to TimeML data containing documents labeled with time expressions. Each document D has a set {(mi, ei)|i = 1 . . . n}, where each mention mi marks a phrase that resolves to the time expression ei.\nEvaluation We evaluate performance (Section 8) for both newswire text and Wikipedia articles. We compare to the state-of-the-art systems for end-to-end resolution (Strötgen and Gertz, 2013) and resolution given gold mentions (Bethard, 2013b), both of which do not use any machine learning techniques."
  }, {
    "heading": "3 Representing Time",
    "text": "We use simply typed lambda calculus to represent time expressions. Our representation draws heavily from the representation proposed by Angeli et al. (2012), who introduced semantic parsing for this task. There are five primitive types: duration d, sequence s, range r, approximate reference a, and numeral n, as described below. Table 1 lists the available constants for each type.\nDuration A period of time. Each duration is a multiple of one of a closed set of possible base durations (e.g., hour, day, and quarter), which we refer to as its granularity. Table 1 includes the complete set of base durations used.\nRange A specific interval of time, following an interval-based theory of time (Allen, 1981). The interval length is one of the base durations, which is the granularity of the range. Given two ranges R and R′, we say that R ⊆ R′ if the endpoints of R lie on or within R′.\nSequence A set of ranges with identical granularity. The granularity of the sequence is that of its members. For example, thursday , which has a\nday granularity, denotes the set of all day-granular ranges enclosing specific Thursdays. Given a range R and sequence S, we say that R ∈ S if R is a member of S. Given two sequences S and S′ we say that S ⊆ S′ if R ∈ S implies R ∈ S′. Approximate Reference An approximate time relative to the reference time. For example, past and future. To handle mentions such as “a while,” we add the constant unknown .\nNumeral An integer, for example, 5 or 1990 . Numerals are used to denote specific ranges, such as the year 2001, or to modify a duration’s length.\nFunctions We also allow for functional types, for example 〈s, r〉 is assigned to a function that maps from sequences to ranges. Table 2 lists all supported functions with example mentions.\nContext Dependent Constants To mark places where context-dependent choices will need to be made during resolution, we use two placeholder constants. First, ref time denotes the mention reference time, which is later set to either the document time or a previously resolved mention. Second, temp d is used in the shift function to determine its return granularity, as described in Table 2, and is later replaced with the granularity of either the first or second argument of the enclosing shift function. Section 4.3 describes how these decisions are made."
  }, {
    "heading": "4 Parsing Time Expressions",
    "text": "We define a three-step derivation to resolve mentions to their TIMEX3 value. First, we use a CCG to generate an initial logical form for the mention. Next, we apply a set of operations that modify the\ninitial logical form, as appropriate for its context. Finally, the logical form is resolved to a TIMEX3 value using a deterministic process."
  }, {
    "heading": "4.1 Combinatory Categorial Grammars",
    "text": "CCG is a linguistically motivated categorial formalism for modeling a wide range of language phenomena (Steedman, 1996; Steedman, 2000). A CCG is defined by a lexicon and a set of combinators. The lexicon pairs words with categories and the combinators define how to combine categories to create complete parse trees.\nFor example, Figure 1 shows a CCG parse tree for the phrase “one week ago.” The parse tree is read top to bottom, starting from assigning categories to words using the lexicon. The lexical entry ago ` NP\\NP : λx.shift(ref time,−1 × x, temp d) for the word “ago” pairs it with a category that has syntactic type NP\\NP and semantics λx.shift(ref time,−1 × x, temp d). Each intermediate parse node is then constructed by applying one of a small set of binary or unary operations (Steedman, 1996; Steedman, 2000), which modify both the syntax and semantics. We use backward (<) and forward (>) application and several unary type-shifting rules to handle number combinations. For example, in Figure 1 the category of the span “one week” is combined with the category of “ago” using backward application (<). Parsing concludes with a logical form representing the meaning of the complete mention.\nHand Engineered Lexicon To parse time expressions, we use a CCG lexicon that includes 287 manually designed entries, along with automatically generated entries such as numbers and common formats of dates and times. Figure 2 shows example entries from our lexicon."
  }, {
    "heading": "4.2 Context-dependent Operations",
    "text": "To correctly resolve mentions to TIMEX3 values, the system must account for contextual in-\nformation from various sources, including previous mentions in the document, the document creation time, and the sentence containing the mention. We consider three types of context operations, each takes as input a logical form z′, modifies it and returns a new logical form z. Each context-dependent parse y specifies one operator of each type, which are applied to the logical form constructed by the CCG grammar, to produce the final, context-dependent logical form LF(y).\nReference Time Resolution The logical constant ref time is replaced by either dct , representing the document creation time, or last range, the last r-typed mention resolved in the document. For example, consider the mention “the following year”, which is represented using the logical form next(seq(year), ref time). Within the sentence “1998 was colder than the following year”, the resolution of “the following year” depends on the previous mention “1998”. In contrast, in “The following year will be warmer”, its resolution depends on the document creation time.\nDirectionality Resolution If z′ is s-typed we modify it to nearest forward(z′, ref time), nearest backward(z′, ref time), or z′. For example, given the sentence “. . . will be launched in april”, the mention “april”, and its logical form april , we would like to resolve it to the coming April, and therefore modify it to nearest forward(april , ref time).\nShifting Granularity Every occurrence of the logical constant temp d , which is used as an argument to the function shift (see Table 2), is replaced with the granularity of either the first argument, the origin of the shift, or the second argument, the delta of the shift. This determines the final granularity of the output. For example, if the reference time is 2002-01, the mention “two years earlier” would resolve to either a month (since the reference time is of month granularity) or a year (since the delta is of year granularity)."
  }, {
    "heading": "4.3 Resolving Logical Forms",
    "text": "For a context-dependent parse y, we compute the TIMEX3 value TM(y) from the logical form z = LF(y) with a deterministic step that performs a single traversal of z. Each primitive logical constant from Table 1 contributes to setting part of the TIMEX3 value (for example, specifying the day of the week) and the functional constants in Table 2 dictate transformations on the TIMEX3 values (for example, shifting forward or backward in time).2"
  }, {
    "heading": "5 Detection",
    "text": "The detection problem is to take an input document D and output a mention set M = {mi | i = 1, . . . , n}, where each mention mi indexes a specific phrase in D that delimits a time expression.\nAlgorithm The detection algorithm considers all phrases that our CCG grammar Λ (Section 4) can parse, uses a learned classifier to further filter this set, and finally resolves conflicts between any overlapping predictions. We use a CKY algorithm to efficiently determine which phrases the CCG grammar can parse and only allow logical forms for which there exists some context in which they would produce a valid time expression, e.g. ruling out intersect(monday , tuesday). Finally, we build the set M of non-overlapping mentions using a step similar to non-maximum suppression:\n2The full details are beyond the scope of this paper, but an implementation is available on the author’s website.\nthe mentions are sorted by length (longest first) and iteratively added to M , as long as they do not overlap with any mention already in M .\nFiltering Model Given a mention m, its document D, a feature function φ, the CCG lexicon Λ, and feature weights θ, we use a logistic regression model to define the probability distribution:\nP (t|m,D; Λ, θ) = e θ·φ(m,D,Λ)\n1 + eθ·φ(m,D,Λ)\nwhere t indicates whether m is a time expression.\nFeatures We use three types of indicator features that test properties of the words in and around the potential mention m.\nContext tokens Indicate the presence of a set of manually specified tokens near the mention. These include quotations around the mention, the word “old” after the mention, and prepositions of time (such as “in”, “until”, and “during”) before.\nPart of speech Indicators that pair each word with its part of speech, as assigned by the Stanford tagger (Toutanova et al., 2003).\nLexical group Each lexical entry belongs to one of thirteen manually defined lexical groups which cluster entries that contribute to the final time expression similarly. These groups include numbers, days of the week, months, seasons, etc. For each group, we include a feature indicating whether the parse includes a lexical entry from that group.\nDeterminer dependency Indicates the presence of a determiner in the mention and whether its parent in the dependency tree (generated by the Stanford parser (de Marneffe et al., 2006)) also resides within the mention.\nLearning Finally, we construct the training data by considering all spans that (1) the CCG temporal grammar can parse and (2) are not strict subspans of an annotated mention. All spans that exactly matched the gold labels are used as positive examples and all others are negatives. Given this relaxed data, we learn the feature weights θ with L1-regularization. We set the probability threshold for detecting a time expression by optimizing the F1 score over the training data."
  }, {
    "heading": "6 Resolution",
    "text": "The resolution problem is to, given a document D and a set of mentions M , map each m ∈ M to the correct time expression e. Section 4 defined\nthe space of possible time expression that can be constructed for an input mention m in the context of a document D. In general, there will be many different possible derivations, and we will learn a model for selecting the best one.\nModel Let y be a context-dependent CCG parse, which includes a parse tree TR(y), a set of context operations CNTX(y) applied to the logical form at the root of the tree, a final context-dependent logical form LF(y) and a TIMEX3 value TM(y). Define φ(m,D, y) ∈ Rd to be a d-dimensional feature–vector representation and θ ∈ Rd to be a parameter vector. The probability of a parse y for mention m and document D is:\nP (y|m,D; θ,Λ) = e θ·φ(m,D,y)∑\ny′ e θ·φ(m,D,y′)\nThe inference problem at test time requires finding the best resolution by solving y∗(m,D) = arg maxy P (y|m,D; θ,Λ), where the final output TIMEX3 value is TM(y∗(m,D)).\nInference We find the best context-dependent parse y by enumeration, as follows. We first parse the input mention m with a CKY-style algorithm, following previous work (Zettlemoyer and Collins, 2005). Due to the short length of time expressions and the manually constructed lexicon, we can perform exact inference. Given a parse, we then enumerate all possible outcomes for the context resolution operators. In practice, there are never more than one hundred possibilities.\nFeatures The resolution features test properties of the linguistic context surrounding the mention m, relative to the context-dependent CCG parse y.\nGovernor verb We define the governor verb to be the nearest ancestor verb in the dependency parse of any token in m. We include features indicating the concatenation of the part-of-speech of the governor verb, its auxiliary verb if present, and the selected direction resolution operator (see Section 4.2). This feature helps to distinguish “They met on Friday” from “They will meet on Friday.”\nTemporal offset If the final logical form LF (y) is a range, we define t to be the time difference between TM(y) and the reference time. For example, if the reference time is 2000-01-10 and the mention resolves to 2000-01-01, then t is -9 days. This feature indicates one of eleven bucketed values for t, including same day, less than a week,\nless than a month, etc. It allows the model to encode the likely temporal progression of a narrative. This feature is ignored if the granularity of TM(y) or the reference time is greater than a year.\nShift granularity The logical constant shift (Table 2) takes three arguments: the origin (range), the delta (duration), and the output granularity (duration). This indicator feature is the concatenation of each argument’s granularity for every shift in LF (y). It allows the model to determine whether “a year ago” refers to a year or a day.\nReference type Let r denote whether the reference time is the document creation time dct or the last range last range. Let gl and gr denote the granularities of LF (y) and the reference time, respectively. We include features indicating the concatenations: r+gl, r+gr, and r+gl+gr. Additionally, we include features indicating the concatenation of r with each lexical entry used in the parse TR(y). These features allow the model to encode preferences in selecting the correct reference time.\nFine-grained type These features indicate the fine-grained type of TM(y), such as day of the month or week of the year. We also include a feature indicating the concatenation of each of these features with the direction resolution operator that was used. These features allow the model to represent, for example, that minutes of the year are less likely than days of the month.\nIntersections These features indicate the concatenation of the granularities of any two sequences that appear as arguments to an intersect constant.\nLearning To estimate the model parameters θ we assume access to a set of training examples {(mi, di, ei) : i = 1, . . . , n}, where each mention mi is paired with a document di and a TIMEX3 value ei. We use the AdaGrad algorithm (Duchi et al., 2011) to optimize the conditional, marginal log-likelihood of the data. For each mention, we marginalize over all possible context-dependent parses, using the predictions from the model on the previous gold mentions to fill in missing context, where necessary. After parameter estimation, we set a probability threshold for retaining a resolved time expression by optimizing value F1 (see Section 8) over the training data."
  }, {
    "heading": "7 Related Work",
    "text": "Semantic parsers map sentences to logical representations of their underlying meaning, e.g., Zelle\nand Mooney (1996), Zettlemoyer and Collins (2005), and Wong and Mooney (2007). Recently, research in this area has focused on learning for various forms of relatively weak but easily gathered supervision. This includes learning from question-answer pairs (Clarke et al., 2010; Liang et al., 2011; Kwiatkowski et al., 2013), from conversational logs (Artzi and Zettlemoyer, 2011), with distant supervision (Krishnamurthy and Mitchell, 2012; Cai and Yates, 2013), and from sentences paired with system behavior (Goldwasser and Roth, 2011; Chen and Mooney, 2011; Artzi and Zettlemoyer, 2013b). Recently, Angeli et al. introduced the idea of learning semantic parsers to resolve time expressions (Angeli et al., 2012) and showed that the approach can generalize to multiple languages (Angeli and Uszkoreit, 2013). Similarly, Bethard demonstrated that a hand-engineered semantic parser is also effective (Bethard, 2013b). However, these approaches did not use the semantic parser for detection and did not model linguistic context during resolution.\nWe build on a number of existing algorithmic ideas, including using CCGs to build meaning representations (Zettlemoyer and Collins, 2005; Zettlemoyer and Collins, 2007; Kwiatkowski et al., 2010; Kwiatkowski et al., 2011), building derivations to transform the output of the CCG parser based on context (Zettlemoyer and Collins, 2009), and using weakly supervised parameter updates (Artzi and Zettlemoyer, 2011; Artzi and Zettlemoyer, 2013b). However, we are the first to use a semantic parsing grammar within a mention detection algorithm, thereby avoiding the need to represent the meaning of complete sentences, and the first to develop a context-dependent model for semantic parsing of time expressions.\nTime expressions have been extensively studied as part of the TimeEx task, including 9 teams who competed in the 2013 TempEval-3 competition (Uzzaman et al., 2013). This line of work builds on ideas from TimeBank (Pustejovsky et al., 2003) and a number of different formal models for temporal reasoning, e.g. Allen (1983), Moens and Steedman (1988). In 2013, HeidelTime (Strötgen and Gertz, 2013) was the top performing system. It used deterministic rules defined over regular expressions to perform both detection and resolution, and will provide a comparison system for our evaluation in Section 9. In\ngeneral, many different rule-based systems, e.g. NavyTime (Chambers, 2013) and SUTime (Chang and Manning, 2012), and learning systems, e.g. ClearTK (Bethard, 2013a) and MANTime (Filannino et al., 2013), did well for detection. However, rule-based approaches dominated in resolution; none of the top performers attempted to learn to do resolution. Our approach is a hybrid of rule based and learning, by using latent-variable learning techniques to estimate CCG parsing and context resolution models from the provided data."
  }, {
    "heading": "8 Experimental Setup",
    "text": "Data We evaluate performance on the TempEval-3 (Uzzaman et al., 2013) and WikiWars (Mazur and Dale, 2010) datasets. Figure 3 shows summary statistics for both datasets. For the TempEval-3 corpus, we use the given training and testing set splits. Since the training set has lower inter-annotator agreement than the testing set (Uzzaman et al., 2013), we manually corrected all of the mistakes we found in the training data.3 The original training set is denoted Dev* and the corrected Dev. We report (1) cross-validation development results on Dev*, (2) cross-validation development and ablation results for Dev, and (3) held-out test results after training with Dev. For WikiWars, we randomly assigned the data to include 17 training documents (2,228 time expressions) and 5 test documents (363 time expressions). We use cross-validation on the training data for development. All cross-validation experiments used 10 folds.\nImplementation Our system was implemented using the open source University of Washington Semantic Parsing Framework (Artzi and Zettlemoyer, 2013a). We used LIBLINEAR (Fan et al., 2008) to learn the detection model.\nParameter Settings We use the same set of parameters for both datasets, chosen based on development experiments. For detection, we set the regularization parameter to 10 with a stopping crite-\n3We modified the annotations for 18% of the mentions. This relabeled corpus is available on the author’s website.\nrion of 0.01. For resolution, we set the learning rate to 0.25 and ran AdaGrad for 5 iterations. All features are initialized to have zero weights.\nEvaluation Metrics We use the official TempEval-3 scoring script and report the standard metrics. We report detection precision, recall and F1 with relaxed and strict metrics; a gold mention is considered detected for the relaxed metric if any of the output candidates overlap with it and is detected for the strict metric if the extent of any output candidates matches exactly. For resolution, we report value accuracy, measuring correctness of time expressions detected according to the relaxed metric. We also report value precision, recall, and F1, which score an expression as correct if it is both correctly detected (relaxed) and resolved. For end-to-end performance, value F1 is the primary metric. Finally, we report accuracy and F1 for temporal types, as defined in Section 2, for the TempEval dataset (WikiWars does not include type labels).\nComparison Systems We compare our system primarily to HeidelTime (Strötgen and Gertz, 2013), which is state of the art in the end-toend task. For the TempEval-3 dataset, we also compare to two other strong participants of the shared task. These include NavyTime (Chambers, 2013), which had the top relaxed detection score, and ClearTK (Bethard, 2013a), which had the top strict detection score and type F1 score. We also include a comparison with Bethard’s synchronous\ncontext free grammar (SCFG) (Bethard, 2013b), which is state-of-the-art in the task of resolution with gold mention boundaries."
  }, {
    "heading": "9 Results",
    "text": "End-to-end results Figure 4 shows development and test results for TempEval-3. Figure 5 shows these numbers for WikiWars. In both datasets, we achieve state-of-the-art test scores. For detection, we show up to 3-point improvements in strict and relaxed F1 scores. These numbers outperform all systems participating in the shared task, which used a variety of techniques including hand-engineered rules, CRF tagging models, and SVMs. For resolution, we show up to 4-point improvements in the value F1 score, also outperforming participating systems, all of which used hand-engineered rules for resolution.\nGold Mentions Figure 6 reports development and test results with gold mentions.4 Our approach outperforms the state of the art, SCFG (Bethard, 2013b), which also used a hand engineered grammar, but did not use machine learning techniques.\n4These numbers vary slightly from those reported; we did not count the document creation times as mentions.\nPrecision vs. Recall Our probabilistic model of time expression resolution allows us to easily tradeoff precision and recall for end-to-end performance by varying the resolution probability threshold. Figure 7 shows the precision vs. recall of the resolved values from 10-fold cross validation of TempEval-3 Dev and WikiWars Dev. We are able to achieve precision at or above 90% with reasonable recall, nearly 70% for WikiWars and over 85% for TempEval-3.\nAblation Study Figures 4-5 also show comparisons for our system with no context. We ablate the ability to refer to the context during resolution by removing contextual information from the resolution features and only allowing the document creation time to be the reference time.\nWe see an interesting asymmetry in the effect of modeling context across the two domains. We find that context is much more important in WikiWars (19 point difference) than in TempEval (2 point difference). This result reaffirms the difference in domains that Strötgen and Gertz (2012) noted during the development of HeidelTime: history articles have narrative structure that moves back and forth through time while newspaper text typically describes events happening near the document creation time. This difference helps us to understand why previous learning systems have been able to ignore context and perform well on newswire text.\nError Analysis To investigate the source of error, we compute oracle results for resolving gold mentions over the TempEval-3 Dev dataset. We found that our system produces a correct candidate derivation for 96% of the mentions.\nWe also manually categorized all resolution errors for end-to-end performance with 10-fold cross validation of the TempEval-3 Dev dataset,\nshown in Figure 8. The lexicon allows for effective parsing, contributing to only 2% of the overall errors. However, context is more challenging. The three largest categories, responsible for 64.7% of the errors, were incorrect use of the context operators. More expressive modeling will be required to fully capture the complex pragmatics involved in understanding time expressions."
  }, {
    "heading": "10 Conclusion",
    "text": "We presented the first context-dependent semantic parsing system to detect and resolve time expressions. Both models used a Combinatory Categorial Grammar (CCG) to construct a set of possible temporal meaning representations. This grammar defined the possible phrases for detection and the inputs to a context-dependent reasoning step that was used to construct the output time expression during resolution. Experiments demonstrated that our approach outperforms state-of-the-art systems.\nIn the future, we aim to develop joint models for reasoning about events and time expressions, including detection and resolution of temporal relations. We are also interested in testing coverage in new domains and investigating techniques for semi-supervised learning and learning with noisy data. We hypothesize that semantic parsing techniques could help in all of these settings, providing a unified mechanism for compositional analysis within temporal understanding problems."
  }, {
    "heading": "Acknowledgments",
    "text": "The research was supported in part by DARPA under the DEFT program through the AFRL (FA8750-13-2-0019) and the CSSG (N11AP20020), and the NSF (IIS-1115966, IIS1252835). The authors thank Nicholas FitzGerald, Tom Kwiatkowski, and Mark Yatskar for helpful discussions, and the anonymous reviewers for helpful comments."
  }],
  "year": 2014,
  "references": [{
    "title": "An interval-based representation of temporal knowledge",
    "authors": ["References James F. Allen."],
    "venue": "Proceedings of the 7th International Joint Conference on Artificial Intelligence.",
    "year": 1981
  }, {
    "title": "Maintaining knowledge about temporal intervals",
    "authors": ["James F Allen."],
    "venue": "Communications of the ACM, 26(11):832–843.",
    "year": 1983
  }, {
    "title": "Languageindependent discriminative parsing of temporal expressions",
    "authors": ["Gabor Angeli", "Jakob Uszkoreit."],
    "venue": "Proceedings of the Conference of the Association of Computational Linguistics.",
    "year": 2013
  }, {
    "title": "Parsing time: Learning to interpret time expressions",
    "authors": ["Gabor Angeli", "Christopher D Manning", "Daniel Jurafsky."],
    "venue": "Proceedings of the Conference of the North American Chapter of the Association for Computational Linguistics.",
    "year": 2012
  }, {
    "title": "Bootstrapping semantic parsers from conversations",
    "authors": ["Y. Artzi", "L.S. Zettlemoyer."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2011
  }, {
    "title": "UW SPF: The University of Washington Semantic Parsing Framework",
    "authors": ["Y. Artzi", "L.S. Zettlemoyer"],
    "year": 2013
  }, {
    "title": "Weakly supervised learning of semantic parsers for mapping instructions to actions",
    "authors": ["Y. Artzi", "L.S. Zettlemoyer."],
    "venue": "Transactions of the Association for Computational Linguistics, 1(1):49–62.",
    "year": 2013
  }, {
    "title": "Cleartk-timeml: A minimalist approach to tempeval 2013",
    "authors": ["Steven Bethard."],
    "venue": "Second Joint Conference on Lexical and Computational Semantics.",
    "year": 2013
  }, {
    "title": "A synchronous context free grammar for time normalization",
    "authors": ["Steven Bethard."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2013
  }, {
    "title": "Semantic parsing freebase: Towards open-domain semantic parsing",
    "authors": ["Q. Cai", "A. Yates."],
    "venue": "Joint Conference on Lexical and Computational Semantics: Proceedings of the Main Conference and the Shared Task: Semantic Textual Similarity.",
    "year": 2013
  }, {
    "title": "Navytime: Event and time ordering from raw text",
    "authors": ["Nathanael Chambers."],
    "venue": "Second Joint Conference on Lexical and Computational Semantics.",
    "year": 2013
  }, {
    "title": "Sutime: A library for recognizing and normalizing time expressions",
    "authors": ["Angel X Chang", "Christopher Manning."],
    "venue": "Proceedings of the 8th International Conference on Language Resources and Evaluation.",
    "year": 2012
  }, {
    "title": "Learning to interpret natural language navigation instructions from observations",
    "authors": ["D.L. Chen", "R.J. Mooney."],
    "venue": "Proceedings of the National Conference on Artificial Intelligence.",
    "year": 2011
  }, {
    "title": "Wide-coverage efficient statistical parsing with CCG and log-linear models",
    "authors": ["S. Clark", "J.R. Curran."],
    "venue": "Computational Linguistics, 33(4):493–552.",
    "year": 2007
  }, {
    "title": "Driving semantic parsing from the world’s response",
    "authors": ["J. Clarke", "D. Goldwasser", "M. Chang", "D. Roth."],
    "venue": "Proceedings of the Conference on Computational Natural Language Learning.",
    "year": 2010
  }, {
    "title": "Generating typed dependency parses from phrase structure parses",
    "authors": ["Marie-Catherine de Marneffe", "Bill MacCartney", "Christopher D. Manning."],
    "venue": "Proceedings of the 5th International Conference on Language Resources and Evaluation.",
    "year": 2006
  }, {
    "title": "Adaptive subgradient methods for online learning and stochastic optimization",
    "authors": ["John Duchi", "Elad Hazan", "Yoram Singer."],
    "venue": "The Journal of Machine Learning Research, 12:2121–2159.",
    "year": 2011
  }, {
    "title": "LIBLINEAR: A library for large linear classification",
    "authors": ["Rong-En Fan", "Kai-Wei Chang", "Cho-Jui Hsieh", "XiangRui Wang", "Chih-Jen Lin."],
    "venue": "Journal of Machine Learning Research, 9:1871–1874.",
    "year": 2008
  }, {
    "title": "Mantime: Temporal expression identification and normalization in the tempeval-3 challenge",
    "authors": ["Michele Filannino", "Gavin Brown", "Goran Nenadic."],
    "venue": "Second Joint Conference on Lexical and Computational Semantics.",
    "year": 2013
  }, {
    "title": "Learning from natural instructions",
    "authors": ["D. Goldwasser", "D. Roth."],
    "venue": "Proceedings of the International Joint Conference on Artificial Intelligence.",
    "year": 2011
  }, {
    "title": "Weakly supervised training of semantic parsers",
    "authors": ["J. Krishnamurthy", "T. Mitchell."],
    "venue": "Proceedings of the Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning.",
    "year": 2012
  }, {
    "title": "Inducing probabilistic CCG grammars from logical form with higher-order unification",
    "authors": ["T. Kwiatkowski", "L.S. Zettlemoyer", "S. Goldwater", "M. Steedman."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2010
  }, {
    "title": "Lexical Generalization in CCG Grammar Induction for Semantic Parsing",
    "authors": ["T. Kwiatkowski", "L.S. Zettlemoyer", "S. Goldwater", "M. Steedman."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2011
  }, {
    "title": "Scaling semantic parsers with on-the-fly ontology matching",
    "authors": ["T. Kwiatkowski", "E. Choi", "Y. Artzi", "L. Zettlemoyer."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2013
  }, {
    "title": "Learning dependency-based compositional semantics",
    "authors": ["P. Liang", "M.I. Jordan", "D. Klein."],
    "venue": "Proceedings of the Conference of the Association for Computational Linguistics.",
    "year": 2011
  }, {
    "title": "Wikiwars: a new corpus for research on temporal expressions",
    "authors": ["Pawet Mazur", "Robert Dale."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing.",
    "year": 2010
  }, {
    "title": "Temporal ontology and temporal reference",
    "authors": ["Marc Moens", "Mark Steedman."],
    "venue": "Computational linguistics, 14(2):15–28.",
    "year": 1988
  }, {
    "title": "The timebank corpus",
    "authors": ["James Pustejovsky", "Patrick Hanks", "Roser Sauri", "Andrew See", "Robert Gaizauskas", "Andrea Setzer", "Dragomir Radev", "Beth Sundheim", "David Day", "Lisa Ferro"],
    "venue": "In Corpus linguistics",
    "year": 2003
  }, {
    "title": "The specification language timeml",
    "authors": ["James Pustejovsky", "Bob Ingria", "Roser Sauri", "Jose Castano", "Jessica Littman", "Rob Gaizauskas", "Andrea Setzer", "Graham Katz", "Inderjeet Mani."],
    "venue": "The language of time: A reader, pages 545–557.",
    "year": 2005
  }, {
    "title": "Surface Structure and Interpretation",
    "authors": ["M. Steedman."],
    "venue": "The MIT Press.",
    "year": 1996
  }, {
    "title": "The Syntactic Process",
    "authors": ["M. Steedman."],
    "venue": "The MIT Press.",
    "year": 2000
  }, {
    "title": "Temporal tagging on different domains: Challenges, strategies, and gold standards",
    "authors": ["Jannik Strötgen", "Michael Gertz."],
    "venue": "Proceedings of the Eigth International Conference on Language Resources and Evaluation.",
    "year": 2012
  }, {
    "title": "Multilingual and cross-domain temporal tagging",
    "authors": ["Jannik Strötgen", "Michael Gertz."],
    "venue": "Language Resources and Evaluation, 47(2):269–298.",
    "year": 2013
  }, {
    "title": "Feature-rich part-ofspeech tagging with a cyclic dependency network",
    "authors": ["Kristina Toutanova", "Dan Klein", "Christopher D Manning", "Yoram Singer."],
    "venue": "Proceedings of the 2003 Conference of the North American Chapter of the Association for Computa-",
    "year": 2003
  }, {
    "title": "Semeval-2013 task 1: Tempeval-3: Evaluating time expressions, events, and temporal relations",
    "authors": ["N. Uzzaman", "H. Llorens", "L. Derczynski", "M. Verhagen", "J. Allen", "J. Pustejovsky."],
    "venue": "Proceedings of the International Workshop on Semantic Evaluation.",
    "year": 2013
  }, {
    "title": "Learning synchronous grammars for semantic parsing with lambda calculus",
    "authors": ["Y.W. Wong", "R.J. Mooney."],
    "venue": "Proceedings of the Conference of the Association for Computational Linguistics.",
    "year": 2007
  }, {
    "title": "Learning to parse database queries using inductive logic programming",
    "authors": ["J.M. Zelle", "R.J. Mooney."],
    "venue": "Proceedings of the National Conference on Artificial Intelligence.",
    "year": 1996
  }, {
    "title": "Learning to map sentences to logical form: Structured classification with probabilistic categorial grammars",
    "authors": ["L.S. Zettlemoyer", "M. Collins."],
    "venue": "Proceedings of the Conference on Uncertainty in Artificial Intelligence.",
    "year": 2005
  }, {
    "title": "Online learning of relaxed CCG grammars for parsing to logical form",
    "authors": ["L.S. Zettlemoyer", "M. Collins."],
    "venue": "Proceedings of the Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning.",
    "year": 2007
  }, {
    "title": "Learning context-dependent mappings from sentences to logical form",
    "authors": ["L.S. Zettlemoyer", "M. Collins."],
    "venue": "Proceedings of the Joint Conference of the Association for Computational Linguistics and International Joint Conference on Natural Lan-",
    "year": 2009
  }],
  "id": "SP:6b9a0429c2e6b9fe36c0b6e8874e37d402a647c1",
  "authors": [{
    "name": "Kenton Lee",
    "affiliations": []
  }, {
    "name": "Yoav Artzi",
    "affiliations": []
  }, {
    "name": "Jesse Dodge",
    "affiliations": []
  }, {
    "name": "Luke Zettlemoyer",
    "affiliations": []
  }],
  "abstractText": "We present an approach for learning context-dependent semantic parsers to identify and interpret time expressions. We use a Combinatory Categorial Grammar to construct compositional meaning representations, while considering contextual cues, such as the document creation time and the tense of the governing verb, to compute the final time values. Experiments on benchmark datasets show that our approach outperforms previous stateof-the-art systems, with error reductions of 13% to 21% in end-to-end performance.",
  "title": "Context-dependent Semantic Parsing for Time Expressions"
}