{
  "sections": [{
    "text": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, pages 2886–2892 Copenhagen, Denmark, September 7–11, 2017. c©2017 Association for Computational Linguistics"
  }, {
    "heading": "1 Introduction",
    "text": "The aspect-based sentiment analysis (ABSA) task is to identify opinions expressed towards specific entities such as laptop or attributes of entities such as price (Liu, 2012a). This task involves three subtasks: Aspect Term Extraction (ATE), Aspect Polarity Detection and Aspect Category Detection. As a fundamental subtask in ABSA, the goal of the ATE task is to identify opinionated aspect expressions. One of most important characteristics is that opinion words can provide indicative clues for aspect detection since opinion words should co-occur with aspect words. Most publicly available datasets contain the gold standard annotations for opinionated aspects, but the ground truth of the corresponding opinion words is not commonly provided. Some works tackling the ATE task ignore the consideration of opinion words and just focus on aspect term modeling and learning (Jin\n∗The work described in this paper is substantially supported by a grant from the Research Grant Council of the Hong Kong Special Administrative Region, China (Project Code: 14203414). We thank Lidong Bing and Piji Li for their helpful comments on this draft and the anonymous reviewers for their valuable feedback.\net al., 2009; Jakob and Gurevych, 2010; Toh and Wang, 2014; Chernyshevich, 2014; Manek et al., 2017; San Vicente et al., 2015; Liu et al., 2015; Poria et al., 2016; Toh and Su, 2016; Yin et al., 2016). They fail to leverage opinion information which is supposed to be useful clues.\nSome works tackling the ATE task consider opinion information (Hu and Liu, 2004a,b; Popescu and Etzioni, 2005; Zhuang et al., 2006; Qiu et al., 2011; Liu et al., 2012b, 2013a,b, 2014) in an unsupervised or partially supervised manner. Qiu et al. (2011) proposed Double Propagation (DP) to collectively extract aspect terms and opinion words based on information propagation over a dependency graph. One drawback is that it heavily relies on the dependency parser, which is prone to generate mistakes when applying on informal online reviews. Liu et al. (2014) modeled relation between aspects and opinions by constructing a bipartite heterogenous graph. It cannot perform well without a high-quality phrase chunker and POS tagger reducing its flexibility. As unsupervised or partially supervised frameworks cannot take the full advantages of aspect annotations commonly found in the training data, the above methods lead to deficiency in leveraging the data. Recently, Wang et al. (2016) considered relation between opinion words and aspect words in a supervised model named RNCRF. However, RNCRF tends to suffer from parsing errors since the structure of the recursive network hinges on the dependency parse tree. CMLA (Wang et al., 2017a) used a multilayer neural model where each layer consists of aspect attention and opinion attention. However CMLA merely employs standard GRU without extended memories.\nWe propose MIN (Memory Interaction Network), a novel LSTM-based deep multi-task learning framework for the ATE task. Two LSTMs with extended memory are designed for handling\n2886\nthe extraction tasks of aspects and opinions. The aspect-opinion relationship is established based on neural memory interactions between aspect extraction and opinion extraction where the global indicator score of opinion terms and local positional relevance between aspects and opinions are considered. To ensure that aspects are from sentimental sentences, MIN employs a third LSTM for sentimental sentence classification facilitating more accurate aspect term extraction. Experiment results over two benchmark datasets show that our framework achieves superior performance."
  }, {
    "heading": "2 Model",
    "text": ""
  }, {
    "heading": "2.1 Overview",
    "text": "Let an input review sentence with T word tokens and the corresponding distributed representations be w = {w1, ..., wT } and x = {x1, ..., xT } respectively. The ATE task is treated as a sequence labeling task with BIO tagging scheme and the set of aspect tags for the word wt is yAt ∈ {B, I,O}, where B, I,O represent beginning of, inside and outside of the aspect span respectively. Commonly found training data contains gold annotations for aspect terms and opinionated sentences, but the gold standard of opinion words are usually not available.\nIn our multi-task learning framework, three tasks are involved: (1) aspect term extraction (ATE), (2) opinion word extraction and (3) sentimental sentence classification. We design a taskspecific LSTM, namely, A-LSTM, O-LSTM and S-LSTM, for tackling each of the above tasks respectively. The first component of our proposed framework consists of A-LSTM and O-LSTM where we equip LSTMs with extended operational memories and some operations are defined over the memories for task-level memory interactions. The second component is to determine if a review sentence is sentimental. This is achieved by employing a vanilla LSTM, namely, S-LSTM."
  }, {
    "heading": "2.2 Model Description",
    "text": "The first component of our framework MIN is composed of A-LSTM and O-LSTM. Both LSTMs have extended memories for task-level memory interactions. A-LSTM involves a large aspect memory HAt ∈ Rnm×dim A h and an opinion summary vectormOt ∈ Rdim O h whereHAt contains nm pieces of aspect hidden states of dimension dimAh and m O t is distilled from H O t . As for\nO-LSTM, similarly, an opinion memory HOt ∈ Rnm×dimOh and an aspect-specific summary vector mAt ∈ Rdim A h are included.\nWe use the aspect term annotations in the training data for training A-LSTM. As there is no ground truth available for opinion words in the training data, sentiment lexicon and highprecision dependency rules are introduced to find potential opinion words. Commonly used opinion words can be found in some general sentiment lexicons. To find opinion words, not in sentiment lexicons, in a sentence, we build a small rule setR composed of dependency relations with high confidence, e.g., amod, nsubj, and determine if wt directly depends on the gold aspect word through the dependencies in R. If so, wt will be treated as a potential opinion word. Then such opinion words are used as training data for O-LSTM.\nIn the memory-enhanced A-LSTM and OLSTM, we manually design three kinds of operations: (1) READ to select nm pieces of aspect (opinion) hidden states from the past memories and build HAt (H O t ); (2) DIGEST to distill an aspect (opinion)-specific summary mAt (m O t ) from HAt (H O t ) where influences of opinion terms and relative positions of inputs are considered; (3) INTERACT to perform interaction between ALSTM and O-LSTM using the task specific summaries (i.e., mAt and m O t ).\nConsider the work flow of A-LSTM for aspect term extraction. Since opinion words and aspect terms should co-occur, the goal of A-LSTM participating in memory interactions is to acquire opinion summaries from O-LSTM (i.e., mOt ) for better aspect prediction. First of all, MIN will READ nm pieces of opinion memories which are most related to wt from O-LSTM. Syntax structure could be used but syntactic parsers are not effective for processing short informal review sentences. Therefore, MIN selects memory segments temporally related to wt. Precisely, the opinion memory at the time step t is HOt = [hOt−1; ...;hOt−nm ] where h O t−i is the (t − i)-th hidden state from O-LSTM. Since the linear context contains most of the parent nodes and the child nodes of wt on the dependency parse tree, treating the corresponding memory segments as relevant segments to wt is reasonable.\nThen MIN will DIGEST the collected opinion memories HOt in the A-LSTM. As different memory segments are not of equal importance for the\ncurrent decision and the same segment in different memories (i.e., different HOt ) also makes a difference, MIN leverages two kind of weights to summarize the collected content. The first weight is the indicator score of being opinion terms denoted as vI ∈ Rnm , which is used to measure how much opinion information the word wt−i (i = 1, .., nm) holds. We adopt Euclidean distance between distributed representations of wt−i and opinion words. It is obvious that computing the distance between xt−i and each opinion word is expensive. Thus, we run an off-the-shelf clustering algorithm over opinion words in the training set and then use the produced nc centroids to estimate the indicator score vIi of wt−i being an opinion word:\nvIi = nc∑\nj=1\n1 ||xt−i − cj ||2 (1)\nwhere xt−i is the distributed representation of wt−i and cj is the centroid vector representation of j-th cluster. This weighting scheme ensures that wt−i is assigned a high score as long as xt−i is close to a particular centroid. The aspect decision of wt is also affected by relative position between wt−i and wt. Thus, MIN employs the second weight vP to explicitly model their positional relevance and the initial weight for the i-th segment vPi is calculated as below:\nvPi = nm − i+ 1∑nm\nk=1 k (2)\nwhere nm is the number of hidden state in HOt . This position-aware weight enables that the closer the word wt−i is to the current input, the more the corresponding memory segment will contribute to the current decision. To better capture the local positional relevance, we make the initialized vP as learnable parameters. Combining the above two weights helps to utilize each active memory segment according to the importance for prediction and mOt , the summary of H O t is generated:\nmOt = (H O t ) >( vI vP ||vI ||2 ) (3)\nwhere denotes element-wise multiplication and || ∗ ||2 is Euclidean norm of vectors. From Equation 3,mOt is dominated by the associated memory segment of wt−i that obtains the high combined weights.\nIn the last operation INTERACT, A-LSTM communicates with O-LSTM by acquiring mOt from O-LSTM and incorporating the summary into the memory update. The update process is as follows:\niAt = σ(W A i xt + U A i [H A t [1] : m O t ]) + b A i )\nfAt = σ(W A f xt + U A f [H A t [1] : m O t ]) + b A f ) ĉAt = tanh(W A c xt + U A c [H A t [1] : m O t ]) + b A c ) oAt = σ(W A o xt + U A o [H A t [1] : m O t ]) + b A o ) cAt = i A t ĉAt + cAt−1 fAt hAt = tanh(c A t ) oAt (4)\nwhere WA∗ , UA∗ and bA∗ are weight parameters of the A-LSTM and σ is the sigmoid activation function. [:] denotes vector concatenation operation. mOt can be seen as the summary of the opinion indicator in the left context of wt and HAt [1] is the most immediate hidden memory of A-LSTM. MIN blends the opinion summary from O-LSTM with the memory from A-LSTM. The co-occurrence relation between aspects and opinion words is modeled by such “memory fusion” strategy. Since opinion words can appear on both sides of wt, memory segments corresponding to the right context (i.e., “future” memory) should be included. Hence, we conduct bi-directional training for A-LSTM.\nThe work flow of memory interaction and the update process of the internal memories in OLSTM are kept same with those in A-LSTM except the DIGEST operation. Specifically, we set mAt , the task-specific summary of A-LSTM, as hAt .\nThe second component of MIN is a generic LSTM called S-LSTM for discriminating sentimental sentences and non-sentimental sentences. The design and the process of the memory update in this component are similar to that in Jozefowicz et al. (2015). In sentences not conveying any sentimental meanings, some words like food, service tend to be misclassified as aspect terms since they are commonly used in user reviews. To avoid this kind of error, we add a constraint that an aspect term should come from sentimental sentence. Specifically, S-LSTM learns the sentimental representation hST of the sentence and then feeds it in aspect prediction as a soft constraint:\nP (yAt |xt) = softmax(WAfc([hAt : hST ])) (5) where WAfc denotes the weight matrix of the fullyconnected softmax layer.\nOn the whole, our proposed MIN framework has three LSTMs and each of them is differentiable. Thus, our MIN framework can be efficiently trained with gradient descent. For ALSTM and O-LSTM, we use the token-level cross-entropy error between the predicted distribution P (yTt |xt) and the gold standard distribution P (yT ,gt |xt) as the loss function (T ∈ {A,O}):\nLoss(T ) = − 1 N ∗ T N∑ i=1 T∑ t=1 P (Y T ,gi,t |Xi,t)\nlog[P (Y Ti,t |Xi,t)] (6)\nFor S-LSTM, sentence-level cross entropy error are employed to calculate the corresponding loss:\nLoss(S) = − 1 N N∑ i=1\nP (Y S,gi |Xi) log[P (Y Si |Xi)] (7)\nThen, losses from different LSTMs are combined to form the training objective of the MIN framework:"
  }, {
    "heading": "3 Experiment",
    "text": ""
  }, {
    "heading": "3.1 Dataset",
    "text": "We conduct experiments on two benchmark datasets from SemEval ABSA challenge (Pontiki et al., 2014, 2016) as shown in Table 1. D1 (SemEval 2014) contains reviews from the laptop domain and D2 (SemEval 2016) contains reviews from the restaurant domain. In these datasets, aspect terms have been labeled and sentences containing at least one golden truth aspect are regarded as sentimental sentences. As gold standard annotations for opinion words are not provided, we select words with strong subjectivity from MPQA1 as potential opinion words. Apart from the common opinion words in the sentiment lexicon, we also treat words, which directly depend on gold standard aspect terms through highprecision dependency rules, as opinion words.\n1http://mpqa.cs.pitt.edu/"
  }, {
    "heading": "3.2 Experiment Design",
    "text": "To evaluate the proposed MIN framework, we perform comparison with the following two groups of methods: (1) CRF based methods:\n• CRF: Conditional Random Fields with basic feature templates2 and word embeddings.\n• Semi-CRF: First-order semi-Markov conditional random fields (Sarawagi et al., 2004) and the feature template in Cuong et al. (2014) is adopted.\n• IHS RD (Chernyshevich, 2014), NLANGP (Toh and Su, 2016): Best systems in ATE subtask in SemEval ABSA challenges (Pontiki et al., 2014, 2016).\n• DLIREC (Toh and Wang, 2014), AUEB (Xenos et al., 2016): Top-ranked CRF-based systems in ATE subtask in SemEval ABSA challenges (Pontiki et al., 2014, 2016).\n• WDEmb (Yin et al., 2016): Enhanced CRF with word embeddings, linear context embeddings and dependency path embeddings.\n(2) Neural Network based methods\n• LSTM: Vanilla bi-directional LSTM with pre-trained word embeddings3.\n• RNCRF (Wang et al., 2016): Dependency Tree based Recursive Neural Network with CRF extractor4.\nFor datasets in the restaurant domain, we train word embeddings of dimension 200 with word2vec (Mikolov et al., 2013) on Yelp reviews5. For those in laptop domain, we use pre-trained glove.840B.300d6.\n2http://sklearn-crfsuite.readthedocs.io/en/latest/ 3As we use our own implementation of LSTM, the reported results are different from those in (Liu et al., 2015) 4Specifically, we list the result of RNCRF over D1 without opinion annotations for fair comparison. As no result is provided for RNCRF-no-opinion over D2, we report the corresponding performance of the full model. See their following works (Wang et al., 2017a,b). Also, CMLA (Wang et al., 2017a) reports better results than RNCRF but we do not compare with it. The reason is that CMLA introduces the gold standard opinion labels in the training data while such labels are not available for our experiments\n5https://www.yelp.com/dataset challenge 6https://nlp.stanford.edu/projects/glove/\nThe hyper-parameters are selected via ten-fold cross validation. The dimension of hidden representations are 100, 20, 40 for A-LSTM, O-LSTM and S-LSTM respectively. The dropout rate for O-LSTM and S-LSTM is 0.4. The size of the aspect (opinion) memory nm is 4. The batch size is set to 32. As for initialization of network parameters, we adopt the strategy that the initial weights are sampled from the uniform distribution (Glorot and Bengio, 2010). We employ ADAM (Kingma and Ba, 2014) as optimizer and the default settings of ADAM are used.\nTo better reveal the capability of the proposed MIN, we train 5 models with the same group of hyper-parameters and report the average F1 score over the testing set."
  }, {
    "heading": "3.3 Results and Analysis",
    "text": "Table 2 depicts experiment results. Compared to the best systems in SemEval challenge, MIN achieves 3.0% and 1.1% absolute gains on D1 and D2 respectively. Besides, our MIN outperforms WDEmb, a strong CRF-based system benefiting from several kinds of useful word embeddings, by 2.1% on D1. With memory interactions and consideration of sentimental sentence, our MIN boosts the performance of vanilla bi-directional LSTM (+2.0% and +1.7% respectively). It validates the effectiveness of the manually designed memory operations and the proposed memory interaction mechanism. MIN also outperforms the state-of-the-art RNCRF on each dataset suggesting that memory interactions can be an alternative strategy instead of syntactic parsing. To further study the impact of each element in MIN, we conduct ablation experiments. As shown in Table 3, removing bi-directionality decreases the extraction performances (-2.0% and -1.0%). The soft\nsentimental constraint proves to be useful since MIN is 1.5% and 1.0% superior than the framework without S-LSTM on D1 and D2 respectively. O-LSTM brings in the largest performance gains on D2 compared with ablated framework (i.e., MIN without O-LSTM), verifying our postulation that aspect-opinion “interaction” is more effective than only considering aspect terms. We also observe that the contribution of O-LSTM is less significant than that of bi-directionality on D1 (+1.6% vs +2.0%). This is reasonable since using opinion words as adjective modifiers placed after the aspects is common in English."
  }, {
    "heading": "4 Conclusions",
    "text": "We propose Memory Interaction Network (MIN), a multi-task learning framework, to detect aspect terms from the online user reviews. Compared with previous studies, our MIN has following features:\n• Co-occurrence pattern between aspects and opinions is captured via memory interactions, where the neural memory operations are designed to summarize task-level information and perform interactions.\n• A novel LSTM unit with extended memories is developed for memory interactions."
  }],
  "year": 2017,
  "references": [{
    "title": "Ihs r&d belarus: Crossdomain extraction of product features using crf",
    "authors": ["Maryna Chernyshevich."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation (SemEval 2014), pages 309– 313.",
    "year": 2014
  }, {
    "title": "Conditional random field with high-order dependencies for sequence labeling and segmentation",
    "authors": ["Nguyen Viet Cuong", "Nan Ye", "Wee Sun Lee", "Hai Leong Chieu."],
    "venue": "Journal of Machine Learning Research, 15(1):981–1009.",
    "year": 2014
  }, {
    "title": "Understanding the difficulty of training deep feedforward neural networks",
    "authors": ["Xavier Glorot", "Yoshua Bengio."],
    "venue": "Proceedings of AISTATS, pages 249– 256.",
    "year": 2010
  }, {
    "title": "Mining and summarizing customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of KDD, pages 168–177.",
    "year": 2004
  }, {
    "title": "Mining opinion features in customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of AAAI, pages 755–760.",
    "year": 2004
  }, {
    "title": "Extracting opinion targets in a single and cross-domain setting with conditional random fields",
    "authors": ["Niklas Jakob", "Iryna Gurevych."],
    "venue": "Proceedings of EMNLP, pages 1035–1045.",
    "year": 2010
  }, {
    "title": "A novel lexicalized hmm-based learning framework for web opinion mining",
    "authors": ["Wei Jin", "Hung Hay Ho", "Rohini K Srihari."],
    "venue": "Proceedings of ICML, pages 465–472.",
    "year": 2009
  }, {
    "title": "An empirical exploration of recurrent network architectures",
    "authors": ["Rafal Jozefowicz", "Wojciech Zaremba", "Ilya Sutskever."],
    "venue": "Proceedings of ICML, pages 2342–2350.",
    "year": 2015
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["Diederik Kingma", "Jimmy Ba."],
    "venue": "Proceedings of ICLR.",
    "year": 2014
  }, {
    "title": "Sentiment analysis and opinion mining",
    "authors": ["Bing Liu."],
    "venue": "Synthesis lectures on human language technologies, 5(1):1–167.",
    "year": 2012
  }, {
    "title": "Opinion target extraction using partially-supervised word alignment model",
    "authors": ["Kang Liu", "Heng Li Xu", "Yang Liu", "Jun Zhao."],
    "venue": "Proceedings of IJCAI, pages 2134–2140.",
    "year": 2013
  }, {
    "title": "Opinion target extraction using word-based translation model",
    "authors": ["Kang Liu", "Liheng Xu", "Jun Zhao."],
    "venue": "Proceedings of EMNLP/CoNLL, pages 1346–1356.",
    "year": 2012
  }, {
    "title": "Syntactic patterns versus word alignment: Extracting opinion targets from online reviews",
    "authors": ["Kang Liu", "Liheng Xu", "Jun Zhao."],
    "venue": "Proceedings of ACL, pages 1754–1763. Association for Computational Linguistics.",
    "year": 2013
  }, {
    "title": "Extracting opinion targets and opinion words from online reviews with graph co-ranking",
    "authors": ["Kang Liu", "Liheng Xu", "Jun Zhao."],
    "venue": "Proceedings of ACL, pages 314–324. Association for Computational Linguistics.",
    "year": 2014
  }, {
    "title": "Finegrained opinion mining with recurrent neural networks and word embeddings",
    "authors": ["Pengfei Liu", "Shafiq Joty", "Helen Meng."],
    "venue": "Proceedings of EMNLP, pages 1433–1443.",
    "year": 2015
  }, {
    "title": "Aspect term extraction for sentiment analysis in large movie reviews using gini index feature selection method and svm classifier",
    "authors": ["Asha S Manek", "P Deepa Shenoy", "M Chandra Mohan", "KR Venugopal."],
    "venue": "World Wide Web Journal, 20(2):135–154.",
    "year": 2017
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Greg S Corrado", "Jeff Dean."],
    "venue": "Proceedings of NIPS, pages 3111–3119.",
    "year": 2013
  }, {
    "title": "Semeval-2016 task 5: Aspect based sentiment analysis",
    "authors": ["talia Loukachevitch", "Evgeniy Kotelnikov", "Núria Bel", "Salud Marı́a Jiménez-Zafra", "Gülşen Eryiğit"],
    "venue": "In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval-2016),",
    "year": 2016
  }, {
    "title": "Semeval-2014 task 4: Aspect based sentiment analysis",
    "authors": ["Maria Pontiki", "Dimitris Galanis", "John Pavlopoulos", "Harris Papageorgiou", "Ion Androutsopoulos", "Suresh Manandhar."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation",
    "year": 2014
  }, {
    "title": "Extracting product features and opinions from reviews",
    "authors": ["Ana-Maria Popescu", "Oren Etzioni."],
    "venue": "Proceedings of EMNLP, pages 339–346.",
    "year": 2005
  }, {
    "title": "Aspect extraction for opinion mining with a deep convolutional neural network",
    "authors": ["Soujanya Poria", "Erik Cambria", "Alexander Gelbukh."],
    "venue": "Knowledge-Based Systems, 108:42–49.",
    "year": 2016
  }, {
    "title": "Opinion word expansion and target extraction through double propagation",
    "authors": ["Guang Qiu", "Bing Liu", "Jiajun Bu", "Chun Chen."],
    "venue": "Computational Linguistics, 37(1):9–27.",
    "year": 2011
  }, {
    "title": "Elixa: A modular and flexible absa platform",
    "authors": ["Iñaki San Vicente", "Xabier Saralegi", "Rodrigo Agerri."],
    "venue": "Proceedings of the 9th International Workshop on Semantic Evaluation (SemEval 2015), pages 748–752.",
    "year": 2015
  }, {
    "title": "Semimarkov conditional random fields for information extraction",
    "authors": ["Sunita Sarawagi", "William W Cohen"],
    "venue": "In Proceedings of NIPS,",
    "year": 2004
  }, {
    "title": "Nlangp at semeval2016 task 5: Improving aspect based sentiment analysis using neural network features",
    "authors": ["Zhiqiang Toh", "Jian Su."],
    "venue": "Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval-2016), pages 282–288.",
    "year": 2016
  }, {
    "title": "Dlirec: Aspect term extraction and term polarity classification system",
    "authors": ["Zhiqiang Toh", "Wenting Wang."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation (SemEval 2014), pages 235–240.",
    "year": 2014
  }, {
    "title": "Multi-task coupled attentions for categoryspecific aspect and opinion terms co-extraction",
    "authors": ["Wenya Wang", "Sinno Jialin Pan", "Daniel Dahlmeier."],
    "venue": "arXiv preprint arXiv:1702.01776. 2891",
    "year": 2017
  }, {
    "title": "Recursive neural conditional random fields for aspect-based sentiment analysis",
    "authors": ["Wenya Wang", "Sinno Jialin Pan", "Daniel Dahlmeier", "Xiaokui Xiao."],
    "venue": "Proceedings of EMNLP, pages 616–626. Association for Computational Linguistics.",
    "year": 2016
  }, {
    "title": "Coupled multi-layer attentions for co-extraction of aspect and opinion terms",
    "authors": ["Wenya Wang", "Sinno Jialin Pan", "Daniel Dahlmeier", "Xiaokui Xiao."],
    "venue": "Proceedings of AAAI, pages 3316–3322.",
    "year": 2017
  }, {
    "title": "Aueb-absa at semeval-2016 task 5: Ensembles of classifiers and embeddings for aspect based sentiment analysis",
    "authors": ["Dionysios Xenos", "Panagiotis Theodorakakos", "John Pavlopoulos", "Prodromos Malakasiotis", "Ion Androutsopoulos."],
    "venue": "Proceedings of",
    "year": 2016
  }, {
    "title": "Unsupervised word and dependency path embeddings for aspect term extraction",
    "authors": ["Yichun Yin", "Furu Wei", "Li Dong", "Kaimeng Xu", "Ming Zhang", "Ming Zhou."],
    "venue": "Proceedings of IJCAI, pages 2979– 2985.",
    "year": 2016
  }, {
    "title": "Movie review mining and summarization",
    "authors": ["Li Zhuang", "Feng Jing", "Xiao-Yan Zhu."],
    "venue": "Proceedings of CIKM, pages 43–50.",
    "year": 2006
  }],
  "id": "SP:88d5afb4035e36f5d82c8657361602957fb48b74",
  "authors": [{
    "name": "Xin Li",
    "affiliations": []
  }, {
    "name": "Wai Lam",
    "affiliations": []
  }],
  "abstractText": "We propose a novel LSTM-based deep multi-task learning framework for aspect term extraction from user review sentences. Two LSTMs equipped with extended memories and neural memory operations are designed for jointly handling the extraction tasks of aspects and opinions via memory interactions. Sentimental sentence constraint is also added for more accurate prediction via another LSTM. Experiment results over two benchmark datasets demonstrate the effectiveness of our framework.",
  "title": "Deep Multi-Task Learning for Aspect Term Extraction with Memory Interaction"
}