{
  "sections": [{
    "heading": "1. Introduction",
    "text": "The study of relational data arising from various networks including social, biological and physical networks is becoming increasingly important due to the emergence of massive relational data collected from these domains. Many efforts have been dedicated to develop statistical models in terms of community detection and missing link prediction for analyzing relational data arising from static networks, where either a single snapshot of the network of interest or an aggregated network over time is presented; see (Goldenberg et al., 2010) for a review of the literature. However, network data, such\n1Department of Electrical Engineering and Information Technology, Technische Universität Darmstadt, Germany. Correspondence to: Sikun Yang <sikun.yang@bcs.tu-darmstadt.de>, Heinz Koeppl <heinz.koeppl@bcs.tu-darmstadt.de>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nas friendships or interactions in a social network, is often dynamic since the relations among the entities within the network may appear or disappear over time (Mucha et al., 2010). Accordingly, the latent groups composed of those temporally connected entities also form and decay over time. Hence, appropriate models are needed to enable a better understanding of the formation and evolution of dynamic networks (Phan & Airoldi, 2015).\nA probabilistic framework is proposed to model such dynamic networks by assuming the network of interest is composed of a set of latent groups. Each node of the observed network is hence associated with a time-dependent memberships vector that governs its involvement in multiple groups and interactions with other nodes. The node-group memberships are assumed to be gamma distributed, thus, naturally nonnegative real-valued. Moreover, to capture time-evolving interactions between groups of nodes, we model the birth and death dynamics of individual groups explicitly via a dependent relational gamma process (dRGaP). The ideal number of latent groups can be adaptively learned from data via the shrinkage mechanism of the dRGaP.\nExplicitly modelling group birth/death dynamics can be useful in many applications. For instance, latent groups in a network of military disputes between countries could mean alliances such as NATO coordinating collective defence to attacks by external forces (Schein et al., 2016a). These groups can be born and die afterwards. For example, the Warsaw Pact was established during the Cold War and dissolved in later years. We demonstrate that our model can discover interpretable latent structure on a real network of military interstate disputes (Ghosn et al., 2004) that agrees with our knowledge of international relations (Section 5). Furthermore, it is reasonable to model the time-evolving memberships of each individual node to interpret its joining and withdrawing behavior to these groups. Hence, we capture the dynamics of individual node-group memberships evolving over time via gamma Markov processes.\nIn contrast to dynamic network modelling using logistic or probit mapping functions (Foulds et al., 2011; Heaukulani et al., 2013; Durante et al., 2014a), we leverage the Bernoulli-Poisson link (BPL) function (Dunson & Herring, 2005; Zhou, 2015) to generate edges from the latent space representation, which makes the computational cost of our\nmodel to scale linearly with the number of edges, rather than quadratically with the number of nodes. In addition, the Bernoulli-Poisson link is also a more appropriate model for imbalanced binary data (Zhou, 2017; Hu et al., 2015), which makes the proposed model appealing for analyzing real-world relational data that are usually extremely sparse. To perform inference, we present an efficient Gibbs sampling algorithm exploiting the Pólya-gamma data augmentation technique (Polson et al., 2013) and the data augmentation and marginalization technique for discrete data (Zhou et al., 2015).\nThe paper is organized as follows. In Section 2, we shortly review the gamma process and the thinned completely random measure framework. In Section 3, we present our generative model. In Section 4, we discuss some related work. Experimental results are provided in Section 5. The complete Gibbs sampling algorithm and additional experimental results are presented in the supplementary material."
  }, {
    "heading": "2. Covariate-Dependent Random Measures",
    "text": "Our dynamic network model is based on the thinned completely random measures (tCRMs) framework, originally proposed in (Foti et al., 2013) for the construction of covariate-dependent topic models and latent feature models. We generalize this construction for longitudinal network modelling. More specifically, a set of latent groups that constitute the underlying structure of the observed dynamic network is generated. Via the tCRMs framework, the generated groups are allowed to form and decay over time. To facilitate understanding, we shortly review the gamma process and the thinned CRMs."
  }, {
    "heading": "2.1. Gamma Process",
    "text": "The gamma process (GaP) is a completely random measure (CRM) (Kingman, 1967) defined on the product space Θ × R>0 as G ∼ GaP(G0, c), where c is a scale parameter, and G0 is a finite and continuous base measure over a complete separable metric space Θ, such that G(Sk) ∼ Gamma(G0(Sk), c) are independent gamma random variables for disjoint subsets {Sk}∞k=1 of Θ. The positive Lévy measure of the gamma process can be expressed as ν(dr) = cr−1e−crdr. As a completely random measure, the gamma process can be regarded as a Poisson process on Θ × R>0 with mean measure ν(dθ,dr). A sample from this Poisson process consists of countably infinite atoms because ∫ ∫ Θ×R>0 ν(dθ,dr) = ∞. Thus, a sample from the gamma process can be expressed as G = ∑∞ k=1 rkδθk ∼ GaP(G0, c). More detailed information about the gamma process can be found in (Wolpert et al., 1998; 2011)."
  }, {
    "heading": "2.2. The Thinned CRMs Framework",
    "text": "Let Π = {(xk, θk, rk)}∞k=1 be generated by a Poisson process on the augmented product space X × Θ × R>0 with mean measure ν(dx, dθ,dr). Let G = ∑∞ k=1 rkδ(xk,θk) be a CRM on X × Θ × R>0, and let T denote the time set as the coveriate. Our goal is to construct a family of random measures {G(t)}t∈T dependent on covariate values t ∈ T . To achieve this, we generate a set of binary random variables b(t)k for each point (xk, rk, θk) ∈ Π such that p(b\n(t) k = 1) = Pxk(t), where Px : T → [0, 1] denotes the thinning function which determines the probability that atom k in the global measure G appears in the local measure G(t) at covariate value t. Then, the set of covariate-dependent CRMs {G(t)}t∈T can be specified as\nG(t) = ∞∑ k=1 b (t) k rkδθk , t ∈ T .\nThe new CRMs are well-defined by the mapping theorem for the Poisson processes (Kingman, 1993), that is proved in (Foti et al., 2013). As a concrete example, we exploit a thinned gamma process (tGaP) to model the global atoms and their activity/inactivity at multiple time points originally developed for dynamic topic models. Let ν(dx,dθ,dr) = H(dx)G0(dθ)ν0(dr), where ν0(dr) = cr−1e−crdr is the Lévy measure of the gamma process. We transform a Gaussian basis kernel pointwise using a logistic function as the thinning function:\nPxk(t) = σ { ω0k + T∑ l=1 ωlk exp[−φk(t− l)2] } ,\nwhere σ(x) = 1/(1 + exp(−x)) denotes the logistic function. We fix the centres of these kernels to the T discrete time points in covariate space T . We characterize each location xk ∈ X by a set of T + 1 kernel weights ωlk ∈ R, and a (shared) kernel width φk uniformly drawn from a fixed dictionary {φ∗1, . . . , φ∗D} of size D. To encourage sparsity of the kernel weights, we place a normalinverse gamma prior over ωlk, i.e., ωlk ∼ NIG(ωlk; 0, 1, 1). Hence, the base measure H(dx) can be expressed as H(dx) = NIG(ωlk; 0, 1, 1)Cat(φk; {φ∗1, . . . , φ∗D}). The generative procedure can be expressed as\nG = ∞∑ k=1 rkδ(xk,θk) ∼ CRM(ν(dx, dθ,dr)), (1)\nωlk ∼ NIG(0, 1, 1), φk ∼ Cat(φ∗1, . . . , φ∗D),\nPxk(t) = σ { ω0k + T∑ l=1 ωlk exp[−φk(t− l)2] } ,\nb (t) k ∼ Bernoulli [ Pxk(t) ] , G(t) = ∞∑ k=1 b (t) k rkδθk ."
  }, {
    "heading": "3. Model Formulation",
    "text": "We represent a dynamic network by a sequence of adjacency matrices A(t) for each time t = 1, 2, . . . , T . For the sake of clarity, we limit our focus to unweighted (binary) undirected (symmetric) dynamic networks without self-links although the proposed model can straightforwardly be generalized to nonnegative real-weighted networks via the Poisson randomized gamma distribution (Zhou et al., 2016). We denote each snapshot of a dynamic network by A(t) ∈ {0, 1}N×N with N being the number of nodes. The binary symmetric matrix A(t) has entries A(t)ij = 1 if an edge between nodes i and j is present at time t, and A(t)ij = 0 otherwise. Let Π (t) ij be the link probability between nodes i and j. Our model specifies\nA (t) ij | Π (t) ij ∼ Bernoulli(Π (t) ij ), t ∈ T\nindependently for each i = 2, . . . , N and j = 1, . . . , i− 1, with\nE [ A\n(t) ij | Π (t) ij\n] = 1− exp ( −\nK∑ k=1 K∑ k′=1 z (t) ik λ (t) kk′z (t) jk′\n) ,\nwhere z(t)ik ∈ R>0 characterizes the membership of node i to group k at time t ∈ T . In contrast to the latent feature relational models (Foulds et al., 2011; Heaukulani et al., 2013; Kim et al., 2013) that assume binary node-group relationships, our nonnegative memberships capture how strongly each node associates with multiple groups. The group interaction weight λ(t)kk′ modulates the probability that there exists a link between a node affiliated to group k and a second node affiliated to group k′ at time t. Our framework exploits the dynamics of the underlying relations between nodes on two levels: (1) The latent groups can be active and inactive; and (2) the memberships of each node to groups evolve over time. We now proceed to describe each component of our framework in the following sections."
  }, {
    "heading": "3.1. Model of Active Groups",
    "text": "Many previous works (Kim et al., 2013; Xu, 2015) have shown that explicitly modelling the dynamics of latent groups using a distance-dependent Indian buffet process (dd-IBP) (Gershman et al., 2015) or a linear dynamical system discovers interpretable latent structures and achieves good predictive performance. Here, we build the group interaction weight λkk′ on the relational gamma process construction (Zhou, 2015). For implementation convenience, we use a truncated version of the infinite capacity model by fixing the maximum number of groups toK. That is, we first generate a group weight rk independently for each group k as rk ∼ Gamma(γ0/K, c), where γ0 denotes the concentration parameter and c denotes the rate parameters. Then,\nthe inter-group interaction weight λkk′ and intra-group interaction weight λkk can be generated as\nλkk′ ∼\n{ Gamma(ξrk, β), if k = k′\nGamma(rkrk′ , β), otherwise (2)\nwhere ξ ∼ Gamma(1, 1) and β ∈ R>0.\nFor dynamic relational data, we exploit the thinned CRMs framework to capture the birth/death dynamics of latent groups assuming that the status of group k can be either active or inactive at time t. More specifically, we use a Bernoulli random variable b(t)k = 1 to indicate the presence of group k at time t, and b(t)k = 0 otherwise. Accordingly, the interaction weight between group k and k′ is active at time t only if the two groups are both active at that time, i.e., λ\n(t) kk′ = λkk′b (t) k b (t) k′ .\nGiven the group interaction weight matrix Λ defined in Eq. (2), we generate the time-dependent group interaction weights λ(t)kk′ using the thinning function introduced in Section 2.2 with the prior specification:\nωlk ∼ NIG(0, 1, 1), φk ∼ Cat(φ∗1, . . . , φ∗D),\nPxk(t) = σ { ω0k + T∑ l=1 ωlk exp[−φk(t− l)2] } ,\nwhere we fix the centres of the covariate-dependent kernel functions to the T discrete time points of the considered dynamic network. The probability of activity/inactivity of group k at time t can be determined by the thinning function. A smooth thinning function can encourage the snapshots of a dynamic network at nearby covariate values t to share a similar set of groups."
  }, {
    "heading": "3.2. Dynamics of Node-Group Memberships",
    "text": "To capture the temporal dynamics of node-group memberships, we represent the individual memberships as independently evolving gamma Markov chains. More specifically, the individual membership z(t)ik is assumed to be gamma distributed with shape parameter z(t−1)ik , where z (t−1) ik corresponds to the membership of the same node at the previous time, and rate parameter τ as\nz (t) ik ∼ Gamma(z (t−1) ik , τ), t ∈ T (3) z (1) ik ∼ Gamma(θik, τ),\nwhere we assume each membership starts off in a dummy state (θik for i = 1, . . . , N , and k = 1, . . . ,K). We place a gamma prior over the dummy node membership θik, i.e. θik ∼ Gamma(1, 1). Given the group interaction weights {λ(t)kk′} and node-group memberships {z (t) ik } generated by our model, we generate an edge A(t)ij between two nodes i\nand j at time t via the Bernoulli-Poisson link (BPL) function as\nm (t) ij ∼ Poisson ( K∑ k=1 K∑ k′=1 z (t) ik λ (t) kk′z (t) jk′ ) , (4)\nA (t) ij = 1(m (t) ij ≥ 1), t ∈ T\nwhere mij is a latent Poisson count that measures how often nodes i and j interact in the latent space representation. Marginalizing out m(t)ij from Eq. (4) yields\nA (t) ij ∼ Bernoulli\n[ 1− exp ( −\nK∑ k=1 K∑ k′=1 z (t) ik λ (t) kk′z (t) jk′\n)] .\nThe conditional distribution of the latent count m(t)ij can be expressed as\n(m (t) ij | A (t) ij ,−) ∼ A (t) ij Poisson+ ( K∑ k=1 K∑ k′=1 z (t) ik λ (t) kk′z (t) jk′ ) ,\nwhere x ∼ Poisson+(σ) is the zero-truncated Poisson distribution with support only on the positive integers, and “–” denotes all other variables. We note that if A(t)ij = 0, then m(t)ij = 0 almost surely (a.s.), and if A (t) ij = 1, then m (t) ij ∼ Poisson+( ∑K k=1 ∑K k′=1 z (t) ik λ (t) kk′z (t) jk′). Thus, the latent count m(t)ij only needs to be sampled for A (t) ij = 1 with a rejection sampler (Zhou, 2015). This property makes the proposed model appealing for modelling large sparse dynamic networks because the computational cost of our model scales linearly with the number of edges."
  }, {
    "heading": "3.3. Bayesian Nonparametric Interpretation",
    "text": "As K → ∞, the group weights and their corresponding dummy node memberships vector constitute a draw from a gamma process as G = ∑∞ k=1 rkδθk , where θk = (θ1k, . . . , θNk) ∈ Θ is an atom sampled from a N-dimensional base measure G0(dθk)/G0(Θ) =∏N i=1 Gamma(1, 1). Accordingly, the intra- and intergroup interaction weights and their corresponding pair of node memberships vector constitute a draw Λ | G =∑∞ k=1 ∑∞ k′=1 λkk′δ(θk,θk′ ) from a relational gamma process (Zhou, 2015). Via the thinned CRMs framework, Λ(t) | Λ = ∑∞ k=1 ∑∞ k′=1 b (t) k b (t) k′ λkk′δ(θk,θk′ ) can be viewed as a draw from a covariate-dependent relational gamma process. For brevity, the definitions of these processes are presented in the supplementary material."
  }, {
    "heading": "3.4. The Full Generative Model",
    "text": "The full generative model (truncated) for the observed dynamic network data {A(t)}t∈T along with the latent vari-\nables, parameters, and hyperparameters, is given by\nrk ∼ Gamma(γ0/K, c), θik ∼ Gamma(1, 1), (5) ξ ∼ Gamma(1, 1),\nλkk′ ∼\n{ Gamma(ξrk, β), if k = k′\nGamma(rkrk′ , β), otherwise\nωlk ∼ NIG(0, 1, 1), φk ∼ Cat(φ∗1, . . . , φ∗D),\nb (t) k ∼ Bernoulli ( σ { ω0k + T∑ l=1 ωlk exp[−φk(t− l)2] }) ,\nz (t) ik ∼ Gamma(z (t−1) ik , τ), z (1) ik ∼ Gamma(θik, τ),\nλ (t) kk′ = b (t) k λkk′b (t) k′ ,m (t) ij ∼ Poisson  K∑ k,k′=1 z (t) ik λ (t) kk′z (t) jk′  , A\n(t) ij = 1(m (t) ij ≥ 1)."
  }, {
    "heading": "3.5. Inference via Gibbs Sampling",
    "text": "LetA(1:t) denotes the sequenceA(1), . . . , A(t) and similarly for Z(1:t) and Λ(1:t). The model parameters that need to be sampled include: latent node-group memberships {z(t)ik }, {θik}, individual group weights {rk}, scale parameter ξ, groups interaction weights {λkk′}, kernel weights {ωlk}, kernel widths {φk}, thinning variables {b(t)k }, and latent counts {m(t)ij }. Exploiting the Pólya-gamma data augmentation technique (Polson et al., 2013) and the data augmentation and marginalization technique (Zhou et al., 2015), a simple and efficient Gibbs sampling algorithm is developed to perform the model inference. The details of our inference algorithm are presented in the supplementary material."
  }, {
    "heading": "4. Related Work",
    "text": "Prior works on dynamic networks modelling include the exponential random graph model (ERGM) (Guo et al., 2007), matrix and tensor factorization based methods (Dunlavy et al., 2011) and statistical models (Sarkar et al., 2007; 2014; Ishiguro et al., 2010; Durante et al., 2014b; Schein et al., 2016a; Palla et al., 2016). Statistical dynamic network models received considerable attention because these models have favourable interpretability by providing uncertainty estimates for the uncovered latent representations (Hoff et al., 2001). Dynamic extensions of the mixed membership stochastic blockmodel (MMSB) (Airoldi et al., 2008) have been developed (Fu et al., 2009; Xing et al., 2010; Ho et al., 2011) using linear state space models to capture the evolution of real-valued node-group memberships. Recently, an extended Kalman filter (EKF) based algorithm (Xu et al., 2014) was proposed to infer dynamic stochastic blockmodels (SBM) with competitive performance. Dynamic extensions of the latent feature relational model (LFRM) (Miller et al., 2009) using an infinite factorial hidden Markov pro-\ncess to capture the evolution of binary node-group memberships include the dynamic relational infinite feature model (DRIFT) (Foulds et al., 2011), the latent feature propagation model (LFP) (Heaukulani et al., 2013), and the dynamic multi-group membership graph model (DMMG) (Kim et al., 2013).\nOur proposed model is a form of Poisson factorization model (Zhou et al., 2015; Gopalan et al., 2015), and can be considered as the dynamic extension of the hierarchical gamma process edge partition model (HGPEPM) (Zhou, 2015). The dependent CRM framework (Foti et al., 2013) has been exploited for dynamic topic models and dependent latent feature models previously. To the best of our knowledge, this is the first attempt to model activity and inactivity of latent groups using a thinned CRMs framework in longitudinal network modelling. Our Markov chain construction, used to capture the evolution of node-group memberships, is inspired by the data augmentation technique (Zhou et al., 2015) that has been exploited for dynamic matrix factorization (Acharya et al., 2015a; Schein et al., 2016b) and deep gamma belief networks (Zhou et al., 2016). We note that the dynamic gamma process Poisson factorization (DGPPF) (Acharya et al., 2015b) has been proposed using gamma Markov chains to model the evolution of latent groups while the D-GPPF assumes node memberships are static over time. Yang & Koeppl (2018) directly generalized the relational gamma process model to dynamic networks using gamma Markov chains to model node-group evolving behavior. For longitudinal networks, it is more reasonable to explicitly model the birth and death dynamics of latent groups by switching off redundant groups to avoid overfitting the data and to strengthen the interpretability of the latent network structure."
  }, {
    "heading": "5. Experiments",
    "text": "We demonstrate that the proposed Dependent Relational Gamma Process Model (DRGPM) infers more interpretable latent structure compared with the related methods using a synthetic example. Quantitive evaluations of our model, compared with state-of-the-art methods as discussed in Section 4, are performed in terms of missing link prediction and future network forecasting on three real-world data sets. The first baseline is the dynamic relational infinite feature model (DRIFT) for which we used the code provided by Foulds et al. (2011).1 Additionally, we implemented the D-GPPF, where we set the hyperparameters and initialized the model parameters with the values provided in (Acharya et al., 2015b). The third baseline is the dynamic stochastic blockmodel (DSBM) based on an extended Kalman filter (EKF) augmented with a local search, for which we use\n1http://jfoulds.informationsystems.umbc. edu/code/DRIFT.tar.gz.\nthe released code2 with the default settings. We also compare DRGPM with the hierarchical gamma process edge partition model (HGPEPM) (Zhou, 2015)3 and the dynamic Poisson gamma model (DPGM) (Yang & Koeppl, 2018) that only models the evolving node memberships. Moreover, we demonstrate that our model can discover highly interpretable latent structure on a military interstate disputes dataset. In the experiments, we set the hyperparameters for our model as γ0 = 1, β = 1, c = 1, τ = 1. Unless otherwise stated, we use K = N/2 for initilization, where N is the number of nodes. A sensitivity analysis revealed that we obtain similar results when instead setting γ0 = 0.1 or γ0 = 10. All the experiments were run on a standard desktop with 2.7 GHz CPU and 24 GB RAM."
  }, {
    "heading": "5.1. Simulation Study",
    "text": "Following the procedure suggested by Durante et al. (2016), we generate synthetic data to evaluate our proposed model in estimating the formation and evolution of the latent network sturcture. We consider a dynamic network with N = 50 nodes monitored for T = 70 equally spaced time snapshots. To generate a time-varying network, we first generate five regimes defining the true edge probabilities, as shown in Figure 2. We then simulate the network edges A\n(t) ij | Π (t) ij ∼ Bernoulli(Π (t) ij ) with each of the five regimes according to Figure 1. To demonstrate that DRGPM can infer interpretable latent structure while avoiding to overfit the data, we compare DRGPM with D-GPPF and DPGM. We initialize all methods setting K = 30.\n2https://tinyurl.com/ydf29he9. 3https://github.com/mingyuanzhou/EPM.\nredundant groups over time, which strengthens the model interpretability for longitudinal network analysis. In Figure 4, we depict the thinning probabilities (mean of b(t)k ) over time for six inferred active groups by DRGPM. We notice that\nDRGPM infers three groups (4, 11, 24) at t = 0, turns off Group 4 and turns on Groups 3 and 7 at t = 10. Group 28 is only active from t = 30 to 40. The comparison of DRGPM to DPGM is presented in the supplementary material."
  }, {
    "heading": "5.2. Quantitative Results",
    "text": "For the quantitative evaluation, we consider the following data sets: (1) Face-to-face dynamic contacts network (FFDC): This dataset (Mastrandrea et al., 2015) records timestamped face-to-face contacts among 180 students for 7 school days. We generated a dynamic network considering each school day as a snapshot, and created an edge between each pair of students at time t if they have at least one contact recorded at that given time. (2) DBLP: The DBLP co-authorship network data (Asur et al., 2009) contains the co-authorship information among 958 authors over ten years (1997-2006) in 28 conferences which spans three related research topics-database, data mining, and artificial\nintelligence. We focus on a subset of 324 most connected authors over all time period. (3) Enron: The Enron data4 contains 517,431 emails among 151 users over 38 months (from May 1999 to June 2002). We generated a dynamic network aggregating the data into monthly snapshots, and created an edge between each pair of users at time t if they have at least one email recorded at that given time. The summary statistics are detailed in Table 2.\nTask 1: Predicting missing links First, we perform missing link prediction on the real-world data sets, and show the proposed model’s predictive performance compared to the baseline models. We randomly hold out 20% of the network entries (either links or non-links) for each snapshot as test data, and use the remaining 80% to predict the held-out entries. DRIFT was infeasible to run on the Enron dataset in a reasonable amount of time given our computational resource. For DSBM, we either set K to the true number of classes provided by the data set or initialize it by examining the singular values of the first snapshot (Xu et al., 2014). We apply HGPEPM to each snapshot of dynamic networks independently. For all probabilistic methods, we use 2000 burn-in iterations, and collect 1000 samples from the model posterior distribution. We estimate the posterior mean of the edge probability for each held-out edge in the test data by averaging over the collected Gibbs samples. We then use these edge probabilities to evaluate the predictive performance of each model by calculating the area under the curve of the receiver operating characteristic (AUROC) and of the precision-recall (PR). In Table 1, we report the average evaluation metrics for each model over 10 runs. Overall, we found that DRIFT performs slightly better than\n4https://www.cs.cmu.edu/˜enron/.\nDRGPM, although DRGPM has a significant advantage in terms of computational cost due to the Bernoulli-Poisson link (see Section 5.3). HGPEPM performs better than the dynamic models on the DBLP dataset because co-authorship links change dramatically from one year to the next one, and hence, the static model is better at fitting each snapshot independently. For the longitudinal Enron email network that is recorded monthly, DRGPM performs better than the baseline methods.\nTask 2: Forecasting future networks Next, we consider the task of forecasting an unseen network snapshot A(t) given observed snapshots A(1:t−1). Following previous works (Foulds et al., 2011; Heaukulani et al., 2013; Kim et al., 2013), we train the models on the first (t−1) snapshots of the considered network, and then estimate the predictive distribution of the unseen snapshot A(t) by running MCMC sampling one time step into the future. We apply HGPEPM to the most recent snapshot A(t−1), and then to perform prediction on the unseen snapshot A(t). For DRGPM, we set Λ(t) = Λ(t−1), assuming the snapshots at nearby time points share a similar set of groups. We generated 10 samples of Z(t) for each of the 1000 samples collected for Z(t−1). For DSBM, we use the method detailed in (Xu et al., 2014) to perform future network forecasting. Table 1 shows the averaged performance for each model over different network snapshots from 3 to T . Overall, DRGPM shows competitive performance on all three datasets. This confirms that DRGPM can flexibly characterize temporally local links via time-evolving node memberships and switch off redundant groups to avoid overfitting the data."
  }, {
    "heading": "5.3. Running Time",
    "text": "The probilistic models achieve higher accuracy although these methods require more computation time to collect MCMC samples. DSBM is much faster than the probabilistc models because its inference is performed using the\nextended Kalman filter. Table 3 compares the per-iteration computation time of the sampling-based models (all models are implemented in Matlab). The computational cost of DRIFT scales inO(K̄2N2T ), where K̄ is the expected number of groups. The Bernoulli-Poisson link based models (DGPPF, DPGM, DRGPM) are much faster than the logistic link based method (DRIFT) because the former models scale linearly with the number of non-zero entries in network data. For DRGPM, sampling {m(t)ij }i,j,t and {m (t) ikk′j}i,j,k,k′,t takes O(NeK̄2) with Ne being the number of non-zero entries. Sampling {z(t)ik }i,k,t takes O(NK̄T ) and sampling {λ(t)kk′}k,k′,t takes O(K̄2T ). Overall, the computational complexity of DRGPM is O(NeK̄2 + NK̄T + K̄2T ). The computational complexity of D-GPPF and DPGM is O(NeK̄ +NK̄ + K̄T ) and O(NeK̄2 +NK̄T + K̄2), respectively. DRGPM is slightly faster than DPGM because DRGPM can effectively turn off redundant groups and hence achieves a lower computational cost."
  }, {
    "heading": "5.4. Case Study: Military Interstate Disputes Dataset",
    "text": "We investigate the military interstate disputes (MID) dataset that contains disputes events between 138 countries from 1992 to 2001 (Ghosn et al., 2004) to explore the latent structure discovered by DRGPM. A dynamic network was generated by aggregating the data into monthly snapshots and a link was created between each pair of two countries if either country has disputes with the other one at that given time. We applied DRGPM to this dynamic network initializing K = 30 groups. Most of the identified groups correspond to some regional relations or conflicts. In Figure 5, we depict four interesting groups inferred by DRGPM and show the group activity by plotting the mean of the thinning function b (t) k . We normalized the node memberships to [0, 1] by dividing them by the sum of memberships within the same group. In Table 4, we report the top 20 nodes associated to each\nof four groups with positive memberships. For instance, we found that Group 1 corresponds to the second Congo war (1998-2000). The first six nodes of the group are indeed the belligerents of this war. Group 2 corresponds to the Bosnian War (1992-1995), and its associated nodes are Yugoslavia and some NATO members that are indeed the belligerents of this war. Groups 3 and 4 are related to the regional disputes between some African countries. Additional graphs of the inferred groups, and tables showing the associated nodes are presented in the supplementary material."
  }, {
    "heading": "6. Conclusion",
    "text": "We proposed a probabilistic framework for longitudinal network modelling based on the covariate-dependent relational gamma process. Our framework can characterize the group birth/death dynamics using the thinned CRM, which enables us to investigate the evolution of the inferred latent structure. The inferred latent dynamic structure can be useful for various qualitative analyses in practical applications. We experimentally demonstrated the competitive predictive performance and scalability of our framework on three real-world datasets. Our generative model can be easily extended in many interesting ways. For instance, it can be extended to dynamic multilayer networks (Durante et al., 2017) with relational data arising from multiple-related contexts via multi-level hierarchical gamma processes (Zhou et al., 2015). Additionally, network side information can be flexibly leveraged via a regression model (Rai et al., 2015)."
  }, {
    "heading": "Acknowledgements",
    "text": "The authors thank the anonymous reviewers and Adrian Šošić for their useful comments and suggestions. This research is funded by the European Union’s Horizon 2020 research and innovation programme under grant agreement 668858."
  }],
  "year": 2018,
  "references": [{
    "title": "Nonparametric Bayesian factor analysis for dynamic count matrices",
    "authors": ["Acharya", "Ayan"],
    "venue": "In AISTATS, pp",
    "year": 2015
  }, {
    "title": "Nonparametric dynamic network modeling",
    "authors": ["Acharya", "Ayan"],
    "venue": "In KDD Workshop on MLT,",
    "year": 2015
  }, {
    "title": "Mixed membership stochastic blockmodels",
    "authors": ["Airoldi", "Edoardo M"],
    "venue": "J. Mach. Learn. Res.,",
    "year": 2008
  }, {
    "title": "An event-based framework for characterizing the evolutionary behavior of interaction",
    "authors": ["Asur", "Sitaram"],
    "venue": "graphs. ACM Trans. Knowl. Discov. Data,",
    "year": 2009
  }, {
    "title": "Temporal link prediction using matrix and tensor factorizations",
    "authors": ["Dunlavy", "Daniel M"],
    "venue": "ACM Trans. Knowl. Discov. Data,",
    "year": 2011
  }, {
    "title": "Bayesian latent variable models for mixed discrete outcomes",
    "authors": ["Dunson", "David B", "Herring", "Amy H"],
    "year": 2005
  }, {
    "title": "Bayesian logistic Gaussian process models for dynamic networks",
    "authors": ["Durante", "Daniele"],
    "venue": "In AISTATS, pp",
    "year": 2014
  }, {
    "title": "Nonparametric Bayes dynamic modelling of relational data",
    "authors": ["Durante", "Daniele"],
    "year": 2014
  }, {
    "title": "Locally adaptive dynamic networks",
    "authors": ["Durante", "Daniele"],
    "venue": "Ann. Appl. Stat.,",
    "year": 2016
  }, {
    "title": "Bayesian learning of dynamic multilayer",
    "authors": ["Durante", "Daniele"],
    "venue": "networks. JMLR,",
    "year": 2017
  }, {
    "title": "A Bayesian analysis of some nonparametric problems",
    "authors": ["Ferguson", "Thomas S"],
    "venue": "Ann. Statist.,",
    "year": 1973
  }, {
    "title": "A unifying representation for a class of dependent random measures",
    "authors": ["Foti", "Nicholas"],
    "venue": "In AISTATS, pp",
    "year": 2013
  }, {
    "title": "A dynamic relational infinite feature model for longitudinal social networks",
    "authors": ["Foulds", "James R"],
    "venue": "In AISTATS, pp",
    "year": 2011
  }, {
    "title": "Dynamic mixed membership blockmodel for evolving networks",
    "authors": ["Fu", "Wenjie"],
    "venue": "In ICML, pp",
    "year": 2009
  }, {
    "title": "Distance dependent infinite latent feature models",
    "authors": ["Gershman", "Samuel"],
    "venue": "IEEE Trans. Pattern Anal. Mach. Intell.,",
    "year": 2015
  }, {
    "title": "The mid3 data set, 1993-2001: Procedures, coding rules, and description",
    "authors": ["Ghosn", "Faten"],
    "venue": "Conflict Management and Peace Science,",
    "year": 2004
  }, {
    "title": "A survey of statistical network models",
    "authors": ["Goldenberg", "Anna"],
    "venue": "Found. Trends Mach. Learn.,",
    "year": 2010
  }, {
    "title": "Scalable recommendation with hierarchical poisson factorization",
    "authors": ["Gopalan", "Prem"],
    "venue": "In UAI, pp",
    "year": 2015
  }, {
    "title": "Recovering temporally rewiring networks: a model-based approach",
    "authors": ["Guo", "Fan"],
    "venue": "In ICML, pp",
    "year": 2007
  }, {
    "title": "Dynamic probabilistic models for latent feature propagation in social networks",
    "authors": ["Heaukulani", "Creighton"],
    "venue": "In ICML, pp",
    "year": 2013
  }, {
    "title": "Evolving cluster mixed-membership blockmodel for time-evolving networks",
    "authors": ["Ho", "Qirong"],
    "venue": "In AISTATS,",
    "year": 2011
  }, {
    "title": "Latent space approaches to social network analysis",
    "authors": ["Hoff", "Peter D"],
    "venue": "JASA, 97:1090–1098,",
    "year": 2001
  }, {
    "title": "Zero-truncated Poisson tensor factorization for massive binary tensors",
    "authors": ["Hu", "Changwei"],
    "venue": "In UAI, pp",
    "year": 2015
  }, {
    "title": "Dynamic infinite relational model for time-varying relational data analysis",
    "authors": ["Ishiguro", "Katsuhiko"],
    "venue": "In NIPS, pp",
    "year": 2010
  }, {
    "title": "Nonparametric multi-group membership model for dynamic networks",
    "authors": ["Kim", "Myunghwan"],
    "venue": "In NIPS,",
    "year": 2013
  }, {
    "title": "Completely random measures",
    "authors": ["J.F.C. Kingman"],
    "venue": "Pacific J. Math.,",
    "year": 1967
  }, {
    "title": "Contact patterns in a high school: A comparison between data collected using wearable sensors, contact diaries and friendship surveys",
    "authors": ["Mastrandrea", "Rossana"],
    "venue": "PLoS ONE,",
    "year": 2015
  }, {
    "title": "Nonparametric latent feature models for link prediction",
    "authors": ["Miller", "Kurt"],
    "venue": "In NIPS, pp",
    "year": 2009
  }, {
    "title": "Community structure in timedependent",
    "authors": ["Mucha", "Peter J"],
    "venue": "multiscale, and multiplex networks. Science,",
    "year": 2010
  }, {
    "title": "Bayesian nonparametrics for sparse dynamic networks",
    "authors": ["K Palla"],
    "venue": "ArXiv e-prints,",
    "year": 2016
  }, {
    "title": "A natural experiment of social network formation and dynamics",
    "authors": ["Phan", "Tuan Q", "Airoldi", "Edoardo M"],
    "venue": "PNAS, 112(21):6595–6600,",
    "year": 2015
  }, {
    "title": "Bayesian inference for logistic models using Pólya–Gamma latent variables",
    "authors": ["Polson", "Nicholas G"],
    "year": 2013
  }, {
    "title": "Large scale Bayesian multi-label learning via topic-based label embeddings",
    "authors": ["Rai", "Piyush"],
    "venue": "In NIPS,",
    "year": 2015
  }, {
    "title": "A latent space approach to dynamic embedding of co-occurrence data",
    "authors": ["Sarkar", "Purnamrita"],
    "venue": "In AISTATS,",
    "year": 2007
  }, {
    "title": "Nonparametric link prediction in large scale dynamic networks",
    "authors": ["Sarkar", "Purnamrita"],
    "venue": "Electron. J. Statist.,",
    "year": 2022
  }, {
    "title": "Bayesian Poisson Tucker decomposition for learning the structure of international relations",
    "authors": ["Schein", "Aaron"],
    "venue": "In ICML, pp",
    "year": 2016
  }, {
    "title": "Poisson-gamma dynamical systems",
    "authors": ["Schein", "Aaron"],
    "venue": "In NIPS, pp",
    "year": 2016
  }, {
    "title": "Poisson/gamma random field models for spatial statistics",
    "authors": ["Wolpert", "Robert L"],
    "year": 1998
  }, {
    "title": "Stochastic expansions using continuous dictionaries: Lévy adaptive regression kernels",
    "authors": ["Wolpert", "Robert L"],
    "venue": "Ann. Statist., 39(4):1916–1962,",
    "year": 2011
  }, {
    "title": "A state-space mixed membership blockmodel for dynamic network tomography",
    "authors": ["Xing", "Eric P"],
    "venue": "Ann. Appl. Stat., 4(2):535–566,",
    "year": 2010
  }, {
    "title": "Stochastic block transition models for dynamic networks",
    "authors": ["Xu", "Kevin"],
    "venue": "In AISTATS, pp. 1079–1087,",
    "year": 2015
  }, {
    "title": "Dynamic stochastic blockmodels for time-evolving social networks",
    "authors": ["Xu", "Kevin S"],
    "venue": "J. Sel. Topics Signal Processing,",
    "year": 2014
  }, {
    "title": "A Poisson gamma probabilistic model for latent node-group memberships in dynamic networks",
    "authors": ["Yang", "Sikun", "Koeppl", "Heinz"],
    "venue": "In AAAI,",
    "year": 2018
  }, {
    "title": "Infinite edge partition models for overlapping community detection and link prediction",
    "authors": ["Zhou", "Mingyuan"],
    "venue": "In AISTATS, pp",
    "year": 2015
  }, {
    "title": "Discussion on “Sparse graphs using exchangeable random measures",
    "authors": ["Zhou", "Mingyuan"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2017
  }, {
    "title": "Negative binomial process count and mixture modeling",
    "authors": ["Zhou", "Mingyuan"],
    "venue": "IEEE Trans. Pattern Anal. Mach. Intell.,",
    "year": 2015
  }, {
    "title": "Augmentable gamma belief networks",
    "authors": ["Zhou", "Mingyuan"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }],
  "id": "SP:80f7c85163f92c831b54399db492f204550d93dd",
  "authors": [{
    "name": "Sikun Yang",
    "affiliations": []
  }, {
    "name": "Heinz Koeppl",
    "affiliations": []
  }],
  "abstractText": "A probabilistic framework based on the covariatedependent relational gamma process is developed to analyze relational data arising from longitudinal networks. The proposed framework characterizes networked nodes by nonnegative nodegroup memberships, which allow each node to belong to multiple latent groups simultaneously, and encodes edge probabilities between each pair of nodes using a Bernoulli Poisson link to the embedded latent space. Within the latent space, our framework models the birth and death dynamics of individual groups via a thinning function. Our framework also captures the evolution of individual node-group memberships over time using gamma Markov processes. Exploiting the recent advances in data augmentation and marginalization techniques, a simple and efficient Gibbs sampler is proposed for posterior computation. Experimental results on a simulation study and three realworld temporal network data sets demonstrate the model’s capability, competitive performance and scalability compared to state-of-the-art methods.",
  "title": "Dependent Relational Gamma Process Models for Longitudinal Networks"
}