{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 686–693 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n686"
  }, {
    "heading": "1 Introduction",
    "text": "Problem. Schumacher convinced to win on Sunday. When this news headline is fed into modern tools for Named Entity Disambiguation (NED), virtually all of them would map the mention Schumacher onto the former Formula One champion Michael Schumacher, as the best-fitting entity from a Wikipedia-centric knowledge base (KB). However, knowing that Sunday refers to August 14, 1949, i.e., ignoring the surface form but exploiting normalized information, it becomes clear that the text actually refers to the German politician Kurt Schumacher. State-of-the-art NED methods (see surveys by Hachey et al. (2013), Ling et al. (2015), Shen et al. (2015)) tend to miss this because they are designed and trained for temporally focused input corpora such as current news, and do not cope well with longitudinal archives and other diachronic corpora that span decades. Standard NED benchmarks from CoNLL and TAC do not reflect this difficulty either.\n1The diaNED corpus and the temporal signatures of entities are publicly available: https://www.mpi-inf. mpg.de/yago-naga/dianed/.\nWhat is needed here is a better way of capturing temporal context, for both the mention Schumacher and each of the candidate entities. Figure 1 illustrates “time profiles” for sample entities with highly ambiguous names. Normalized temporal information from the input context, such as Sunday (1949-08-14), can provide additional cues for proper disambiguation. The problem addressed in this paper is how to model and capture temporal contexts and how to enhance NED with this novel asset. Contribution. Our approach to this problem is to compute temporal signatures for entities in the KB, and to use these as expressive features when comparing candidate entities against the context of an input mention. Temporal signatures are embeddings that reflect the importance of different years for entities. They are automatically constructed by extracting and normalizing temporal expressions in entity descriptions such as Wikipedia articles. Analogously, temporal signals are captured in the contexts of textual mentions and represented by embeddings.\nThe time-aware NED method that we devise with these features can robustly cope with inputs\nfrom diachronic corpora. We propose a new evaluation benchmark, based on the New York Times Archive, spanning more than 20 years, and the history collection historynet.com, spanning several centuries. Our experiments demonstrate that timeaware NED substantially outperforms some of the best standard NED tools."
  }, {
    "heading": "2 Temporal Signatures and Contexts",
    "text": "Better context representation improves disambiguation quality (see, e.g., Shen et al. (2015)). As the underlying entity descriptions (e.g., Wikipedia articles) are not only textually but also temporally related to their mentions, we enrich the context representation with a temporal dimension, which no prior work handles explicitly.\nWe model the temporal dimension by embedding vectors. The embeddings represent the temporal signatures of entities in a KB and the temporal contexts of entity mentions in text in a joint vector space. Then, the similarity between them quantifies their temporal relatedness.\nTemporal vector space. We use 2,050 dimensions (years 1 AD to 2050) to define the vector space. Coarser and finer granularities than years could be used, but finer ones (e.g., days) are rarely needed for NED and coarser granularities (e.g., centuries) are too vague.2\nTemporal signatures of entities. We use the temporal tagger HeidelTime (Strötgen and Gertz, 2010; Strötgen and Gertz, 2015) to extract and normalize date expressions from an entity’s Wikipedia page3 and aggregate them by years. This results in a count-based temporal vector tcbe = (t0001, ..., ti, ..., t2050) where ti is the total number of temporal expressions extracted from e’s Wikipedia page referring to year i. Temporal expressions of finer granularities are mapped to respective years and expressions of coarser granularities than year are currently ignored.\nAs the count-based vectors may overfit to the entity descriptions and to avoid discontinuity in the temporal signatures, we apply exponential smoothing and get smoothed temporal vectors\n2In an analysis of temporal expressions extracted with HeidelTime from the Wikipedia corpus (August 2016 dump), we find that there are on average 18.500 expressions per year value (with year values ranging from 0001 AD to 2050 AD) in contrast to only 9.64 expressions per day value (with day values ranging from 0001-01-01 to 2050-12-31). Therefore, using year level identifiers to define our temporal vector space results in short and non-sparse temporal vectors.\n3August 2016 Wikipedia dump\ntse = (t s 0001, ..., t s i , ..., t s 2050) such that t s i = α · tcbi + (1 − α) · tsi−1, for i > 0001 where α is the smoothing factor with 0 ≤ α ≤ 1. For further smoothing, this procedure can be recursively applied n times. In experiments, we set α = 0.2 and n = 2 based on cross-validation.\nTemporal contexts of entity mentions. We exploit temporal expressions in the surrounding text of entity mentions and the texts’ publication dates. In news-style articles, entities are likely to be related to the document creation time (dct), while dates in the content are important for other types of documents (Strötgen and Gertz, 2016).\nTemporal vectors for mentions tm are thus a combination of a one-hot temporal vector tdctm = (0, ..., ti, ..., 0) where ti=1 if i is the dct’s year, and tcontentm containing dates extracted by a temporal tagger in the immediate context of the mention (e.g., in the same sentence or paragraph), aggregated by year. tdctm and t content m are linearly combined as tm = λ · tdctm +(1−λ) · tcontentm where λ (with 0 ≤ λ ≤ 1) weights the components.\nRelatedness. We calculate the temporal relatedness between a mention and all candidate entities as the cosine similarity between tm and te."
  }, {
    "heading": "3 Time-aware NED",
    "text": "To test the importance of time-awareness for NED, we use two settings. We enhance a basic NED system and a state-of-the-art system by enriching both with temporal signatures and contexts.\ndiaNED-1, as basic NED system, uses a mention-entity prior reflecting entity prominence and a keyphrase-based language model for the similarity of mention and entity contexts (as suggested by Hoffart et al. (2011)). These components are cast into edge weights for a graph over which the final disambiguation is computed. Hyper-parameters for the relative influence of the two components are tuned using an SVM.\nWe added the temporal dimension to the feature set and retrained the model accordingly to get new feature weights.\ndiaNED-2 based on Yamada et al. (2016): This is a learning-to-rank-based model. Besides mention-entity priors and string-similarity features, it uses word and entity embeddings trained in a joint vector space to model context and coherence. The intuition is that a good candidate entity vector must be close to the word and entity vectors appearing in the same context.\nYamada et al. (2016) measures entity context by averaging the word vectors of the proper noun neighbors and calculating the cosine similarity with each candidate entity. Similarly, the coherence between entities is measured by computing the cosine similarity between candidates and the average of the other entities in the neighborhood.\ndiaNED-2 enhances this model as follows. We compute the cosine similarity between the mention’s and the candidate entities’ temporal vectors, and normalize the time relatedness scores across candidate entities. Finally, all similarity features are used to train a binary classifier with gradientboosted decision trees. The top-ranked candidate entity in each pool of candidates is assigned to the mention being evaluated."
  }, {
    "heading": "4 A Diachronic NED Data Set",
    "text": "Datasets for NED evaluation contain articles published within a short period. Consequently, all mentions share a temporal context making it difficult to evaluate temporal variability. CoNLLAIDA (Hoffart et al., 2011) are newswire articles from 1996, TAC 2010 (Ji et al., 2010) news and forum articles from 2004–2007, and Microposts2014 (Cano et al., 2014) tweets from 2011.\nTo account for this limitation, we create a new diachronic benchmark containing documents with heterogeneous temporal context. As in Microposts-2014, we limit documents to single sentences and headlines from HistoryNet.com (HN) and The New York Times corpus (NYT). For the annotation process, we followed the entity annotation guidelines, which have been used for annotating CoNLL-AIDA (Hoffart et al., 2011).\nHN is an online resource of world history with information on popular historical topics. Its section Today in History contains short texts on what happened on a specific day with a total of 7,061 facts/events (excluding born today). Using Stanford NER (Finkel et al., 2005), we extracted 13,773 entity mentions and randomly selected 350 of them. We annotated all entity mentions in respective sentences with their Wikipedia ids. After removing NER errors and out-of-KB entities, the dataset contains 865 gold entity mentions in 334 sentences. Examples are: “Conrad II claims the throne in France” from 1032 or “The Old Pretender, son of James III dies” from 1766.\nNYT contains more than 1.5 million documents published between 1987 and 2007. After apply-\ning the same procedure, the dataset contains 368 manually annotated mentions in 290 news headlines. Examples are “Arafat’s Faction is Said to Avoid Guerrilla Actions” from 1989 or “U.N. Aide to Meet Milosevic, Angering Some” from 1999.\nAs HN texts come without further context, entity mentions are rather explicit. Entity mentions in NYT ’s headlines are more ambiguous as more information is available in the articles and the entities are mostly, at the time of publication, prominent and obvious to the reader.\nFinally, we created a third subset from the 7,061 documents of HistoryNet.com with 13,773 entity mentions. It contains the sentences with all the entity mentions which are linked to different entities by diaNED-2 depending on whether it uses its time-awareness or not, i.e., whether diaNED2 is trained with or without the temporal feature. This set (HN-timediff ) contains 567 manually annotated entities from 547 documents. It is the most challenging subset as all entity mentions are difficult to disambiguate."
  }, {
    "heading": "5 Evaluation",
    "text": "To evaluate the importance of temporal information in NED, we focus in our analysis on the newly created diaNED corpus. As standard NED datasets CoNLL-AIDA and TAC 2010 contain only articles published within a short period of time, they are not suited for evaluating timeaware NED (cf. Section 4), and experiments on these datasets showed no significant differences between using diaNED-1 and diaNED-2 with or without their time-awareness features.\nNote that the temporal contexts in the HN sentences and the NYT headlines of the diaNED corpus are part of the metadata. Thus, to ensure a fair comparison among all systems, we added the temporal contexts in the form of year information to all documents to allow the non-time-aware systems to exploit the temporal context in case the respective year number occurs as part of the entities’ textual context.4"
  }, {
    "heading": "5.1 Intra-system Comparison",
    "text": "As described above, we (re-)implemented two NED systems as diaNED-1 and diaNED-2. To al-\n4Disambiguation quality of non-time-aware systems was generally lower without this additional information. The diaNED corpus contains all sentences with and without year information so that evaluation results can be reproduced for both settings.\nlow the systems to adapt to the diachronic corpus without considering temporal information explicitly, we retrained the systems so that appropriate weights are learnt for each standard feature. Due to the rather small size of the diaNED corpus, we use bootstrapping (i.e., train and evaluate on 50 randomly shuffled versions of the corpus) with and without using the time-awareness feature.\ndiaNED-1. Table 1 shows micro-accuracy for our basic NED system on the HN and NYT sets of diaNED. Significant gains are achieved when combining the prior and context features with the time-awareness feature. This demonstrates that NED systems with standard features can be improved by making them time-aware.\ndiaNED-2. Table 2 shows micro-accuracy for our re-implementation of Yamada et al. (2016)’s initial features with and without the timeawareness feature. As can be seen in the table, adding the temporal feature improves the results significantly in each setting on both sets, which demonstrates that even state-of-the-art systems can be improved by making them time-aware."
  }, {
    "heading": "5.2 Inter-system Comparison",
    "text": "In Table 3, we compare the time-aware NED approach diaNED-2 to various NED tools available via GERBIL (v. 1.2.5) (Usbeck et al., 2015) and to the recent work by Gupta et al. (2017). As all systems are used with standard settings, we also trained diaNED-2 on standard NED training data (CoNLL-AIDA) with the temporal context of entity mentions being the respective article’s year\nof publication. However, due to the differences in what kind of entities the systems consider and what kind of candidate entity lookup dictionaries they use, the systems are not directly comparable and the performance differences should be interpreted with a grain of salt. Nevertheless, timeawareness further increases the distance between (Yamada et al., 2016) and the second best system significantly, which demonstrates its usefulness for NED."
  }, {
    "heading": "5.3 Type-based Analysis",
    "text": "To gain further insights about the importance of time-awareness, we analyzed the results of diaNED-2 with and without temporal feature on the HN-timediff set of our benchmark (Table 4). On these particularly challenging documents, the time-awareness feature helps to improve NED quality for all entity types. While location and organization entities moderately benefit, there is a huge performance increase for person entities. The explanation that person entities benefit most could be that person entities have comparably short life spans and are thus most time-sensitive."
  }, {
    "heading": "6 Related Work",
    "text": "Starting with the early work of Bunescu and Paşca (2006), Cucerzan (2007), Mihalcea and Csomai (2007), and Milne and Witten (2008),\nNED methods and tools have been greatly advanced and become mature. Many systems use a combination of (i) local features like string similarities, lexico-syntactic characteristics and context between mentions and candidate entities and (ii) global features like the coherence among a set of selected entities. The inference over this feature space is typically performed by probabilistic graphical models, learning-to-rank techniques or algorithms related to such models (see, e.g., Ratinov et al. (2011), Hoffart et al. (2011), Ferragina and Scaiella (2012), Cheng and Roth (2013), Guo and Barbosa (2014), Durrett and Klein (2014), Chisholm and Hachey (2015), Pershina et al. (2015), Lazic et al. (2015), Nguyen et al. (2016), Globerson et al. (2016), Eshel et al. (2017), and Ganea and Hofmann (2017)). The GERBIL framework (Usbeck et al., 2015) provides a unified way of evaluating a wide variety of NED tools and services.\nA recent line of work uses representational learning to characterize contexts through embeddings (e.g., He et al. (2013), Sun et al. (2015), Francis-Landau et al. (2016), Yamada et al. (2016), Gupta et al. (2017), Yamada et al. (2017)). These approaches naturally lend themselves towards inference by neural networks such as LSTMs. In our experiments, the Neural TextEntity Encoder by Yamada et al. (2016) serves as state-of-the-art baseline.\nWhile temporal information was used as a global feature to compute coherence between entity lifespans (Hoffart et al., 2013), no prior work on named entity disambiguation made explicit use of temporal information as a local feature. However, the value of time has been shown in a variety of other information extraction tasks, such as relation extraction (UzZaman et al., 2013; Mirza and Tonelli, 2016), event extraction (Kuzey et al., 2016; Spitz and Gertz, 2016), and slot filling (Ji et al., 2011; Surdeanu et al., 2011; Surdeanu, 2013), as well as in the context of information retrieval (Berberich et al., 2010; Agarwal and Strötgen, 2017) and fact checking (Popat et al., 2017). In this paper, inspired by the importance of temporal information for many NLP tasks, we analyzed its value for NED."
  }, {
    "heading": "7 Conclusions and Ongoing Work",
    "text": "We proposed the first NED method with explicit consideration of temporal background. As demon-\nstrated in our experiments, this time-awareness improves NED quality over diachronic texts that span long time periods. The diaNED dataset and the temporal signatures of entities are publicly available.5\nCurrently, we integrate a strategy for handling out-of-KB entities to determine how temporal affinity may help in the nil detection problem. Furthermore, we plan large-scale experiments with distant supervision data which will also allow to evaluate the effectiveness of considering temporal expressions in the context of the entity mentions as further temporal context information. Finally, using a multilingual temporal tagger (Strötgen and Gertz, 2015), the value of time for NED could be studied for further languages."
  }, {
    "heading": "Acknowledgments",
    "text": "The authors thank the anonymous reviewers for their valuable comments and suggestions and Ikuya Yamada for providing the word-entity embeddings and his help in the implementation of one of the baseline systems."
  }],
  "year": 2018,
  "references": [{
    "title": "Tiwiki: Searching Wikipedia with Temporal Constraints",
    "authors": ["Prabal Agarwal", "Jannik Strötgen."],
    "venue": "Proceedings of the 7th Temporal Web Analytics Workshop, TempWeb’17, pages 1595–1600.",
    "year": 2017
  }, {
    "title": "A Language Modeling Approach for Temporal Information Needs",
    "authors": ["Klaus Berberich", "Srikanta Bedathur", "Omar Alonso", "Gerhard Weikum."],
    "venue": "Proceedings of the 32nd European Conference on Advances in Information Retrieval, ECIR’10, pages",
    "year": 2010
  }, {
    "title": "Using Encyclopedic Knowledge for Named Entity Disambiguation",
    "authors": ["Razvan Bunescu", "Marius Paşca."],
    "venue": "Proceedings of the 11th Conference of the European Chapter of the Association for Computational Linguistics, EACL’06, pages 9–16.",
    "year": 2006
  }, {
    "title": "Making Sense of Microposts (#Microposts2014): Named Entity Extraction & Linking Challenge",
    "authors": ["Amparo E. Cano", "Giuseppe Rizzo", "Andrea Varga", "Matthew Rowe", "Milan Stankovic", "Aba-Sah Dadzie."],
    "venue": "Proceedings of the 4th Workshop",
    "year": 2014
  }, {
    "title": "Dexter: An Open Source Framework for Entity 5https://www.mpi-inf.mpg.de/yago-naga",
    "authors": ["Diego Ceccarelli", "Claudio Lucchese", "Salvatore Orlando", "Raffaele Perego", "Salvatore Trani"],
    "year": 2013
  }, {
    "title": "Relational Inference for Wikification",
    "authors": ["Xiao Cheng", "Dan Roth."],
    "venue": "Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing, EMNLP’13, pages 1787–1796.",
    "year": 2013
  }, {
    "title": "Entity Disambiguation with Web Links",
    "authors": ["Andrew Chisholm", "Ben Hachey."],
    "venue": "Transactions of the Association for Computational Linguistics, 3:145– 156.",
    "year": 2015
  }, {
    "title": "Using FRED for Named Entity Resolution, Linking and Typing for Knowledge Base Population",
    "authors": ["Sergio Consoli", "Diego Reforgiato Recupero."],
    "venue": "Proceedings of the Semantic Web Evaluation Challenge, SemWebEval’15, pages 40–50.",
    "year": 2015
  }, {
    "title": "Large-Scale Named Entity Disambiguation Based on Wikipedia Data",
    "authors": ["Silviu Cucerzan."],
    "venue": "Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, EMNLP-",
    "year": 2007
  }, {
    "title": "Entityclassifier.eu: Real-Time Classification of Entities in Text with Wikipedia",
    "authors": ["Milan Dojchinovski", "Tomáš Kliegr"],
    "venue": "In Proceedings of the Joint European Conference on Machine Learning and Knowledge Discovery in Databases,",
    "year": 2013
  }, {
    "title": "A Joint Model for Entity Analysis: Coreference, Typing, and Linking",
    "authors": ["Greg Durrett", "Dan Klein."],
    "venue": "Transactions of the Association for Computational Linguistics, 2:477–490.",
    "year": 2014
  }, {
    "title": "Named Entity Disambiguation for Noisy Text",
    "authors": ["Yotam Eshel", "Noam Cohen", "Kira Radinsky", "Shaul Markovitch", "Ikuya Yamada", "Omer Levy."],
    "venue": "Proceedings of the 21st Conference on Computational Natural Language Learning, CoNLL’17,",
    "year": 2017
  }, {
    "title": "Fast and Accurate Annotation of Short Texts with Wikipedia Pages",
    "authors": ["Paolo Ferragina", "Ugo Scaiella."],
    "venue": "IEEE Software, 29(1):70–75.",
    "year": 2012
  }, {
    "title": "Incorporating Non-local Information into Information Extraction Systems by Gibbs Sampling",
    "authors": ["Jenny Rose Finkel", "Trond Grenager", "Christopher Manning."],
    "venue": "Proceedings of the 43rd Annual Meeting on Association for Computational Linguistics,",
    "year": 2005
  }, {
    "title": "Capturing Semantic Similarity for Entity Linking with Convolutional Neural Networks",
    "authors": ["Matthew Francis-Landau", "Greg Durrett", "Dan Klein."],
    "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association for Computa-",
    "year": 2016
  }, {
    "title": "Probabilistic Bag-Of-Hyperlinks Model for Entity Linking",
    "authors": ["Octavian-Eugen Ganea", "Marina Ganea", "Aurelien Lucchi", "Carsten Eickhoff", "Thomas Hofmann."],
    "venue": "Proceedings of the 25th International Conference on World Wide Web, WWW’16, pages",
    "year": 2016
  }, {
    "title": "Deep Joint Entity Disambiguation with Local Neural Attention",
    "authors": ["Octavian-Eugen Ganea", "Thomas Hofmann."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, EMNLP’17, pages 2609–2619.",
    "year": 2017
  }, {
    "title": "Collective Entity Resolution with Multi-Focal Attention",
    "authors": ["Amir Globerson", "Nevena Lazic", "Soumen Chakrabarti", "Amarnag Subramanya", "Michael Ringaard", "Fernando Pereira."],
    "venue": "Proceedings of the 54th Annual Meeting of the Association for Compu-",
    "year": 2016
  }, {
    "title": "Robust Entity Linking via Random Walks",
    "authors": ["Zhaochen Guo", "Denilson Barbosa."],
    "venue": "Proceedings of the 23rd ACM International Conference on Information and Knowledge Management, CIKM’14, pages 499–508.",
    "year": 2014
  }, {
    "title": "Entity Linking via Joint Encoding of Types, Descriptions, and Context",
    "authors": ["Nitish Gupta", "Sameer Singh", "Dan Roth."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, EMNLP’17, pages 2681–2690.",
    "year": 2017
  }, {
    "title": "Evaluating Entity Linking with Wikipedia",
    "authors": ["Ben Hachey", "Will Radford", "Joel Nothman", "Matthew Honnibal", "James R. Curran."],
    "venue": "Artificial Intelligence, 194:130–150.",
    "year": 2013
  }, {
    "title": "Learning Entity Representation for Entity Disambiguation",
    "authors": ["Zhengyan He", "Shujie Liu", "Mu Li", "Ming Zhou", "Longkai Zhang", "Houfeng Wang."],
    "venue": "Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, ACL’13, pages",
    "year": 2013
  }, {
    "title": "YAGO2: A Spatially and Temporally Enhanced Knowledge Base from Wikipedia",
    "authors": ["Johannes Hoffart", "Fabian M. Suchanek", "Klaus Berberich", "Gerhard Weikum."],
    "venue": "Artificial Intelligence, 194:28–61.",
    "year": 2013
  }, {
    "title": "Robust Disambiguation of Named Entities in Text",
    "authors": ["Johannes Hoffart", "Mohamed Amir Yosef", "Ilaria Bordino", "Hagen Fürstenau", "Manfred Pinkal", "Marc Spaniol", "Bilyana Taneva", "Stefan Thater", "Gerhard Weikum."],
    "venue": "Proceedings of the 2011 Con-",
    "year": 2011
  }, {
    "title": "Overview of the TAC2011 Knowledge Base Population Track",
    "authors": ["Heng Ji", "Ralph Grishman", "Hoa Dang."],
    "venue": "Proceedings of the 4th Text Analysis Conference, TAC’11.",
    "year": 2011
  }, {
    "title": "Overview of the TAC 2010 Knowledge Base Population Track",
    "authors": ["Heng Ji", "Ralph Grishman", "Hoa Trang Dang", "Kira Griffitt", "Joe Ellis."],
    "venue": "Proceedings of the 3rd Text Analysis Conference, TAC’10.",
    "year": 2010
  }, {
    "title": "As Time Goes By: Comprehensive Tagging of Textual Phrases with Temporal Scopes",
    "authors": ["Erdal Kuzey", "Vinay Setty", "Jannik Strötgen", "Gerhard Weikum."],
    "venue": "Proceedings of the 25th International Conference on World Wide Web, WWW’16, pages 915–925.",
    "year": 2016
  }, {
    "title": "Plato: A Selective Context Model for Entity Resolution",
    "authors": ["Nevena Lazic", "Amarnag Subramanya", "Michael Ringgaard", "Fernando Pereira."],
    "venue": "Transactions of the Association for Computational Linguistics, 3:503–515.",
    "year": 2015
  }, {
    "title": "Design Challenges for Entity Linking",
    "authors": ["Xiao Ling", "Sameer Singh", "Daniel Weld."],
    "venue": "Transactions of the Association for Computational Linguistics, 3:315–328.",
    "year": 2015
  }, {
    "title": "DBpedia Spotlight: Shedding Light on the Web of Documents",
    "authors": ["Pablo N. Mendes", "Max Jakob", "Andrés Garcı́a-Silva", "Christian Bizer"],
    "venue": "In Proceedings of the 7th International Conference on Semantic Systems,",
    "year": 2011
  }, {
    "title": "Wikify!: Linking Documents to Encyclopedic Knowledge",
    "authors": ["Rada Mihalcea", "Andras Csomai."],
    "venue": "Proceedings of the 16th ACM Conference on Information and Knowledge Management, CIKM’07, pages 233–242.",
    "year": 2007
  }, {
    "title": "Learning to Link with Wikipedia",
    "authors": ["David Milne", "Ian H. Witten."],
    "venue": "Proceedings of the 17th ACM Conference on Information and Knowledge Management, CIKM’08, pages 509–518.",
    "year": 2008
  }, {
    "title": "CATENA: Causal and Temporal Relation Extraction from Natural Language Texts",
    "authors": ["Paramita Mirza", "Sara Tonelli."],
    "venue": "Proceedings the 26th International Conference on Computational Linguistics, COLING’16, pages 64–75.",
    "year": 2016
  }, {
    "title": "J-NERD: Joint Named Entity Recognition and Disambiguation with Rich Linguistic Features",
    "authors": ["Dat Nguyen", "Martin Theobald", "Gerhard Weikum."],
    "venue": "Transactions of the Association for Computational Linguistics, 4:215–229.",
    "year": 2016
  }, {
    "title": "Personalized Page Rank for Named Entity Disambiguation",
    "authors": ["Maria Pershina", "Yifan He", "Ralph Grishman."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Tech-",
    "year": 2015
  }, {
    "title": "Where the truth lies: Explaining the credibility of emerging claims on the web and social media",
    "authors": ["Kashyap Popat", "Subhabrata Mukherjee", "Jannik Strötgen", "Gerhard Weikum."],
    "venue": "Proceedings of the 26th International Conference on World Wide",
    "year": 2017
  }, {
    "title": "Local and Global Algorithms for Disambiguation to Wikipedia",
    "authors": ["Lev Ratinov", "Dan Roth", "Doug Downey", "Mike Anderson."],
    "venue": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technolo-",
    "year": 2011
  }, {
    "title": "Entity Linking with a Knowledge Base: Issues, Techniques, and Solutions",
    "authors": ["Wei Shen", "Jianyong Wang", "Jiawei Han."],
    "venue": "IEEE Transactions on Knowledge and Data Engineering, 27(2):443–460.",
    "year": 2015
  }, {
    "title": "Named Entity Recognition Using FOX",
    "authors": ["René Speck", "Axel-Cyrille Ngonga Ngomo."],
    "venue": "Proceedings of the International Semantic Web Conference, ISWC-PD’14, pages 85–88.",
    "year": 2014
  }, {
    "title": "Terms over LOAD: Leveraging Named Entities for CrossDocument Extraction and Summarization of Events",
    "authors": ["Andreas Spitz", "Michael Gertz."],
    "venue": "Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Infor-",
    "year": 2016
  }, {
    "title": "HeidelTime: High Quality Rule-based Extraction and Normalization of Temporal Expressions",
    "authors": ["Jannik Strötgen", "Michael Gertz."],
    "venue": "Proceedings of the 5th International Workshop on Semantic Evaluation, SemEval’10, pages 321–324.",
    "year": 2010
  }, {
    "title": "A Baseline Temporal Tagger for all Languages",
    "authors": ["Jannik Strötgen", "Michael Gertz."],
    "venue": "Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing, EMNLP’15, pages 541–547.",
    "year": 2015
  }, {
    "title": "Domainsensitive Temporal Tagging",
    "authors": ["Jannik Strötgen", "Michael Gertz."],
    "venue": "Synthesis Lectures on Human Language Technologies, Morgan & Claypool Publishers.",
    "year": 2016
  }, {
    "title": "Modeling Mention, Context and Entity with Neural Networks for Entity Disambiguation",
    "authors": ["Yaming Sun", "Lei Lin", "Duyu Tang", "Nan Yang", "Zhenzhou Ji", "Xiaolong Wang."],
    "venue": "Proceedings of the 24th International Conference on Artificial Intelligence,",
    "year": 2015
  }, {
    "title": "Overview of the TAC2013 Knowledge Base Population Evaluation: English Slot Filling and Temporal Slot Filling",
    "authors": ["Mihai Surdeanu."],
    "venue": "Proceedings of the 6th Text Analysis Conference, TAC’13.",
    "year": 2013
  }, {
    "title": "Stanford’s Distantly-Supervised Slot-Filling System",
    "authors": ["Mihai Surdeanu", "Sonal Gupta", "John Bauer", "David McClosky", "Angel X. Chang", "Valentin I. Spitkovsky", "Christopher D. Manning."],
    "venue": "Proceedings of the 4th Text Analysis Conference,",
    "year": 2011
  }, {
    "title": "AGDISTIS - Graph-Based Disambiguation of Named Entities Using Linked Data",
    "authors": ["Ricardo Usbeck", "Axel-Cyrille Ngonga Ngomo", "Michael Röder", "Daniel Gerber", "Sandro Athaide Coelho", "Sören Auer", "Andreas Both."],
    "venue": "Proceedings",
    "year": 2014
  }, {
    "title": "GERBIL: General Entity Annotator Benchmarking Framework",
    "authors": ["Francesco Piccinno", "Giuseppe Rizzo", "Harald Sack", "René Speck", "Raphaël Troncy", "Jörg Waitelonis", "Lars Wesemann."],
    "venue": "Proceedings of the 24th International Conference",
    "year": 2015
  }, {
    "title": "SemEval-2013 Task 1: TempEval3: Evaluating Time Expressions, Events, and Temporal Relations",
    "authors": ["Naushad UzZaman", "Hector Llorens", "Leon Derczynski", "James Allen", "Marc Verhagen", "James Pustejovsky."],
    "venue": "Proceedings of the 7th Inter-",
    "year": 2013
  }, {
    "title": "Joint Learning of the Embedding of Words and Entities for Named Entity Disambiguation",
    "authors": ["Ikuya Yamada", "Hiroyuki Shindo", "Hideaki Takeda", "Yoshiyasu Takefuji."],
    "venue": "Proceedings of the 20th SIGNLL Conference on Computational Natu-",
    "year": 2016
  }, {
    "title": "Learning Distributed Representations of Texts and Entities from Knowledge Base",
    "authors": ["Ikuya Yamada", "Hiroyuki Shindo", "Hideaki Takeda", "Yoshiyasu Takefuji."],
    "venue": "Transactions of the Association for Computational Linguistics, 5:397–411.",
    "year": 2017
  }, {
    "title": "X-LiSA: Crosslingual Semantic Annotation",
    "authors": ["Lei Zhang", "Achim Rettinger."],
    "venue": "Proc. VLDB Endow., 7(13):1693–1696.",
    "year": 2014
  }],
  "id": "SP:e9f086a312e72427ca67394a579e07ffe1ad556e",
  "authors": [{
    "name": "Prabal Agarwal",
    "affiliations": []
  }, {
    "name": "Jannik Strötgen",
    "affiliations": []
  }, {
    "name": "Luciano del Corro",
    "affiliations": []
  }, {
    "name": "Johannes Hoffart",
    "affiliations": []
  }, {
    "name": "Gerhard Weikum",
    "affiliations": []
  }],
  "abstractText": "Named Entity Disambiguation (NED) systems perform well on news articles and other texts covering a specific time interval. However, NED quality drops when inputs span long time periods like in archives or historic corpora. This paper presents the first time-aware method for NED that resolves ambiguities even when mention contexts give only few cues. The method is based on computing temporal signatures for entities and comparing these to the temporal contexts of input mentions. Our experiments show superior quality on a newly created diachronic corpus.1",
  "title": "diaNED: Time-Aware Named Entity Disambiguation for Diachronic Corpora"
}