{
  "sections": [{
    "heading": "1. Introduction",
    "text": "We aim to contribute to the body of research on the trade-off between releasing datasets from which publicly beneficial statistical inferences can be drawn, and between protecting the privacy of individuals who contribute to such datasets. Currently the most successful formalisation of protecting user privacy is provided by differential privacy (Dwork & Roth, 2014), which is a definition that any algorithm operating on a database may or may not satisfy. An algorithm that does satisfy the definition ensures that a particular individual does not lose too much privacy by deciding to contribute to the database on which the algorithm operates.\nWhile differentially private algorithms for releasing entire\n1MPI-IS, Tübingen, Germany 2University of Cambridge, UK. Correspondence to: Matej Balog <first.surname@gmail.com>. Code: https://github.com/matejbalog/RKHS-private-database/.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\ndatabases have been studied previously (Blum et al., 2008; Wasserman & Zhou, 2010; Zhou et al., 2009), most algorithms focus on releasing a privacy-protected version of a particular summary statistic, or of a statistical model trained on the private dataset. In this work we revisit the more difficult non-interactive, or offline setting, where the database owner aims to release a privacy-protected version of the entire database without knowing what statistics third-parties may wish to compute in the future.\nIn our new framework we propose to use the kernel mean embedding (Smola et al., 2007) as an intermediate representation of a database. It is (1) sufficiently rich in the sense that it captures a wide class of statistical properties of the data, while at the same time (2) it lives in a Reproducing Kernel Hilbert Space (RKHS), where it can be handled mathematically in a principled way and privacy-protected in a unified manner, independently of the type of data appearing in the database. Although kernel mean embeddings are functions in an abstract Hilbert space, in practice they can be (at least approximately) represented using a possibly weighted set of data points in input space (i.e. a set of database rows). The privacy-protected kernel mean embedding is released to the public in this representation, however, using synthetic datapoints instead of the private ones. As a result, our framework can be seen as leading to synthetic database algorithms.\nWe validate our approach by instantiating two concrete algorithms and proving that they output consistent estimators of the true kernel mean embedding of the data generating process, while satisfying the definition of differential privacy. The consistency results ensure that third-parties can carry out a wide variety of statistically founded computation on the released data, such as constructing consistent estimators of population statistics, estimating the Maximum Mean Discrepancy (MMD) between distributions, and two-sample testing (Gretton et al., 2012), or using the data in the kernel probabilistic programming framework for random variable arithmetics (Schölkopf et al., 2015; Simon-Gabriel et al., 2016, Section 3), repeatedly and unlimitedly without being able to, or having to worry about, violating user privacy.\nOne of our algorithms is especially suited to the interesting scenario where a (small) subset of a database has already been published. This situation can arise in a wide variety of settings, for example, due to weaker privacy protections in\nthe past, due to a leak, or due to the presence of an incentive, financial or otherwise, for users to publish their data. In such a situation our algorithm provides a principled approach for reweighting the public data in such a way that the accuracy of statistical inferences on this dataset benefits from the larger sample size (including the private data), while maintaining differential privacy for the undisclosed data.\nIn summary, the contributions of this paper are:\n1. A new framework for designing database release algorithms with the guarantee of differential privacy. The framework uses kernel mean embeddings as intermediate database representations, so that the RKHS metric can be used to control accuracy of the released synthetic database in a principled manner (Section 3).\n2. Two instantiations of our framework in the form of two synthetic database algorithms, with proofs of their consistency, convergence rates and differential privacy, as well as basic empirical illustrations of their performance on synthetic datasets (Sections 4 and 5)."
  }, {
    "heading": "2. Background",
    "text": ""
  }, {
    "heading": "2.1. Differential Privacy",
    "text": "Definition 1 (Dwork, 2006). For ε > 0, δ ≥ 0, algorithmA is said to be (ε, δ)-differentially private if for all neighbouring databases D ∼ D′ (differing in at most one element) and all measurable subsets S of the co-domain of A,\nP (A(D) ∈ S) ≤ eεP (A(D′) ∈ S) + δ. (1)\nThe parameter ε controls the amount of information the algorithm can leak about an individual, while a positive δ allows the algorithm to produce an unlikely output that leaks more information, but only with probability up to δ. This notion is sometimes called approximate differential privacy; an algorithm that is (ε, 0)-differentially private is simply said to be ε-differentially private. Note that any non-trivial differentially private algorithm must be randomised; the definition asserts that the distribution of algorithm outputs is not too sensitive to changing one row in the database.\nWhen the algorithm’s output is a finite vector A(D) ∈ RJ , two standard random perturbation mechanisms for making this output differentially private are the Laplace and Gaussian mechanisms. As the perturbation needs to mask the contribution of each individual entry of the database D, the scale of the added noise is closely linked to the notion of sensitivity, measuring how much the algorithm’s output can change due to changing a single data point:\n∆1 := sup D∼D′\n‖A(D)−A(D′)‖1 , (2)\n∆2 := sup D∼D′\n‖A(D)−A(D′)‖2 . (3)\nThe Laplace mechanism adds i.i.d. Lap(∆1/ε) noise to each of the J coordinates of the output vector and ensures pure ε-differential privacy, while the Gaussian mechanism adds i.i.d. N (0, σ2) noise to each coordinate, where σ2 > 2∆22 ln(1.25/δ)/ε\n2, and ensures (ε, δ)-differential privacy. Applying these mechanisms thus requires computing (an upper bound on) the relevant sensitivity.\nDifferential privacy is preserved under post-processing: if an algorithm A is (ε, δ)-differentially private, then so is its sequential composition B(A(·)) with any other algorithm B that does not have direct or indirect access to the private database D (Dwork & Roth, 2014)."
  }, {
    "heading": "2.2. Kernels, RKHS, and Kernel Mean Embeddings",
    "text": "A kernel on a non-empty set (data type) X is a binary positive-definite function k(·, ·) : X × X → R. Intuitively it can be thought of as expressing the similarity between any two elements in X . The literature on kernels is vast and their properties are well studied (Schölkopf & Smola, 2002); many kernels are known for a large variety of data types such as vectors, strings, time series, graphs, etc, and kernels can be composed to yield valid kernels for composite data types (e.g. the type of a database row containing both numerical and string data).\nThe kernel mean embedding (KME) of an X -valued random variable X in the RKHS is the function µkX : X → R, y 7→ EX [k(X, y)], defined whenever EX [ √ k(X,X)] < ∞ (Smola et al., 2007). Several popular kernels have been proved to be characteristic (Fukumizu et al., 2008), in which case the map pX 7→ µkX , where pX is the distribution of X , is injective. This means that no information about the distribution of X is lost when passing to its KME µkX .\nIn practice, the KME of a random variable X is approximated using a sample x1, . . . , xN drawn from X , which can be used to construct an empirical KME µ̂kX of X in the RKHS: a function given by y 7→ 1N ∑N n=1 k(xn, y). When the xn’s are i.i.d., under a boundedness condition µ̂kX converges to the true KME µkX at rate Op(N−1/2), independently of the dimension of X (Lopez-Paz et al., 2015)1. Our approach relies on the metric of the RKHS in which these KMEs live. The RKHS Hk is a space of functions, endowed with an inner product 〈·, ·〉Hk that satisfies the reproducing property 〈k(x, ·), h〉 = h(x) for all x ∈ X and h ∈ Hk. The inner product induces a norm ‖ · ‖Hk , which can be used to measure distances ‖µkX − µkY ‖Hk between distributions of X and Y . This can be exploited for various\n1The KME can be viewed as a smoothed version of the density, which is easier to estimate than the density itself; rates of nonparametric density estimation or statistical powers of two-sample or independence tests involving pX are known to necessarily degrade with growing dimension (Tolstikhin et al., 2017, Section 4.3).\npurposes such as two-sample tests (Gretton et al., 2012), independence testing (Gretton et al., 2005), or one can attempt to minimise this distance in order to match one distribution to another.\nAn example of such minimisation are reduced set methods (Burges, 1996; Schölkopf & Smola, 2002, Chap. 18), which replace a set of points S = {x1, . . . , xN} ⊆ X with a weighted set R = {(z1, w1), . . . , (zM , wM )} ⊆ X × R (of potentially smaller size), where the new points zm can, but need not equal any of the xns, such that the KME computed using the reduced setR is close to the KME computed using the original set S, as measured by the RKHS norm:\n∥∥µkS − µkR∥∥Hk = ∥∥∥∥∥ 1N N∑ n=1 k(xn, ·)− M∑ m=1 wmk(zm, ·) ∥∥∥∥∥ Hk .\nReduced set methods are usually motivated by the computational savings arising when |R| < |S|; we will invoke them mainly to replace a collection S of private data points with a (possibly weighted) set R of synthetic data points."
  }, {
    "heading": "3. Framework",
    "text": ""
  }, {
    "heading": "3.1. Problem Formulation",
    "text": "Throughout this work, we assume the following setup. A database curator wishes to publicly release a database D = {x1, . . . xN} ∈ XN containing private data about N individuals, with each data point (database row) xn taking values in a non-empty set X . The set X can be arbitrarily rich, for example, it could be a product of Euclidean spaces, integer spaces, sets of strings, etc.; we only require availability of a kernel function k : X × X → R on X . We assume that the N rows x1, . . . , xN in the database D can be thought of as i.i.d. observations from some X -valued data-generating random variable X (but see Section 7 for a discussion about relaxing this assumption). The database curator, wishing to protect the privacy of individuals in the database, seeks a database release mechanism that satisfies the definition of (ε, δ)-differential privacy, with ε > 0 and δ ≥ 0 given. The main purpose of releasing the database is to allow third parties to construct estimators of population statistics (i.e. properties of the distribution of X), but it is not known at the time of release what statistics the third-parties will be interested in.\nTo lighten notation, henceforth we drop the superscript k from KMEs (such as µkX ) and the subscript k from the RKHS Hk, whenever k is the kernel on X chosen by the database curator."
  }, {
    "heading": "3.2. Algorithm Template",
    "text": "We propose the following general algorithm template for differentially private database release:\n1. Construct a consistent estimator µ̂X of the KME µX of X using the private database.\n2. Obtain a perturbed version µ̃X of the constructed estimate µ̂X to ensure differential privacy.\n3. Release a (potentially approximate) representation of µ̃X in terms of a (possibly weighted) dataset {(z1, w1), . . . , (zM , wM )} ⊆ X × R.\nThe released representation should be such that∑M m=1 wmk(zm, ·) is a consistent estimator of the true KME µX , i.e. such that the RKHS distance between the two converges to 0 in probability as the private database size N , and together with it the synthetic database size M , go to infinity.\nEach step of this template admits several possibilities. For the first step we have discussed the standard empirical KME 1 N ∑N n=1 k(xn, ·) with x1, . . . , xN i.i.d. observations of X , but the framework remains valid with improved estimators such as kernel-based quadrature (Chen et al., 2010) or the shrinkage kernel mean estimators of (Muandet et al., 2016).\nAs the KMEs µ̂X and µX live in the RKHSH of the kernel k, a natural mechanism for privatising µ̂X in the second step would be to follow (Hall et al., 2013) and pointwise add to µ̂X a suitably scaled sample path g of a Gaussian process with covariance function k(·, ·). This does ensure (ε, δ)-differential privacy of the resulting function µ̃X = µ̂X + g, but unfortunately µ̃X 6∈ H, because the RKHS norm ‖g‖H of a Gaussian process sample path with the same kernel k is infinite almost surely (Rasmussen & Williams, 2005). While our framework allows pursuing this direction by, for example, moving to a larger function space that does contain the Gaussian process sample path, in this work we will present algorithms that achieve differential privacy by mapping µ̂X into a finite-dimensional Hilbert space and then employing the standard Laplace or Gaussian mechanisms to the finite coordinate vector.\nDifferential privacy is preserved under post-processing, but the third step does require some care to ensure that private data is not leaked. Specifically, when several possible (approximate) representations µ̃X ≈ ∑M m=1 wmk(zm, ·) in terms of a weighted dataset (w1, z1), . . . , (wM , zM ) are possible, committing to a particular one reveals more information than just the function µ̃X (consider, for example, the extreme case where the representation would be in terms of the private points x1, . . . , xN ). One thus needs to either control the privacy leak due to choosing a representation in a way that depends on the private data, or, as we do in our concrete algorithms below, choose a representation independently of the private data (but still minimising its RKHS distance to the privacy-protected µ̃X )."
  }, {
    "heading": "3.3. Versatility",
    "text": "Algorithms in our framework release a possibly weighted synthetic dataset {(z1, w1), . . . , (zM , wM )} ⊆ X ×R such that ∑M m=1 wmk(zm, ·) is a consistent estimator of the true KME µX of the data generating random variable X . This allows third-parties to perform a wide spectrum of statistical computation, all without having to worry about violating differential privacy:\n1. Kernel probabilistic programming (Schölkopf et al., 2015): The versatility of our approach is greatly expanded thanks to the result of (Simon-Gabriel et al., 2016), who showed that under technical conditions, applying a continuous function f to all points zm in the synthetic dataset yields a consistent estimator ∑M m=1 wmkf (f(zm), ·) of the KME µf(X) of the\ntransformed random variable f(X), even when the points z1, . . . , zM are not i.i.d. (as they may not be, depending on the particular synthetic database release algorithm).\n2. Consistent estimation of population statistics: For any RKHS function h ∈ H, we have 〈µX , h〉H = E[h(X)], so a consistent estimator of µX yields a consistent estimator of the expectation of h(X). It can be evaluated using the reproducing kernel property:\nE[h(X)] = 〈µX , h〉H ≈ 〈 M∑ m=1 wmk(zm, ·), h 〉 H\n= M∑ m=1 wmh(zm). (4)\nFor example, approximating the indicator function 1S of a set S ⊆ X with functions in the RKHS allows estimating probabilities: E[1S(X)] = P[X ∈ S] (note that 1S itself may not be an element of the RKHS).\n3. MMD estimation and two-sample testing (Gretton et al., 2012): Given another random variable Y on X , one can consistently estimate the Maximum Mean Discrepancy (MMD) distance ‖µX − µY ‖H between the distributions of X and Y , and in particular to construct a two-sample test based on this distance. Given a sample y1, . . . , yL ∼ Y :\n‖µX − µY ‖H ≈ ∥∥∥∥∥ M∑ m=1 wmk(zm, ·)− 1 L L∑ l=1 k(yl, ·) ∥∥∥∥∥ H ,\nwhich can again be evaluated using the reproducing property.\n4. Subsequent use of synthetic data: Since the output of the algorithm is a (possibly weighted) database, thirdparties are free to use this data for arbitrary purposes,\nsuch as training any machine learning model on this data. Models trained purely on this data can be released with differential privacy guaranteed; however, the accuracy of such models on real data remains an empirical question that is beyond the scope of this work.\nAn orthogonal spectrum of versatility arises from the fact that the third step in the algorithm template can constrain the released dataset (z1, w1), . . . , (zM , wM ) to be more convenient or more computationally efficient for further processing. For example, one could fix the weights to uniform wm = 1 M to obtain an unweighted dataset, or to replace an expensive data type with a cheaper subset, such as requesting floats instead of doubles in the zm’s. All this can be performed while an RKHS distance is available to control accuracy between µ̃X and its released representation."
  }, {
    "heading": "3.4. Concrete Algorithms",
    "text": "As a first illustrative example, we describe how a particular case of an existing, but inefficient synthetic database algorithm already fits into our framework. The exponential mechanism (McSherry & Talwar, 2007) is a general mechanism for ensuring ε-differential privacy, and in our setting it operates as follows: given a similarity measure s : XN × XM → R between (private) databases of size N and (synthetic) databases of size M , output a random (synthetic) database R with probability proportional to exp( ε2∆1 s(D,R)), where D is the actual private database and ∆1 is the L1 sensitivity of s w.r.t. D. This ensures ε-differential privacy (McSherry & Talwar, 2007).\nTo fit this into our framework, we can take s(D,R) = −‖µD − µR‖H to be the negative RKHS distance between the KMEs computed using D and R, and achieve ε-differential privacy by releasing R with probability proportional to exp(− ε2∆1 ‖µD − µR‖H). This solves steps 2 and 3 of our general algorithm template simultaneously, as it directly samples a concrete representation of a “perturbed” KME µR. The algorithm essentially corresponds to the SmallDB algorithm of Blum et al. (2008), except for choosing the RKHS distance as a well-studied similarity measure between two databases.\nThe principal issue with this algorithm is its computational infeasibility except in trivial cases, as it requires sampling from a probability distribution supported on all potential synthetic databases, and employing an approximate sampling scheme can break the differential privacy guarantee of the exponential mechanism. In Sections 4 and 5 respectively, we describe two concrete synthetic database release algorithms that may possess failure modes where they become inefficient, but employing approximations in those cases can only affect their statistical accuracy, not the promise of differential privacy.\nAlgorithm 1 Differentially private database release via a synthetic data subspace of the RKHS Input: database D = {x1, . . . , xN} ⊆ X , kernel k on X , privacy parameters ε > 0 and δ > 0 Output: (ε, δ)-differentially private, weighted synthetic database (representing an estimate of µX in the RKHSH of k)\n1: M ←M(N) ∈ ω(1) ∩ o(N2), number of synthetic data points to use 2: z1, . . . , zM ← initialised deterministically or randomly from some distribution q on X 3: HM ← Span({k(z1, ·), . . . , k(zM , ·)}) ≤ H 4: b1, . . . , bF ← orthonormal basis ofHM (obtained using, e.g. Gram-Schmidt) 5: µ̂X ← 1N ∑N n=1 k(xn, ·), empirical KME of X inH\n6: µX ← ∑F f=1〈bf , µ̂X〉Hbf =: ∑F f=1 αfbf , projection of µ̂X ontoHM 7: β ← α+N (0, 8 ln(1.25/δ)N2ε2 IF ), an (ε, δ)-differentially private version of the coordinate vector α (Gaussian mechanism) 8: µ̃X ← ∑F f=1 βfbf = ∑M m=1 wmk(zm, ·), re-expressed in terms of k(zm, ·)’s 9: return (z1, w1), . . . , (zM , wM )"
  }, {
    "heading": "4. Perturbation in Synthetic-Data Subspace",
    "text": "In this section we describe an instantiation of the framework proposed in Section 3 that achieves differential privacy of the KME by projecting it onto a finite-dimensional subspace of the RKHS spanned by feature maps k(zm, ·) of synthetic data points z1, . . . , zM , and perturbing the resulting finite coordinate vector. To ensure differential privacy, the synthetic data points are chosen independently of the private database. As a result, statistical efficiency of this approach will depend on the choice of synthetic data points, with efficiency increasing if there are enough synthetic data points to capture the patterns in the private data. Therefore this algorithm is especially suited to the scenario discussed in Section 1, where a part of the database (or of a similar one) has already been published, as this can serve as a good starting set for the synthetic data points.\nThe setting where some observations from X have already been released highlights the fact that differential privacy only protects against additional privacy violation due to an individual deciding to contribute to the private database; if a particular user’s data has already been published, differential privacy does not protect against privacy violations based on exploiting this previously published data.\nThe algorithm is formalised as Algorithm 1 above. Lines 1- 2 choose synthetic data points z1, . . . , zM independently of the private data (only using the database size N ). Lines 3-4 construct the linear subspaceHM ofH spanned by feature maps of the chosen synthetic data points, and compute a (finite) basis for it. Only then the private data is accessed: the empirical KME µ̂X is computed (line 5), projected onto the subspace HM and expressed in terms of the precomputed basis (line 6). The basis coefficients of the projection are then perturbed to achieve differential privacy (line 7), and the perturbed element µ̃X ∈ HM is then re-expressed in terms of the spanning set containing feature maps of synthetic data points (line 8). This expansion is finally released to the public (line 9).\nLine 1 stipulates that the number of synthetic data points M → ∞ as N → ∞, but asymptotically slower than N2. This is to ensure that the privatisation noise added in the subspace HM to each coordinate is small enough overall to preserve consistency, as stated in the following Theorem 2. This theorem assures us that Algorithm 1 produces a consistent estimator of the true KME µX , if the synthetic data points are sampled from a distribution with sufficiently large support. Due to space constraints, all proofs appear in Appendix A.\nTheorem 2. Let X be a compact metric space and k a continuous kernel on X . If the synthetic data points z1, z2, . . . are sampled i.i.d. from a distribution q on X such that the support of X is included in the support of q, then Algorithm 1 outputs a consistent estimator of the KME µX :∑M m=1 wmk(zm, ·) P→ µX as N →∞.\nAs discussed by Simon-Gabriel et al. (2016), these assumptions are usually satisfied: X can be taken to be compact whenever the data comes from measurements with any bounded range, and many kernels are continuous, including all kernels on discrete spaces (w.r.t. to the discrete topology).\nIn order to use the output of Algorithm 1 in the very general kernel probabilistic programming framework and obtain a consistent estimator of the KME µf(X) of f(X) for any continuous function f , there is a technical condition that the L1 norm ∑M m=1 |wm| of the released weights may need to remain bounded by a constant as N →∞ (Simon-Gabriel et al., 2016). This is not enforced by Algorithm 1, but Theorem 11 in Appendix A.1 shows how a simple regularisation in the final stage of the algorithm achieves this without breaking consistency (or privacy).\nThe next result about Algorithm 1 shows that it is differentially private whenever k(x, x) ≤ 1 for all x ∈ X . This is a weak assumption that holds for all normalised kernels, and can be achieved by simple rescaling for any bounded kernel (such that supx∈X k(x, x) < ∞). When X is a compact domain, all continuous kernels are bounded.\nProposition 3. If k(x, x) ≤ 1 for all x ∈ X , then Algorithm 1 is (ε, δ)-differentially private.\nRemark 4. One usually requires that δ decreases faster than polynomially with the database size N (Dwork & Roth, 2014). The proof of Theorem 2 remains valid whenever M(N) ∈ o(N2/ ln(1.25/δ(N))), so for example we could have δ(N) = e− √ N and M(N) ∈ o(N3/2).\nFor a finite private database, actual performance will heavily depend on how the synthetic data points are chosen. We consider the following two extreme scenarios:\n1. No publishable subset: No rows of the private database are, or can be made public unmodified.\n2. Publishable subset: A small proportion of the private database is already public, or can be made public.\nProposition 5 (Algorithm 1, No publishable subset). Say X is a bounded subset of RD, the kernel k is Lipschitz, and the synthetic data points z1, z2, . . . are sampled i.i.d. from a distribution q with density bounded away from 0 on any bounded subset of RD. Then M = M(N) can be chosen so that the output of Algorithm 1 converges to the true KME µX in RKHS norm at a rate Op(N−1/(D+1+c)), where c is any fixed positive number c > 0.\nUnsurprisingly, the convergence rate deteriorates with input dimension D, since without prior information about the private data manifold it is increasingly difficult for randomly sampled synthetic points to capture patterns in the private data. One of the main strengths of KMEs is that the empirical estimator converges to the true embedding at a rate\nOp(N−1/2) independently of the input dimension D, so we see that in this unfavourable scenario Algorithm 1 incurs a substantial privacy cost in high dimensions. On the other hand, if a small, but fixed proportion of the private database is publishable, then Algorithm 1 incurs no privacy cost in terms of the convergence rate:\nProposition 6 (Algorithm 1, Publishable subset). Say that a fixed proportion η of the private database can be published unmodified. Using this part of the database as the synthetic data points, Algorithm 1 outputs a consistent estimator of µX that converges in RKHS norm at a rate Op(N−1/2).\nNote that in this scenario the rate Op(N−1/2) can be also achieved by uniform weighting of the synthetic data points, since µ̂baseline := 1M ∑M m=1 k(zm, ·) with zm = xm is already a consistent estimator of µX (although based on a much smaller sample size M = ηN N ). The purpose of Algorithm 1 is to find (generally non-uniform) w1, . . . , wM that reweight the public data points using the information in the large private dataset, but respecting differential privacy. Proposition 6 confirmed theoretically that this does not hurt the convergence rate, while Figure 1 shows empirically on two synthetic datasets of dimensions D = 2 and D = 5 that Algorithm 1 can in fact yield more accurate estimates of the KME than µ̂baseline, especially when the proportion of public data points is small. This is encouraging, since obtaining permission to publish a larger subset of the private data unchanged will usually come at an increased cost. The ability to instead reweight a smaller public dataset in a differentially private manner using Algorithm 1 is therefore useful.\nAlgorithm 2 Differentially private database release via a random features RKHS Input: database D = {x1, . . . , xN} ⊆ X , kernel k on X , privacy parameters ε > 0 and δ > 0 Output: (ε, δ)-differentially private, weighted synthetic database (representing an estimate of µX in the RKHSH of k)\n1: J ← J(N) ∈ ω(1) ∩ o(N2), number of random features to use 2: φ← random feature map X 7→ RJ for kernel k with J features 3: µ̂φX ← 1 N ∑N n=1 φ(xn) ∈ RJ , empirical KME of X in RKHSHφ of the random features kernel kφ(·, ·) := φ(·)Tφ(·) 4: µ̃φX ← µ̂ φ X +N (0, 8 ln(1.25/δ) N2ε2 IJ), an (ε, δ)-differentially private version of the vector µ̂ φ X (Gaussian mechanism) 5: M ←M(N) ≥ N , number of synthetic expansion points to use for representing µ̃φX 6: (z1, w1), . . . , (zM , wM )← approximate µ̃φX in the RKHSHφ using a Reduced set method:\n(z1, w1), . . . , (zM , wM ) ≈ argmin (z′1,w ′ 1),...,(z ′ M ,w ′ M ) s.t. ∑ m |w ′ m|≤1 ∥∥∥∥∥ M∑ m=1 w′mφ(z ′ m)− µ̃ φ X ∥∥∥∥∥ Hφ\n(5)\n7: return (z1, w1), . . . , (zM , wM )"
  }, {
    "heading": "5. Perturbation in Random-Features RKHS",
    "text": "Another approach to ensuring differential privacy is to map the potentially infinite dimensional RKHS H of k into a different, finite-dimensional RKHSHφ using random features (Rahimi & Recht, 2007), privacy-protect the finite coordinate vector in this space (Chaudhuri et al., 2011), and then employ a reduced set method to find an expansion of the resulting RKHS element in terms of synthetic data points. In contrast to Algorithm 1, both the weights and locations of synthetic data points can be optimised here.\nThe algorithm is formalised as Algorithm 2 above. Lines 1- 2 pick the number J = J(N) of random features to use, and construct a random feature map φ with that many features. Lines 3-4 compute the empirical KME of X in the RKHS Hφ corresponding to the kernel induced by the random features, and then privacy-protect the resulting finite, realvalued vector. Lines 5-6 run a blindly initialised Reduced set method to find a weighted synthetic dataset whose KME inHφ is close to the privacy-protected KME of the private database. Line 7 releases this weighted dataset to the public.\nThe following theorem confirms that Algorithm 2 outputs a consistent estimator of the true KME µX , provided that the optimisation problem (5) is solved exactly, and the random features converge to the kernel k uniformly on X . On compact sets X this requirement is satisfied by general schemes such as random Fourier features and random binning for shift-invariant kernels (Rahimi & Recht, 2007), or by random features for dot product kernels (Kar & Karnick, 2012).\nTheorem 7. If φ(·)Tφ(·)→ k(·, ·) converges uniformly in X × X as J → ∞, then the output of Algorithm 2 is a consistent estimator of the true KME µX as N →∞.\nMoreover, a uniform convergence rate for the random features, such as the one for random Fourier features by Sriperumbudur & Szabo (2015), can be used to derive a convergence rate for the output of Algorithm 2:\nProposition 8. If φ(·)Tφ(·)→ k(·, ·) converges uniformly in X ×X at a rate Op(J−1/2) as J →∞, then J = J(N) can be chosen so that the output of Algorithm 2 converges to the true KME µX at a rate Op(N−1/3).\nThe empirical KME of the private database µ̂X converges at a rateOp(N−1/2), so we see that under perfect optimisation, the privacy cost incurred by Algorithm 2 is a factor of N1/6. In practice performance will also depend on the Reduced set method used, and the computational budget allocated to it. Figure 2 shows how the incurred error (in terms of RKHS distance) varies with the number of synthetic data points M . The additional ability of Algorithm 2 to optimise the locations of the synthetic data points (rather than just the weights, as in Algorithm 1) seems to be more helpful in the higher-dimensional case D = 5, where the randomly sampled synthetic data points are less likely to land close to private data points.\nProposition 9. If ‖φ(x)‖2 ≤ 1 for all x ∈ X , then Algorithm 2 is (ε, δ)-differentially private.\nThis L2-boundedness requirement on the random feature vectors φ(x) is reasonable under the weak assumption k(x, x) ≤ 1 for all x ∈ X discussed in Section 4, as in that case ‖φ(x)‖22 = φ(x)Tφ(x) ≈ k(x, x) ≤ 1."
  }, {
    "heading": "6. Related Work",
    "text": "Synthetic database release algorithms with a differential privacy guarantee have been studied in the literature before. Machanavajjhala et al. (2008) analyzed such a procedure for count data, ensuring privacy by sampling a distribution and then synthetic counts from a Dirichlet-Multinomial posterior. Blum et al. (2008) studied the exponential mechanism applied to synthetic database generation, which leads to a very general, but unfortunately inefficient algorithm (see also Section 3.4). Wasserman & Zhou (2010) provided a theoretical comparison of this algorithm to sampling synthetic\ndatabases from deterministically smoothed, or randomly perturbed histograms. Unlike our approach, these algorithms achieve differential privacy by sampling synthetic data points from a specific distribution, where resorting to approximate sampling can break the privacy guarantee. In our framework we propose to arrive at the synthetic database using a reduced set method, where poor performance could affect statistical usefulness of the synthetic database, but cannot break its differential privacy.\nZhou et al. (2009) and Kenthapadi et al. (2012) proposed randomised database compression schemes that yield synthetic databases useful for particular types of algorithms, while guaranteeing differential privacy. The former compresses the number of data points using a random linear or affine transformation of the entire database, and the result can be used by procedures that rely on the empirical covariance of the original data. The latter compresses the number of data point dimensions while approximately preserving distances between original, private data points.\nDifferentially private learning in a RKHS has also been studied, with Chaudhuri et al. (2011) and Rubinstein et al. (2012) having independently presented release mechanisms for the result of an empirical risk minimisation procedure (such as a SVM). Similarly to our Algorithm 2, they map data points into a finite-dimensional space defined by random features and carry out the privacy-protecting perturbation there. However, they do not require the final stage of invoking a Reduced set method to construct a synthetic database, because the output (such as a trained SVM) is only used for evaluation on test points, for which it suffices to additionally release the used random feature map φ.\nAs our framework stipulates privacy-protecting an empirical\nKME, which is a function X → R, the work on differential privacy for functional data is of relevance. Hall et al. (2013) showed how an RKHS element can be made differentially private via pointwise addition of a Gaussian process sample path, but as discussed in Section 3.2, the resulting function is no longer an element of the RKHS. Recently, Aldà & Rubinstein (2017) proposed a general Bernstein mechanism for ε-differentially private function release. The released function can be evaluated pointwise arbitrarily many times, but again, the geometry of the RKHS to which the unperturbed function belonged cannot be easily exploited anymore."
  }, {
    "heading": "7. Discussion",
    "text": "We proposed a framework for constructing differentially private synthetic database release algorithms, based on the idea of using KMEs in RKHS as intermediate database representations. To justify our framework, we presented two concrete algorithms and proved theoretical results guaranteeing their consistency and differential privacy. We also studied their finite-sample convergence rates, and provided empirical illustrations of their performance on synthetic datasets. We believe that exploring other instantiations of this framework, and comparing them theoretically and empirically, can be a fruitful direction for future research.\nThe i.i.d. assumption on database rows can be relaxed. For example, if they are identically distributed (as a random variable X), but not necessarily independent, the framework remains valid as long as a consistent estimator of the KME µX can be constructed from the database rows. A common situation where this arises is, for example, duplication of database rows due to user error."
  }, {
    "heading": "Acknowledgements",
    "text": "The authors would like to thank Bharath Sriperumbudur and the anonymous reviewers for helpful feedback."
  }],
  "year": 2018,
  "references": [{
    "title": "The Bernstein mechanism: Function release under differential privacy",
    "authors": ["F. Aldà", "B.I.P. Rubinstein"],
    "venue": "In AAAI,",
    "year": 2017
  }, {
    "title": "A learning theory approach to non-interactive database privacy",
    "authors": ["A. Blum", "K. Ligett", "A. Roth"],
    "venue": "In 40th ACM Symposium on Theory of Computing,",
    "year": 2008
  }, {
    "title": "Simplified support vector decision rules",
    "authors": ["C.J.C. Burges"],
    "venue": "In ICML,",
    "year": 1996
  }, {
    "title": "Differentially private empirical risk",
    "authors": ["K. Chaudhuri", "C. Monteleoni", "A.D. Sarwate"],
    "venue": "minimization. JMLR,",
    "year": 2011
  }, {
    "title": "Super-samples from kernel herding",
    "authors": ["Y. Chen", "M. Welling", "A. Smola"],
    "venue": "In UAI,",
    "year": 2010
  }, {
    "title": "Differential privacy",
    "authors": ["C. Dwork"],
    "venue": "In 33rd International Conference on Automata, Languages and Programming (ICALP),",
    "year": 2006
  }, {
    "title": "The Algorithmic Foundations of Differential Privacy",
    "authors": ["C. Dwork", "A. Roth"],
    "venue": "Foundations and Trends in Theoretical Computer Science,",
    "year": 2014
  }, {
    "title": "Kernel measures of conditional dependence",
    "authors": ["K. Fukumizu", "A. Gretton", "X. Sun", "B. Schölkopf"],
    "venue": "In NIPS,",
    "year": 2008
  }, {
    "title": "Measuring statistical dependence with Hilbert-Schmidt norms",
    "authors": ["A. Gretton", "O. Bousquet", "A. Smola", "B. Schölkopf"],
    "venue": "In ALT,",
    "year": 2005
  }, {
    "title": "Random feature maps for dot product kernels",
    "authors": ["P. Kar", "H. Karnick"],
    "venue": "In AISTATS,",
    "year": 2012
  }, {
    "title": "Privacy via the Johnson-Lindenstrauss transform",
    "authors": ["K. Kenthapadi", "A. Korolova", "I. Mironov", "N. Mishra"],
    "venue": "[cs],",
    "year": 2012
  }, {
    "title": "Towards a learning theory of cause-effect inference",
    "authors": ["D. Lopez-Paz", "K. Muandet", "B. Schölkopf", "I. Tolstikhin"],
    "venue": "In ICML,",
    "year": 2015
  }, {
    "title": "Privacy: Theory meets practice on the map",
    "authors": ["A. Machanavajjhala", "D. Kifer", "J. Abowd", "J. Gehrke", "L. Vilhuber"],
    "venue": "In IEEE 24th International Conference on Data Engineering,",
    "year": 2008
  }, {
    "title": "Mechanism design via differential privacy",
    "authors": ["F. McSherry", "K. Talwar"],
    "venue": "In 48th Annual IEEE Symposium on Foundations of Computer Science (FOCS),",
    "year": 2007
  }, {
    "title": "Random features for large scale kernel machines",
    "authors": ["A. Rahimi", "B. Recht"],
    "venue": "In NIPS,",
    "year": 2007
  }, {
    "title": "Gaussian Processes for Machine Learning",
    "authors": ["C.E. Rasmussen", "C.K.I. Williams"],
    "year": 2005
  }, {
    "title": "Learning in a large function space: Privacy-preserving mechanisms for SVM learning",
    "authors": ["B.I.P. Rubinstein", "P.L. Bartlett", "L. Huang", "N. Taft"],
    "venue": "The Journal of Privacy and Confidentiality,",
    "year": 2012
  }, {
    "title": "Learning with Kernels: Support Vector Machines, Regularization, Optimization, and Beyond",
    "authors": ["B. Schölkopf", "A.J. Smola"],
    "year": 2002
  }, {
    "title": "Computing functions of random variables via Reproducing Kernel Hilbert Space representations",
    "authors": ["B. Schölkopf", "K. Muandet", "K. Fukumizu", "S. Harmeling", "J. Peters"],
    "venue": "Statistics and Computing,",
    "year": 2015
  }, {
    "title": "Consistent Kernel Mean Estimation for Functions of Random Variables",
    "authors": ["Simon-Gabriel", "C.-J", "A. Ścibior", "I. Tolstikhin", "B. Schölkopf"],
    "venue": "In NIPS,",
    "year": 2016
  }, {
    "title": "A Hilbert space embedding for distributions",
    "authors": ["A. Smola", "A. Gretton", "L. Song", "B. Schölkopf"],
    "venue": "In ALT,",
    "year": 2007
  }, {
    "title": "Optimal rates for random Fourier features",
    "authors": ["B. Sriperumbudur", "Z. Szabo"],
    "venue": "In NIPS",
    "year": 2015
  }, {
    "title": "Universality, characteristic kernels and RKHS embedding of measures",
    "authors": ["B.K. Sriperumbudur", "K. Fukumizu", "G.R.G. Lanckriet"],
    "year": 2011
  }, {
    "title": "Minimax estimation of kernel mean embeddings",
    "authors": ["I. Tolstikhin", "B.K. Sriperumbudur", "K. Muandet"],
    "year": 2017
  }, {
    "title": "A statistical framework for differential privacy",
    "authors": ["L. Wasserman", "S. Zhou"],
    "venue": "Journal of the American Statistical Association,",
    "year": 2010
  }, {
    "title": "Differential privacy with compression",
    "authors": ["S. Zhou", "K. Ligett", "L. Wasserman"],
    "venue": "In IEEE International Conference on Symposium on Information Theory (ISIT),",
    "year": 2009
  }],
  "id": "SP:7625663bc7081f90b15a59b1466eb7b3d70afc5b",
  "authors": [{
    "name": "Matej Balog",
    "affiliations": []
  }, {
    "name": "Ilya Tolstikhin",
    "affiliations": []
  }, {
    "name": "Bernhard Schölkopf",
    "affiliations": []
  }],
  "abstractText": "We lay theoretical foundations for new database release mechanisms that allow third-parties to construct consistent estimators of population statistics, while ensuring that the privacy of each individual contributing to the database is protected. The proposed framework rests on two main ideas. First, releasing (an estimate of) the kernel mean embedding of the data generating random variable instead of the database itself still allows thirdparties to construct consistent estimators of a wide class of population statistics. Second, the algorithm can satisfy the definition of differential privacy by basing the released kernel mean embedding on entirely synthetic data points, while controlling accuracy through the metric available in a Reproducing Kernel Hilbert Space. We describe two instantiations of the proposed framework, suitable under different scenarios, and prove theoretical results guaranteeing differential privacy of the resulting algorithms and the consistency of estimators constructed from their outputs.",
  "title": "Differentially Private Database Release via Kernel Mean Embeddings"
}