{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Deep Neural Networks (DNNs) have demonstrated excellent performance in solving many complex problems, and have been widely employed for tasks such as speech recognition (Hinton et al., 2012), computer vision (He et al., 2016) and gaming agents (Silver et al., 2016). DNNs are capable of learning very complex functions, and can generalize well even for a huge number of parameters (Neyshabur et al., 2014). However, recent studies have shown that DNNs may generalize poorly for datasets which contain a high proportion noisy (incorrect) class labels (Zhang et al., 2017). It is important to gain a fuller understanding of this phenomenon, with a view to development of new training methods that can\n*Equal contribution 1The University of Melbourne, Melbourne, Australia 2Tsinghua University, Beijing, China 3National Institute of Informatics, Tokyo, Japan. Correspondence to: Yisen Wang <wangys14@mails.tsinghua.edu.cn>, Xingjun Ma <xingjun.ma@unimelb.edu.au>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nachieve good generalization performance in the presence of variable amounts of label noise.\nOne simple approach for noisy labels is to ask a domain expert to relabel or remove suspect samples in a preprocessing stage. However, this is infeasible for large datasets and also runs the risk of removing crucial samples. An alternative is to correct noisy labels to their true labels via a clean label inference step (Vahdat, 2017; Veit et al., 2017; Jiang et al., 2017; Li et al., 2017). Such methods often assume the availability of a supplementary labelled dataset containing pre-identified noisy labels which are used to develop a model of the label noise. However, their effectiveness is tied to the assumption that the data follow the noise model. A different approach to tackle noisy labels is to utilize correction methods such as loss correction (Patrini et al., 2017; Ghosh et al., 2017), label correction (Reed et al., 2014), or additional linear correction layers (Sukhbaatar & Fergus, 2014; Goldberger & Ben-Reuven, 2017).\nIn this paper, we first investigate the dimensionality of the deep representation subspaces learned by a DNN and provide a dimensionality-driven explanation of DNN generalization behavior in the presence of (class) label noise. Our analysis employs a dimensionality measure called Local Intrinsic Dimensionality (LID) (Houle, 2013; 2017a), applied to the deep representation subspaces of training examples. We show that DNNs follow two-stage of learning in this scenario: 1) an early stage of dimensionality compression, that models low-dimensional subspaces that closely match the underlying data distribution, and 2) a later stage of dimensionality expansion, that steadily increases subspace dimensionality in order to overfit noisy labels. This second stage appears to be a key factor behind the poor generalization performance of DNNs for noisy labels. Based on this finding, we propose a new training strategy, termed Dimensionality-Driven Learning, that avoids the dimensionality expansion stage of learning by adapting the loss function. Our main contributions are:\n• We show that from a dimensionality perspective, DNNs exhibit distinctive learning styles with clean labels versus noisy labels.\n• We show that the local intrinsic dimensionality can\nbe used to identify the stage shift from dimensionality compression to dimensionality expansion.\n• We propose a Dimensionality-Driven Learning strategy (D2L) that modifies the loss function once the turning point between the two stages of dimensionality compression and expansion is recognized, in an effort to prevent overfitting.\n• We empirically demonstrate on MNIST, SVHN, CIFAR-10 and CIFAR-100 datasets that our Dimensionality-Driven Learning strategy can effectively learn (1) low-dimensional representation subspaces that capture the underlying data distribution, (2) simpler hypotheses, and (3) high-quality deep representations."
  }, {
    "heading": "2. Related Work",
    "text": ""
  }, {
    "heading": "2.1. Generalization of DNNs",
    "text": "Zhang et al. (2017) showed that DNNs are capable of memorizing completely random labels and exhibit poor generalization capability. They argued that DNNs employ case-bycase memorization on training samples and their labels in this scenario. Krueger et al. (2017) highlighted that DNNs exhibit different learning styles on datasets with clean labels versus those on datasets with noisy inputs or noisy labels. They showed that DNNs require more capacity, longer training time to fit noisy labels and the learned hypothesis is more complex. Arpit et al. (2017) further substantiated this finding by identifying two stages of learning of DNNs with noisy labels: an early stage of simple pattern learning and refining, and a later stage of label memorization. They also showed that dropout regularization can hinder overfitting to noisy labels. Shwartz-Ziv & Tishby (2017) demonstrated that, on data with clean labels, DNNs with tanh layers undergo an initial label fitting phase and then a subsequent compression phase. They also argued that information compression is related to the excellent generalization performance of DNNs. However, Saxe et al. (2018) conducted experiments where information compression was not found to occur for ReLU (Glorot et al., 2011) DNNs.\nWhile these works have studied the differences between learning with clean labels and learning with noisy labels, a full picture of this phenomenon and its implications for DNN generalization is yet to emerge. Our study adds another perspective based on subspace dimensionality analysis, and shows how this can lead to the development of an effective learning strategy."
  }, {
    "heading": "2.2. Noisy Label Learning",
    "text": "A variety of approaches have been proposed to robustly train DNNs on datasets with noisy labels. One strategy is to\nexplicitly or implicitly formulate the noise model and use a corresponding noise-aware approach. Symmetric label noise that is independent of the true label was modeled in (Larsen et al., 1998), and asymmetric label noise that is conditionally independent of individual samples was modeled in (Natarajan et al., 2013; Sukhbaatar et al., 2014). There are also more complex noise models for training samples where true labels and noisy labels can be characterized by directed graphical models (Xiao et al., 2015), conditional random fields (Vahdat, 2017), neural networks (Veit et al., 2017; Jiang et al., 2017) or knowledge graphs (Li et al., 2017). These methods aim to correct noisy labels to their true labels via a clean label inference step or by assigning smaller weights to noisy label samples. For the modeling of label noise, they often require an extra dataset with ground truth of pre-identified noisy labels to be available, or an expensive detection process. They may also rely on specific assumptions about the noise model. Another approach is to use a refined training strategy that utilizes correction methods to adjust the loss function to eliminate the influence of noisy samples (Wang et al., 2018). Backward and Forward are two such correction methods that use an estimated or learned factor to modify the loss function (Patrini et al., 2017). A linear layer is added on top of the network to further augment the correction architecture in (Sukhbaatar & Fergus, 2014; Goldberger & Ben-Reuven, 2017). Bootstrap replaces the target labels with a combination of raw target labels and their predicted labels (Reed et al., 2014).\nOur proposed Dimensionality-Driven Learning strategy is also a loss correction method, one that avoids overfitting by using the estimation of the local intrinsic dimensionality of learned local subspaces to regulate the learning process. In Section 5 we empirically compare Dimensionality-Driven Learning with other loss correction strategies."
  }, {
    "heading": "2.3. Supervised Learning and Dimensionality",
    "text": "The Local Intrinsic Dimensionality (LID) model (Houle, 2017a) was recently used for successful detection of adversarial examples for DNNs by (Ma et al., 2018). This work demonstrates that adversarial perturbations (one type of input noise) tend to increase the dimensionality of the local subspace immediately surrounding a test sample, and that features based on LID can be used for identifying such perturbations. However, in this paper we show how LID can be used in a new way, as a tool for assessing the learning behavior of a DNN, and developing an adaptive learning strategy against noisy labels.\nOther works have also considered the use of dimensionality measures for regularization in manifold learning (Roweis & Saul, 2000; Belkin et al., 2004; 2006). For example, an intrinsic geometry regularization over Reproducing Kernel Hilbert Spaces (RKHS) was proposed in (Belkin et al., 2006)\nto enforce smoothness of solutions relative to the underlying manifold, and a Laplacian-based regularization using the weighted neighborhood graph was proposed in (Belkin et al., 2004). In contrast to these works, which treated dimensionality as a characteristic of the global data distribution, we explore how knowledge of local dimensional characteristics can be used to monitor and modify DNN learning behavior for the noisy label scenario."
  }, {
    "heading": "3. Dimensionality of Deep Representation Subspaces",
    "text": "We now briefly introduce the LID measure for assessing the dimensionality of data subspaces residing in the deep representation space of DNNs. We then connect dimensionality theory with the learning process of DNNs."
  }, {
    "heading": "3.1. Local Intrinsic Dimensionality (LID)",
    "text": "Local Intrinsic Dimensionality (LID) is an expansion-based measure of intrinsic dimensionality of the underlying data subspace/submanifold (Houle, 2017a). In the theory of intrinsic dimensionality, classical expansion models (such as the expansion dimension (Karger & Ruhl, 2002) and generalized expansion dimension (Houle et al., 2012)) measure the rate of growth in the number of data objects encountered as the distance from the reference sample increases. Intuitively, in Euclidean space, the volume of an D-dimensional ball grows proportionally to rD when its size is scaled by a factor of r. From the above rate of volume growth with distance, the dimension D can be deduced from two volume measurements as:\nV2/V1 = (r2/r1) D ⇒ D = ln(V2/V1)/ ln(r2/r1). (1)\nThe aforementioned expansion-based measures of intrinsic dimensionality would determine D by estimating the volumes in terms of the numbers of data points captured by the balls. Transferring the concept of expansion dimension from the Euclidean space to the statistical setting of continuous distance distributions, the notion of ball volume is replaced by the probability measure associated with the balls. This leads to the formal definition of LID (Houle, 2017a): Definition 1 (Local Intrinsic Dimensionality). Given a data sample x ∈ X , let r > 0 be a random variable denoting the distance from x to other data samples. If the cumulative distribution function F (r) is positive and continuously differentiable at distance r > 0, the LID of x at distance r is given by:\nLIDF (r) , lim →0\nln ( F ((1 + )r) / F (r) ) ln(1 + ) = rF ′(r) F (r) , (2)\nwhenever the limit exists. The LID at x is in turn defined as the limit of the radius r → 0:\nLIDF = lim r→0 LIDF (r). (3)\nLIDF describes the relative rate at which its cumulative distance function F (r) increases as the distance r increases. In the ideal case where the data in the vicinity of x are distributed uniformly within a local submanifold, LIDF equals the dimension of the submanifold. Nevertheless, in more general cases, LID also provides a rough indication of the dimension of the submanifold containing x that would best fit the data distribution in the vicinity of x. We refer readers to (Houle, 2017a;b) for more details about LID.\nEstimation of LID: Given a reference sample point x ∼ P , where P represents a global data distribution, P induces a distribution of distances relative to x — each sample x∗ ∼ P being associated with the distance value d(x, x∗). With respect to a dataset X drawn from P , the smallest k nearest neighbor distances from x can be regarded as extreme events associated with the lower tail of the induced distance distribution. From the statistical theory of extreme values, the tails of continuous distance distributions can be seen to converge to the Generalized Pareto Distribution (GPD), a form of power-law distribution (Coles et al., 2001; Hill, 1975). Several estimators of LID were developed in (Amsaleg et al., 2015; Levina & Bickel, 2005), of which the Maximum Likelihood Estimator (MLE) exhibited the best trade-off between statistical efficiency and complexity:\nL̂ID(x) = −\n( 1\nk k∑ i=1 log ri(x) rmax (x)\n)−1 . (4)\nHere, ri(x) denotes the distance between x and its i-th nearest neighbor, and rmax (x) denotes the maximum of the neighbor distances. Note that the LID defined in Equation (3) is a distributional quantity, and the L̂ID defined in Equation (4) is its estimate."
  }, {
    "heading": "3.2. LID Estimation through Batch Sampling",
    "text": "Since computing neighborhoods with respect to the entire dataset X can be prohibitively expensive, we will estimate LID of a training example x from its k-nearest neighbor set within a batch randomly selected from X . Consider a L-layer neural network h : P → Rc, where h(i) is the intermediate transformation of the i-th layer, and c is a positive number indicating the number of classes. Given a batch of training samples XB ⊆ X , and a reference point x ∼ P (not necessarily a training sample), we estimate the LID score of x as:\nL̂ID(x,XB) = −\n( 1\nk k∑ i=1 log ri(g(x), g(XB)) rmax (g(x), g(XB))\n)−1 ,\n(5) where g = h(L−1) is the output of the second-to-last layer of the network, ri(g(x), g(XB)) is the distance of g(x) to its ith nearest neighbor in the transformed set g(XB), and rmax represents the radius of the neighborhood. L̂ID(x,XB)\nreveals the dimensional complexity of the local subspace in the vicinity of x, taken after transformation by g. Provided that the batch is chosen sufficiently large so as to ensure that the k-nearest neighbor sets remain in the vicinity of g(x), the estimate of LID at g(x) within the batch serves as an approximation to the value that would have been computed within the full dataset g(X)."
  }, {
    "heading": "3.3. Subspace Dimensionality and Noisy Labels",
    "text": "We now show by means of an example how the subspace dimensionality of training and test examples is affected by the quality of label information, as the number of training epochs is increased. For our example, we trained a 5-layer Convolutional Neural Network (CNN) on MNIST (an image data set with 10 categories of handwritten digits (LeCun et al., 1998)) and a 12-layer CNN on CIFAR-10 (a natural image data set with 10 categories (Krizhevsky & Hinton, 2009)) using SGD, cross-entropy loss, and two different label quality settings: (1) clean labels for all training samples; (2) noisy labels for 40% of the training samples, generated by uniformly and randomly replacing the correct label with one of the 9 incorrect labels. LID values at layer 4 for MNIST and layer 11 for CIFAR-10 were averaged over 10 batches of 128 points each, for a total of 1280 test points. The resulting LID scores and the train/test accuracies are shown in Figure 1. When learning with clean labels, we observe a decreasing trend in LID score and an increasing trend in accuracy as the number of training epochs increases. However, when learning with noisy labels, we see a very different trend: first a decrease in LID followed by an increase,\naccompanied by an initial increase in test accuracy followed by a decrease. We observed similar dimensionality trends for a 6-layer CNN on SVHN (Netzer et al., 2011) and a 44- layer ResNet (He et al., 2016) on CIFAR-100 (Krizhevsky & Hinton, 2009).\nClearly, in these two situations, the DNNs are exhibiting different learning styles. For training data with clean labels, the network gradually transforms the data to subspaces of low dimensionality. Once the subspaces of the lowest dimensionality has been found, the network effectively stops learning: the test accuracy stabilizes at its highest level and the dimensionality stabilizes at its lowest. On the other hand, for training data with noisy labels, the network initially learns a transformation of the data to subspaces of lower dimensionality, although not as low as when training on data with clean labels. Thereafter, the network progressively attempts to accommodate noisy labels by increasing the subspace dimensionality."
  }, {
    "heading": "3.4. Two-Stage of Learning of DNNs on Noisy Labels",
    "text": "From the above empirical results, we find that DNNs follow two-stage of learning in the presence of label noise: 1) an early stage of dimensionality compression, in which the dimensionalities associated with the underlying data manifold are learned; and 2) a later stage of dimensionality expansion, in which the subspace dimensionalities steadily increase as the learning process overfits to the noisy data.\nOne possible explanation for this phenomenon can be found in the effect of transformation on the neighborhood set of test points. Given a training point x ∈ X , its initial spatial location (before learning) would relate to a low-dimensional local subspace determined by the underlying manifold (call this subspace A). Although the initial neighborhood of x would likely contain many data points that are also close to manifold A, the LID estimate would not necessarily be the exact dimension of A. LID reveals the growth characteristics of the distance distribution from x, which is influenced by — but not equal to — the dimension of the manifold to which x is best associated.\nAs the learning process progresses, the manifold undergoes a transformation by which it progressively achieves a better fit to the training data. If x is labeled correctly, and if many of its neighbors also have clean labels, the learning process can be expected to converge towards a local subspace of relatively low intrinsic dimensionality (as observed in the left-hand plot of Figure 1); however, it should be noted that the learning process still risks overfitting to the data, if carried out too long. With overfitting, the dimensionality of the local manifold would be expected to rise eventually.\nIf x is incorrectly labeled, each epoch in the learning process progressively causes x — or more precisely, its transform\n(call it x′) — to migrate to a new local subspace (call it A′) associated with members of the same label that was incorrectly applied to x. During this migration, the neighborhood of x′ tends to contain more and more points of A′ that share the same label as x, and fewer and fewer points from the original neighborhood in A. With respect to the points of A′, the mislabeled point x′ is spatially an outlier, since its coordinates relate to A and not A′; thus, the presence of x′ forces the local subspace around it to become more high-dimensional in order to accommodate (or compress) it. This distortion results in a dimensionality expansion in the vicinity of x′ that would be expected to be reflected in LID estimates based at x′. Stopping the learning process earlier allows x′ to find its neighborhood in A before the local subspace is corrupted by too many neighbors from A′, which thus leads to better learning of the true data distribution and improved generalization to test data.\nThis explanation of the effect of incorrect labeling in terms of local subspaces is consistent with the one recently given in (Ma et al., 2018) for the effect of adversarial perturbation on DNN classification. In this situation, rather than directly assigning an incorrect label to the test item while leaving its spatial coordinates unchanged, the adversary must instead attempt to move a test point into a region associated with an incorrect class by means of an antagonistic learning process. In both cases, regardless of how the test point is modified, the neighborhoods of the transformed points are affected in a similar manner: as the neighborhood membership evolves, the local intrinsic dimensionality can be expected to rise. The associated changes in LID estimates have been used as the basis for the effective detection of a wide variety of adversarial attacks (Ma et al., 2018). Recent theoretical work for adversarial perturbation in nearest-neighbor classification further supports the relationship between LID and local transformation of data, by showing that the magnitude of the perturbation required in order to subvert the classification diminishes as the local intrinsic dimensionality and data sample size grow (Amsaleg et al., 2017)."
  }, {
    "heading": "4. Dimensionality-Driven Learning Strategy",
    "text": "In the previous section, we observed that learning in the presence of noisy labels has two stages: dimensional compression, followed by dimensional expansion. Motivated by these observations, we propose a Dimensionality-Driven Learning (D2L) strategy whose objective is to avoid the overfitting and loss of test accuracy associated with dimensional expansion.\nGiven a training sample x, we denote its raw label as y and its predicted label as ŷ, where both y and ŷ are ‘onehot’ indicator vectors. (L̂ID0, · · · , L̂IDi, · · · , L̂IDT ) is a sequence of LID scores, where L̂IDi represents the LID score computed from the second-to-last DNN layer at the\ni-th training epoch (T epochs in total). Each LID score is produced as follows. m batches of samples are randomly selected X1B , . . . , X m B and for each X i B and each of its members x, L̂ID(x,XiB) is computed. This givesm×|XiB | LID estimates, which are then averaged to compute the LID score for the epoch (later, in the experiments, we use m = 10 and |XiB | = 128\nTo avoid dimensionality expansion during training with noisy labels, we propose to reduce the effect of noisy labels on learning the true data distribution using the following adaptive LID-corrected labels:\ny∗ = αiy + (1− αi)ŷ, (6)\nwhere αi is a LID-based factor that updates at the i-th training epoch:\nαi = exp ( − λ L̂IDi\nmini−1j=0 L̂IDj\n) , (7)\nwhere λ = i/T is a weighting that indicates decreasing confidence in the raw labels when the training proceeds to the dimensionality expansion stage (that is, when LID begins to increase). The training loss can then be refined as:\nL = − 1 N N∑ n=1 ∑ y∗n y∗n logP (y ∗ n|xn), (8)\nwhere N is the total number of training samples and P (y∗n|xn) is the predicted class probability of y∗n given xn.\nInterpreting Equations (6) - (8), we can regard D2L as a simulated annealing algorithm that attempts to find an optimal trade-off between subspace dimensionality and prediction performance. The role of α is an exponential decay factor that allows for interpolation between raw and predicted label assignments according to the degree of dimensional expansion observed over the learning history. Here, dimensional expansion is assessed in terms of the ratio of two average LID scores: the score observed at the current epoch, and the lowest score encountered at earlier epochs. As the learning enters the dimensional expansion stage, this ratio exceeds 1, and the exponential decay factor begins to favor the current predicted label. The complete D2L learning strategy is shown in Algorithm 1. Note that the computational cost of LID estimation through batch sampling is low compared to the overall training time (tLID/ttraining ≈ 1− 2%), as it requires only the pairwise distances within a few batches.\nTo identify the turning point between the two stages of learning, we employ an epoch window of size w ∈ [1, T − 1] so as to allow w epochs of initialization for the network, and to reduce the variation of stochastic optimization. The turning point is flagged when the LID score of the current epoch is two standard deviations higher than the mean LID score of\nAlgorithm 1 Dimensionality-Driven Learning (D2L) Input: dataset X , network h(x), total epochs T , epoch window w, number of batches for LID estimation m. Initialize: epoch i ← 0, lids ← [], α0 ← 1, turning epoch u← −1. repeat\nTrain h(x) for one epoch. lid ← 0, λ← i/T . for j = 1 to m do\nSample XB from X. lid ← lid + 1|XB | ∑|XB | k=1 L̂ID(x,XB).\nend for lids[i ]← lid/m. if i ≥ w and u = −1 and lid −mean(lids[i− w : i− 1]) > 2 · std(lids[i− w : i− 1]) then u← i− 1. # turning point found Rollback h(x) to the u-th epoch. end if if u > −1 then αi = exp ( −λ · lids[i]/min(lids[0 : i− 1]) ) . else αi = α0 end if y∗ = αiy + (1− αi)ŷ. Update loss to L = − 1N ∑N n=1 ∑ y∗n y∗n logP (y ∗ n|xn).\ni← i+ 1. until i = T or early stopping.\nthe w preceding epochs, until which the D2L loss is equivalent to the cross-entropy loss (enforced by setting α equal to 1). The epoch at which the turning point is identified can be regarded as the first epoch at which overfitting occurs; for this reason, we roll the model state back to that of the previous epoch, and begin the interpolation between the raw and predicted label assignments. Although we find in the experimental results of Section 5 that this strategy works consistently well for a variety of datasets, further variations upon this basic strategy may also be effective. The D2L code is available at https://github.com/xingjunm/ dimensionality-driven-learning."
  }, {
    "heading": "5. Experiments",
    "text": "We evaluate our proposed D2L learning strategy, comparing the performance of our model with state-of-the-art baselines for noisy label learning."
  }, {
    "heading": "5.1. Empirical Understanding of D2L",
    "text": "We first provide an empirical understanding of the proposed D2L learning strategy on subspace learning, hypothesis learning, representation learning and model analysis.\nExperimental Setup: The experiments were conducted on the benchmark dataset CIFAR-10 (Krizhevsky & Hinton, 2009). We used a 12-layer CNN architecture. All networks were trained using SGD with momentum 0.9, weight decay 10−4 and an initial learning rate of 0.1. The learning rate was divided by 10 after epochs 40 and 80 (T = 120 epochs in total). Simple data augmentations (width/height shift and horizontal flip) were applied. Noisy labels were generated by introducing symmetric noise, in which the labels of a given proportion of training samples are flipped to one of the other class label, selected with equal probability. In (Vahdat, 2017) this noisy label generation scheme has been verified to be more challenging than that of restricted (asymmetric) label noise, which assumes that mislabelling only occurs within a specific set of classes (Reed et al., 2014; Patrini et al., 2017).\nCompeting Strategies: 1) Backward (Patrini et al., 2017): training via loss correction by multiplying the cross-entropy loss by a noise-aware correction matrix; 2) Forward (Patrini et al., 2017): training with label correction by multiplying the network prediction by a noise-aware correction matrix; 3) Boot-hard (Reed et al., 2014): training with new labels generated by a convex combination (the “hard” version) of the noisy labels and their predicted labels; 4) Boot-soft (Reed et al., 2014): training with new labels generated by a convex combination (the “soft” version) of the noisy labels and their predictions; and 5) Cross-entropy: the conventional approach of training with cross-entropy loss.\nThe parameters of the competitors were configured according to their original papers. For our proposed D2L, we set k = 20 for LID estimation, and used the average LID score over m = 10 random batches of training samples as the\noverall dimensionality of the representation subspaces.\nEffect on Subspace Learning: We illustrate the effect of D2L on subspace learning by investigating the dimensionality (measured by LID) of the deep representation subspaces learned by DNNs and the test accuracy throughout training. The results are presented in Figure 2 for the CIFAR-10 dataset, with noisy label proportions set to 40% and to 60%. First, examining the test accuracy (the left-hand plots), we see that D2L can stabilize the test accuracy after around 60 epochs regardless of the noise rate, whereas the competitors experience a substantial decrease in test accuracy. This indicates the effectiveness of D2L in limiting the overfitting to noisy labels. Second, we focus on the dimensionality of the representation subspaces learned by different models (the right-hand plots). We observe that D2L is capable of learning representation subspaces which have significantly lower dimensionality than other models. It can also be noted that lower-dimensional subspaces lead to better generalization and higher test accuracy. This supports our claim that the true data distribution is of low dimensionality, and that D2L is capable of learning the low-dimensional true data distribution even with a large proportion of noisy labels. Note that for the case of 60% label noise, the low test accuracy of the ‘backward’ model, as well as the low dimensionality of the learned subspaces, together show that this competitor suffered from underfitting.\nEffect on Hypothesis Learning: We investigate the complexity of the hypotheses learned from different models. Given a hypothesis space H, a learned hypothesis h ∈ H from a DNN with lower complexity is expected to generalize better. Here, we use the recently proposed Critical Sample Ratio (CSR) (Arpit et al., 2017) as the measure for hypothesis complexity. CSR measures the density around the decision boundaries, where a high CSR score indicates a complex decision boundary and hypothesis.\nAs shown in Figure 3, the complexity of the learned hypothesis from D2L is significantly lower than that of its competitors. Recalling the results from Figure 2, where D2L achieved the highest test accuracy, we conclude that a simpler hypothesis does lead to better generalization, and that D2L is capable here of learning smoother decision\nboundaries and a simpler hypothesis than its competitors.\nEffect on Representation Learning: To analyze the effectiveness of D2L for representation learning, we visualize dataset representations in 2-dimensional embeddings using t-SNE (Maaten & Hinton, 2008), a commonly-used dimensionality reduction technique for the visualization of high-dimensional data (LeCun et al., 2015). Figure 4 presents the reduced 2D embeddings of 500 randomly selected samples from each of two classes on CIFAR-10. For each class, 40% of the samples were assigned correct labels (the ‘clean’ samples), and 60% were assigned incorrect labels chosen uniformly at random from the 9 other classes (the ‘noisy’ samples). We see that D2L (the right-hand plot) can learn high-quality representations that accurately separate the two classes of objects (blue vs red), and can effectively isolate noisy samples (magenta/cyan) from clean samples (blue/red). However, for both classes, representations learned by cross-entropy (the left-hand plot) suffer from significant overlapping between clean and noisy samples. Note that the representations of noisy samples learned by D2L are more fragmented, since the noisy labels are from many different classes. Overall, D2L is able to learn a high-quality representation from noisy datasets.\nParameter Sensitivity: We assess the sensitivity of D2L to the neighborhood size k and the number of batches m used to compute the mean LID. Figure 5 shows that D2L is relatively insensitive to these two hyper-parameters on the CIFAR-10 dataset. We observed similar behavior with the other three datasets."
  }, {
    "heading": "5.2. Robustness against Noisy Labels",
    "text": "Finally, we evaluate the robustness of D2L against noisy labels under varying noise rates (0%, 20%, 40%, and 60%) on several benchmark datasets, comparing to state-of-the-art baselines for noisy label learning.\nExperimental Setup: Experiments were conducted on several benchmark datasets: MNIST (LeCun et al., 1998), SVHN (Netzer et al., 2011), CIFAR-10 (Krizhevsky & Hinton, 2009) and CIFAR-100 (Krizhevsky & Hinton, 2009). We used a LeNet-5 network (LeCun et al., 1998) for MNIST, a 6-layer CNN for SVHN, a 12-layer CNN for CIFAR-10 and a ResNet-44 network (He et al., 2016) for CIFAR-100. All networks were trained using SGD with momentum 0.9, weight decay 10−4 and an initial learning rate of 0.1. The learning rate is divided by 10 after epochs 20 and 40 for MNIST/SVHN (50 epochs in total), after epochs 40 and 80 for CIFAR-10 (120 epochs in total), and after epochs 80, 120 and 160 for CIFAR-100 (200 epochs in total) (Huang et al., 2016). Simple data augmentations (width/height shift and horizontal flip) were applied on CIFAR-10 and CIFAR100. Noisy labels were generated as described in Section 5.1. On a particular dataset, the compared methods differ only in their loss functions — they share the same CNN architecture, regularizations (batch normalization and max pooling), and the number of training epochs. We repeated the experiments 5 times with different random seeds for network initialization and label noise generation.\nResults: We report the mean test accuracy and standard deviation over 5 repetitions of the experiments in Table 1. D2L outperforms its competitors consistently across all datasets and across all noise rates tested. In particular, the performance gap between D2L and its competitors increases\nas the noise rate is increased from 20% to 60%. We also note that as the noise rate increases, the accuracy drop of D2L is the smallest among all models. Even with 60% label noise, D2L can still obtain a relatively high classification accuracy, which indicates that D2L may have the potential to be an effective strategy for semi-supervised learning."
  }, {
    "heading": "6. Discussion and Conclusion",
    "text": "In this paper, we have investigated the generalization behavior of DNNs for noisy labels in terms of the intrinsic dimensionality of local subspaces. We observed that dimensional compression occurs early in the learning process, followed by dimensional expansion as the process begins to overfit. Employing a simple measure of local intrinsic dimensionality (LID), we proposed a Dimensionality-Driven Learning (D2L) strategy for avoiding overfitting that identifies the learning epoch at which the transition from dimensional compression to dimensional expansion occurs, and then suppresses the subsequent dimensionality expansion. D2L delivers very strong classification performance across a range of scenarios with high proportions of noisy labels.\nWe believe that dimensionality-based analysis opens up new directions for understanding and enhancing the behavior of DNNs. Theoretical formulation of DNN subspace dimensionality, and investigation of the effects of data augmentation and regularization techniques such as batch normalization (Ioffe & Szegedy, 2015) and dropout (Srivastava et al., 2014) are possible directions for future research. Another open issue is the investigation of how other forms of noise such as adversarial or corrupted inputs and asymmetric label noise can affect local subspace dimensionality and DNN learning behavior."
  }, {
    "heading": "Acknowledgements",
    "text": "James Bailey is in part supported by the Australian Research Council via grant number DP170102472. Michael E. Houle is partially supported by JSPS Kakenhi Kiban (B) Research Grants 15H02753 and 18H03296. Shu-Tao Xia is partially supported by the National Natural Science Foundation of China under grant No. 61771273."
  }],
  "year": 2018,
  "references": [{
    "title": "Estimating local intrinsic dimensionality",
    "authors": ["Amsaleg", "Laurent", "Chelly", "Oussama", "Furon", "Teddy", "Girard", "Stéphane", "Houle", "Michael E", "Kawarabayashi", "Ken-ichi", "Nett", "Michael"],
    "venue": "In SIGKDD,",
    "year": 2015
  }, {
    "title": "The vulnerability of learning to adversarial perturbation increases with intrinsic dimensionality",
    "authors": ["Amsaleg", "Laurent", "Bailey", "James", "Barbe", "Dominique", "Erfani", "Sarah M", "Houle", "Michael E", "Nguyen", "Xuan Vinh", "Radovanović", "Miloš"],
    "venue": "WIFS,",
    "year": 2017
  }, {
    "title": "A closer look at memorization in deep networks",
    "authors": ["Arpit", "Devansh", "Jastrzebski", "Stanisaw", "Ballas", "Nicolas", "Krueger", "David", "Bengio", "Emmanuel", "Kanwal", "Maxinder S", "Maharaj", "Tegan", "Fischer", "Asja", "Courville", "Aaron", "Yoshua", "Lacoste-Julien", "Simon"],
    "year": 2017
  }, {
    "title": "Regularization and semi-supervised learning on large graphs",
    "authors": ["Belkin", "Mikhail", "Matveeva", "Irina", "Niyogi", "Partha"],
    "venue": "In COLT,",
    "year": 2004
  }, {
    "title": "Manifold regularization: A geometric framework for learning from labeled and unlabeled examples",
    "authors": ["Belkin", "Mikhail", "Niyogi", "Partha", "Sindhwani", "Vikas"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2006
  }, {
    "title": "An introduction to statistical modeling of extreme values, volume 208",
    "authors": ["Coles", "Stuart", "Bawa", "Joanna", "Trenner", "Lesley", "Dorazio", "Pat"],
    "year": 2001
  }, {
    "title": "Robust loss functions under label noise for deep neural networks",
    "authors": ["Ghosh", "Aritra", "Kumar", "Himanshu", "Sastry", "PS"],
    "venue": "In AAAI,",
    "year": 2017
  }, {
    "title": "Deep sparse rectifier neural networks",
    "authors": ["Glorot", "Xavier", "Bordes", "Antoine", "Bengio", "Yoshua"],
    "venue": "In AISTATS,",
    "year": 2011
  }, {
    "title": "Training deep neural-networks using a noise adaptation layer",
    "authors": ["Goldberger", "Jacob", "Ben-Reuven", "Ehud"],
    "venue": "In ICLR,",
    "year": 2017
  }, {
    "title": "Deep residual learning for image recognition",
    "authors": ["He", "Kaiming", "Zhang", "Xiangyu", "Ren", "Shaoqing", "Sun", "Jian"],
    "year": 2016
  }, {
    "title": "A simple general approach to inference about the tail of a distribution",
    "authors": ["Hill", "Bruce M"],
    "venue": "The Annals of Statistics,",
    "year": 1975
  }, {
    "title": "Dimensionality, discriminability, density & distance distributions",
    "authors": ["Houle", "Michael E"],
    "venue": "In ICDMW, pp",
    "year": 2013
  }, {
    "title": "Local intrinsic dimensionality I: an extreme-value-theoretic foundation for similarity applications",
    "authors": ["Houle", "Michael E"],
    "venue": "In SISAP,",
    "year": 2017
  }, {
    "title": "Local intrinsic dimensionality II: multivariate analysis and distributional support",
    "authors": ["Houle", "Michael E"],
    "venue": "SISAP,",
    "year": 2017
  }, {
    "title": "Generalized expansion dimension",
    "authors": ["Houle", "Michael E", "Kashima", "Hisashi", "Nett", "Michael"],
    "venue": "In ICDMW,",
    "year": 2012
  }, {
    "title": "Deep networks with stochastic depth",
    "authors": ["Huang", "Gao", "Sun", "Yu", "Liu", "Zhuang", "Sedra", "Daniel", "Weinberger", "Kilian Q"],
    "venue": "In ECCV,",
    "year": 2016
  }, {
    "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
    "authors": ["Ioffe", "Sergey", "Szegedy", "Christian"],
    "venue": "In ICML,",
    "year": 2015
  }, {
    "title": "Mentornet: Regularizing very deep neural networks on corrupted labels",
    "authors": ["Jiang", "Lu", "Zhou", "Zhengyuan", "Leung", "Thomas", "Li", "Li-Jia", "Fei-Fei"],
    "venue": "arXiv preprint arXiv:1712.05055,",
    "year": 2017
  }, {
    "title": "Finding nearest neighbors in growth-restricted metrics",
    "authors": ["Karger", "David R", "Ruhl", "Matthias"],
    "venue": "In STOC,",
    "year": 2002
  }, {
    "title": "Learning multiple layers of features from tiny images",
    "authors": ["Krizhevsky", "Alex", "Hinton", "Geoffrey"],
    "venue": "Technical report, University of Toronto,",
    "year": 2009
  }, {
    "title": "Deep nets don’t learn via memorization",
    "authors": ["Krueger", "David", "Ballas", "Nicolas", "Jastrzebski", "Stanislaw", "Arpit", "Devansh", "Kanwal", "Maxinder S", "Maharaj", "Tegan", "Bengio", "Emmanuel", "Fischer", "Asja", "Courville", "Aaron"],
    "venue": "In ICLR,",
    "year": 2017
  }, {
    "title": "Design of robust neural network classifiers",
    "authors": ["Larsen", "Jan", "L. Nonboe", "Hintz-Madsen", "Mads", "Hansen", "Lars Kai"],
    "venue": "In ICASSP,",
    "year": 1998
  }, {
    "title": "Gradient-based learning applied to document recognition",
    "authors": ["LeCun", "Yann", "Bottou", "Léon", "Bengio", "Yoshua", "Haffner", "Patrick"],
    "venue": "Proceedings of the IEEE,",
    "year": 1998
  }, {
    "title": "Maximum likelihood estimation of intrinsic dimension",
    "authors": ["Levina", "Elizaveta", "Bickel", "Peter J"],
    "venue": "In NIPS,",
    "year": 2005
  }, {
    "title": "Learning from noisy labels with distillation",
    "authors": ["Li", "Yuncheng", "Yang", "Jianchao", "Song", "Yale", "Cao", "Liangliang", "Luo", "Jiebo", "Jia"],
    "year": 2017
  }, {
    "title": "Characterizing adversarial subspaces using local intrinsic dimensionality",
    "authors": ["X. Ma", "B. Li", "Y. Wang", "S. Erfani", "Wijewickrema", "G.S. Schoenebeck", "Houle", "D.M.E. Song", "J. Bailey"],
    "venue": "In ICLR,",
    "year": 2018
  }, {
    "title": "Visualizing data using t-SNE",
    "authors": ["Maaten", "Laurens van der", "Hinton", "Geoffrey"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2008
  }, {
    "title": "Learning with noisy labels",
    "authors": ["Natarajan", "Nagarajan", "Dhillon", "Inderjit S", "Ravikumar", "Pradeep K", "Tewari", "Ambuj"],
    "venue": "In NIPS,",
    "year": 2013
  }, {
    "title": "Reading digits in natural images with unsupervised feature learning",
    "authors": ["Netzer", "Yuval", "Wang", "Tao", "Coates", "Adam", "Bissacco", "Alessandro", "Wu", "Bo", "Ng", "Andrew Y"],
    "venue": "NIPSW,",
    "year": 2011
  }, {
    "title": "In search of the real inductive bias: On the role of implicit regularization in deep learning",
    "authors": ["Neyshabur", "Behnam", "Tomioka", "Ryota", "Srebro", "Nathan"],
    "venue": "arXiv preprint arXiv:1412.6614,",
    "year": 2014
  }, {
    "title": "Making neural networks robust to label noise: a loss correction approach",
    "authors": ["Patrini", "Giorgio", "Rozza", "Alessandro", "Menon", "Aditya", "Nock", "Richard", "Qu", "Lizhen"],
    "year": 2017
  }, {
    "title": "Training deep neural networks on noisy labels with bootstrapping",
    "authors": ["Reed", "Scott", "Lee", "Honglak", "Anguelov", "Dragomir", "Szegedy", "Christian", "Erhan", "Dumitru", "Rabinovich", "Andrew"],
    "venue": "arXiv preprint arXiv:1412.6596,",
    "year": 2014
  }, {
    "title": "Nonlinear dimensionality reduction by locally linear embedding",
    "authors": ["Roweis", "Sam T", "Saul", "Lawrence K"],
    "year": 2000
  }, {
    "title": "On the information bottleneck theory of deep learning",
    "authors": ["Saxe", "Andrew M", "Bansal", "Yamini", "Dapello", "Joel", "Advani", "Madhu", "Kolchinsky", "Artemy", "Tracey", "Brendan D", "Cox", "David D"],
    "venue": "In ICLR,",
    "year": 2018
  }, {
    "title": "Opening the black box of deep neural networks via information",
    "authors": ["Shwartz-Ziv", "Ravid", "Tishby", "Naftali"],
    "venue": "arXiv preprint arXiv:1703.00810,",
    "year": 2017
  }, {
    "title": "Mastering the game of go with deep neural networks and tree",
    "authors": ["Dominik", "Nham", "John", "Kalchbrenner", "Nal", "Sutskever", "Ilya", "Lillicrap", "Timothy", "Leach", "Madeleine", "Kavukcuoglu", "Koray", "Graepel", "Thore", "Hassabis", "Demis"],
    "venue": "search. Nature,",
    "year": 2016
  }, {
    "title": "Dropout: a simple way to prevent neural networks from overfitting",
    "authors": ["Srivastava", "Nitish", "Hinton", "Geoffrey E", "Krizhevsky", "Alex", "Sutskever", "Ilya", "Salakhutdinov", "Ruslan"],
    "venue": "Journal of Machine Learning Research,",
    "year": 1929
  }, {
    "title": "Learning from noisy labels with deep neural networks",
    "authors": ["Sukhbaatar", "Sainbayar", "Fergus", "Rob"],
    "venue": "arXiv preprint arXiv:1406.2080,",
    "year": 2014
  }, {
    "title": "Training convolutional networks with noisy labels",
    "authors": ["Sukhbaatar", "Sainbayar", "Bruna", "Joan", "Paluri", "Manohar", "Bourdev", "Lubomir", "Fergus", "Rob"],
    "venue": "arXiv preprint arXiv:1406.2080,",
    "year": 2014
  }, {
    "title": "Toward robustness against label noise in training deep discriminative neural networks",
    "authors": ["Vahdat", "Arash"],
    "venue": "In NIPS,",
    "year": 2017
  }, {
    "title": "Learning from noisy large-scale datasets with minimal supervision",
    "authors": ["Veit", "Andreas", "Alldrin", "Neil", "Chechik", "Gal", "Krasin", "Ivan", "Gupta", "Abhinav", "Belongie", "Serge"],
    "year": 2017
  }, {
    "title": "Iterative learning with open-set noisy labels",
    "authors": ["Wang", "Yisen", "Liu", "Weiyang", "Ma", "Xingjun", "Bailey", "James", "Zha", "Hongyuan", "Song", "Le", "Xia", "Shu-Tao"],
    "year": 2018
  }, {
    "title": "Learning from massive noisy labeled data for image classification",
    "authors": ["Xiao", "Tong", "Xia", "Tian", "Yang", "Yi", "Huang", "Chang", "Wang", "Xiaogang"],
    "venue": "In CVPR,",
    "year": 2015
  }, {
    "title": "Understanding deep learning requires rethinking generalization",
    "authors": ["Zhang", "Chiyuan", "Bengio", "Samy", "Hardt", "Moritz", "Recht", "Benjamin", "Vinyals", "Oriol"],
    "venue": "In ICLR,",
    "year": 2017
  }],
  "id": "SP:69fe934ac8c5a03f16220ea3549e00e7fa7016c7",
  "authors": [{
    "name": "Xingjun Ma",
    "affiliations": []
  }, {
    "name": "Yisen Wang",
    "affiliations": []
  }, {
    "name": "Michael E. Houle",
    "affiliations": []
  }, {
    "name": "Shuo Zhou",
    "affiliations": []
  }, {
    "name": "Sarah M. Erfani",
    "affiliations": []
  }, {
    "name": "Shu-Tao Xia",
    "affiliations": []
  }, {
    "name": "Sudanthi Wijewickrema",
    "affiliations": []
  }, {
    "name": "James Bailey",
    "affiliations": []
  }],
  "abstractText": "Datasets with significant proportions of noisy (incorrect) class labels present challenges for training accurate Deep Neural Networks (DNNs). We propose a new perspective for understanding DNN generalization for such datasets, by investigating the dimensionality of the deep representation subspace of training samples. We show that from a dimensionality perspective, DNNs exhibit quite distinctive learning styles when trained with clean labels versus when trained with a proportion of noisy labels. Based on this finding, we develop a new dimensionality-driven learning strategy, which monitors the dimensionality of subspaces during training and adapts the loss function accordingly. We empirically demonstrate that our approach is highly tolerant to significant proportions of noisy labels, and can effectively learn low-dimensional local subspaces that capture the data distribution.",
  "title": "Dimensionality-Driven Learning with Noisy Labels"
}