{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 462–468 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n462"
  }, {
    "heading": "1 Introduction",
    "text": "Neural network mappings are widely used to bridge modalities or spaces in cross-modal retrieval (Qiao et al., 2017; Wang et al., 2016; Zhang et al., 2016), zero-shot learning (Lazaridou et al., 2015b, 2014; Socher et al., 2013) in building multimodal representations (Collell et al., 2017) or in word translation (Lazaridou et al., 2015a), to name a few. Typically, a neural network is firstly trained\nto predict the distributed vectors of one modality (or space) from the other. At test time, some operation such as retrieval or labeling is performed based on the nearest neighbors of the predicted (mapped) vectors. For instance, in zero-shot image classification, image features are mapped to the text space and the label of the nearest neighbor word is assigned. Thus, the success of such systems relies entirely on the ability of the map to make the predicted vectors similar to the target vectors in terms of semantic or neighborhood structure.1 However, whether neural nets achieve this goal in general has not been investigated yet. In fact, recent work evidences that considerable information about the input modality propagates into the predicted modality (Collell et al., 2017; Lazaridou et al., 2015b; Frome et al., 2013).\nTo shed light on these questions, we first introduce the (to the best of our knowledge) first existing measure to quantify similarity between the neighborhood structures of two sets of vectors. Second, we perform extensive experiments in three benchmarks where we learn image-to-text and text-to-image neural net mappings using a rich variety of state-of-the-art text and image features and loss functions. Our results reveal that, contrary to expectation, the semantic structure of the mapped vectors consistently resembles more that of the input vectors than that of the target vectors of interest. In a second experiment, by using six concept similarity tasks we show that the semantic structure of the input vectors is preserved after mapping them with an untrained network, further evidencing that feed-forward nets naturally preserve semantic information about the input. Overall, we uncover and rise awareness of a largely\n1We indistinctly use the terms semantic structure, neighborhood structure and similarity structure. They refer to all pairwise similarities of a set of N vectors, for some similarity measure (e.g., Euclidean or cosine).\nignored phenomenon relevant to a wide range of cross-modal / cross-space applications such as retrieval, zero-shot learning or image annotation.\nUltimately, this paper aims at: (1) Encouraging the development of better architectures to bridge modalities / spaces; (2) Advocating for the use of semantic-based criteria to evaluate the quality of predicted vectors such as the neighborhood-based measure proposed here, instead of purely geometric measures such as mean squared error (MSE)."
  }, {
    "heading": "2 Related Work and Motivation",
    "text": "Neural network and linear mappings are popular tools to bridge modalities in cross-modal retrieval systems. Lazaridou et al. (2015b) leverage a text-to-image linear mapping to retrieve images given text queries. Weston et al. (2011) map label and image features into a shared space with a linear mapping to perform image annotation. Alternatively, Frome et al. (2013), Lazaridou et al. (2014) and Socher et al. (2013) perform zero-shot image classification with an image-to-text neural network mapping. Instead of mapping to latent features, Collell et al. (2018) use a 2-layer feedforward network to map word embeddings directly to image pixels in order to visualize spatial arrangements of objects. Neural networks are also popular in other cross-space applications such as cross-lingual tasks. Lazaridou et al. (2015a) learn a linear map from language A to language B and then translate new words by returning the nearest neighbor of the mapped vector in the B space.\nIn the context of zero-shot learning, shortcomings of cross-space neural mappings have also been identified. For instance, “hubness” (Radovanović et al., 2010) and “pollu-\ntion” (Lazaridou et al., 2015a) relate to the highdimensionality of the feature spaces and to overfitting respectively. Crucially, we do not assume that our cross-modal problem has any class labels, and we study the similarity between input and mapped vectors and between output and mapped vectors.\nRecent work evidences that the predicted vectors of cross-modal neural net mappings are still largely informative about the input vectors. Lazaridou et al. (2015b) qualitatively observe that abstract textual concepts are grounded with the visual input modality. Counterintuitively, Collell et al. (2017) find that the vectors “imagined” from a language-to-vision neural map, outperform the original visual vectors in concept similarity tasks. The paper argued that the reconstructed visual vectors become grounded with language because the map preserves topological properties of the input. Here, we go one step further and show that the mapped vectors often resemble the input vectors more than the target vectors in semantic terms, which goes against the goal of a cross-modal map.\nWell-known theoretical work shows that networks with as few as one hidden layer are able to approximate any function (Hornik et al., 1989). However, this result does not reveal much neither about test performance nor about the semantic structure of the mapped vectors. Instead, the phenomenon described is more closely tied to other properties of neural networks. In particular, continuity guarantees that topological properties of the input, such as connectedness, are preserved (Armstrong, 2013). Furthermore, continuity in a topology induced by a metric also ensures that points that are close together are mapped close together. As a toy example, Fig. 1 illustrates the distortion of a manifold after being mapped by a neural net.2\nIn a noiseless world with fully statistically dependent modalities, the vectors of one modality could be perfectly predicted from those of the other. However, in real-world problems this is unrealistic given the noise of the features and the fact that modalities encode complementary information (Collell and Moens, 2016). Such unpredictability combined with continuity and topology-preserving properties of neural nets propel the phenomenon identified, namely mapped vectors resembling more the input than the target vectors, in nearest neighbors terms.\n2Parameters of these mappings were generated at random."
  }, {
    "heading": "3 Proposed Approach",
    "text": "To bridge modalities X and Y , we consider two popular cross-modal mappings f : X → Y .\n(i) Linear mapping (lin):\nf(x) =W0x+ b0\nwith W0 ∈ Rdy×dx , b0 ∈ Rdy , where dx and dy are the input and output dimensions respectively.\n(ii) Feed-forward neural network (nn):\nf(x) =W1σ(W0x+ b0) + b1\nwith W1 ∈ Rdy×dh , W0 ∈ Rdh×dx , b0 ∈ Rdh , b1 ∈ Rdy where dh is the number of hidden units and σ() the non-linearity (e.g., tanh or sigmoid). Although single hidden layer networks are already universal approximators (Hornik et al., 1989), we explored whether deeper nets with 3 and 5 hidden layers could improve the fit (see Supplement).\nLoss: Our primary choice is the MSE: 1 2‖f(x) − y‖\n2, where y is the target vector. We also tested other losses such as the cosine: 1 − cos(f(x), y) and the max-margin: max{0, γ + ‖f(x) − y‖ − ‖f(x̃) − y‖}, where x̃ belongs to a different class than (x, y), and γ is the margin. As in Lazaridou et al. (2015a) and Weston et al. (2011), we choose the first x̃ that violates the constraint. Notice that losses that do not require class labels such as MSE are suitable for a wider, more general set of tasks than discriminative losses (e.g., cross-entropy). In fact, cross-modal retrieval tasks often do not exhibit any class labels. Additionally, our research question concerns the cross-space mapping problem in isolation (independently of class labels).\nLet us denote a set of N input and output vectors by X ∈ RN×dx and Y ∈ RN×dy respectively. Each input vector xi is paired to the output vector yi of the same index (i = 1, · · · , N ). Let us henceforth denote the mapped input vectors by f(X) ∈ RN×dy . In order to explore the similarity between f(X) and X , and between f(X) and Y , we propose two ad hoc settings below."
  }, {
    "heading": "3.1 Neighborhood Structure of Mapped Vectors (Experiment 1)",
    "text": "To measure the similarity between the neighborhood structure of two sets of paired vectors V and\nZ, we propose the mean nearest neighbor overlap measure (mNNOK(V,Z)). We define the nearest neighbor overlap NNOK(vi, zi) as the number of K nearest neighbors that two paired vectors vi, zi share in their respective spaces. E.g., if the 3 (= K) nearest neighbors of vcat in V are {vdog, vtiger, vlion} and those of zcat in Z are {zmouse, ztiger, zlion}, the NNO3(vcat, zcat) is 2.\nDefinition 1 Let V = {vi}Ni=1 and Z = {zi}Ni=1 be two sets of N paired vectors. We define:\nmNNOK(V,Z) = 1\nKN N∑ i=1 NNOK(vi, zi) (1)\nwith NNOK(vi, zi) = |NNK(vi) ∩ NNK(zi)|, where NNK(vi) and NNK(zi) are the indexes of the K nearest neighbors of vi and zi, respectively.\nThe normalizing constant K simply scales mNNOK(V,Z) between 0 and 1, making it independent of the choice of K. Thus, a mNNOK(V,Z) = 0.7 means that the vectors in V and Z share, on average, 70% of their nearest neighbors. Notice that mNNO implicitly performs retrieval for some similarity measure (e.g., Euclidean or cosine), and quantifies how semantically similar two sets of paired vectors are."
  }, {
    "heading": "3.2 Mapping with Untrained Networks (Experiment 2)",
    "text": "To complement the setting above (Sect. 3.1), it is instructive to consider the limit case of an untrained network. Concept similarity tasks provide a suitable setting to study the semantic structure of distributed representations (Pennington et al., 2014). That is, semantically similar concepts should ideally be close together. In particular, our interest is in comparing X with its projection f(X) through a mapping with random parameters, to understand the extent to which the mapping may disrupt or preserve the semantic structure of X ."
  }, {
    "heading": "4 Experimental Setup",
    "text": ""
  }, {
    "heading": "4.1 Experiment 1",
    "text": ""
  }, {
    "heading": "4.1.1 Datasets",
    "text": "To test the generality of our claims, we select a rich diversity of cross-modal tasks involving texts at three levels: word level (ImageNet), sentence level (IAPR TC-12), and document level (Wiki). ImageNet (Russakovsky et al., 2015). Consists of ∼14M images, covering ∼22K WordNet synsets\n(or meanings). Following Collell et al. (2017), we take the most relevant word for each synset and keep only synsets with more than 50 images. This yields 9,251 different words (or instances). IAPR TC-12 (Grubinger et al., 2006). Contains 20K images (18K train / 2K test) annotated with 255 labels. Each image is accompanied with a short description of one to three sentences. Wikipedia (Pereira et al., 2014). Has 2,866 samples (2,173 train / 693 test). Each sample is a section of a Wikipedia article paired with one image."
  }, {
    "heading": "4.1.2 Hyperparameters and Implementation",
    "text": "See the Supplement (Sect. 1) for details."
  }, {
    "heading": "4.1.3 Image and Text Features",
    "text": "To ensure that results are independent of the choice of image and text features, we use 5 (2 image + 3 text) features of varied dimensionality (64- d, 128-d, 300-d, 2,048-d) and two directions, textto-image (T → I) and image-to-text (I → T ). We make our extracted features publicly available.3 Text. In ImageNet we use 300-dimensional GloVe4 (Pennington et al., 2014) and 300-d word2vec (Mikolov et al., 2013) word embeddings. In IAPR TC-12 and Wiki, we employ stateof-the-art bidirectional gated recurrent unit (biGRU) features (Cho et al., 2014) that we learn with a classification task (see Sect. 2 of Supplement). Image. For ImageNet, we use the publicly available5 VGG-128 (Chatfield et al., 2014) and ResNet (He et al., 2015) visual features from Collell et al. (2017), where we obtained 128- dimensional VGG-128 and 2,048-d ResNet features from the last layer (before the softmax) of the forward pass of each image. The final representation for a word is the average feature vector (centroid) of all available images for this word. In IAPR TC-12 and Wiki, features for individual images are obtained similarly from the last layer of a ResNet and a VGG-128 model."
  }, {
    "heading": "4.2 Experiment 2",
    "text": ""
  }, {
    "heading": "4.2.1 Datasets",
    "text": "We include six benchmarks, comprising three types of concept similarity: (i) Semantic similarity: SemSim (Silberer and Lapata, 2014), Simlex999 (Hill et al., 2015) and SimVerb-3500 (Gerz et al., 2016); (ii) Relatedness: MEN (Bruni et al.,\n3http://liir.cs.kuleuven.be/software.html 4http://nlp.stanford.edu/projects/glove 5http://liir.cs.kuleuven.be/software.html\n2014) and WordSim-353 (Finkelstein et al., 2001); (iii) Visual similarity: VisSim (Silberer and Lapata, 2014) which includes the same word pairs as SemSim, rated for visual similarity instead of semantic. All six test sets contain human ratings of similarity for word pairs, e.g., (‘cat’,‘dog’)."
  }, {
    "heading": "4.2.2 Hyperparameters and Implementation",
    "text": "The parameters in W0,W1 are drawn from a random uniform distribution [−1, 1] and b0, b1 are set to zero. We use a tanh activation σ().6 The output dimension dy is set to 2,048 for all embeddings."
  }, {
    "heading": "4.2.3 Image and Text Features",
    "text": "Textual and visual features are the same as described in Sect. 4.1.3 for the ImageNet dataset."
  }, {
    "heading": "4.2.4 Similarity Predictions",
    "text": "We compute the prediction of similarity between two vectors z1, z2 with both the cosine z1z2‖z1‖‖z2‖ and the Euclidean similarity 11+‖z1−z2‖ . 7"
  }, {
    "heading": "4.2.5 Performance Metrics",
    "text": "As is common practice, we evaluate the predictions of similarity of the embeddings (Sect. 4.2.4) against the human similarity ratings with the Spearman correlation ρ. We report the average of 10 sets of randomly generated parameters."
  }, {
    "heading": "5 Results and Discussion",
    "text": "We test statistical significance with a two-sided Wilcoxon rank sum test adjusted with Bonferroni. The null hypothesis is that a compared pair is equal. In Tab. 1, ∗ indicates that mNNO(X, f(X)) differs from mNNO(Y, f(X)) (p < 0.001) on the same mapping, embedding and direction. In Tab. 2, ∗ indicates that performance of mapped and input vectors differs (p < 0.05) in the 10 runs."
  }, {
    "heading": "5.1 Experiment 1",
    "text": "Results below are with cosine neighbors and K = 10. Euclidean neighbors yield similar results and are thus left to the Supplement. Similarly, results in ImageNet with GloVe embeddings are shown below and word2vec results in the Supplement. The choice ofK = {5, 10, 30} had no visible effect on results. Results with 3- and 5-layer nets did not show big differences with the results below (see Supplement). The cosine and max-margin losses\n6We find that sigmoid and ReLu yield similar results. 7Notice that papers generally use only cosine similarity\n(Lazaridou et al., 2015b; Pennington et al., 2014).\nperformed slightly worse than MSE (see Supplement). Although Lazaridou et al. (2015a) and Weston et al. (2011) find that max-margin performs the best in their tasks, we do not find our result entirely surprising given that max-margin focuses on inter-class differences while we look also at intraclass neighbors (in fact, we do not require classes).\nTab. 1 shows our core finding, namely that the semantic structure of f(X) resembles more that of X than that of Y , for both lin and nn maps.\nFig. 2 is particularly revealing. If we would only look at train performance (and allow train MSE to reach 0) then f(X) = Y and clearly train mNNO(f(X), Y ) = 1 while mNNO(f(X), X) can only be smaller than 1. However, the interest is always on test samples, and (near-)perfect test prediction is unrealistic. Notice in fact in Fig. 2 that even if we look at train fit, MSE needs to be close to 0 for mNNO(f(X), Y ) to be\nreasonably large. In all the combinations from Tab. 1, the test mNNO(f(X), Y ) never surpasses test mNNO(f(X), X) for any number of epochs, even with an oracle (not shown)."
  }, {
    "heading": "5.2 Experiment 2",
    "text": "Tab. 2 shows that untrained linear (flin) and neural net (fnn) mappings preserve the semantic structure of the input X , complementing thus the findings of Experiment 1. Experiment 1 concerns learning, while, by “ablating” the learning part and randomizing weights, Experiment 2 is revealing about the natural tendency of neural nets to preserve semantic information about the input, regardless of the choice of the target vectors and loss function."
  }, {
    "heading": "6 Conclusions",
    "text": "Overall, we uncovered a phenomenon neglected so far, namely that neural net cross-modal mappings can produce mapped vectors more akin to the input vectors than the target vectors, in terms of semantic structure. Such finding has been possible thanks to the proposed measure that explicitly quantifies similarity between the neighborhood structure of two sets of vectors. While other measures such as mean squared error can be misleading, our measure provides a more realistic estimate of the semantic similarity between predicted and target vectors. In fact, it is the semantic structure (or pairwise similarities) what ultimately matters in cross-modal applications."
  }, {
    "heading": "Acknowledgments",
    "text": "This work has been supported by the CHIST-ERA EU project MUSTER8 and by the KU Leuven grant RUN/15/005."
  }],
  "year": 2018,
  "references": [{
    "title": "Basic topology",
    "authors": ["Mark Anthony Armstrong."],
    "venue": "Springer Science & Business Media.",
    "year": 2013
  }, {
    "title": "Multimodal distributional semantics",
    "authors": ["Elia Bruni", "Nam-Khanh Tran", "Marco Baroni."],
    "venue": "JAIR 49(147).",
    "year": 2014
  }, {
    "title": "Return of the devil in the details: Delving deep into convolutional nets",
    "authors": ["Ken Chatfield", "Karen Simonyan", "Andrea Vedaldi", "Andrew Zisserman."],
    "venue": "BMVC.",
    "year": 2014
  }, {
    "title": "Learning phrase representations using rnn encoder-decoder for statistical machine translation",
    "authors": ["Kyunghyun Cho", "Bart Van Merriënboer", "Caglar Gulcehre", "Dzmitry Bahdanau", "Fethi Bougares", "Holger Schwenk", "Yoshua Bengio."],
    "venue": "arXiv preprint",
    "year": 2014
  }, {
    "title": "Is an Image Worth More than a Thousand Words? On the Fine-Grain Semantic Differences between Visual and Linguistic Representations",
    "authors": ["Guillem Collell", "Marie-Francine Moens."],
    "venue": "COLING. ACL, pages 2807–2817.",
    "year": 2016
  }, {
    "title": "Acquiring Common Sense Spatial Knowledge through Implicit Spatial Templates",
    "authors": ["Guillem Collell", "Luc Van Gool", "Marie-Francine Moens."],
    "venue": "AAAI. AAAI.",
    "year": 2018
  }, {
    "title": "Imagined Visual Representations as Multimodal Embeddings",
    "authors": ["Guillem Collell", "Teddy Zhang", "Marie-Francine Moens."],
    "venue": "AAAI. AAAI, pages 4378–4384.",
    "year": 2017
  }, {
    "title": "Placing search in context: The concept revisited",
    "authors": ["Lev Finkelstein", "Evgeniy Gabrilovich", "Yossi Matias", "Ehud Rivlin", "Zach Solan", "Gadi Wolfman", "Eytan Ruppin."],
    "venue": "WWW. ACM, pages 406–414.",
    "year": 2001
  }, {
    "title": "Devise: A deep visual-semantic embedding model",
    "authors": ["Andrea Frome", "Greg S Corrado", "Jon Shlens", "Samy Bengio", "Jeff Dean", "Tomas Mikolov"],
    "venue": "In NIPS",
    "year": 2013
  }, {
    "title": "Simverb-3500: A largescale evaluation set of verb similarity",
    "authors": ["Daniela Gerz", "Ivan Vulić", "Felix Hill", "Roi Reichart", "Anna Korhonen."],
    "venue": "arXiv preprint arXiv:1608.00869 .",
    "year": 2016
  }, {
    "title": "The iapr tc-12 benchmark: A new evaluation resource for visual information systems",
    "authors": ["Michael Grubinger", "Paul Clough", "Henning Müller", "Thomas Deselaers."],
    "venue": "International workshop ontoImage. volume 5, page 10.",
    "year": 2006
  }, {
    "title": "Deep residual learning for image recognition",
    "authors": ["Kaiming He", "Xiangyu Zhang", "Shaoqing Ren", "Jian Sun."],
    "venue": "arXiv preprint arXiv:1512.03385 .",
    "year": 2015
  }, {
    "title": "Simlex-999: Evaluating semantic models with (genuine) similarity estimation",
    "authors": ["Felix Hill", "Roi Reichart", "Anna Korhonen."],
    "venue": "Computational Linguistics 41(4):665–695.",
    "year": 2015
  }, {
    "title": "Multilayer feedforward networks are universal approximators",
    "authors": ["Kurt Hornik", "Maxwell Stinchcombe", "Halbert White."],
    "venue": "Neural networks 2(5):359–366.",
    "year": 1989
  }, {
    "title": "Is this a wampimuk? cross-modal mapping between distributional semantics and the visual world",
    "authors": ["Angeliki Lazaridou", "Elia Bruni", "Marco Baroni."],
    "venue": "ACL. pages 1403–1414.",
    "year": 2014
  }, {
    "title": "Hubness and pollution: Delving into cross-space mapping for zero-shot learning",
    "authors": ["Angeliki Lazaridou", "Georgiana Dinu", "Marco Baroni."],
    "venue": "ACL. volume 1, pages 270–280.",
    "year": 2015
  }, {
    "title": "Combining language and vision with a multimodal skip-gram model",
    "authors": ["Angeliki Lazaridou", "Nghia The Pham", "Marco Baroni."],
    "venue": "arXiv preprint arXiv:1501.02598 .",
    "year": 2015
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Gregory S. Corrado", "Jeffrey Dean."],
    "venue": "NIPS. pages 3111–3119.",
    "year": 2013
  }, {
    "title": "Glove: Global vectors for word representation",
    "authors": ["Jeffrey Pennington", "Richard Socher", "Christopher D Manning."],
    "venue": "EMNLP. volume 14, pages 1532– 1543.",
    "year": 2014
  }, {
    "title": "On the role of correlation and abstraction in cross-modal multimedia retrieval",
    "authors": ["Jose Costa Pereira", "Emanuele Coviello", "Gabriel Doyle", "Nikhil Rasiwasia", "Gert RG Lanckriet", "Roger Levy", "Nuno Vasconcelos."],
    "venue": "TPAMI 36(3):521–535.",
    "year": 2014
  }, {
    "title": "Visually aligned word embeddings for improving zero-shot learning",
    "authors": ["Ruizhi Qiao", "Lingqiao Liu", "Chunhua Shen", "Anton van den Hengel."],
    "venue": "arXiv preprint arXiv:1707.05427 .",
    "year": 2017
  }, {
    "title": "On the existence of obstinate results in vector space models",
    "authors": ["Milos Radovanović", "Alexandros Nanopoulos", "Mirjana Ivanović."],
    "venue": "SIGIR. ACM, pages 186–193.",
    "year": 2010
  }, {
    "title": "Imagenet large scale visual recognition challenge",
    "authors": ["Olga Russakovsky", "Jia Deng", "Hao Su", "Jonathan Krause", "Sanjeev Satheesh", "Sean Ma", "Zhiheng Huang", "Andrej Karpathy", "Aditya Khosla", "Michael Bernstein"],
    "year": 2015
  }, {
    "title": "Learning grounded meaning representations with autoencoders",
    "authors": ["Carina Silberer", "Mirella Lapata."],
    "venue": "ACL. pages 721–732.",
    "year": 2014
  }, {
    "title": "Zero-shot learning through cross-modal transfer",
    "authors": ["Richard Socher", "Milind Ganjoo", "Christopher D Manning", "Andrew Ng."],
    "venue": "NIPS. pages 935– 943.",
    "year": 2013
  }, {
    "title": "A comprehensive survey on cross-modal retrieval",
    "authors": ["Kaiye Wang", "Qiyue Yin", "Wei Wang", "Shu Wu", "Liang Wang."],
    "venue": "arXiv preprint arXiv:1607.06215 .",
    "year": 2016
  }, {
    "title": "Wsabie: Scaling up to large vocabulary image annotation",
    "authors": ["Jason Weston", "Samy Bengio", "Nicolas Usunier."],
    "venue": "IJCAI. volume 11, pages 2764–2770.",
    "year": 2011
  }, {
    "title": "Fast zero-shot image tagging",
    "authors": ["Yang Zhang", "Boqing Gong", "Mubarak Shah."],
    "venue": "CVPR. IEEE, pages 5985–5994.",
    "year": 2016
  }],
  "id": "SP:ffb93ae527799e3616fbae43ca30d8a9ff4deb54",
  "authors": [{
    "name": "Guillem Collell",
    "affiliations": []
  }],
  "abstractText": "Feed-forward networks are widely used in cross-modal applications to bridge modalities by mapping distributed vectors of one modality to the other, or to a shared space. The predicted vectors are then used to perform e.g., retrieval or labeling. Thus, the success of the whole system relies on the ability of the mapping to make the neighborhood structure (i.e., the pairwise similarities) of the predicted vectors akin to that of the target vectors. However, whether this is achieved has not been investigated yet. Here, we propose a new similarity measure and two ad hoc experiments to shed light on this issue. In three cross-modal benchmarks we learn a large number of language-to-vision and visionto-language neural network mappings (up to five layers) using a rich diversity of image and text features and loss functions. Our results reveal that, surprisingly, the neighborhood structure of the predicted vectors consistently resembles more that of the input vectors than that of the target vectors. In a second experiment, we further show that untrained nets do not significantly disrupt the neighborhood (i.e., semantic) structure of the input vectors.",
  "title": "Do Neural Network Cross-Modal Mappings Really Bridge Modalities?"
}