{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Learning the representations that respect the pairwise relationships is one of the most important problems in machine learning and pattern recognition with vast applications. To this end, deep metric learning methods (Hadsell et al., 2006; Weinberger et al., 2006; Schroff et al., 2015; Song et al., 2016; Sohn, 2016; Song et al., 2017; Bell & Bala, 2015; Sener et al., 2016) aim to learn an embedding representation space such that similar data are close to each other\n1Department of Computer Science and Engineering, Seoul National University, Seoul, Korea. Correspondence to: Hyun Oh Song <hyunoh@snu.ac.kr>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nand vice versa for dissimilar data. Some of these methods have shown significant advances in various applications in retrieval (Sohn, 2016; Schroff et al., 2015), clustering (Song et al., 2017), domain adaptation (Sener et al., 2016), video understanding (Wang & Gupta, 2015), etc.\nDespite recent advances in deep metric learning methods, deploying the learned embedding representation in large scale applications poses great challenges in terms of the inference efficiency and scalability. To address this, practitioners in large scale retrieval and recommendation systems often resort to a separate post-processing step where the learned embedding representation is run through quantization pipelines such as sketches, hashing, and vector quantization in order to significantly reduce the number of data to compare during the inference while trading off the accuracy.\nIn this regard, we propose a novel end-to-end learning method for quantizable representations jointly optimizing for the quality of the network embedding representation and the performance of the corresponding binary hash code. In contrast to some of the recent methods (Cao et al., 2016; Liu & Lu, 2017), our proposed method avoids ever having to cluster the entire dataset, offers the modularity to accommodate any existing deep embedding learning techniques (Schroff et al., 2015; Sohn, 2016), and is efficiently trained in a mini-batch stochastic gradient descent setting. We show that the discrete optimization problem of finding the optimal binary hash codes given the embedding representations can be computed efficiently and exactly by solving an equivalent minimum cost flow problem. The proposed method alternates between finding the optimal hash codes of the given embedding representations in the mini-batch and adjusting the embedding representations indexed at the activated hash code dimensions via deep metric learning methods.\nOur end-to-end learning method outperforms state-of-theart deep metric learning approaches (Schroff et al., 2015; Sohn, 2016) in retrieval and clustering tasks on the Cifar-100 (Krizhevsky et al., 2009) and the ImageNet (Russakovsky et al., 2015) datasets while providing up to several orders of magnitude speedup during inference. Our method utilizes efficient off-the-shelf implementations from OR-Tools (Google optimization tools for combinatorial optimization problems) (OR-tools, 2018), the deep metric learning library implementation in Tensorflow (Abadi et al., 2015),\nand is efficient to train. The state of the art deep metric learning approaches (Schroff et al., 2015; Sohn, 2016) use the class labels during training (for the hard negative mining procedure) and since our method utilizes the approaches as a component, we focus on the settings where the class labels are available during training."
  }, {
    "heading": "2. Related works",
    "text": "Learning the embedding representation via neural networks dates back to over two decades ago. Starting with Siamese networks (Bromley et al., 1994; Hadsell et al., 2006), the task is to learn embedding representation of the data using neural networks so that similar examples are close to each other and dissimilar examples are farther apart in the embedding space. Despite the recent successes and near human performance reported in retrieval and verification tasks (Schroff et al., 2015), most of the related literature on learning efficient representation via deep learning focus on learning the binary hamming codes for finding nearest neighbors with linear search over entire dataset per each query. Directly optimizing for the embedding representations in deep networks for quantization codes and constructing the hash tables for significant search reduction in the number of data is much less studied.\n(Xia et al., 2014) first precompute the hash code based on the labels and trains the embedding to be similar to the hash code. (Zhao et al., 2015) apply element-wise sigmoid on the embedding and minimizes the triplet loss. (Norouzi et al., 2012) optimize the upper bound on the triplet loss defined on hamming code vectors. (Liong et al., 2015) minimize the difference between the original and the signed version of the embedding with orthogonality regularizers in a network. (Li et al., 2017) employ discrete cyclic coordinate descent (Shen et al., 2015) on a discrete sub-problem optimizing one hash bit at a time but the algorithm has neither the convergence guarantees nor the bound on the number of iterations. All of these methods focus on learning the binary codes for hamming distance ranking and perform an exhaustive linear search over the entire dataset which is not likely to be suitable for large scale problems.\n(Cao et al., 2016) minimize the difference between the similarity label and the cosine distance of network embedding. (Liu & Lu, 2017) define a distance between a quantized data and continuous embedding, and back-propagates the metric loss error only with respect to the continuous embedding. Both of these methods require repeatedly running k-means clustering on the entire dataset while training the network at the same time. This is unlikely to be practical for large scale problems because of the prohibitive computational complexity and having to store the cluster centroids for all classes in the memory as the number of classes becomes extremely large (Prabhu & Varma, 2014; Choromanska et al., 2013).\nIn this paper, we propose an efficient end-to-end learning method for quantizable representations jointly optimizing the quality of the embedding representation and the performance of the corresponding hash codes in a scalable mini-batch stochastic gradient descent setting in a deep network and demonstrate state of the art search accuracy and quantitative search efficiency on multiple datasets."
  }, {
    "heading": "3. Problem formulation",
    "text": "Consider a hash function r(x) that maps an input data x ∈ X onto a d dimensional binary compound hash code h ∈ {0, 1}d with the constraint that k out of d total bits needs to be set. We parameterize the mapping as\nr(x) = argmin h∈{0,1}d\n−f(x;θ)ᵀh\nsubject to ||h||1 = k, (1)\nwhere f(·,θ) : X → Rd is a transformation (i.e. neural network) differentiable with respect to the parameter θ and takes the input x and emits the d dimensional embedding vector. Given the hash function r(·), we define a hash table H which is composed of d buckets with each bucket indexed by a compound hash code h. Then, given a query xq , union of all the items in the buckets indexed by k active bits in r(xq) is retrieved as the candidates of the approximate nearest items of xq . Finally, this is followed by a reranking operation where the retrieved items are ranked according to the distances computed using the original embedding representation f(·;θ).\nNote, in quantization based hashing (Wang et al., 2016; Cao et al., 2016), a set of prototypes or cluster centroids are first computed via dictionary learning or other clustering (i.e. k-means) algorithms. Then, the function f(x;θ) is represented by the indices of k-nearest prototypes or centroids. Concretely, if we replace f(x;θ) in Equation (1) with the negative distances of the input item x with respect to all d prototypes or centroids, [−||x− c1||2, . . . ,−||x− cd||2]ᵀ, then the corresponding hash function r(x) can be used to build the hash table.\nIn contrast to most of the recent methods that learn a hamming ranking in a neural network and perform exhaustive linear search over the entire dataset (Xia et al., 2014; Zhao et al., 2015; Norouzi et al., 2012; Li et al., 2017), quantization based methods, have guaranteed search inference speed up by only considering a subset of k out d buckets and thus avoid exhaustive linear search. We explicitly maintain the sparsity constraint on the hash code in Equation (1) throughout our optimization without continuous relaxations to inherit the efficiency aspect of quantization based hashing and this is one of the key attributes of the algorithm.\nAlthough quantization based hashing is known to show high search accuracy and search efficiency (Wang et al., 2016),\nrunning the quantization procedure on the entire dataset to compute the cluster centroids is computationally very costly and requires storing all of the cluster centroids in the memory. Our desiderata are to formulate an efficient end-to-end learning method for quantizable representations which (1) guarantees the search efficiency by avoiding linear search over the entire data, (2) can be efficiently trained in a minibatch stochastic gradient descent setting and avoid having to quantize the entire dataset or having to store the cluster centroids for all classes in the memory, and (3) offers the modularity to accommodate existing embedding representation learning methods which are known to show the state of the art performance on retrieval and clustering tasks."
  }, {
    "heading": "4. Methods",
    "text": "We formalize our proposed method in Section 4.1 and discuss the subproblems in Section 4.2 and in Section 4.4."
  }, {
    "heading": "4.1. End-to-end learning for quantizable representations",
    "text": "Finding the optimal set of embedding representations and the corresponding hash codes is a chicken and egg problem. Embedding representations are required to infer which k activation dimensions to set in the corresponding binary hash code, but the binary hash codes are needed to adjust the embedding representations indexed at the activated bits so that similar items get hashed to the same buckets and vice versa. We formalize this notion in Equation (2) below.\nminimize θ\nh1,...,hn `metric({f(xi;θ)}ni=1;h1, . . . ,hn)︸ ︷︷ ︸ embedding representation quality +\nγ  n∑ i −f(xi;θ)ᵀhi + n∑ i ∑ j:yj 6=yi hᵀiPhj  ︸ ︷︷ ︸\nhash code performance\nsubject to hi ∈ {0, 1}d, ||hi||1 = k, ∀i, (2)\nwhere the matrix P encodes the pairwise cost for the hash code similarity between each negative pair and γ is the trade-off hyperparameter balancing the loss contribution between the embedding representation quality given the hash codes and the performance of the hash code with respect to the embedding representations. We solve this optimization problem via alternating minimization through iterating over solving for k-sparse binary hash codes h1, . . . ,hn and updating the parameters of the deep network θ for the continuous embedding representations per each mini-batch. Following subsections discuss these two steps in detail."
  }, {
    "heading": "4.2. Learning the compound hash code",
    "text": "Given a set of continuous embedding representations {f(xi;θ)}ni=1, we seek to solve the following subproblem in Equation (3) where the task is to (unary) select k as large elements of the each embedding vector as possible, while (pairwise) selecting as orthogonal elements as pos-\nsible across different classes. The unary term mimics the hash function r(x) in Equation (1) and the pairwise term has the added benefit that it also provides robustness to the optimization especially during the early stages of the training when the embedding representation is not very accurate.\nminimize h1,...,hn n∑ i −f(xi;θ)ᵀhi + n∑ i ∑ j:yj 6=yi\nhᵀiPhj︸ ︷︷ ︸ := g(h1,...,n;θ)\nsubject to hi ∈ {0, 1}d, ||hi||1 = k, ∀i, (3)\nHowever, solving for the optimal solution of the problem in Equation (3) is NP-hard in general even for the simple case where k = 1 and d > 2 (Boykov et al., 2001). Thus, we construct a upper bound function ḡ(h1,...,n;θ) to the objective function g(h1,...,n;θ) which we argue that it can be exactly optimized by establishing the connection to a network flow algorithm. The upper bound function is a slightly reparameterized discrete objective where we optimize the hash codes over the average embedding vectors per each class instead. We first rewrite1 the objective function by indexing over each class and then over each data per class and derive the upper bound function as shown below.\ng(h1,...,n;θ) = nc∑ i ∑ k:yk=i −f(xk;θ)ᵀhk + nc∑ i ∑ k:yk=i, l:yl 6=i hᵀkPhl\n≤ nc∑ i ∑ k:yk=i −cᵀihk + nc∑ i ∑ k:yk=i, l:yl 6=i hᵀkPhl\n+ maximize h1,...,hn\nhi∈{0,1}d,||hi||1=k\nnc∑ i=1 ∑ k:yk=i (ci − f(xk;θ))ᵀhk\n︸ ︷︷ ︸ :=M(θ)\n= ḡ(h1,...,n;θ) (4)\nwhere nc denotes the number of classes in the mini-batch, m = |{k : yk = i}|, and ci = 1m ∑ k:yk=i\nf(xk;θ). Here, w.l.o.g we assume each class has m number of data in the mini-batch (i.e. Npairs (Sohn, 2016) mini-batch construction). The last term in upper bound, denoted as M(θ), is constant with respect to the hash codes and is non-negative. Note, from the bound in Equation (4), the gap between the minimum value of g and the minimum value of ḡ is bounded above by M(θ). Furthermore, since this value corresponds to the maximum deviation of an embedding vector from its class mean of the embedding, the bound gap decreases over iterations as we update the network parameter θ to attract similar pairs of data and vice versa for dissimilar pairs in the other embedding subproblem (more details in Section 4.4).\nMoreover, minimizing the upper bound over each hash codes {hi}ni=1 is equivalent to minimizing a reparameter-\n1We also omit the dependence of the index i for each hk and hl to avoid the notation clutter.\nization ĝ(z1,...,nc ;θ) over {zi} nc i=1 defined below because for a given class label i, each hk shares the same ci vector.\nminimize h1,...,hn\nhi∈{0,1}d,||hi||1=k\nnc∑ i ∑ k:yk=i −cᵀihk + nc∑ i ∑ k:yk=i, l:yl 6=i hᵀkPhl\n= minimize z1,...,znc\nzi∈{0,1}d,||zi||1=k\nm  nc∑ i −cᵀi zi + nc∑ i ∑ j 6=i zᵀiP ′zj  ︸ ︷︷ ︸\n:= ĝ(z1,...,nc ;θ)\n,\nwhere P ′ = mP . Therefore, we formulate the following optimization problem below whose objective upper bounds the original objective in Equation (3) over all feasible hash codes {hi}ni=1.\nminimize z1,...,znc nc∑ i −cᵀi zi + ∑ i,j 6=i zᵀiPzj\nsubject to zi ∈ {0, 1}d, ||zi||1 = k, ∀i (5)\nIn the upper bound problem above, we consider the case where the pairwise cost matrix P is a diagonal matrix of non-negative values 2. Theorem 1 in the next subsection proves that finding the optimal solution of Equation (5) is equivalent to finding the minimum cost flow solution of the flow network G′ illustrated in Figure 2 which can be solved efficiently and exactly in polynomial time. In practice, we use the efficient implementations from OR-Tools (Google Optimization Tools for combinatorial optimization problems) (OR-tools, 2018) to solve the minimum cost flow problem per each mini-batch."
  }, {
    "heading": "4.3. Equivalence of problem 5 to minimum cost flow",
    "text": "Theorem 1. The optimization problem in Equation (5) can be solved by finding the minimum cost flow solution on the flow network G’.\nProof. Suppose we construct a complete bipartite graph G = (A ∪ B,E) and create a directed graph G′ = (A ∪ B ∪ {s, t}, E′) from G by adding source s and sink t and directing all edges E in G from A to B. We also add edges from s to each vertex ap ∈ A. For each vertex bq ∈ B, we add nc number of edges to t. Edges incident to s have capacity u(s, ap) = k and cost v(s, ap) = 0. The edges between ap ∈ A and bq ∈ B have capacity u(ap, bq) = 1 and cost v(ap, bq) = −cp[q]. Each edge r ∈ {0, . . . , nc − 1} from bq ∈ B to t has capacity u((bq, t)r) = 1 and cost v((bq, t)r) = 2λqr. Figure 2 illustrates the flow network G′. The amount of flow to be sent from s to t is nck.\nThen we define the flow {fz(e)}e∈E′ , indexed both by (1) a given configuration of z1, . . . , znc where each zi ∈\n2Note that we absorb the scaler factor m from the definition of P ′ and redefine P = diag(λ1, . . . , λd).\n{0, 1}d, ||zi||1 = k, ∀i, and by (2) the edges of G′, below:\n(i) fz(s, ap) = k, (ii) fz(ap, bq) = zp[q],\n(iii) fz((bq, t)r) =\n{ 1 for r < ∑nc p=1 zp[q]\n0 otherwise (6)\nWe first show the flow fz defined above is feasible for G′. The capacity constraints are satisfied by construction in Equation (6), so we only need to check the flow conservation conditions. First, the amount of input flow at s is nck and the output flow from s is ∑ ap∈A fz(s, ap) = ∑ ap∈A k = nck which is equal. The amount of input flow to each vertex ap ∈ A is given as k and the output flow is∑\nbq∈B fz(ap, bq) = ∑d q zp[q] = ||zp||1 = k.\nLet us denote the amount of input flow at a vertex bq ∈ B as yq = ∑nc p zp[q]. The output\nflow from the vertex bq is ∑nc−1\nr=0 fz((bq, t)r) =∑yq−1 r=0 fz((bq, t)r) + ∑nc−1 r=yq\nfz((bq, t)r) = yq from Equation (6) (iii). The last condition to check is that the amount of input flow at t is equal to the output flow at s.∑\nbq∈B ∑nc−1 r=0 fz((bq, t)r) = ∑d q=1 yq = ∑ q,p zp[q] = nck. This shows the construction of the flow {fz(e)}e∈E′ in Equation (6) is valid in G′.\nNow denote {fo(e)}e∈E′ as the minimum cost flow solution of the flow network G′ which minimizes the total cost ∑ e∈E′ v(e)fo(e). Denote the optimal flow from a vertex ap ∈ A to a vertex bq ∈ B as z′p[q] := fo(ap, bq). By the optimality of the flow {fo(e)}e∈E′ , we have that ∑ e∈E′ v(e)fo(e) ≤ ∑ e∈E′ v(e)fz(e). By\nLemma 1, the lhs of the inequality is equal to∑ p−cᵀpz′p + ∑ p1 6=p2 z ′ᵀ p1Pz ′ p2 . Also, by Lemma 2,\nthe rhs is equal to ∑ p−cᵀpzp + ∑ p1 6=p2 z ᵀ p1Pzp2 . Finally, we have that ∑ p−cᵀpz′p + ∑ p1 6=p2 z ′ᵀ p1Pz ′ p2 ≤∑\np−cᵀpzp + ∑ p1 6=p2 z ᵀ p1Pzp2 ,∀{zp}. Thus, we have proved that finding the minimum cost flow solution on the flow network G′ and translating the flows between each vertices between A and B as {z′p}, we can find the optimal solution to the optimization problem in Equation (5).\nLemma 1. For the minimum cost flow {fo(e)}e∈E′ of the network G′, we have that the total cost is∑\ne∈E′ v(e)fo(e) = ∑ p−cᵀpz′p + ∑ p1 6=p2 z ′ᵀ p1Pz ′ p2 .\nProof. The total minimum cost ∑\ne∈E′ v(e)fo(e) is broken down as\n∑ e∈E′ v(e)fo(e) = ∑ ap∈A\nv(s, ap)fo(s, ap)︸ ︷︷ ︸ flow from s to A +\n∑ ap∈A ∑ bq∈B\nv(ap, bq)fo(ap, bq)︸ ︷︷ ︸ flow from A to B\n+ ∑ bq∈B nc−1∑ r=0\nv((bq, t)r)fo((bq, t)r)︸ ︷︷ ︸ flow from B to t\nDenote the amount of input flow at a vertex bq given the minimum cost flow {fo(e)}e∈E′ as y′q = ∑ p fo(ap, bq) =∑nc\np z ′ p[q]. From the cost definition at the edges between bq and t, v((bq, t)r) = 2λqr, and by the optimality of the minimum cost flow, we have that fo((bq, t)r) = 1 ∀r < y′q and fo((bq, t)r) = 0 ∀r ≥ y′q . Thus, the total cost is∑ e∈E′ v(e)fo(e) = 0 + nc∑ p d∑ q −cp[q]z′p[q] + ∑ bq∈B y′q−1∑ r=0 2λqr\n= ∑ p −cᵀpz′p + ∑ q λqy ′ q(y ′ q − 1)\n= ∑ p −cᵀpz′p + ∑ q λqy ′ q 2 − ∑ p ∑ q λqz ′ p[q]\n= ∑ p −cᵀpz′p + ∑ p z′p ᵀ P ∑ p z′p − ∑ p z′ᵀp Pz ′ p\n= ∑ p −cᵀpz′p + ∑\np1 6=p2\nz′ᵀp1Pz ′ p2 (7)\nLemma 2. For the {fz(e)}e∈E′ defined as Equation (6) of the network G′, we have that the total cost is∑\ne∈E′ v(e)fz(e) = ∑ p−cᵀpzp + ∑ p1 6=p2 z ᵀ p1Pzp2 .\nProof. The proof is similar to Lemma 1 except that we use the definition of the flow {fz(e)}e∈E′ in Equation (6) (iii) to reduce the cost of the flow from B to t to ∑y′q−1 r=0 2λqr.\nTime complexity For λq nc, note that the worst case time complexity of finding the minimum cost flow (MCF) solution in the network G′\nis O ( (nc + d) 2 ncd log (nc + d) ) (Goldberg & Tarjan,\n1990). In practice, however, it has been shown that implementation heuristics such as price updates, price refinement, push-look-ahead, (Goldberg, 1997) and set-relabel (Bünnagel et al., 1998) methods drastically improve the reallife performance. Also, we emphasize again that we solve the minimum cost flow problem only within the mini-batch not on the entire dataset. We benchmarked the wall clock running time of the method at varying sizes of nc and d and observed approximately linear time complexity in nc and d. Figure 1 shows the benchmark wall clock run time results."
  }, {
    "heading": "4.4. Learning the embedding",
    "text": "As the hash codes become more and more sparse, it becomes increasingly likely for hamming distances defined on binary codes (Norouzi et al., 2012; Zhao et al., 2015) to become zero regardless of whether the input pair of data is similar or dissimilar. This phenomenon can be problematic when trained in a deep network because the back-propagation gradient would become zero and thus the embedding representations would not be updated at all. In this regard, we propose a distance function based on gated residual as shown in Equation (8). This parameterization outputs zero distance only if the embedding representations of the two input data are identical at all the hash code activations. Concretely, given a pair of embedding vectors f(xi;θ), f(xj ;θ) and the corresponding binary k-sparse hash codes hi,hj ,\nwe define the following distance function d hashij between the embedding vectors\nd hashij = || (hi ∨ hj) (f(xi;θ)− f(xj ;θ)) ||1, (8)\nwhere ∨ denotes the logical or operation of the two binary hash codes and denotes the element-wise multiplication. Then, using the distance function above, we can define the following subproblems using any existing deep metric learning methods (Weinberger et al., 2006; Schroff et al., 2015; Song et al., 2016; Sohn, 2016; Song et al., 2017). Given a set of binary hash codes {hi}ni=1, we seek to solve the following subproblems where the task is to optimize the embedding representations so that similar pairs of data get hashed to the same buckets and dissimilar pairs of data get hashed to different buckets. In other words, we need similar pairs of data to have similar embedding representations indexed at the activated hash code dimensions and vice versa. In terms of the hash code optimization in Equation (4), updating the network weight has the effect of tightening the bound gap M(θ).\nEquation (9) and Equation (10) show the subproblems defined on the distance function above using Triplet (Schroff et al., 2015) and Npairs (Sohn, 2016) method respectively. We optimize these embedding subproblems by updating the network parameter θ via stochastic gradient descent using the subgradients ∂`metric(θ;h1,...,n)∂θ given the hash codes per each mini-batch.\nminimize θ\n1 |T | ∑\n(i,j,k)∈T [d hashij + α− d hashik ]+︸ ︷︷ ︸ `triplet(θ; h1,...,n)\nsubject to ||f(x;θ)||2 = 1, (9)\nwhere T = {(xi,x+i ,x − i )}i is the set of triplets (Schroff\net al., 2015), and the embedding vectors are normalized onto unit hypersphere ||f(x;θ)||2 = 1, ∀x ∈ X . We also apply the semi-hard negative mining procedure (Schroff et al., 2015) where hard negatives farther than the distance between the anchor and positives are mined within the mini-batch. In practice, since our method can be applied to any deep metric learning methods, we use existing deep metric learning implementations available in tf.contrib.losses.metric learning. Similarly, we could also employ npairs (Sohn, 2016) method,\nminimize θ −1 |P| ∑ (i,j)∈P log exp ( −d hashij ) exp ( −d hashij ) + ∑ k:yk 6=yi exp ( −d hashik ) ︸ ︷︷ ︸\n`npairs(θ; h1,...,n)\n+ λ\nm ∑ i ||f(xi;θ)||22, (10)\nwhere the npairs mini-batch B is constructed with positive pairs (x,x+) which are negative with respect to all\nother pairs. B = {(x1,x+1 ), . . . , (xn,x+n ))} and P denotes the set of all positive pairs within the mini-batch. We use the existing implementation of npairs loss in Tensorflow as well. Note that even though the distance d hashij is defined after masking the embeddings with the union binary vector (hi ∨ hj), it’s important to normalize or regularize the embedding representation before the masking operations for the optimization stability due to the sparse nature of the hash codes.\nAlgorithm 1 Learning algorithm input θembb (pretrained metric learning base model); θd ∈ Rd initialize θf = [θb,θd] 1: for t = 1, . . . , MAXITER do 2: Sample a minibatch {xj} 3: Update the flow networkG′ by recomputing the cost vectors\nfor all classes in the minibatch ci =\n1 m ∑ k:yk=i f(xk;θf )\n4: Compute the hash codes {hi} minimizing Equation (5) via finding the minimum cost flow on G′ 5: Update the network parameter given the hash codes θf ← θf − η(t)∂`metric(θf ; h1,...,nc)/∂θf 6: Update stepsize η(t) ← ADAM rule (Kingma & Ba, 2014) 7: end for\noutput θf (final estimate);"
  }, {
    "heading": "4.5. Query efficiency analysis",
    "text": "In this subsection, we examine the expectation and the variance of the query time speed up over linear search. Recall the properties of the compound hash code defined in Section 3, h ∈ {0, 1}d and ||h||1 = k. Given n such hash codes, we have that Pr(hᵀi hj = 0) = ( d−k k ) / ( d k\n) assuming the hash code uniformly distributes the items throughout different buckets. For a given hash code hq, the number of retrieved data is Nq = ∑ i 6=q 1(h ᵀ i hq 6= 0). Then, the expected number of retrieved data is E[Nq] = (n−1) ( 1− ( d−k k ) / ( d k )) . Thus, in contrast to linear search, the expected speedup factor (SUF) under perfectly uniform distribution of the hash code is\nE[SUF] = ( 1− ( d−k k )( d k ) )−1 (11) In the case where d k, the speedup factor approaches(\nd k2 ) . Similarly, we have that the variance is V [Nq] =\n(n− 1) ( 1− ( d−k k ) / ( d k ))( d−k k ) / ( d k ) ."
  }, {
    "heading": "5. Implementation details",
    "text": "Network architecture In our experiments, we used the NIN (Lin et al., 2013) architecture (denote the parameters as θb) with leaky relu (Xu et al., 2015) with α = 5.5 as activation function and trained Triplet embedding network with semi-hard negative mining (Schroff et al., 2015) and\nNpairs network (Sohn, 2016) from scratch as the base model. We snapshot the network weights (θembb ) of the learned base model. Then we replace the last layer in (θembb ) with a randomly initialized d dimensional fully connected projection layer (θd) and finetune the hash network (denote the parameters as θf = [θb,θd]). Algorithm 1 summarizes the training procedure in detail.\nHash table construction and query We use the learned hash network θf and apply Equation (1) to convert a hash data xi into the hash code h(xi;θf ) and use the base embedding network θembb to convert the data into the embedding representation f(xi;θembb ). Then, the embedding representation is hashed to buckets corresponding to the k set bits in the hash code. We use the similar procedure and convert a query data xq into the hash code h(xq;θf ) and into the embedding representation f(xq;θembb ). Once we retrieve the union of all bucket items indexed at the k set bits in the hash code, we apply a reranking procedure (Wang et al., 2016) based on the euclidean distance in the embedding representation space.\nEvaluation metrics We report our accuracy results using precision@k (Pr@k) and normalized mutual information (NMI) (Manning et al., 2008) metrics. Precision@k is computed based on the reranked ordering (described above) of the retrieved items from the hash table. We evaluate NMI, when the code sparsity is set to k = 1, treating each bucket as individual clusters. In this setting, NMI becomes perfect, if each bucket has perfect class purity (pathologically putting one item per each bucket is prevented by construction since d n). We report the speedup results by comparing the number of retrieved items versus the total number of data (exhaustive linear search) and denote this metric as SUF. As the hash code becomes uniformly distributed, SUF metric approaches the theoretical expected speedup in Equation (11). Figure 3 shows that the measured SUF of our method closely follows the theoretical upper bound in contrast to other methods."
  }, {
    "heading": "6. Experiments",
    "text": "We report our results on Cifar-100 (Krizhevsky et al., 2009) and ImageNet (Russakovsky et al., 2015) datasets and compare the accuracy against several baseline methods. First baseline methods are the state of the art deep metric learning models (Schroff et al., 2015; Sohn, 2016) performing an exhaustive linear search over the whole dataset given a query data. Another baselines are the Binarization transform (Agrawal et al., 2014; Zhai et al., 2017) methods where the dimensions of the hash code corresponding to the top k dimensions of the embedding representation are set. We also perform vector quantization (Wang et al., 2016) on the learned embedding representation from the deep metric learning methods above on the entire dataset and compute the hash code based on the indices of the k nearest centroids.\n‘Triplet’ and ‘Npairs’ denotes the deep metric learning base models performing an exhaust linear search per each query. ‘Th’ denotes the binarization transform baseline, ‘VQ’ denotes the vector quantization baseline."
  }, {
    "heading": "6.1. Cifar-100",
    "text": "Cifar-100 (Krizhevsky et al., 2009) dataset has 100 classes. Each class has 500 images for train and 100 images for test. Given a query image from test, we experiment the search performance both when the hash table is constructed from train and from test. We subtract the per-pixel mean of training images across all the images and augmented the dataset by zero-padding 4 pixels on each side, randomly cropping 32× 32, and applying random horizontal flipping. The batch size is set to 128. The metric learning base model is trained for 175k iterations, and learning rate decays to 0.1 of previous learning rate after 100k iterations. We finetune the base model for 70k iterations and decayed the learning rate to 0.1 of previous learning rate after 40k iterations. Table 1 show results using the triplet network with d=256 and Table 2 show results using the npairs network with d= 64. The results show that our method not only outperforms search accuracies of the state of the art deep metric learning base models but also provides up to 98× speed up over exhaustive search."
  }, {
    "heading": "6.2. ImageNet",
    "text": "ImageNet ILSVRC-2012 (Russakovsky et al., 2015) dataset has 1, 000 classes and comes with train (1, 281, 167 images) and val set (50, 000 images). We use the first nine splits of train set to train our model, the last split of train set for validation, and use validation dataset to test the query performance. We use the images downsampled to 32× 32 from (Chrabaszcz et al., 2017). Preprocessing step is identical with cifar-100 and we used the pixel mean provided in the dataset. The batch size for the metric learning base model is set to 512 and is trained for 450k iterations, and learning rate decays to 0.3 of previous learning rate after each 200k iterations. When we finetune npairs base model for d=512, we set the batch size to 1024 and total iterations to 35k with decaying the learning rate to 0.3 of previous learning rate after each 15k iterations. When we finetune the triplet base model for d=256, we set the batch size to 512 and total iterations to 70k with decaying the learning rate to 0.3 of previous learning rate after each 30k iterations. Our results in Table 3 and Table 4 show that our method outperforms the state of the art deep metric learning base models in search accuracy while providing up to 478× speed up over exhaustive linear search. Table 5 compares the NMI metric and shows that the hash table constructed from our representation yields buckets with significantly better class purity on both datasets and on both methods."
  }, {
    "heading": "7. Conclusion",
    "text": "We have presented a novel end-to-end optimization algorithm for jointly learning a quantizable embedding representation and the sparse binary hash code which then can be used to construct a hash table for efficient inference. We also show an interesting connection between finding the optimal sparse binary hash code and solving a minimum cost flow problem. Our experiments show that the proposed algorithm not only achieves the state of the art search accuracy outperforming the previous state of the art deep metric learning approaches (Schroff et al., 2015; Sohn, 2016) but also provides up to 98× and 478× search speedup on Cifar-100 and ImageNet datasets respectively."
  }, {
    "heading": "Acknowledgements",
    "text": "We would like to thank Zhen Li at Google Research for helpful discussions and anonymous reviewers for their constructive comments. This work was partially supported by Kakao, Kakao Brain and Basic Science Research Program through the National Research Foundation of Korea (NRF) (2017R1E1A1A01077431). Hyun Oh Song is the corresponding author."
  }],
  "year": 2018,
  "references": [{
    "title": "Analyzing the performance of multilayer neural networks for object recognition",
    "authors": ["P. Agrawal", "R. Girshick", "J. Malik"],
    "venue": "In ECCV,",
    "year": 2014
  }, {
    "title": "Learning visual similarity for product design with convolutional neural networks",
    "authors": ["S. Bell", "K. Bala"],
    "venue": "In SIGGRAPH,",
    "year": 2015
  }, {
    "title": "Fast approximate energy minimization via graph cuts",
    "authors": ["Y. Boykov", "O. Veksler", "R. Zabih"],
    "venue": "IEEE Transactions on pattern analysis and machine intelligence,",
    "year": 2001
  }, {
    "title": "Signature verification using a ”siamese” time delay neural network",
    "authors": ["J. Bromley", "I. Guyon", "Y. Lecun", "E. Sackinger", "R. Shah"],
    "venue": "In NIPS,",
    "year": 1994
  }, {
    "title": "Efficient implementation of the goldberg–tarjan minimum-cost flow algorithm",
    "authors": ["U. Bünnagel", "B. Korte", "J. Vygen"],
    "venue": "Optimization Methods and Software,",
    "year": 1998
  }, {
    "title": "Deep quantization network for efficient image retrieval",
    "authors": ["Y. Cao", "M. Long", "J. Wang", "H. Zhu", "Q. Wen"],
    "venue": "In AAAI,",
    "year": 2016
  }, {
    "title": "Extreme multi class classification",
    "authors": ["A. Choromanska", "A. Agarwal", "J. Langford"],
    "venue": "In NIPS,",
    "year": 2013
  }, {
    "title": "A downsampled variant of imagenet as an alternative to the cifar datasets",
    "authors": ["P. Chrabaszcz", "I. Loshchilov", "F. Hutter"],
    "venue": "arXiv preprint arXiv:1707.08819,",
    "year": 2017
  }, {
    "title": "An efficient implementation of a scaling minimum-cost flow algorithm",
    "authors": ["A.V. Goldberg"],
    "venue": "Journal of algorithms,",
    "year": 1997
  }, {
    "title": "Finding minimum-cost circulations by successive approximation",
    "authors": ["A.V. Goldberg", "R.E. Tarjan"],
    "venue": "Mathematics of Operations Research,",
    "year": 1990
  }, {
    "title": "Dimensionality reduction by learning an invariant mapping",
    "authors": ["R. Hadsell", "S. Chopra", "Y. Lecun"],
    "venue": "In CVPR,",
    "year": 2006
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["D.P. Kingma", "J. Ba"],
    "venue": "arXiv preprint arXiv:1412.6980,",
    "year": 2014
  }, {
    "title": "Cifar-100 (canadian institute for advanced research)",
    "authors": ["A. Krizhevsky", "V. Nair", "G. Hinton"],
    "year": 2009
  }, {
    "title": "Deep hashing for compact binary codes learning",
    "authors": ["V.E. Liong", "J. Lu", "G. Wang", "P. Moulin", "J. Zhou"],
    "venue": "In CVPR,",
    "year": 2015
  }, {
    "title": "Learning deep representations with diode loss for quantization-based similarity search",
    "authors": ["S. Liu", "H. Lu"],
    "venue": "In IJCNN,",
    "year": 2017
  }, {
    "title": "Introduction to Information Retrieval",
    "authors": ["C.D. Manning", "P. Raghavan", "H. Schutze"],
    "venue": "Cambridge university press,",
    "year": 2008
  }, {
    "title": "Hamming distance metric learning",
    "authors": ["M. Norouzi", "D.J. Fleet", "R.R. Salakhutdinov"],
    "venue": "In NIPS,",
    "year": 2012
  }, {
    "title": "Fastxml: A fast, accurate and stable tree-classifier for extreme multi-label learning",
    "authors": ["Y. Prabhu", "M. Varma"],
    "venue": "In SIGKDD,",
    "year": 2014
  }, {
    "title": "Facenet: A unified embedding for face recognition and clustering",
    "authors": ["F. Schroff", "D. Kalenichenko", "J. Philbin"],
    "venue": "In CVPR,",
    "year": 2015
  }, {
    "title": "Learning transferrable representations for unsupervised domain adaptation",
    "authors": ["O. Sener", "H.O. Song", "A. Saxena", "S. Savarese"],
    "venue": "In NIPS,",
    "year": 2016
  }, {
    "title": "Supervised discrete hashing",
    "authors": ["F. Shen", "C. Shen", "W. Liu", "H.T. Shen"],
    "venue": "In CVPR,",
    "year": 2015
  }, {
    "title": "Improved deep metric learning with multi-class n-pair loss objective",
    "authors": ["K. Sohn"],
    "venue": "In NIPS,",
    "year": 2016
  }, {
    "title": "Deep metric learning via lifted structured feature embedding",
    "authors": ["H.O. Song", "Y. Xiang", "S. Jegelka", "S. Savarese"],
    "year": 2016
  }, {
    "title": "Deep metric learning via facility location",
    "authors": ["H.O. Song", "S. Jegelka", "V. Rathod", "K. Murphy"],
    "year": 2017
  }, {
    "title": "A survey on learning to hash",
    "authors": ["J. Wang", "T. Zhang", "J. Song", "N. Sebe", "H.T. Shen"],
    "venue": "arXiv preprint arXiv:1606.00185,",
    "year": 2016
  }, {
    "title": "Unsupervised learning of visual representations using videos",
    "authors": ["X. Wang", "A. Gupta"],
    "venue": "In ICCV,",
    "year": 2015
  }, {
    "title": "Distance metric learning for large margin nearest neighbor classification",
    "authors": ["K.Q. Weinberger", "J. Blitzer", "L.K. Saul"],
    "venue": "In NIPS,",
    "year": 2006
  }, {
    "title": "Supervised hashing for image retrieval via image representation learning",
    "authors": ["R. Xia", "Y. Pan", "H. Lai", "C. Liu", "S. Yan"],
    "venue": "In AAAI,",
    "year": 2014
  }, {
    "title": "Empirical evaluation of rectified activations in convolutional network",
    "authors": ["B. Xu", "N. Wang", "T. Chen", "M. Li"],
    "venue": "arXiv preprint arXiv:1505.00853,",
    "year": 2015
  }, {
    "title": "Visual discovery at pinterest",
    "authors": ["A. Zhai", "D. Kislyuk", "Y. Jing", "M. Feng", "E. Tzeng", "J. Donahue", "Y.L. Du", "T. Darrell"],
    "venue": "In Proceedings of the 26th International Conference on World Wide Web Companion,",
    "year": 2017
  }, {
    "title": "Deep semantic ranking based hashing for multi-label image retrieval",
    "authors": ["F. Zhao", "Y. Huang", "L. Wang", "T. Tan"],
    "venue": "In CVPR,",
    "year": 2015
  }],
  "id": "SP:a40a0a99959120a3931ada9cdcd61cf789639718",
  "authors": [{
    "name": "Yeonwoo Jeong",
    "affiliations": []
  }, {
    "name": "Hyun Oh Song",
    "affiliations": []
  }, {
    "name": "Hyun Oh",
    "affiliations": []
  }],
  "abstractText": "Embedding representation learning via neural networks is at the core foundation of modern similarity based search. While much effort has been put in developing algorithms for learning binary hamming code representations for search efficiency, this still requires a linear scan of the entire dataset per each query and trades off the search accuracy through binarization. To this end, we consider the problem of directly learning a quantizable embedding representation and the sparse binary hash code end-to-end which can be used to construct an efficient hash table not only providing significant search reduction in the number of data but also achieving the state of the art search accuracy outperforming previous state of the art deep metric learning methods. We also show that finding the optimal sparse binary hash code in a mini-batch can be computed exactly in polynomial time by solving a minimum cost flow problem. Our results on Cifar-100 and on ImageNet datasets show the state of the art search accuracy in precision@k and NMI metrics while providing up to 98× and 478× search speedup respectively over exhaustive linear search. The source code is available at https://github.com/maestrojeong/Deep-HashTable-ICML18.",
  "title": "Efficient end-to-end learning for quantizable representations"
}