{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Understanding multi-entity interactions is a central question in many real-world applications. For example, in computational sustainability (Gomes, 2009; MacKenzie et al., 2004), it is important to understand the spatial distribution of species and how species interact with each other and their environment, for developing conservation plans. In computer vision, the detections of multiple objects are often\n1Computer Science Department, Cornell University, Ithaca, NY, US 14850. Correspondence to: Di Chen <di@cs.cornell.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\ncorrelated because of the shared background and scenario (Wang et al., 2016). In natural language processing, a text often has several correlated labels in terms of its topic, emotion, and semantic meaning (Nam et al., 2014). The multivariate probit model (MVP) (Ashford & Sowden, 1970) is a popular classic model for studying interactions of multiple entities. Nevertheless, learning the multivariate probit model is challenging because it involves the integration of a multivariate normal distribution over a constrained space.\nA classic approach for optimizing the MVP model is Bayesian Inference (Chib & Greenberg, 1998; Tabet, 2007), where the posterior distribution is simulated by Markov Chain Monte Carlo (MCMC) methods (Jeliazkov & Hee Lee, 2010) and the maximum likelihood estimates are obtained by a Monte Carlo version of the Expectation Maximization (EM) algorithm. These approaches require the simulation of observations from a multivariate truncated normal distribution involving an arbitrary covariance matrix. Although observations from a multivariate truncated normal distribution can be sampled from a sequence of univariate truncated normal distributions (Genz, 1992), the computational effort is rather heavy for high dimensional problems. Extensions of the classic MVP in specific domains have been proposed under specific assumptions of the covariance matrix (see e.g, (Song & Lee, 2005; Young et al., 2009)). Recent approaches for computing the maximum likelihood of MVP have been proposed using the first-order gradients and the second-order information (Chen et al., 2017; Mandt et al., 2017). Those approaches integrate MCMC methods and the numerical estimation of the multivariate probit (Genz, 1992), which is based on an importance sampling using the truncated normal distribution.\nThe accessibility of massive contextual data, as well as the success of deep learning, provide additional opportunities and challenges for boosting MVP. On the one hand, massive contextual data, such as millions of high-resolution images, create the possibility of improving predictive performance, particularly when integrated with deep neural networks, which are remarkably powerful for extracting high-level features from raw data. On the other hand, a scalable learning scheme, which integrates well with parallelized infrastructure such as GPUs, is needed to take advantage of various deep neural networks as well as the massive contextual data. Unfortunately, the classical approaches such as Bayesian\ninference or previous gradient-based methods, inevitably contain sequential inferences, such as MCMC simulations, which is typically not easy to implement on GPUs. A recent approach called Multi-Entity Dependency Learning via Conditional Variational Auto-encoder (MEDL CVAE) (Tang et al., 2017) is compatible with deep neural networks and exploits GPUs, with competitive wall-clock training time, but suffers from two key limitations. On one hand, MEDL CVAE learns the joint likelihood by optimizing the variational lower bound of the joint likelihood but has no guarantee concerning the gap between the lower bound and the true likelihood. A second limitation is that the empirical optimization of the variational lower bound of MEDL CVAE suffers from the KL-vanishment problem, which is a known problem in applications based on variational auto-encoder. As a result, when integrating it with powerful deep neural networks such as Convolutional Neural Networks, the KLterm decreases dramatically to zero, which causes serious overfitting problems that restrict its performance.\nWe propose a novel end-to-end learning scheme for the Deep Multivariate Probit Model (DMVP), which is scalable and flexible with various deep neural networks. Specifically: (1) We introduce the Deep Multivariate Probit Model (DMVP), a deep generalization of classic MVP, in which a flexible deep neural network is embedded to extract the high-level features from the raw data. (2) We propose an efficient parallel sampling process, which transforms the integration over a high-dimensional constrained space into an expectation over the residual multivariate normal distribution with a variance strictly lower than the rejection sampling, tightly integrates with various deep neural networks, and can be implemented end-to-end on GPUs. (3) We provide both a theoretical and an empirical analysis of the convergence behavior of the sampling process embedded in DMVP. We provide theoretical convergence guarantees for DMVP as well as a numerical analysis of the convergence behavior based on a tighter bound, which is much closer to the empirical results. Our theoretical bound also sheds light on the trade-offs between performance and convergence. (4) We apply DMVP to three multi-entity modelling problems. In the first application, we use the crowdsourced eBird dataset combined with the National Land Cover Database for the U.S (NLCD) (Homer et al., 2015) and satellite images to study the interaction among multiple species. In the second application, we study the deforestation and human encroachment in Amazon rainforest with high-resolution satellite images. In the last application, we study the associated concepts of real-world web images using the NUS-WIDE-LITE web image dataset collected from Flickr (Chua et al., July 8-10, 2009). Preview of results: We show that our DMVP (a) trains significantly faster than classic MVP models using the endto-end learning scheme fully implemented on GPUs; (b)\ncaptures correlations among multiple entities in all applications; and (c) outperforms the approaches that assume the independence among entities conditioned on contextual data, classic MVP models, recent gradient-based MVP methods, and the recent variational approach MEDL CVAE."
  }, {
    "heading": "2. Preliminaries",
    "text": ""
  }, {
    "heading": "2.1. Notations",
    "text": "We use φ(x;µ,Σ) and Φ(x;µ,Σ) to denote the density function and the cumulative distribution function of the multivariate normal distribution with mean µ ∈ Rl and covariance Σ ∈ Rl×l, i.e,\nφ(x;µ,Σ) = 1\n(2π)l/2|Σ|1/2 e− 1 2 (x−µ) T Σ−1(x−µ) (1)\nΦ(x;µ,Σ) = ∫ x1 −∞ ... ∫ xl −∞ φ(s;µ,Σ).ds1...dsl (2) where | · | denotes the determinant of a matrix.\nFor the sake of simplicity, we use Φ(x) to denote the CDF of one-dimensional standard normal distribution.\nFor the comparison between vectors, we use ”4” to denote the ”element-wise less or equal to”, i.e,\na 4 b iff ∀i, ai ≤ bi (3)"
  }, {
    "heading": "2.2. Deep Multivariate Probit Model",
    "text": "The multivariate probit model (MVP) is described in terms of a multivariate normal distribution of the underlying latent variables that are manifested as binary responses through a threshold specification. More specifically, given the dataset D = {(xi, yi)|i = 1, ..., N}, where xi ∈ Rm is the m-dimensional contextual data and yi ∈ {0, 1}l is the ldimensional binary label, MVP maps the Bernoulli distribution of each binary label yi,j to a sequence of latent variables ri = (ri,1, ..., ri,l) through the threshold 0, where ri is subject to a multivariate normal distribution, i.e,\nPr(yi,j = 1|xi) = Pr(ri,j > 0) (4) Pr(yi,j = 0|xi) = Pr(ri,j ≤ 0) where ri ∼ N(µ(xi),Σ).\nMore specifically, the marginal likelihood is,\nPr(yi,j = 1|xi) = Φ ( µ(xi)j√\nΣj,j\n)\nPr(yi,j = 0|xi) = Φ ( −µ(xi)j√\nΣj,j\n) ,\nand the joint likelihood is, Pr(yi|xi) = ∫ A1 ... ∫ Al φ(s;µ(xi),Σ)ds1...dsl\nHere Aj = {\n(−∞, 0] if yi,j = 0 [0,+∞) if yi,j = 1\n(5)\nLetDi = diag(2yi−1) ∈ {−1, 0, 1}l×l which is a diagonal matrix using vector 2yi − 1 as its diagonal. Then, we can further reduce formula (5) into the CDF of a multivariate normal distribution, using the affine transformation, i.e.,\nPr(yi|xi) = Φ(0;−µ′i,Σ′i), (6) where µ′i = D iµ(xi) and Σ′i = D iΣDi.\nLearning the classic MVP model involves estimating the coefficient W of the linear function µ(xi) = Wxi and the covariance matrix Σ. Usually, both the coefficient matrixW and the covariance matrix Σ are learnt from data, but in some cases the variance matrix Σ can be computed directly from data. For example, the model in (Mandt et al., 2017) used linear kernel for the covariance matrix, where the covariance matrix is the sum of a linear kernel matrix and a diagonal noise matrix computed from the raw input data.\nTaking advantage of the successful development of deep learning, we introduce the Deep Multivariate Probit Model (DMVP), which is a deep generalization of the classic MVP, where µ(xi) changes from the linear function Wxi to a non-linear function θ(xi), learnt via a deep neural network, and the covariance matrix Σ is always learnt from the data. In this way, the DMVP obtains the flexibility as well as the predictive power of various deep neural networks while modelling the correlations of multiple entities by fitting the correlations of the latent variables."
  }, {
    "heading": "3. End-to-End Learning for DMVP",
    "text": "The generic learning methods of MVP are maximum-aposteriori estimation and maximum likelihood estimation. Because we have introduced the deep neural networks into the DMVP, we train DMVP by maximizing the loglikelihood, which is the most commonly used method for the training of neural networks, i.e.,\nargmax θ,Σ\n∑ i log Pr(yi|xi) = argmax\nθ,Σ\n∑ i log Φ(0;−µ′i,Σ′i).\nThe difficulties with respect to learning the DMVP are mainly due to the computation of equation (6) as well as its gradients, which are obtained by integrating over a high-dimensional constrained space of latent variables. As pointed out by (Magid, 1994), there is no closed form solution for equation (6), and to date can only be estimated via sampling methods."
  }, {
    "heading": "3.1. End-to-End Sampling Process for DMVP",
    "text": "The vanilla rejection sampling estimates Φ(0;−µ′i,Σ′i) by counting the rate that a sample r from N(−µ′i,Σ′i) satisfies r 4 0. However, because the value of Φ(0;−µ′i,Σ′i) could be exponentially small, on average, it could take exponentially many trials to get merely one trial that satisfies\nthe condition. One straightforward solution for this estimation, which has been adopted in (Chen et al., 2017), is to use the MCMC approaches to estimate the distribution over the truncated high-dimensional space. Another importance sampling method proposed by (Genz, 1992) uses Cholesky factorization to compute the equation (6). This method transforms the sampling of a truncated multivariate normal distribution into the sampling of a sequence of univariate truncated normal distributions, where the truncation of each univariate normal distribution depends on the samples of all preceding random variables. Because both the MCMC method and the importance sampling require a sequentially dependent sampling, they cannot easily integrate with parallelized deep learning infrastructure such as GPUs. Therefore, we propose a novel parallel sampling method to address this approximation problem.\nThough there is no closed form for computing the CDF of a general multivariate normal distribution, the onedimensional CDF Φ(x) has very accurate analytical estimation (Cody, 1969), which has been implemented in almost all machine learning tools. Inspired by this fact, we decompose the covariance matrix Σ into V + Σr, where V is a diagonal positive definite matrix and Σr is the residual covariance matrix, so that a random variable r ∼ N(0,Σ) can be decomposed as the subtraction of two random variable z ∼ N(0, V ) and w ∼ N(0,Σr), i.e., r = z − w. Thus, the estimation of Φ(0;−µ,Σ) in equation (6) can be transformed into the expectation of the product of l onedimensional CDF’s, conditioned on the residual multivariate normal distribution w, i.e.,\nΦ(0;−µ,Σ) = Pr(r − µ 4 0) r ∼ N(0,Σ) = Pr(z − w 4 µ) z ∼ N(0, V ), w ∼ N(0,Σr) = Ew∼N(0,Σr)[Pr(z 4 (w + µ)|w)] z ∼ N(0, V )\n= Ew∼N(µ,Σr)\n[ l∏\nj=1\nΦ ( wj√ Vj,j )]\n= Ew∼N(V−1/2µ,V−1/2ΣrV−1/2)\n[ l∏\nj=1\nΦ (wj)\n]\n≈ 1 M M∑ k=1\n( l∏\nj=1\nΦ ( w\n(k) j\n)) . (7)\nKnowing that the role of the parameter V is to rescale the sample wj , without loss of generality, we can assume that V is an identity matrix and directly learn the ”rescaled” residual multivariate normal distribution. That is, in the rest of the paper as well as the Figure (1), we use the identity matrix I to replace V .\nMain idea: The high-level idea of our end-to-end learning scheme for DMVP is based on the transformation shown in equation (7). The intuition behind our transformation is similar to the Rao-Blackwell theorem (Blackwell, 1947), which improves an estimator by computing its expectation, conditioned on a sufficient statistic. In our case, instead of using a sufficient statistic, we use the residual distribution w, which\nfully captures the correlations of the original multivariate distribution. Conceptually, given input features xi and labels yi, DMVP first learns the mean and the covariance of the residual multivariate normal distribution via a deep neural network. Then, DMVP samples batches of independent samples w(k) from the residual multivariate normal distribution and uses equation (7) to compute the estimation of the joint likelihood. This sampling process outperforms previous estimation methods in several aspects. First, the process samples from an explicit distribution, which is significantly more efficient than MCMC-based methods, which need to burn a lot of intermediate samples to reach the implicit distribution. (We show the experimental results in the section 5.) Second, the variance of this sampling process is strictly smaller than the vanilla rejection sampling (See appendix), therefore DMVP requires fewer samples, since every sample from this process provides non-trivial information. Third, this sampling process can be implemented in parallel on GPUs, which is not the case for MCMC.\nFigure (1) depicts the detailed learning framework implemented in DMVP. The feature network, composed of multilayer convolutional networks or fully connected networks, extracts high-level features from the contextual data source to learn the µ for each data point. The choice of the feature network depends on the type of contextual data and the problem, but is flexible enough to be any structure that could be boosted by GPUs. In DMVP, the residual covariance matrix Σr is a global parameter, which is learned from random initialization and shared by all data points. To ensure that Σr is a semi-positive definite matrix, we actually form the residual covariance matrix by the product of one matrix and its transpose, i.e., Σr = Σ 1/2 r (Σ 1/2 r )T . The random variable generator generates batches of the standard normal distributed random variable z(k) in parallel on GPUs. Then, using Σ1/2r , µ, and the diagonal matrix Di corresponding to yi, DMVP computes batches of samples w(k) = Di(µ + Σ1/2r z(k)). According to the affine transformation of the normal distribution, the samples {w(k)} are subject to the multivariate normal distribution N(Diµ,DiΣrDi), which is the desired residual multivariate normal distribution as derived in equation (6) and (7). Because there is no dependency among those samples, all the operations described above could be computed in parallel using tensor operations. Therefore, we can integrate DMVP with various deep neural networks and implement it end-to-end on GPUs using popular machine learning packages (such as Tensorflow or Pytouch)."
  }, {
    "heading": "3.2. Theoretical Analysis of the DMVP’s Convergence Behavior",
    "text": "In terms of the convergence behavior of this sampling process, we provide a theoretical analysis with respect to the estimation error. Since the estimate ∏l j=1 Φ ( w (k) j ) is\nbounded between 0 and 1, Hoeffding’s inequality guarantees exponentially fast convergence in M between the r.h.s of equation (7) and Pr(yi|xi), i.e.,\nPr ∣∣∣∣∣∣ 1M M∑ k=1 n∏ j=1 Φ(w (k) i,j )− Pr(yi|xi) ∣∣∣∣∣∣ ≥ Pr(yi|xi) \n≤ 2e−M 2 Pr2(yi|xi). (8)\nThough equation (8) converges exponentially fast, the value of Pr(yi|xi) could be the magnitude of 2−l. That is, we may need to sampleO(22l) many times to have a reasonable multiplicative error bound. To address this issue, another assertion can be proven for this sampling process using Chebyshev’s inequality:\nTheorem 1 Let µ ∈ Rl and Σ ∈ Rl×l be the rescaled mean and rescaled residual covariance matrix of the random variable w(k) in equation (7), then we have\nPr ∣∣∣∣∣∣ 1M M∑ k=1 l∏ j=1 Φ(wki,j)− Pr(yi|xi) ∣∣∣∣∣∣ ≥ Pr(yi|xi) \n≤ Φ\n( 0; [ −µ −µ ] , [ Σ + I Σ Σ Σ + I ]) /Φ2(0;−µ,Σ + I)− 1 M 2\n(9)\n≤\n( Φ(0;−µ,2Σ+I) Φ(0;−µ,Σ+I) )2 |2Σ + I|1/2 − 1\nM 2 (10) ≤ ∏l i=1 g(µi)\n2|2Σ + I|1/2 − 1 M 2\n(11)\nwhere g(µi) = maxx Φ( √\n2x+µi) Φ(x+µi) . See the Appendix for a more detailed proof.\nThe function g(µi) in the theorem (1) does not have a closed form but it is a monotonous decreasing function, which converges to 1 as µi increases. Figure 2 is the visualization of function g(µi). As can be seen, the function g(µi) is very close to 1 when µi is positive. Though g(µi) increases exponentially with an upper bound √ 2e 3−2 √ 2 2 µ 2 i when µi is a\nvery small negative number, the training method - maximum likelihood estimation - ensures that most µi are positive. In theorem (1), the equation (9) is the upper bound derived by exact analysis of the second moment of the random variable∏l j=1 Φ(w k i,j). Knowing there is no general closed form for the CDF of multivariate normal distribution, we further derive the equation (11) to provide an analytical upper bound.\nThough, in the worst case, the upper bounds could be exponentially large with respect to the dimensionality, this still sheds light on the convergence behavior of our sampling process. For example, if the distribution of entities is independent, then the rescaled residual covariance Σ is a zero matrix. In that case, the variance of our sampling process is zero, so that we only need to sample once to get the exact likelihood. In more general cases, if the rescaled residual covariance Σ is a low-rank matrix, most eigenvalues of the matrix 2Σ + I are 1, which indicates a small |2Σ + I|. According to our experiments, most eigenvalues of the rescaled residual covariance matrix Σ are very close to 0, which supports the empirical convergence behavior of our DMVP. In the experimental section, we provide more detailed analysis in terms of the performance as well as the convergence behavior of DMVP with a low-rank residual covariance matrix, showing that the DMVP’s performance only degrades significantly when the rank of the residual covariance matrix is extremely small.\nSince our learning scheme is based on stochastic gradient descent, we also use the derivatives of equation (7) as the estimation of the true derivatives. The variance analysis of the derivatives of Pr(yi|xi), which has a similar convergence bound as theorem (1), could also be derived using the similar method. Because of space limitations, see the appendix for a more detailed proof."
  }, {
    "heading": "4. Other Related Work",
    "text": "Multi-entity modelling problems are studied extensively under the names of multi-label classification, multi-entity embedding and structured prediction. The simplest approach is to model the distribution of each entity independently, given the contextual data, known as the binary relevance model. This approach is quite popular in multi-label image classification because of its simplicity and flexibility. (We chose it as a baseline for this problem.) However, this could perform\npoorly, particularly when certain labels are rare or some are highly correlated. Therefore, max-margin (Sarawagi & Gupta, 2008), ranking losses (Elisseeff & Weston, 2002) and embedding methods (Rudolph et al., 2016) have been used to address the correlations. Along this line of research, recent approaches (Belanger et al., 2017; Belanger & McCallum, 2016) use SSVM minimizer to optimize energybased structured models. Those approaches mainly focus on the classification problem, in which the correlation among entities is implicit and therefore it is hard to derive the structured probabilistic distribution of entities. Our applications of DMVP, on the other hand, focus more on probabilistic modeling rather than classification. Another classic approach related to MVP is the Conditional Random Field (CRF) (Lafferty et al., 2001), which offers a general framework for structured prediction based on undirected graphical models. Instead of using correlated latent variables, CRF models the correlation among entities directly, where the joint probability of multiple outcomes is proportional to an energy function. However, optimizing CRF models suffers from the computational intractability of the partition function. To remedy this issue, (Xu et al., 2011) applied ensemble methods and (Deng et al., 2014) proposed a special CRF for problems involving specific hierarchical relations. Nevertheless, optimizing CRF models still inevitably depends on gibbs sampling for approximate inference, and has the same problem as the MCMC-based MVP models. A newly proposed ecological model, the Deep Multi-Species Embedding model (DMSE) (Chen et al., 2017), introduces deep neural networks into the classic MVP. Nevertheless, the learning methods of DMSE are also based on sequential inference such as the MCMC simulations, so that they are not easily boosted using GPUs.\nThe mixed-logit model (McFadden & Train, 2000) is another statistical model for analyzing discrete outcomes, whose marginal likelihood is similar to the formula of the transformation step in DMVP. However, the mixed-logit model is a general way to inject random variables into the logistic regression while the transformation in DMVP uses the auxiliary residual covariance to estimate the likelihood. MultiEntity Dependency Learning via Conditional Variational Learning (MEDL CVAE) uses a conditional variational autoencoder to handle correlation between multiple entities, and is also compatible with parallelized deep structures. Despite its limitations, as discussed in the introduction, MEDL CVAE is a state-of-the-art multi-entity modelling method and is also closely related to our DMVP model. Therefore, we chose MEDL CVAE as the representative approach among those competitive multi-entity modelling methods and compare its performance to DMVP, in the experimental section."
  }, {
    "heading": "5. Experiments",
    "text": ""
  }, {
    "heading": "5.1. Datasets and Implementation Details",
    "text": "We evaluate our DMVP1. on three datasets of multi-entity modelling problems.\neBird is a crowd-sourced bird observation dataset collected from the successful citizen science project eBird (Munson et al., 2012). One record in this dataset is referred to as a checklist in which the bird observer records all the species he/she detects as well as the time and the geographical location of the observational site. Crossed with the National Land Cover Dataset for the U.S. (NLCD) (Homer et al., 2015), we obtain a 15-dimensional feature vector for each observational site which describes the landscape composition with respect to 15 different land types such as water, forest, etc. We also collect the satellite images for each observation site by matching the geographical location of the observational site to Google Earth2. Each satellite image covers an area of 12.3km2 near the observation site and has 256×256 pixels. The dataset for this experiment is formed by picking all the observation checklists from the Bird Conservation Region (BCR) 13 (Committee et al., 2000) in the last two weeks of May from 2004 to 2014, which contains 50,949 observations. We choose the top 100 most frequently observed birds as the target species which cover over 95% of the records in our dataset.\nAmazon is the Amazon rainforest landscape satellite image dataset collected for Amazon rainforest landscape analysis,3 in which raw images were derived from Planet’s fullframe analytic scene products using 4-band satellites in sun-synchronous orbit and International Space Station orbit. The organizers used Planet’s visual product processor to transform raw images into 3-band 256x256-pixel jpg format. The Amazon contains a total of 34,431 samples and each sample in this dataset contains a satellite image chip covering an area of 0.9 km2 in Amazon rainforest. The chips were analyzed using the Crowd Flower4 platform to obtain a ground-truth composition of the landscape. There are 17 different labels for each satellite image chip, which represent a reasonable subset of phenomena of interest in the Amazon basin such as atmospheric conditions, common land cover phenomena, and land use phenomena.\nNUS-WIDE-LITE is a light version of the NUS-WIDE datasets collected by the National University of Singapore\n1Code to reproduce the experiments can be found at https://bitbucket.org/DiChen9412/icml2018 dmvp\n2https://www.google.com/earth/. Google Earth has already conducted preprocessing including cloud removing on the satellite images.\n3https://www.kaggle.com/c/planet-understanding-theamazon-from-space.\n4https://www.crowdflower.com/\n(Chua et al., July 8-10, 2009), which contains 55,615 samples and each sample is the low-level features (such as wavelet texture, histogram, correlogram, etc) of the realworld web image associated with tags from Flicker. The 81 tags represent 81 different concepts related to the web images, such as the concepts related to the objects in the image (dog, cat, building, etc) and the concepts of the background (clouds, sunset, etc). For the ease of presentation, we use NUS to denote this dataset.\nWe randomly split the datasets into three parts for training, validation, and testing. The details of the three datasets are listed in table 1."
  }, {
    "heading": "5.2. Performance Analysis of the DMVP on Multi-Entity Modelling Problems",
    "text": "We compare the proposed DMVP with baseline models from three different groups. The first group, which we refer to as conditional independent model (CIM), assumes independence among entities, conditioned on the contextual data. Within this group, we chose different models based on the type of the input features. For example, when the input features are images, we choose to use convolutional neural networks (CNN), while we use the multi-layer fully connected neural network (MLP) for one-dimensional feature inputs. For the sake of fairness, the structure of CIM as well as the feature networks in other baseline models are always the same as the feature network of DMVP. More specifically, for the data resources of low-level features, such as the NLCD features of eBird dataset and the NUS dataset, we use a 4-layer fully connected neural network with hidden units of size 128, 256, 256, l, where the activation function of the first 3 layers is ReLU (Nair & Hinton, 2010) and there is no activation function in the last layer. For the image data resources, we use a CNN similar to the Alexnet (Krizhevsky et al., 2012) with some minor adjustments. The second group is the previously proposed Multivariate Probit Model, which can also model correlations among entities, but uses different inference methods. Within this group, we chose the Deep Multi-Species Embedding (DMSE) model (Chen et al., 2017), a gradient-based MVP model, which uses the numerical computing method proposed by (Genz, 1992) to estimate the likelihood and a MCMC-based method to estimate the gradients. This model represents a wide class of MCMC-based multivariate probit models while further improving the classic MVP by taking advantages of the flexibility of deep neural networks to\nobtain useful feature extractions. Nevertheless, its training process involves MCMC approaches as well as the sequential importance sampling, and therefore cannot be integrated on GPUs. For the last group, we chose the MEDL CVAE(Tang et al., 2017) model, which is a state-of-the-art multi-entity modelling approach proposed recently. This model uses conditional variational auto-encoder to handle correlation between multiple entities, in which it approximates the joint likelihood by its variational lower bound.\nBecause we study multi-entity modelling problems, in our experiments, we use Negative Joint Distribution Loglikelihood (Neg.JLL) as the indicator of a model’s perfor-\nmance: − 1N N∑ i=1 log Pr(yi|xi), where N is the number of samples in the test set. Based on the theorem (1) we obtain 1,000,000 samples from the residual multivariate normal distribution for testing DMVP’s performance, which is sufficient to guarantee the accuracy of the estimation. However, for the training, DMVP empirically converges well with only 100 samples.\nAll the training and testing process of our DMVP and other baseline models, which are compatible with the GPUs, are performed on one NVIDIA Quadro P4000 GPU with 8GB memory. The training and testing process for the DMSE model is performed on Intel(R) Core(TM) i7-7700K CPU@4.20Gz with 8 cores. Since the bottleneck of the DMSE model is on the MCMC sampling, which could not be parallelized trivially, additional cores do not improve the wall-clock time significantly. The whole training process lasts 200 epochs, using the batch size of 128, Adam optimizer (Kingma & Ba, 2014) with learning rate of 10−4 and utilizing batch normalization (Ioffe & Szegedy, 2015), 0.5 dropout rate (Srivastava et al., 2014) and early stopping to accelerate the training process and to prevent overfitting for not only DMVP but all baseline models.\nTable 2 shows the average performance of DMVP as well as other baseline models on the 3 datasets (4 different type of input features) in terms of the negative joint loglikelihood (Neg.JLL) and the wall-clock time of training.5 There are multiple key results in Table 2: (1) By comparing the Neg.JLL of the conditional independent model (CIM) with other models, one can observe significant advantages of modelling the correlations among entities. (2) DMVP trains more than 100 times faster than the MCMC-based DMSE model in terms of the wall-clock time. This huge gap between DMVP and DMSE is due not only to the parallelization but also to the advantage of sampling from an explicit distribution. For DMVP, empirically we only need to sample 100 samples per data point to converge very well and every sample here is an unbiased esti-\n5We thank the authors of (Tang et al., 2017) and (Chen et al., 2017) for sharing the codes.\nmation of the joint likelihood. However, in DMSE, we need to burn every 1000 intermediate samples to merely get one quasi-unbiased sample from the implicit distribution, which is not cost-efficient. What’s more, the high-resolution image data resources are way beyond the capacity of the MCMCbased method, where the DMSE model cannot reach a reasonable performance after 2-day-long training. (3) In terms of the Neg.JLL, DMVP outperforms all baseline models including the competitive MEDL CVAE model, which is compatible with deep neural networks and also models the correlations among entities. There are two reasons of why DMVP outperforms MEDL CVAE: (i) DMVP directly learns the joint likelihood while MEDL CVAE approximates the joint likelihood by optimizing its variational lower bound. (2) there is a KL-vanishment issue, which is notorious in all applications based on variational autoencoder, in the training of variational lower bound that hampers the performance of the MEDL CVAE model."
  }, {
    "heading": "5.3. Empirical Analysis of the DMVP’s Convergence Behavior",
    "text": "In Section 3.2 we provide the theoretical upper bound of the DMVP’s convergence behavior. Based on the theorem (1), one way to reduce the sampling variance is to assume the low-rank property of the residual covariance matrix. Therefore, we conducted the empirical analysis of the DMVP’s performance as well as the convergence behavior on three datasets with residual covariance matrix of different rank. Based on the theorem (1), we use the numerators of both equation (9) and equation (11) to indicate the convergence rate, where the former is a tighter bound without an analytic form and the latter is the theoretical upper bound. Though\nthe tighter bound (equation (9)) does not have a analytic form, we could show the value estimated using the numerical method proposed in (Genz, 1992). What’s more, because the value of the indicators derived from equation (11) and equation (9) vary across data points over time, we pick the median at the end of the training as the representative. We implement the constraint of rank(Σr) by restricting the dimensionality of Σ1/2r , i.e., Σ 1/2 r ∈ Rl×k, where k ≤ l. Figure (3) show the experimental results conducted on three datasets. Because of the similarity, for the eBird dataset, we only show the analysis using NLCD features. One observation from Figure (3) is that the theoretical bound is way looser than the numerical estimation of the tighter bound, which is actually closer to the empirical results. In our experiments, DMVP converges well in all datasets using only 100 samples. Nevertheless, the theoretical bound still sheds light on the convergence behavior of DMVP. One can see, as we restrict the rank of the residual covariance matrix to be lower, both the theoretical bound and the numerical estimation of the convergence rate become better while the performance of DMVP only degrades significantly\nwhen the rank of Σr is extremely small. The reason behind this phenomenon is that the rank of Σr actually describes the the resolution of how fine-grained DMVP models the residual covariance. Therefore, it is possible to approximate a full-rank matrix by a low-rank matrix with minimal discrepancy. As an example, the Figure 4 is the heatmap of the residual covariance matrix on Amazon dataset with rank from full-rank to rank-1. (Because of the space limitation, we only show the covariance heatmap of Amazon datasets.) One can see, the pattern of residual covariance does not change too much until the resolution is extremely low. These facts are consistent with the empirical results of learning DMVP with full-rank residual covariance matrix, where most eigenvalues of Σr are very close to zero. Based on these observations, we can naturally balance the computational complexity and the predictive performance of DMVP by tuning the resolution. This provides the potential benefits of using DMVP to analyze large scale multi-entity correlation with low-rank constraints."
  }, {
    "heading": "6. Conclusion",
    "text": "In this paper, we propose an end-to-end learning scheme for DMVP, in which we propose an efficient parallel sampling process to integrate DMVP with various GPU-boosted deep neural networks. Tested on three real-world applications of multi-entity modelling, we show that DMVP trains 100x faster than previous MCMC-based methods, captures rich correlations among entities, and consistently performs better than previous models. We further provide both theoretical and empirical analysis of DMVP’s convergence behavior, revealing the benefits of balancing the computational complexity and the predictive performance by restricting the rank of the residual covariance matrix. Future directions include exploring the potential of applying DMVP on large scale correlation analysis with the low-rank residual covariance constraint."
  }, {
    "heading": "Acknowledgement",
    "text": "We are thankful to thousands of eBird participants, and the Cornell Lab of Ornithology. This research was supported by National Science Foundation (Grant Number 0832782,1522054, 1059284, 1356308), and ARO grant W911-NF-14-1-0498."
  }],
  "year": 2018,
  "references": [{
    "title": "Multi-variate probit analysis",
    "authors": ["J. Ashford", "R. Sowden"],
    "venue": "Biometrics, pp",
    "year": 1970
  }, {
    "title": "Structured prediction energy networks",
    "authors": ["D. Belanger", "A. McCallum"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2016
  }, {
    "title": "End-to-end learning for structured prediction energy networks",
    "authors": ["D. Belanger", "B. Yang", "A. McCallum"],
    "venue": "arXiv preprint arXiv:1703.05667,",
    "year": 2017
  }, {
    "title": "Conditional expectation and unbiased sequential estimation",
    "authors": ["D. Blackwell"],
    "venue": "The Annals of Mathematical Statistics,",
    "year": 1947
  }, {
    "title": "Deep multi-species embedding",
    "authors": ["D. Chen", "Y. Xue", "S. Chen", "D. Fink", "C. Gomes"],
    "venue": "In IJCAI,",
    "year": 2017
  }, {
    "title": "Nus-wide: A real-world web image database from national university of singapore",
    "authors": ["Chua", "T.-S", "J. Tang", "R. Hong", "H. Li", "Z. Luo", "Zheng", "Y.-T"],
    "venue": "In Proc. of ACM Conf. on Image and Video Retrieval (CIVR’09),",
    "year": 2009
  }, {
    "title": "Rational chebyshev approximations for the error function",
    "authors": ["W.J. Cody"],
    "venue": "Mathematics of Computation,",
    "year": 1969
  }, {
    "title": "North american bird conservation initiative: Bird conservation region descriptions, a supplement to the north american bird conservation initiative bird conservation regions",
    "authors": ["Committee", "U. N"],
    "year": 2000
  }, {
    "title": "Large-scale object classification using label relation graphs",
    "authors": ["J. Deng", "N. Ding", "Y. Jia", "A. Frome", "K. Murphy", "S. Bengio", "Y. Li", "H. Neven", "H. Adam"],
    "venue": "In ECCV,",
    "year": 2014
  }, {
    "title": "A kernel method for multilabelled classification",
    "authors": ["A. Elisseeff", "J. Weston"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2002
  }, {
    "title": "Numerical computation of multivariate normal probabilities",
    "authors": ["A. Genz"],
    "venue": "Journal of computational and graphical statistics,",
    "year": 1992
  }, {
    "title": "Computational sustainability: Computational methods for a sustainable environment, economy, and society",
    "authors": ["C.P. Gomes"],
    "venue": "The Bridge,",
    "year": 2009
  }, {
    "title": "Completion of the 2011 national land cover database for the conterminous united states–representing a decade of land cover change information",
    "authors": ["C. Homer", "J. Dewitz", "L. Yang", "S. Jin", "P. Danielson", "G. Xian", "J. Coulston", "N. Herold", "J. Wickham", "K. Megown"],
    "year": 2011
  }, {
    "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
    "authors": ["S. Ioffe", "C. Szegedy"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2015
  }, {
    "title": "Mcmc perspectives on simulated likelihood estimation. In Maximum simulated likelihood methods and applications, pp. 3–39",
    "authors": ["I. Jeliazkov", "E. Hee Lee"],
    "venue": "Emerald Group Publishing Limited,",
    "year": 2010
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["D. Kingma", "J. Ba"],
    "venue": "arXiv preprint arXiv:1412.6980,",
    "year": 2014
  }, {
    "title": "Imagenet classification with deep convolutional neural networks. In Advances in neural information processing",
    "authors": ["A. Krizhevsky", "I. Sutskever", "G.E. Hinton"],
    "year": 2012
  }, {
    "title": "Conditional random fields: Probabilistic models for segmenting and labeling sequence data",
    "authors": ["J.D. Lafferty", "A. McCallum", "F.C.N. Pereira"],
    "venue": "In Proceedings of the Eighteenth International Conference on Machine Learning,",
    "year": 2001
  }, {
    "title": "Investigating species co-occurrence patterns when species are detected imperfectly",
    "authors": ["D.I. MacKenzie", "L.L. Bailey", "J Nichols"],
    "venue": "Journal of Animal Ecology,",
    "year": 2004
  }, {
    "title": "Lectures on differential Galois theory",
    "authors": ["A.R. Magid"],
    "venue": "Number 7. American Mathematical Soc.,",
    "year": 1994
  }, {
    "title": "Sparse probit linear mixed model",
    "authors": ["S. Mandt", "F. Wenzel", "S. Nakajima", "J. Cunningham", "C. Lippert", "M. Kloft"],
    "venue": "Machine Learning,",
    "year": 2017
  }, {
    "title": "Mixed mnl models for discrete response",
    "authors": ["D. McFadden", "K. Train"],
    "venue": "Journal of applied Econometrics,",
    "year": 2000
  }, {
    "title": "The ebird reference",
    "authors": ["M.A. Munson", "K. Webb", "D. Sheldon", "D. Fink", "W.M. Hochachka", "M. Iliff", "M. Riedewald", "D. Sorokina", "B. Sullivan", "C Wood"],
    "year": 2012
  }, {
    "title": "Large-scale multi-label text classificationrevisiting neural networks. In Joint european conference on machine learning and knowledge discovery",
    "authors": ["J. Nam", "J. Kim", "E.L. Mencı́a", "I. Gurevych", "J. Fürnkranz"],
    "venue": "in databases,",
    "year": 2014
  }, {
    "title": "Exponential family embeddings",
    "authors": ["M. Rudolph", "F. Ruiz", "S. Mandt", "D. Blei"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2016
  }, {
    "title": "Accurate max-margin training for structured output spaces",
    "authors": ["S. Sarawagi", "R. Gupta"],
    "venue": "In Proceedings of the 25th international conference on Machine learning,",
    "year": 2008
  }, {
    "title": "A multivariate probit latent variable model for analyzing dichotomous responses",
    "authors": ["Song", "X.-Y", "Lee", "S.-Y"],
    "venue": "Statistica Sinica, pp",
    "year": 2005
  }, {
    "title": "Dropout: a simple way to prevent neural networks from overfitting",
    "authors": ["N. Srivastava", "G.E. Hinton", "A. Krizhevsky", "I. Sutskever", "R. Salakhutdinov"],
    "venue": "Journal of machine learning research,",
    "year": 1929
  }, {
    "title": "Bayesian inference in the multivariate probit model",
    "authors": ["A. Tabet"],
    "venue": "PhD thesis, University of British Columbia,",
    "year": 2007
  }, {
    "title": "Multi-entity dependence learning with rich context via conditional variational auto-encoder",
    "authors": ["L. Tang", "Y. Xue", "D. Chen", "C. Gomes"],
    "venue": "In AAAI,",
    "year": 2017
  }, {
    "title": "Cnn-rnn: A unified framework for multi-label image classification",
    "authors": ["J. Wang", "Y. Yang", "J. Mao", "Z. Huang", "C. Huang", "W. Xu"],
    "venue": "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
    "year": 2016
  }, {
    "title": "Ensemble approach based on conditional random field for multi-label image and video annotation",
    "authors": ["Xu", "X.-S", "Y. Jiang", "L. Peng", "X. Xue", "Zhou", "Z.-H"],
    "venue": "In Proceedings of the 19th ACM International Conference on Multimedia,",
    "year": 2011
  }, {
    "title": "Multivariate probit models for conditional claim-types",
    "authors": ["G. Young", "E.A. Valdez", "R. Kohn"],
    "venue": "Insurance: Mathematics and Economics,",
    "year": 2009
  }],
  "id": "SP:02bf14b4af1ad148569c74597b60f20e0d8a4baa",
  "authors": [{
    "name": "Di Chen",
    "affiliations": []
  }, {
    "name": "Yexiang Xue",
    "affiliations": []
  }, {
    "name": "Carla Gomes",
    "affiliations": []
  }],
  "abstractText": "The multivariate probit model (MVP) is a popular classic model for studying binary responses of multiple entities. Nevertheless, the computational challenge of learning the MVP model, given that its likelihood involves integrating over a multidimensional constrained space of latent variables, significantly limits its application in practice. We propose a flexible deep generalization of the classic MVP, the Deep Multivariate Probit Model (DMVP), which is an end-to-end learning scheme that uses an efficient parallel sampling process of the multivariate probit model to exploit GPU-boosted deep neural networks. We present both theoretical and empirical analysis of the convergence behavior of DMVP’s sampling process with respect to the resolution of the correlation structure. We provide convergence guarantees for DMVP and our empirical analysis demonstrates the advantages of DMVP’s sampling compared with standard MCMC-based methods. We also show that when applied to multi-entity modelling problems, which are natural DMVP applications, DMVP trains faster than classical MVP, by at least an order of magnitude, captures rich correlations among entities, and further improves the joint likelihood of entities compared with several competitive models.",
  "title": "End-to-End Learning for the Deep Multivariate Probit Model "
}