{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 680–685 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n680"
  }, {
    "heading": "1 Introduction",
    "text": "When drugs are concomitantly administered to a patient, the effects of the drugs may be enhanced or weakened, which may also cause side effects. These kinds of interactions are called Drug-Drug Interactions (DDIs). Several drug databases have been maintained to summarize drug and DDI information such as DrugBank (Law et al., 2014), Therapeutic Target database (Yang et al., 2016), and PharmGKB (Thorn et al., 2013). Automatic DDI extraction from texts is expected to support the maintenance of databases with high coverage and quick update to help medical experts. Deep neural network-based methods have recently drawn a considerable attention (Liu et al., 2016; Sahu and Anand, 2017; Zheng et al., 2017; Lim et al., 2018) since they show state-of-the-art performance without manual feature engineering.\nIn parallel to the progress in DDI extraction from texts, Graph Convolutional Networks (GCNs) have been proposed and applied to estimate physical and chemical properties of molec-\nular graphs such as solubility and toxicity (Duvenaud et al., 2015; Li et al., 2016; Gilmer et al., 2017).\nIn this study, we propose a novel method to utilize both textual and molecular information for DDI extraction from texts. We illustrate the overview of the proposed model in Figure 1. We obtain the representations of drug pairs in molecular graph structures using GCNs and concatenate the representations with the representations of the textual mention pairs obtained by convolutional neural networks (CNNs). We trained the molecule-based model using interacting pairs mentioned in the DrugBank database and then trained the entire model using the labeled pairs in the text data set of the DDIExtraction 2013 shared task (SemEval-2013 Task 9) (Segura Bedmar et al., 2013). In the experiment, we show GCNs can predict DDIs from molecular graphs in a high accuracy. We also show molecular information can enhance the performance of DDI extraction from texts in 2.39 percent points in F-score.\nThe contribution of this paper is three-fold: • We propose a novel neural method to extract\nDDIs from texts with the related molecular structure information. • We apply GCNs to pairwise drug molecules\nfor the first time and show GCNs can predict DDIs between drug molecular structures in a high accuracy. • We show the molecular information is useful\nin extracting DDIs from texts."
  }, {
    "heading": "2 Methods",
    "text": ""
  }, {
    "heading": "2.1 Text-based DDI Extraction",
    "text": "Our model for extracting DDIs from texts is based on the CNN model by Zeng et al. (2014). When an input sentence S = (w1, w2, · · · , wN ) is given, We prepare word embedding wwi of wi and word\nposition embeddings wpi,1 and w p i,2 that correspond to the relative positions from the first and second target entities, respectively. We concatenate these embeddings as in Equation (1), and we use the resulting vector as the input to the subsequent convolution layer:\nwi = [w w i ;w p i,1;w p i,2], (1)\nwhere [; ] denotes the concatenation. We calculate the expression for each filter j with the window size kl.\nzi,l = [wi−(kl−1)/2, · · · ,wi−(kl+1)/2], (2) mi,j,l = relu(W conv j zi,l + bconv), (3)\nmj,l = max i mi,j,l, (4)\nwhere L is the number of windows, W convj and bconv are the weight and bias of CNN, and max indicates max pooling (Boureau et al., 2010).\nWe convert the output of the convolution layer into a fixed-size vector that represents a textual pair as follows:\nml = [m1,l, · · · ,mJ,l], (5) ht = [m1; . . . ;mL], (6)\nwhere J is the number of filters. We get a prediction ŷt by the following fully connected neural networks:\nh (1) t = relu(W (1) t ht + b (1) t ), (7)\nŷt = softmax(W (2) t h (1) t + b (2) t ), (8)\nwhere W (1)t and W (2) t are weights and b (1) t and b (2) t are bias terms."
  }, {
    "heading": "2.2 Molecular Structure-based DDI Classification",
    "text": "We represent drug pairs in molecular graph structures using two GCN methods: CNNs for fingerprints (NFP) (Duvenaud et al., 2015) and Gated Graph Neural Networks (GGNN) (Li et al., 2016). They both convert a drug molecule graph G into a fixed size vector hg by aggregating the representation hTv of an atom node v in G. We represent atoms as nodes and bonds as edges in the graph.\nNFP first obtains the representation htv by the following equations (Duvenaud et al., 2015).\nmt+1v = h t v + ∑ w∈N(v) htw, (9)\nht+1v = σ(H deg(v) t m t+1 v ), (10)\nwhere htv is the representation of v in the t-th step, N(v) is the neighbors of v, and Hdeg(v)t is a weight parameter. h0v is initialized by the atom features of v. deg(v) is the degree of a node v and σ is a sigmoid function. NFP then acquires the representation of the graph structure\nhg = ∑ v,t softmax(W thtv), (11)\nwhere W t is a weight matrix. GGNN first obtains the representation htv by using Gated Recurrent Unit (GRU)-based recurrent neural networks (Li et al., 2016) as follows:\nmt+1v = ∑\nw∈N(v)\nAevwh t w (12)\nht+1v = GRU([h t v;m t+1 v ]), (13)\nwhere Aevw is a weight for the bond type of each edge evw. GGNN then acquires the representation of the graph structure.\nhg = ∑ v σ(i([hTv ;h 0 v])) (j(hTv )), (14)\nwhere i and j are linear layers and is the element-wise product.\nWe obtain the representation of a molecular pair by concatenating the molecular graph representations of drugs g1 and g2, i.e., hm = [hg1 ;hg2 ].\nWe get a prediction ŷm as follows:\nh(1)m = relu(W (1) m hm + b (1) m ), (15)\nŷm = softmax(W (2) m h (1) m + b (2) m ), (16)\nwhere W (1)m and W (2) m are weights and b (1) m and b (2) m are bias terms."
  }, {
    "heading": "2.3 DDI Extraction from Texts Using Molecular Structures",
    "text": "We realize the simultaneous use of textual and molecular information by concatenating a textbased and molecule-based vectors: hall = [ht;hm]. We normalize molecule-based vectors. We then use hall instead of ht in Equation 7.\nIn training, we first train the molecular-based DDI classification model. The molecular-based classification is performed by minimizing the loss function Lm = − ∑ ym log ŷm. We then fix the parameters for GCNs and train text-based DDI extraction model by minimizing the loss function Lt = − ∑ yt log ŷt."
  }, {
    "heading": "3 Experimental Settings",
    "text": "In this section, we explain the textual and molecular data and task settings and training settings."
  }, {
    "heading": "3.1 Text Corpus and Task Setting",
    "text": "We followed the task setting of Task 9.2 in the DDIExtraction 2013 shared task (Segura Bedmar et al., 2013; Herrero-Zazo et al., 2013) for the evaluation. This data set is composed of documents annotated with drug mentions and their four types of interactions: Mechanism, Effect, Advice and Int. For the data statistics, please refer to the supplementary materials.\nThe task is a multi-class classification task, i.e., to classify a given pair of drugs into the four interaction types or no interaction. We evaluated the performance with micro-averaged precision (P),\nrecall (R), and F-score (F) on all the interaction types. We used the official evaluation script provided by the task organizers.\nAs preprocessing, we split sentences into words using the GENIA tagger (Tsuruoka et al., 2005). We replaced the drug mentions of the target pair with DRUG1 and DRUG2 according to their order of appearance. We also replaced other drug mentions with DRUGOTHER. We did not employ negative instance filtering unlike other existing methods, e.g., Liu et al. (2016), since our focus is to evaluate the effect of the molecular information on texts.\nWe linked mentions in texts to DrugBank entries by string matching. We lowercased the mentions and the names in the entries and chose the entries with the most overlaps. As a result, 92.15% and 93.09% of drug mentions in train and test data set matched the DrugBank entries."
  }, {
    "heading": "3.2 Data and Task for Molecular Structures",
    "text": "We extracted 255,229 interacting (positive) pairs from DrugBank. We note that, unlike text-based interactions, DrugBank only contains the information of interacting pairs; there are no detailed labels and no information for non-interacting (negative) pairs. We thus generated the same number of pseudo negative pairs by randomly pairing drugs and removing those in positive pairs. To avoid overestimation of the performance, we also deleted drug pairs mentioned in the test set of the text corpus. We split positive and negative pairs into 4:1 for training and test data, and we evaluated the classification accuracy using only the molecular information.\nTo obtain the graph of a drug molecule, we took\nas input the SMILES (Weininger, 1988) string encoding of the molecule from DrugBank and then converted it into the graph using RDKit (Landrum, 2016) as illustrated in Figure 2. For the atom features, we used randomly embedded vectors for each atoms (i.e., C, O, N, ...). We also used 4 bond types: single, double, triple, or aromatic."
  }, {
    "heading": "3.3 Training Settings",
    "text": "We employed mini-batch training using the Adam optimizer (Kingma and Ba, 2015). We used L2 regularization to avoid over-fitting. We tuned the bias term b(2)t for negative examples in the final softmax layer. For the hyper-parameters, please refer to the supplementary materials.\nWe employed pre-trained word embeddings trained by using the word2vec tool (Mikolov et al., 2013) on the 2014 MEDLINE/PubMed baseline distribution. The vocabulary size was 215,840. The embedding of the drugs, i.e., DRUG1 and DRUG2 were initialized with the pre-trained embedding of the word drug. The embeddings of training words that did not appear in the pretrained embeddings were initialized with the average of all pre-trained word embeddings. Words that appeared only once in the training data were replaced with an UNK word during training, and the embedding of words in the test data set that did not appear in both training and pre-trained embeddings were set to the embedding of the UNK word. Word position embeddings are initialized with random values drawn from a uniform distribution.\nWe set the molecule-based vectors of unmatched entities to zero vectors."
  }, {
    "heading": "4 Results",
    "text": "Table 1 shows the performance of DDI extraction models. We show the performance without negative instance filtering or ensemble for the fair comparison. We observe the increase of recall and F-score by using molecular information,\nwhich results in the state-of-the-art performance with GGNN.\nBoth GCNs improvements were statistically significant (p < 0.05 for NFP and p < 0.005 for GGNN) with randomized shuffled test.\nTable 2 shows F-scores on individual DDI types. The molecular information improves Fscores especially on type Mechanism and Effect.\nWe also evaluated the accuracy of binary classification on DrugBank pairs by using only the molecular information in Table 3. The performance is high, although the accuracy is evaluated on automatically generated negative instances.\nFinally, we applied the molecular-based DDI classification model trained on DrugBank to the DDIExtraction 2013 task data set. Since the DrugBank has no detailed labels, we mapped all four types of interactions to positive interactions and evaluated the classification performance. The results in Table 4 show that GCNs produce higher recall than precision and the overall performance is low considering the high performance on DrugBank pairs. This might be because the interactions of drugs are not always mentioned in texts even if the drugs can interact with each other and because hedged DDI mentions are annotated as DDIs in the text data set. We also trained the DDI extraction model only with molecular information by replacing hall with hm, but the F-scores were quite low (< 5%). These results show that we cannot predict textual relations only with molecular information."
  }, {
    "heading": "5 Related Work",
    "text": "Various feature-based methods have been proposed during and after the DDIExtraction-2013 shared task (Segura Bedmar et al., 2013). Kim et al. (2015) proposed a two-phase SVM-based approach that employed a linear SVM with rich features that consist of word, word pair, dependency graph, parse tree, and noun phrase-based constrained coordination features. Zheng et al. (2016) proposed a context vector graph kernel to exploit various types of contexts. Raihani and Laachfoubi (2017) also employed a two-phase SVM-based approach using non-linear kernels and they proposed five groups of features: word, drug, pair of drug, main verb and negative sentence features. Our model does not use any features or kernels.\nVarious neural DDI extraction models have been recently proposed using CNNs and Recurrent Neural Networks (RNNs). Liu et al. (2016) built a CNN-based model based on word and position embeddings. Zheng et al. (2017) proposed a Bidirectional Long Short-Term Memory RNN (Bi-LSTM)-based model with an input attention mechanism, which obtained target drug-specific word representations before the Bi-LSTM. Lim et al. (2018) proposed Recursive neural networkbased model with a subtree containment feature and an ensemble method. This model showed the state-of-the-art performance on the DDIExtraction 2013 shared task data set if systems do not use negative instance filtering. These approaches did not consider molecular information, and they can also be enhanced by the molecular information.\nVilar et al. (2017) focused on detecting DDIs from different sources such as pharmacovigilance sources, scientific biomedical literature and social media. They did not use deep neural networks and they did not consider molecular information.\nLearning representations of graphs are widely studied in several tasks such as knowledge base completion, drug discovery, and material science (Wang et al., 2017; Gilmer et al., 2017). Several graph convolutional neural networks have been proposed such as NFP (Duvenaud et al., 2015), GGNN (Li et al., 2016), and Molecular Graph Convolutions (Kearnes et al., 2016), but they have not been applied to DDI extraction."
  }, {
    "heading": "6 Conclusions",
    "text": "We proposed a novel neural method for DDI extraction using both textual and molecular informa-\ntion. The results show that DDIs can be predicted with high accuracy from molecular structure information and that the molecular information can improve DDI extraction from texts by 2.39 percept points in F-score on the data set of the DDIExtraction 2013 shared task.\nAs future work, we would like to seek the way to model the textual and molecular representations jointly with alleviating the differences in labels. We will also investigate the use of other information in DrugBank."
  }, {
    "heading": "Acknowledgments",
    "text": "This work was supported by JSPS KAKENHI Grant Number 17K12741."
  }],
  "year": 2018,
  "references": [{
    "title": "A theoretical analysis of feature pooling in visual recognition",
    "authors": ["Y-Lan Boureau", "Jean Ponce", "Yann LeCun."],
    "venue": "Proceedings of ICML. pages 111– 118.",
    "year": 2010
  }, {
    "title": "Convolutional networks on graphs for learning molecular fingerprints",
    "authors": ["David K Duvenaud", "Dougal Maclaurin", "Jorge Iparraguirre", "Rafael Bombarell", "Timothy Hirzel", "Alan Aspuru-Guzik", "Ryan P Adams."],
    "venue": "Proceedings of NIPS, pages 2224–",
    "year": 2015
  }, {
    "title": "Neural message passing for quantum chemistry",
    "authors": ["Justin Gilmer", "Samuel S. Schoenholz", "Patrick F. Riley", "Oriol Vinyals", "George E. Dahl."],
    "venue": "Proceedings of ICML. pages 1263–1272.",
    "year": 2017
  }, {
    "title": "The DDI corpus: An annotated corpus with pharmacological substances and drug–drug interactions",
    "authors": ["Marı́a Herrero-Zazo", "Isabel Segura-Bedmar", "Paloma Martı́nez", "Thierry Declerck"],
    "venue": "Journal of biomedical informatics 46(5):914–920",
    "year": 2013
  }, {
    "title": "Molecular graph convolutions: moving beyond fingerprints",
    "authors": ["Steven Kearnes", "Kevin McCloskey", "Marc Berndl", "Vijay Pande", "Patrick Riley."],
    "venue": "Journal of computer-aided molecular design 30(8):595–608.",
    "year": 2016
  }, {
    "title": "Extracting drug–drug interactions from literature using a rich feature-based linear kernel approach",
    "authors": ["Sun Kim", "Haibin Liu", "Lana Yeganova", "W John Wilbur."],
    "venue": "Journal of biomedical informatics 55:23–30.",
    "year": 2015
  }, {
    "title": "Adam: A method for stochastic optimization",
    "authors": ["Diederik Kingma", "Jimmy Ba."],
    "venue": "Proceedings of ICLR.",
    "year": 2015
  }, {
    "title": "Rdkit: Open-source cheminformatics",
    "authors": ["Greg Landrum"],
    "year": 2016
  }, {
    "title": "DrugBank 4.0: shedding new light on drug metabolism",
    "authors": ["Vivian Law", "Craig Knox", "Yannick Djoumbou", "Tim Jewison", "An Chi Guo", "Yifeng Liu", "Adam Maciejewski", "David Arndt", "Michael Wilson", "Vanessa Neveu"],
    "venue": "Nucleic acids research",
    "year": 2014
  }, {
    "title": "Gated graph sequence neural networks",
    "authors": ["Yujia Li", "Daniel Tarlow", "Marc Brockschmidt", "Richard Zemel."],
    "venue": "Proceedings of ICLR.",
    "year": 2016
  }, {
    "title": "Drug drug interaction extraction from the literature using a recursive neural network",
    "authors": ["Sangrak Lim", "Kyubum Lee", "Jaewoo Kang."],
    "venue": "PloS one 13(1):e0190926.",
    "year": 2018
  }, {
    "title": "Drug-drug interaction extraction via convolutional neural networks",
    "authors": ["Shengyu Liu", "Buzhou Tang", "Qingcai Chen", "Xiaolong Wang."],
    "venue": "Computational and mathematical methods in medicine .",
    "year": 2016
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Greg S Corrado", "Jeff Dean."],
    "venue": "Proceedings of NIPS. pages 3111–3119.",
    "year": 2013
  }, {
    "title": "A rich feature-based kernel approach for drug-drug interaction extraction",
    "authors": ["Anass Raihani", "Nabil Laachfoubi."],
    "venue": "International Journal of Advanced Computer Science and Applications 8(4):324–330.",
    "year": 2017
  }, {
    "title": "Drugdrug interaction extraction from biomedical text using long short term memory network",
    "authors": ["Sunil Kumar Sahu", "Ashish Anand."],
    "venue": "arXiv preprint arXiv:1701.08303 .",
    "year": 2017
  }, {
    "title": "SemEval-2013 Task 9: Extraction of drug-drug interactions from biomedical texts (DDIExtraction",
    "authors": ["Isabel Segura Bedmar", "Paloma Martı́nez", "Marı́a Herrero Zazo"],
    "venue": "In Proceedings of the 7th International Workshop on Semantic Evaluations",
    "year": 2013
  }, {
    "title": "PharmGKB: the pharmacogenomics knowledge base",
    "authors": ["Caroline F Thorn", "Teri E Klein", "Russ B Altman."],
    "venue": "Pharmacogenomics: Methods and Protocols pages 311–320.",
    "year": 2013
  }, {
    "title": "Developing a robust partof-speech tagger for biomedical text",
    "authors": ["Yoshimasa Tsuruoka", "Yuka Tateishi", "Jin-Dong Kim", "Tomoko Ohta", "John McNaught", "Sophia Ananiadou", "Junichi Tsujii."],
    "venue": "Panhellenic Conference on Informatics. pages 382–392.",
    "year": 2005
  }, {
    "title": "Detection of drug–drug interactions through data mining studies using clinical sources, scientific literature and social media",
    "authors": ["Santiago Vilar", "Carol Friedman", "George Hripcsak."],
    "venue": "Briefings in bioinformatics .",
    "year": 2017
  }, {
    "title": "Knowledge graph embedding: A survey of approaches and applications",
    "authors": ["Quan Wang", "Zhendong Mao", "Bin Wang", "Li Guo."],
    "venue": "IEEE Transactions on Knowledge and Data Engineering 29(12):2724– 2743.",
    "year": 2017
  }, {
    "title": "Smiles, a chemical language and information system",
    "authors": ["David Weininger."],
    "venue": "1. introduction to methodology and encoding rules. Journal of chemical information and computer sciences 28(1):31–36.",
    "year": 1988
  }, {
    "title": "Therapeutic target database update 2016: enriched resource for bench to clinical drug target and targeted pathway information",
    "authors": ["Hong Yang", "Chu Qin", "Ying Hong Li", "Lin Tao", "Jin Zhou", "Chun Yan Yu", "Feng Xu", "Zhe Chen", "Feng Zhu", "Yu Zong Chen."],
    "venue": "Nu-",
    "year": 2016
  }, {
    "title": "Relation classification via convolutional deep neural network",
    "authors": ["Daojian Zeng", "Kang Liu", "Siwei Lai", "Guangyou Zhou", "Jun Zhao"],
    "venue": "In COLING",
    "year": 2014
  }, {
    "title": "An attention-based effective neural model for drug-drug interactions extraction",
    "authors": ["Wei Zheng", "Hongfei Lin", "Ling Luo", "Zhehuan Zhao", "Zhengguang Li", "Yijia Zhang", "Zhihao Yang", "Jian Wang."],
    "venue": "BMC Bioinformatics 18(1):445.",
    "year": 2017
  }, {
    "title": "A graph kernel based on context vectors for extracting drug– drug interactions",
    "authors": ["Wei Zheng", "Hongfei Lin", "Zhehuan Zhao", "Bo Xu", "Yijia Zhang", "Zhihao Yang", "Jian Wang."],
    "venue": "Journal of biomedical informatics 61:34–43.",
    "year": 2016
  }],
  "id": "SP:a1ed3208d0458810104fac28e14db2e27151bc23",
  "authors": [{
    "name": "Masaki Asada",
    "affiliations": []
  }, {
    "name": "Makoto Miwa",
    "affiliations": []
  }, {
    "name": "Yutaka Sasaki",
    "affiliations": []
  }],
  "abstractText": "We propose a novel neural method to extract drug-drug interactions (DDIs) from texts using external drug molecular structure information. We encode textual drug pairs with convolutional neural networks and their molecular pairs with graph convolutional networks (GCNs), and then we concatenate the outputs of these two networks. In the experiments, we show that GCNs can predict DDIs from the molecular structures of drugs in high accuracy and the molecular information can enhance text-based DDI extraction by 2.39 percent points in the F-score on the DDIExtraction 2013 shared task data set.",
  "title": "Enhancing Drug-Drug Interaction Extraction from Texts by Molecular Structure Information"
}