{
  "sections": [{
    "heading": "1. Introduction",
    "text": "The Poisson process is an important model for point data in which samples of the process are locally finite subsets of some domain such as time or space. The process is parametrised by an intensity function, the integral of which gives the expected number of points in the domain of integration — for a gentle introduction we recommend (Baddeley, 2007). In the typical case of unknown intensity function we may place a non-parametric prior over it via e.g. the Gaussian Process (GP) and perform Bayesian inference.\nInference under such models is challenging due to both the GP prior and the non factorial nature of the Poisson process likelihood (1), which includes an integral of the intensity function. One may resort to discretising the domain (Rathbun & Cressie, 1994; Møller et al., 1998; Rue et al., 2009) or performing Monte Carlo approximations (Adams et al., 2009; Diggle et al., 2013). Fast Laplace approximates were studied in (Cunningham et al., 2008; Illian et al., 2012; Flaxman et al., 2015) and variational methods were applied\n1Data61, CSIRO, Australia 2The Australian National University 3University of Technology Sydney. Correspondence to: Christian <christian.walder@anu.edu.au>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nin (Lloyd et al., 2015; Kom Samo & Roberts, 2015).\nTo satisfy non-negativity of the intensity function one transforms the GP prior. The log-Gaussian Cox Process, with GP distributed log intensity, has been the subject of much study; see e.g. (Rathbun & Cressie, 1994; Møller et al., 1998; Illian et al., 2012; Diggle et al., 2013), Alternative formulations for introducing a GP prior exist, e.g. (Adams et al., 2009). More recent research has highlighted the analytical and computational advantages (Lloyd et al., 2015; 2016; Flaxman et al., 2017; Møller et al., 1998) of the permanental process, which has GP distributed square root intensity (Shirai & Takahashi, 2003; McCullagh & Møller, 2006) — we discuss the relationship between these methods and the present work in more detail in subsection 2.2.\nIn section 2 we introduce the Poisson and permanental processes, and place our work in the context of existing literature. Section 3 reviews Flaxman et al. (2017), slightly recasting it as regularised maximum likelihood for the permanental process. Our Bayesian scheme is then derived in section 4. In section 5 we discuss the choice of covariance function for the GP prior, before presenting some numerical experiments in section 6 and concluding in section 7."
  }, {
    "heading": "2. The Model",
    "text": ""
  }, {
    "heading": "2.1. The Poisson Process",
    "text": "We view the inhomogeneous Poisson process on Ω as a distribution over locally finite subsets of Ω. The number N(X ) of elements in some X ⊆ Ω is assumed to be distributed as Poisson(Λ(X , µ)), where Λ(S, µ) :=∫ x∈S λ(x)dµ(x) gives the mean of the Poisson distribution. It turns out that this implies the likelihood function\np ({xi}mi=1 |λ,Ω) = m∏ i=1 λ(xi) exp (−Λ(Ω)) . (1)"
  }, {
    "heading": "2.2. Latent Gaussian Process Intensities",
    "text": "To model unknown λ(x), we employ a non-parametric prior over functions, namely the Gaussian process (GP). To ensure that λ is non-negative valued we include a deterministic “link” function g : R → R+ so that we have the prior over λ defined by λ = g ◦ f and f ∼ GP(k), where k is the covariance function for f . The most com-\nmon choice for g is the exponential function exp(·), leading to the log-Gaussian Cox process (LGCP) (Møller et al., 1998). Recently Adams et al. (2009) employed the transformation g(z) = λ∗(1 + exp(−z))−1 , which permits efficient sampling via thinning (Lewis & Shedler, 1979) due to the bound 0 ≤ λ(x) ≤ λ∗."
  }, {
    "heading": "2.2.1. PERMANENTAL PROCESSES: SQUARED LINK FUNCTION",
    "text": "In this paper we focus on the choice g(z) = 12z 2, known as the permanental process (Shirai & Takahashi, 2003; McCullagh & Møller, 2006). Two recent papers have demonstrated the analytical and computational advantages of this link function.\n1. Flaxman et al. (2017) derived a non-probabilistic regularisation based algorithm which we review in section 3, and which exploited properties of reproducing kernel Hilbert spaces. The present work generalises their result, providing probabilistic predictions and Bayesian model selection. Our derivation is by necessity entirely different to Flaxman et al. (2017), as their representer theorem (Schölkopf et al., 2001) argument is insufficient for our probabilistic setting (see e.g. subsubsection 4.1.6).\n2. (Lloyd et al., 2015) derived a variational approximation to a Bayesian model with the squared link function, based on an inducing variable scheme similar to (Titsias, 2009), and exploiting the tractability of certain required integrals. The present work has the advantage of 1) not requiring the inducing point approximation, 2) being free of non-closed form expressions such as their G̃ and 3) being simpler to implement and orders of magnitude faster in practice while, as we demonstrate, exhibiting comparable predictive accuracy."
  }, {
    "heading": "3. Regularised Maximum Likelihood",
    "text": "Flaxman et al. (2017) combined (1) with the regularisation term ‖f‖2H(k), leading to the regularised maximum likelihood estimator for f , namely f̂ :=\nargmax f m∑ i=1 log 1 2 f2(xi)− 1 2 ( ‖f‖2L2(Ω,µ) + ‖f‖ 2 H(k) ) ︸ ︷︷ ︸\n:=‖f‖2H(k,Ω,µ)\n,\n(2)\nwhere we have implicitly defined the new RKHS H(k,Ω, µ) := H(k̃). Now, provided we can compute the associated new reproducing kernel k̃, then we may appeal to the representer theorem (Kimeldorf & Wahba, 1971) in order to compute the f̂ , which takes the form\n∑m i=1 αik̃(xi, ·) for some αi. The function k̃ may be expressed in terms of the Mercer expansion (Mercer, 1909)\nk(x,y) = N∑ i=1 λiφi(x)φi(y), (3)\nwhere φi are orthonormal in L2(Ω, µ). To satisfy for arbitrary f = ∑ i wiφi the reproducing property (Aronszajn, 1950)〈 k(x, ·),\n∑ i wiφ(·)i 〉 H(k) := f(x) = ∑ i wi, φi(x) (4)\nwe let φi be orthogonal in H(k), obtaining 〈φi, φj〉 = δijλ −1 i . Hence, ‖ ∑ i wiφi‖ 2 H(k) = ∑ i w 2 i /λi, and from\n(2) we have ‖ ∑ i wiφi‖ 2 H(k,Ω,µ) = ∑ i w 2 i (1 + λ −1 i ), so\nk̃(x,y) = N∑ i=1\n1\n1 + λ−1i φi(x)φi(y). (5)\nFor approximate Bayesian inference however, we cannot simply appeal to the representer theorem."
  }, {
    "heading": "4. Approximate Bayesian Inference",
    "text": "In subsection A.3 of the supplementary material, we review the standard Laplace approximation to the GP with non-Gaussian likelihood. This a useful set-up for what follows, but is not directly generalisable to our case due to the integral in (1). Instead, in subsection 4.1 we now take a different approach based on the Mercer expansion."
  }, {
    "heading": "4.1. Laplace Approximation",
    "text": "It is tempting to naı̈vely substitute k̃ into subsection A.3 of the supplementary material, and to neglect the integral part of the likelihood. Indeed, this gives the correct approximate predictive distribution. The marginal likelihood does not work in this way however (due to the log determinant in (18)). We now perform a more direct analysis."
  }, {
    "heading": "4.1.1. MERCER EXPANSION SETUP",
    "text": "Mercer’s theorem allows us to write (3), where for nondegenerate kernels, N = ∞. Assume a linear model in Φ(x) = (φi(x))i so that1\nf(x) = w>Φ(x), (6)\nand let w ∼ N (0,Λ) where Λ = (λi)ii is a diagonal covariance matrix. This is equivalent to f ∼ GP(k) because\ncov(f(x), f(z)) = Φ(x)>Λ Φ(z) = k(x, z).\n1We use a sloppy notation where (x)i is the i-th element of x while (xi)i is a vector with i-th element xi, etc.\nRecall that the Poisson process on Ω with intensity λ(x) = 1 2f 2(x) has likelihood for X := {xi}mi=1\nlog p(X|w,Ω, k) = m∑ i=1 log 1\n2 f2(xi)︸ ︷︷ ︸\n:=log h(X|w)\n−1 2 ∫ x∈Ω\nf2(x)dµ(x)︸ ︷︷ ︸ w>w\nThe joint in w, X is\nlog p(w, X|Ω, k)\n= log h(X|w)−1 2 w>(I+Λ−1)w−1 2 log |Λ|−N 2 log 2π."
  }, {
    "heading": "4.1.2. LAPLACE APPROXIMATION",
    "text": "We make a Laplace approximation to the posterior, which is the normal distribution\nlog p(w|X,Ω, k) ≈ logN (w|ŵ, Q) (7)\n= −1 2 (w − ŵ)>Q−1(w − ŵ)− 1 2 log |Q| − N 2 log 2π\n:= log q(w|X,Ω, k),\nwhere ŵ is chosen as the mode of the true posterior, and Q is the inverse Hessian of the true posterior, evaluated at ŵ."
  }, {
    "heading": "4.1.3. PREDICTIVE MEAN",
    "text": "The mode ŵ is\nŵ = argmax w\nlog p(w|X,Ω, k)\n= argmax w log h(X|w)− 1 2 w>(I + Λ−1)w. (8)\nCrucially, ŵ must satisfy the stationarity condition\nŵ = (I + Λ−1)−1 ∇w log h(X|w)|w=ŵ , (9)\nwhere\n∇w log h(X|w)|w=ŵ = 2 m∑ i=1 Φ(xi) Φ(xi)>ŵ .\nThe approximate predictive mean is therefore\nf̂(x∗) := E [f(x∗)|X,Ω, k] = Φ(x∗)>ŵ\n= m∑ i=1\n2\nΦ(xi)>ŵ · Φ(xi)>(I + Λ−1)−1Φ(x∗)\n:= m∑ i=1 αik̃(xi,x ∗). (10)\nThis reveals the same k̃ as (5). From (10) we have\nα̂i = 2/f̂(xi). (11)\nPutting (9), (10) and (11) into (8), we obtain\nα̂ = argmin α m∑ i=1 logα2i + 1 2 α>K̃α,\nwhere K̃ = (k̃(xi),xj)ij . This is equivalent to Flaxman et al. (2017), though slightly simplified by (11). Interestingly, unlike Flaxman et al. (2017) (or the analogous section 3), we did not appeal to the representer theorem."
  }, {
    "heading": "4.1.4. PREDICTIVE VARIANCE",
    "text": "We now compute theQ in (7). The Hessian term giving the inverse covariance becomes\nQ−1 = − ∂ 2\n∂w∂w> log p(w, X,Ω, k) ∣∣∣∣ w=ŵ\n= I + Λ−1 +W\nW = − ∂ 2\n∂w∂w> log h(X|w) ∣∣∣∣ w=ŵ\n= 2 m∑ i=1 Φ(xi)Φ(xi) > (Φ(xi)>ŵ)2 := V DV >,\nwhere V:i = αi × Φ(xi) and D = 12I ∈ R m×m. The approximate predictive variance can now be rewritten as an m-dimensional matrix expression using the identity (Z + V DV >) = Z−1−Z−1V (V >Z−1V +D−1)V >Z−1 with and Z = I + Λ−1 along with a little algebra, to derive2\nσ2(x∗) := Var [f(x∗)|X,Ω, k] = Φ(x∗)>Q Φ(x∗)\n= k̃(x∗,x∗)− ( k̃(x∗, X) α ) S−1 ( α> k̃(X,x∗) ) ,\nwhere is the Hadamard product, or element-wise multiplication, and S := ( k̃(X,X) (αα>) + 2I ) ."
  }, {
    "heading": "4.1.5. PREDICTIVE DISTRIBUTION",
    "text": "Given the approximate predictive distribution f(x∗)|X,Ω, k ∼ N (f̂(x∗), σ2(x∗)) := N (µ, σ2) and the relation λ(·) = 12f\n2(·) it is straightforward to derive the corresponding3 λ(x∗)|X,Ω, k ∼ Gamma(α, β) where the shape α = (µ 2+σ2)2\n2σ2(2µ2+σ2) and the scale β = 2µ2σ2+σ4 µ2+σ2 ."
  }, {
    "heading": "4.1.6. MARGINAL LIKELIHOOD",
    "text": "Letting q(ŵ, X|Ω, k) be the Taylor expansion of log p(w, X|Ω, k) about the mode w = ŵ and evaluating at ŵ gives, as linear and quadratic terms vanish,\nlog q(ŵ, X|Ω, k) = log p(ŵ, X|Ω, k)\n= log h(X|ŵ)−1 2 ŵ>(I+Λ−1)ŵ−1 2 log |Λ|−N 2 log 2π.\n2Where e.g. k̃(X,x∗) is an m× 1 matrix of evaluations of k̃. 3Gamma(x|α, β) has p.d.f. 1\nΓ(k)βk xα−1 exp(−x/β).\nSimilarly to (19) we get approximate marginal likelihood\nlog p(X|Ω, k) ≈ log q(ŵ, X|Ω, k)− log q(ŵ|X,Ω, k)\n= log h(X|ŵ)︸ ︷︷ ︸ − ∑m i=1 log 2α 2 i −1 2 ( ŵ>(I + Λ−1)ŵ︸ ︷︷ ︸ α>k̃(X,X)α − log |Λ|+log |Q| ) (12)\nWe now use the determinant identity |Z + V DV >| = |Z||D||V >Z−1V + D−1| with the same Z, V and D as subsubsection 4.1.4 to derive\n− log |Λ|+ log |Q| = − log |Λ| − log |Z + V DV >| = − log ∣∣Λ(I + Λ−1)∣∣− log ∣∣D−1 + V >Z−1V ∣∣+ c =\nN∑ i=1 log 1\n1 + λi︸ ︷︷ ︸ :=V(k,Ω,µ)\n− log ∣∣∣k̃(X,X) (αα>) + 2I∣∣∣+ c,\n(13)\nwhere c = m log(2). V(k,Ω, µ) is the crucial ingredient, not accounted for by naı̈vely putting k̃ into subsection A.3."
  }, {
    "heading": "5. Covariance Functions",
    "text": "To apply our inference scheme we need to compute:\n1. The function k̃ from equation (10), studied recently by Flaxman et al. (2017) and earlier by Sollich & Williams (2005) as the equivalent kernel.\n2. The associated term V(k,Ω, µ) from equation (13), required for the marginal likelihood.\nThis is often challenging for compact domains such as the unit hyper-cube. Such domains are crucial however, if we are to avoid the well-known edge-effects which arise from neglecting the fact that our data are sampled from, say, a two dimensional rectangle. In subsection 5.1 we provide a simple constructive approach to the case Ω = [0, 1]d. The following subsection 5.2 presents the general approximation scheme due to Flaxman et al. (2017), for the case when we have k but not its Mercer expansion."
  }, {
    "heading": "5.1. Thin-Plate Semi-norms on the Hyper-Cube",
    "text": "Consider the input domain Ω = [0, π]d with Lebesgue measure µ. A classical function regularisation term is the so called m-th order thin-plate spline semi-norm,\n〈f, g〉T P(m) := ∑ |α|=m m!∏ j αj ! ∫ x∈Ω ∂mf ∂xα ∂mg ∂xα dµ(x)\n= 〈f,∆mg〉L2(Ω) + B. (14)\nHere α is a multi-index running over all indices of total order |α| := ∑ j αj = m, and the boundary conditions B come from formal integration (see e.g. Wahba (1990, section 2.4). We neglect B (for reasons explained shortly) and include the zero-th derivative to define\n〈f, g〉H(k) := 〈f, (a∆m + b)g〉L2(Ω).\nWe may select the free parameters a > 0, b > 0 and m ∈ Z+ using the maximum marginal likelihood criterion. In general, it is challenging to obtain the expressions we require in closed form for arbitrary d, Ω and m. The analytical limit in the literature appears to be the case m = 2 with dimension d = 1 along with so-called Neumann boundary conditions (which impose a vanishing gradient on the boundary (Sommerfeld & Straus, 1949)). That k̃ has been derived in closed form as the reproducing kernel of an associated Sobolev space by Thomas-Agnan (1996).\nWe now present a simple but powerful scheme which sidesteps these challenges via a well chosen series expansion. Consider the basis function\nφβ(x) := (2/π) d/2 d∏ j=1 √ 1/2 [βj=0] cos(βjxj),\nwhere β is a multi-index with non-negative (integral) values, and [·] denotes the indicator function (which is one if the condition is satisfied and zero otherwise). The φβ form a convenient basis for our purposes. They are orthonormal:\n〈φβ , φγ〉L2(Ω) = [β = γ],\nand also eigenfunctions of our regularisation operator with\n(a∆m + b)φβ = ( a ( d∑ j=1 β2j )m + b ) φβ . (15)\nNow if we restrict the function space to H(k) := { f = ∑ β≥0 cβφβ : ‖f‖2H(k) = ∑ β≥0 c2β/λβ <∞ } ,\nthen it is easily verified that the boundary conditions B in (14) vanish. This is a common approach to solving partial differential equations with Neumann boundary conditions (see e.g. Sommerfeld & Straus (1949)). By restricting in this way, we merely impose zero partial derivatives at the boundary, while otherwise enjoying the usual Fourier series approximation properties. Hence we can combine the reproducing property (4) with (14) and (15) to derive\nk(x,y) = ∑ β≥0 λβφβ(x)φβ(y), (16)\nwhere λβ := 1/(a (∑d j=1 β 2 j )m + b).\nThe above covariance function is not required for our inference algorithm. Rather, the point is that since the basis is also orthonormal, we may substitute λβ and φβ into (10) and (13) to obtain k̃ and V(k), as required.\nSeries truncation. We have discovered closed form expressions for k̃ only for m ≤ 2 and d = 1. In practice we may truncate the series at any order and still obtain a valid model due to the equivalence with the linear model (6). Hence, a large approximation error (in terms of k̃) due to truncation may be irrelevant from a machine learning perspective, merely implying a different GP prior over functions. Indeed, the maximum marginal likelihood criterion based on subsubsection 4.1.6 may guide the selection of an appropriate truncation order, although some care needs to be taken in this case."
  }, {
    "heading": "5.2. Arbitrary Covariances and Domains",
    "text": "Flaxman et al. (2017) suggested the following approximation for k̃, for the case when k is known but the associated Mercer expansion is not. The approximation is remarkably general and elegant, and may even be applied to nonvectorial data by employing, say, a kernel function defined on strings (Lodhi et al., 2002). The idea is to note that the φi, λi pairs are eigenfunctions of the integral operator (see Rasmussen & Williams (2006) section 4.3)\nTk : H(k)→ H(k) f 7→ Tkf := ∫ x∈Ω k(x, ·)f(x)p(x) dx,\nwhere p is related to µ of the previous subsection by µ(x) = p(x) dx. The Nyström approximation (Nyström, 1928) to Tk draws m samples X from p and defines T\n(X) k g := 1 m ∑ x∈X k(x, ·)g(x). Then the eigenfunctions and eigenvectors of Tk may be approximated via the eigenvectors e(mat)i and eigenvalues λ (mat) i of 2 k(X,X), as\nφ (X) i :=\n√ m/λ\n(mat) i k(·, X)e (mat) i\nλ (X) i := λ (mat) i /m.\nThese approximations may be used for k̃, as in (Flaxman et al., 2017), as well as our V(k,Ω, µ)."
  }, {
    "heading": "6. Experiments",
    "text": ""
  }, {
    "heading": "6.1. Setup",
    "text": "Evaluation We use two metrics. The `2 Error is the squared difference to the ground truth w.r.t. the Lebesgue measure: ∫ x∈Ω(λ(x) − λtrue(x))\n2 dx. The test log likelihood is the logarithm of (1) at an independent test sample (one sample being a set of points, i.e. a sample from the process), which we summarise by averaging over a finite number of test sets (for real data where the ground truth intensity is unknown) and otherwise (if we have the ground truth) by the analytical expression EX∼PP(λ) [ log pX∼PP(λ̂)(X)\n] =∫\nx∈Ω\n( λ(x) log λ̂(x)− λ̂(x) ) dx,\nwhere PP (λ) is the process with intensity λ (see the supplementary subsection A.1). This evaluation metric is novel in this context, yet more accurate and computationally cheaper than the sampling of e.g. (Adams et al., 2009).\nDecision Theory The above metrics are functions of a single estimated intensity. In all cases we use the predictive mean intensity for evaluation. We demonstrate in subsection A.2 of the supplementary material that this is optimal\nfor the expected test log likelihood evaluation (the `2 error cases is similar as is trivial to show).\nAlgorithms We compare our new Laplace Bayesian Point Process (LBPP) with two covariances: the cosine kernel of subsection 5.1 with fixed m = 2 and hyperparameters a and b (LBPP-Cos), and the Gaussian kernel k(x, z) = γ2 exp(|x− y|2 /(2β2)) with the method of subsection 5.2 (LBPP-G). We compared with the Variational Bayesian Point Process (VBPP) (Lloyd et al., 2015) using the same Gaussian kernel. LBPP-G and VBPP use a regular grid for X (of subsection 5.2) and the inducing points, respectively. To compare timing we vary the number of basis functions, i.e. the number of grid points for LBPP-G and VBPP, and cosine terms for LBPP-Cos. We include the baseline kernel smoothing with edge correction (KS+EC) method (Diggle, 1985; Lloyd et al., 2015). All\ninference is performed with maximum marginal likelihood, except for KS+EC where we maximise the leave one out metric described in (Lloyd et al., 2015)."
  }, {
    "heading": "6.2. 1D Toy Examples",
    "text": "We drew five toy intensities, λ0, λ2, . . . , λ4 as 12f 2 where f was sampled from the GP of Gaussian covariance (defined above) with γ = 5 and β = 0.5. Figure 1 depicts λ0 — see the caption for a description. The remaining test functions are shown in figure 6 of the supplementary material."
  }, {
    "heading": "6.2.1. MODEL SELECTION",
    "text": "As the marginal likelihood log p(X|Ω, k) is a key advantage of our method over the non-probabilistic approach of Flaxman et al. (2017), we investigated its efficacy for model selection. Figure 3 plots log p(X|Ω, k) against our two error metrics, both rescaled to [0, 1] for effective visualisation, based on a single training sample per test function. We observe a strong relationship, with larger values of log p(X|Ω, k) generally corresponding to lower error. This demonstrates the practical utility of both the marginal likelihood itself, and our Laplace approximation to it."
  }, {
    "heading": "6.2.2. EVALUATION",
    "text": "We sampled 100 training sets from each of our five toy functions. Figure 4 shows our evaluation metrics along with the fitting time as a function of the number of basis functions. For visualisation all metrics (including fit time) are scaled to [0, 1] by dividing by the maximum for the given test function, over data replicates and algorithms. LBBP-G and and VBPP achieve the best performance, but our LBPP-G is two orders of magnitude faster. Our KS+EC implementation follows the methodology of Lloyd et al. (2015): we fit the kernel density bandwidth using average leave one out log likelihood. This involves a quadratic number of log p.d.f. of the truncated normal calculations,\nand log-sum-exp calculations, both of which involve large time constants, but are asymptotically superior to the other methods we considered. LBBP-Cos is slightly inferior in terms of expected test log likelihood, which is expected due to the toy functions having been sampled according to the same Gaussian kernel of LBPP-G and VBPP (as well as the density estimator of KS+EC)."
  }, {
    "heading": "6.3. Real Data",
    "text": "We compared the methods on three real world datasets,\n• coal: 190 points in one temporal dimension, indicating the time of fatal coal mining accidents in the United Kingdom, from 1851 to 1962 (Collins, 2013);\n• redwood: 195 California redwood tree locations from a square sampling region (Ripley, 1977);\n• cav: 138 caveolae locations from a square sampling region of muscle fiber (Davison & Hinkley, 2013)."
  }, {
    "heading": "6.4. Computational Speed",
    "text": "Similarly to subsubsection 6.2.2 we evaluate the fitting speed and statistical performance vs. number of basis functions — see figure 5. We omit the `2 error as the ground truth is unknown. Instead we generate 100 test problems by each time randomly assigning each original datum to either the training or the testing set with equal probability. Again we observe similar predictive performance of LBPP and VBPP, but with much faster fit times for our LBPP. Interestingly LBPP-Cos slightly outperform LBPP-G."
  }, {
    "heading": "6.5. 2D California Redwood Dataset",
    "text": "We conclude by further investigating the redwood dataset. Once again we employed the ML-II procedure to determine a and b, fixing m = 2, for the covariance function of subsection 5.1, using the lowest 32 cosine frequencies in each\ndimension for a total of N = 322 basis functions in the expansion (16). For ease of visualisation we also fixed a = b.\nFigure 2 plots the results, including a decomposition of the log marginal likelihood log p(X|Ω, k) and a visualisation of the predictive mean. The mean function strongly resembles the result presented by Adams et al. (2009), where computationally expensive MCMC was employed.\nThe decomposition of the marginal likelihood on the left of figure 2 provides insight into the role of the individual terms in (12) and (13) which make up log p(X|Ω, k). In particular, the term V(k,Ω, µ) from (13) acts as a regulariser, guarding against over-fitting, and balancing against the data term h of (12)."
  }, {
    "heading": "7. Conclusion",
    "text": "We have discussed the permanental process, which places a Gaussian Process prior over the square root of the inten-\nsity function of the Poisson process, and derived the equations required for empirical Bayes under a Laplace posterior approximation. Our analysis provides 1) an alternative derivation and probabilistic generalization of (Flaxman et al., 2017), and 2) an efficient and easier to implement alternative which does not rely on inducing inputs (but rather reproducing kernel Hilbert space theory), to the related Bayesian approach of Lloyd et al. (2015). This further demonstrates, in a new way, the mathematical convenience and practical utility of the permanental process formulation (in comparison with say log Gaussian Cox processes)."
  }, {
    "heading": "Acknowledgements",
    "text": "Thanks to Young Lee, Kar Wai Lim and Cheng Soon Ong for useful discussions. Adrian is supported by the Australian Research Council (ARC) via a Discovery Early Career Researcher Award (DE-120102873)."
  }],
  "year": 2017,
  "references": [{
    "title": "Tractable nonparametric Bayesian inference in Poisson processes with gaussian process intensities",
    "authors": ["Adams", "Ryan P", "Murray", "Iain", "MacKay", "David J. C"],
    "year": 2009
  }, {
    "title": "Spatial point processes and their applications",
    "authors": ["Baddeley", "Adrian"],
    "venue": "Lecture Notes in Mathematics: Stochastic Geometry,",
    "year": 2007
  }, {
    "title": "The Inside-Outside Algorithm",
    "authors": ["Collins", "Michael"],
    "venue": "Columbia University Lecture Notes,",
    "year": 2013
  }, {
    "title": "Financial modelling with jump processes",
    "authors": ["Cont", "Rama", "Tankov", "Peter"],
    "venue": "Financial mathematics series. Chapman and Hall/CRC,",
    "year": 2004
  }, {
    "title": "Fast Gaussian Process Methods for Point Process Intensity Estimation",
    "authors": ["J.P. Cunningham", "K.V. Shenoy", "M. Sahani"],
    "venue": "In Proceedings of the 25th International Conference on Machine Learning (ICML),",
    "year": 2008
  }, {
    "title": "Bootstrap Methods and Their Application",
    "authors": ["A.C. Davison", "D.V. Hinkley"],
    "year": 2013
  }, {
    "title": "A kernel method for smoothing point process data",
    "authors": ["Diggle", "Peter"],
    "venue": "Applied Statistics,",
    "year": 1985
  }, {
    "title": "Spatial and spatio-temporal log-Gaussian Cox processes: Extending the geostatistical paradigm",
    "authors": ["P.J. Diggle", "P. Moraga", "B. Rowlingson", "B.M. Taylor"],
    "venue": "Statistical Science,",
    "year": 2013
  }, {
    "title": "Fast Kronecker Inference in Gaussian Processes with non-Gaussian Likelihoods",
    "authors": ["S. Flaxman", "A.G. Wilson", "D.B. Neill", "H. Nickisch", "A.J. Smola"],
    "venue": "In Proceedings of the 32nd International Conference on Machine Learning (ICML),",
    "year": 2015
  }, {
    "title": "A toolbox for fitting complex spatial point process models using integrated nested Laplace approximation (INLA)",
    "authors": ["J.B. Illian", "S.H. Sørbye", "H. Rue"],
    "venue": "The Annals of Applied Statistics,",
    "year": 2012
  }, {
    "title": "Some results on Tchebycheffian spline functions",
    "authors": ["G. Kimeldorf", "G. Wahba"],
    "venue": "Journal of Mathematical Analysis and Appl.,",
    "year": 1971
  }, {
    "title": "Scalable nonparametric bayesian inference on point processes with gaussian processes",
    "authors": ["Kom Samo", "Y.-L", "S. Roberts"],
    "venue": "In Proceedings of the 32nd International Conference on Machine Learning (ICML),",
    "year": 2015
  }, {
    "title": "Simulation of nonhomogeneous Poisson processes by thinning",
    "authors": ["P.A.W. Lewis", "G.S. Shedler"],
    "venue": "Naval Res. Logistics Quart,",
    "year": 1979
  }, {
    "title": "Latent point process allocation",
    "authors": ["Lloyd", "Chris M", "Gunter", "Tom", "Osborne", "Michael A", "Roberts", "Stephen J", "Nickson"],
    "venue": "In Proceedings of the 19th International Conference on Artificial Intelligence and Statistics,",
    "year": 2016
  }, {
    "title": "Variational inference for gaussian process modulated poisson processes",
    "authors": ["C.M. Lloyd", "T. Gunter", "M.A. Osborne", "S.J. Roberts"],
    "venue": "In Proceedings of the 32nd International Conference on Machine Learning (ICML),",
    "year": 2015
  }, {
    "title": "Text Classification using String Kernels",
    "authors": ["Lodhi", "Huma", "Saunders", "Craig", "Shawe-Taylor", "John", "Cristianini", "Nello", "Watkins", "Chris"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2002
  }, {
    "title": "The permanental process",
    "authors": ["McCullagh", "Peter", "Møller", "Jesper"],
    "venue": "Advances in Applied Probability,",
    "year": 2006
  }, {
    "title": "Functions of positive and negative type, and their connection with the theory of integral equations",
    "authors": ["J. Mercer"],
    "venue": "Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences,",
    "year": 1909
  }, {
    "title": "Log gaussian cox processes",
    "authors": ["J Møller", "A Syversveen", "R. Waagepetersen"],
    "venue": "Scandanavian Journal of Statistics,",
    "year": 1998
  }, {
    "title": "Über die praktische auflösung von linearen integralgleichungen mit anwendungen auf randwertaufgaben der potentialtheorie",
    "authors": ["Nyström", "Evert Johannes"],
    "venue": "Commentationes physico-mathematicae,",
    "year": 1928
  }, {
    "title": "Gaussian Processes for Machine Learning. Adaptive Computation and Machine Learning",
    "authors": ["C.E. Rasmussen", "Williams", "C.K.I"],
    "year": 2006
  }, {
    "title": "Asymptotic properties of estimators for the parameters of spatial inhomogeneous poisson point processes",
    "authors": ["Rathbun", "Stephen L", "Cressie", "Noel"],
    "venue": "Advances in Applied Probability,",
    "year": 1994
  }, {
    "title": "Modeling Spatial Patterns",
    "authors": ["B.D. Ripley"],
    "venue": "Journal of the Royal Statistical Society Series B Statistical Methodolology,",
    "year": 1977
  }, {
    "title": "Approximate bayesian inference for latent gaussian models by using integrated nested laplace approximations",
    "authors": ["Rue", "Håvard", "Martino", "Sara", "Chopin", "Nicolas"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2009
  }, {
    "title": "A generalized representer theorem",
    "authors": ["Schölkopf", "Bernhard", "Herbrich", "Ralf", "Smola", "Alex J"],
    "venue": "In Proc. of the 14th Annual Conf. on Computational Learning Theory,",
    "year": 2001
  }, {
    "title": "Random point fields associated with certain fredholm determinants ii: Fermion shifts and their ergodic and gibbs properties",
    "authors": ["Shirai", "Tomoyuki", "Takahashi", "Yoichiro"],
    "venue": "Ann. Probab., 31(3):1533–1564,",
    "year": 2003
  }, {
    "title": "Understanding Gaussian Process Regression Using the Equivalent Kernel, pp. 211–228",
    "authors": ["Sollich", "Peter", "Williams", "Christopher K. I"],
    "year": 2005
  }, {
    "title": "Partial differential equations in physics. Pure and applied mathematics",
    "authors": ["Sommerfeld", "Arnold", "Straus", "Ernst Gabor"],
    "year": 1949
  }, {
    "title": "Computing a family of reproducing kernels for statistical applications",
    "authors": ["Thomas-Agnan", "Christine"],
    "venue": "Numerical Algorithms,",
    "year": 1996
  }, {
    "title": "Variational learning of inducing variables in sparse gaussian processes",
    "authors": ["Titsias", "Michalis K"],
    "venue": "Artificial Intelligence and Statistics",
    "year": 2009
  }, {
    "title": "Spline Models for Observational Data",
    "authors": ["G. Wahba"],
    "venue": "Series in Applied Math.,",
    "year": 1990
  }],
  "id": "SP:5ec110420e5e2afcd2714334305a0707a98485d4",
  "authors": [{
    "name": "Christian J. Walder",
    "affiliations": []
  }, {
    "name": "Adrian N. Bishop",
    "affiliations": []
  }],
  "abstractText": "The Cox process is a stochastic process which generalises the Poisson process by letting the underlying intensity function itself be a stochastic process. In this paper we present a fast Bayesian inference scheme for the permanental process, a Cox process under which the square root of the intensity is a Gaussian process. In particular we exploit connections with reproducing kernel Hilbert spaces, to derive efficient approximate Bayesian inference algorithms based on the Laplace approximation to the predictive distribution and marginal likelihood. We obtain a simple algorithm which we apply to toy and real-world problems, obtaining orders of magnitude speed improvements over previous work.",
  "title": "Fast Bayesian Intensity Estimation for the Permanental Process"
}