{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 2727–2736 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n2727"
  }, {
    "heading": "1 Introduction",
    "text": "Computational psycholinguistics has “always been...the thing that computational linguistics stood the greatest chance of providing to humanity” (Kay, 2005). Within this broad area, cognitively-plausible parsing models are of particular interest. They are mechanistic computational models that, at some level, do the same task people do in the course of ordinary language comprehension. As such, they offer a way to gain insight into the operation of the human sentence processing mechanism (for a review see Hale, 2017).\nAs Keller (2010) suggests, a promising place to look for such insights is at the intersection of (a) incremental processing, (b) broad coverage, and (c) neural signals from the human brain.\nThe contribution of the present paper is situated precisely at this intersection. It combines a probabilistic generative grammar (RNNG; Dyer et al., 2016) with a parsing procedure that uses this grammar to manage a collection of syntactic derivations as it advances from one word to the next (Stern et al., 2017, cf. Roark, 2004). Via well-known complexity metrics, the intermediate states of this procedure yield quantitative predictions about language comprehension difficulty. Juxtaposing these predictions against data from human encephalography (EEG), we find that they reliably derive several amplitude effects including the P600, which is known to be associated with syntactic processing (e.g. Osterhout and Holcomb, 1992).\nComparison with language models based on long short term memory networks (LSTM, e.g. Hochreiter and Schmidhuber, 1997; Mikolov, 2012; Graves, 2012) shows that these effects are specific to the RNNG. A further analysis pinpoints one of these effects to RNNGs’ syntactic composition mechanism. These positive findings reframe earlier null results regarding the syntaxsensitivity of human processing (Frank et al., 2015). They extend work with eyetracking (e.g. Roark et al., 2009; Demberg et al., 2013) and neuroimaging (Brennan et al., 2016; Bachrach, 2008) to higher temporal resolution.1 Perhaps most significantly, they establish a general correspondence between a computational model and electrophysiological responses to naturalistic language.\nFollowing this Introduction, section 2 presents recurrent neural network grammars, emphasizing their suitability for incremental parsing. Sections 3 then reviews a previously-proposed\n1Magnetoencephalography also offers high temporal resolution and as such this work fits into a tradition that includes Wehbe et al. (2014), van Schijndel et al. (2015), Wingfield et al. (2017) and Brennan and Pylkkänen (2017).\nbeam search procedure for them. Section 4 goes on to introduce the novel application of this procedure to human data via incremental complexity metrics. Section 5 explains how these theoretical predictions are specifically brought to bear on EEG data using regression. Sections 6 and 7 elaborate on the model comparison mentioned above and report the results in a way that isolates the operative element. Section 8 discusses these results in relation to established computational models. The conclusion, to anticipate section 9, is that syntactic processing can be found in naturalistic speech stimuli if ambiguity resolution is modeled as beam search."
  }, {
    "heading": "2 Recurrent neural network grammars for incremental processing",
    "text": "Recurrent neural network grammars (henceforth: RNNGs Kuncoro et al., 2017; Dyer et al.,\n2016) are probabilistic models that generate trees. The probability of a tree is decomposed via the chain rule in terms of derivational actionprobabilities that are conditioned upon previous actions i.e. they are history-based grammars (Black et al., 1993). In the vanilla version of RNNG, these steps follow a depth-first traversal of the developing phrase structure tree. This entails that daughters are announced bottom-up one by one as they are completed, rather than being predicted at the same time as the mother.\nEach step of this generative story depends on the state of a stack, depicted inside the gray box in Figure 1. This stack is “neuralized” such that each stack entry corresponds to a numerical vector. At each stage of derivation, a single vector summarizing the entire stack is available in the form of the final state of a neural sequence model. This is implemented using the stack LSTMs of Dyer et al. (2015). These stack-summary vectors (central rectangle in Figure 1) allow RNNGs to be sensitive to aspects of the left context that would be masked by independence assumptions in a probabilistic context-free grammar. In the present paper, these stack-summaries serve as input to a multi-layer perceptron whose output is converted via softmax into a categorical distribution over three possible parser actions: open a new constituent, close off the latest constituent, or generate a word. A hard decision is made, and if the first or last option is selected, then the same vector-valued stack–summary is again used, via multilayer perceptrons, to decide which specific nonterminal to open, or which specific word to generate.\nPhrase-closing actions trigger a syntactic composition function (depicted in Figure 2) which\nsqueezes a sequence of subtree vectors into one single vector. This happens by applying a bidirectional LSTM to the list of daughter vectors, prepended with the vector for the mother category following §4.1 of Dyer et al. (2016).\nThe parameters of all these components are adaptively adjusted using backpropagation at training time, minimizing the cross entropy relative to a corpus of trees. At testing time, we parse incrementally using beam search as described below in section 3."
  }, {
    "heading": "3 Word-synchronous beam search",
    "text": "Beam search is one way of addressing the search problem that arises with generative grammars — constructive accounts of language that are sometimes said to “strongly generate” sentences. Strong generation in this sense simply means that they derive both an observable word-string as well as a hidden tree structure. Probabilistic grammars are joint models of these two aspects. By contrast, parsers are programs intended to infer a good tree from a given word-string. In incremental parsing with history-based models this inference task is particularly challenging, because a decision that looks wise at one point may end up looking foolish in light of future words. Beam search addresses this challenge by retaining a collection called the “beam” of parser states at each word. These states are rated by a score that is related to the probability of a partial derivation, allowing an incremental parser to hedge its bets against temporary ambiguity. If the score of one analysis suddenly plummets after seeing some word, there may still be others within the beam that are not so drastically affected. This idea of ranked parallelism has become central in psycholinguistic modeling (see e.g. Gibson, 1991; Narayanan and Jurafsky, 1998; Boston et al., 2011).\nAs Stern et al. (2017) observe, the most straightforward application of beam search to generative models like RNNG does not perform well. This is because lexical actions, which advance the analysis onwards to successive words, are assigned such low probabilities compared to structural actions which do not advance to the next word. This imbalance is inevitable in a probability model that strongly generates sentences, and it causes naive beam-searchers to get bogged down, proposing more and more phrase structure rather than moving on through the\nsentence. To address it, Stern et al. (2017) propose a word-synchronous variant of beam search. This variant keeps searching through structural actions until “enough” high-scoring parser states finally take a lexical action, arriving in synchrony at the next word of the sentence. Their procedure is written out as Algorithm 1.\nAlgorithm 1 Word-synchronous beam search with fast-tracking. After Stern et al. (2017)\n1: thisword← input beam 2: nextword← ∅ 3: while |nextword| < k do 4: fringe← successors of all states\ns ∈ thisword via any parsing action\n5: prune fringe to top k 6: thisword← ∅ 7: for each parser state s ∈ fringe do 8: if s came via a lexical action then 9: add s to nextword\n10: else . must have been structural 11: add s to thisword 12: end if 13: end for 14: end while 15: return nextword pruned to top kword k\nIn Algorithm 1 the beam is held in a set-valued variable called nextword. Beam search continues until this set’s cardinality exceeds the designated action beam size, k. If the beam still isn’t large enough (line 3) then the search process explores one more action by going around the while-loop again. Each time through the loop, lexical actions compete against structural actions for a place among the top k (line 5). The imbalance mentioned above makes this competition fierce, and on many loop iterations nextword may not grow by much. Once there are enough parser states, another threshold called the word beam kword kicks in (line 15). This other threshold sets the number of analyses that are handed off to the next invocation of the algorithm. In the study reported here the word beam remains at the default setting suggested by Stern and colleagues, k/10.\nStern et al. (2017) go on to offer a modification of the basic procedure called “fast tracking” which improves performance, particularly when the action beam k is small. Under fast tracking, an additional step is added between lines 4 and 5 of\nAlgorithm 1 such that some small number kft of parser states are promoted directly into nextword. These states are required to come via a lexical action, but in the absence of fast tracking they quite possibly would have failed the thresholding step in line 5.\nTable 1 shows Penn Treebank accuracies for this word-synchronous beam search procedure, as applied to RNNG. As expected, accuracy goes up as the parser considers more and more analyses. Above k = 200, the RNNG+beam search combination outperforms a conditional model based on greedy decoding (88.9). This demonstration reemphasizes the point, made by Brants and Crocker (2000) among others, that cognitively-plausible incremental processing can be achieved without loss of parsing performance."
  }, {
    "heading": "4 Complexity metrics",
    "text": "In order to relate computational models to measured human responses, some sort of auxiliary hypothesis or linking rule is required. In the domain of language, these are traditionally referred to as complexity metrics because of the way they quantify the “processing complexity” of particular sentences. When a metric offers a prediction on each successive word, it is an incremental complexity metric.\nTable 2 characterizes four incremental complexity metrics that are all obtained from intermediate states of Algorithm 1. The metric denoted DISTANCE is the most classic; it is inspired by the count of “transitions made or attempted” in Kaplan (1972). It quantifies syntactic work by counting the number of parser actions explored by Algorithm 1 between each word i.e. the number of times around the while-loop on line 3. The information theoretical quantities SURPRISAL and ENTROPY came into more widespread use later.\nThey quantify unexpectedness and uncertainty, respectively, about alternative syntactic analyses at a given point within a sentence. Hale (2016) reviews their applicability across many different languages, psycholinguistic measurement techniques and grammatical models. Recent work proposes possible relationships between these two metrics, at the empirical as well as theoretical level (van Schijndel and Schuler, 2017; Cho et al., 2018).\nThe SURPRISAL metric was computed over the word beam i.e. the kword highest-scoring partial syntactic analyses at each successive word. In an attempt to obtain a more faithful estimate, ENTROPY and its first-difference are computed over nextword itself, whose size varies but is typically much larger than kword."
  }, {
    "heading": "5 Regression models of naturalistic EEG",
    "text": "Electroencephalography (EEG) is an experimental technique that measures very small voltage fluctuations on the scalp. For a review emphasizing its implications vis-á-vis computational models, see Murphy et al. (2018).\nWe analyzed EEG recordings from 33 participants as they passively listened to a\nspoken recitation of the first chapter of Alice’s Adventures in Wonderland.2 This auditory stimulus was delivered via earphones in an isolated booth. All participants scored significantly better than chance on a post-session 8-question comprehension quiz. An additional ten datasets were excluded for not meeting this behavioral criterion, six due to excessive noise, and three due to experimenter error. All participants provided written informed consent under the oversight of the University of Michigan HSBS Institutional Review Board (#HUM00081060) and were compensated $15/h.3\nData were recorded at 500 Hz from 61 active electrodes (impedences < 25 kΩ) and divided into 2129 epochs, spanning -0.3–1 s around the onset of each word in the story. Ocular artifacts were removed using ICA, and remaining epochs with excessive noise were excluded. The data were filtered from 0.5–40 Hz, baseline corrected against a 100 ms pre-word interval, and separated into epochs for content words and epochs for function words because of interactions between parsing variables of interest and word-class (Roark et al., 2009).\nLinear regression was used per-participant, at each time-point and electrode, to identify content-word EEG amplitudes that correlate with complexity metrics derived from the RNNG+beam search combination via the complexity metrics in Table 2. We refer to these time series as Target predictors.\nEach Target predictor was included in its own model, along with several Control predictors that are known to influence sentence processing: sentence order, word-order in sentence, log word frequency (Lund and Burgess, 1996), frequency of the previous and subsequent word, and acoustic sound power averaged over the first 50 ms of the epoch.\nAll predictors were mean-centered. We also constructed null regression models in which the rows of the design matrix were randomly permuted.4 β coefficients for each effect were tested against these null models at the group level across\n2https://tinyurl.com/alicedata 3A separate analysis of these data appears in Brennan and Hale (2018); datasets are available from JRB. 4Temporal auto-correlation across epochs could impact model fits. Content-words are spaced 1 s apart on average and a spot-check of the residuals from these linear models indicates that they do not show temporal auto-correlation: AR(1) < 0.1 across subjects, time-points, and electrodes.\nall electrodes from 0–1 seconds post-onset, using a non-parametric cluster-based permutation test to correct for multiple comparisons across electrodes and time-points (Maris and Oostenveld, 2007)."
  }, {
    "heading": "6 Language models for literary stimuli",
    "text": "We compare the fit against EEG data for models that are trained on the same amount of textual data but differ in the explicitness of their syntactic representations.\nAt the low end of this scale is the LSTM language model. Models of this type treat sentences as a sequence of words, leaving it up to backpropagation to decide whether or not to encode syntactic properties in a learned history vector (Linzen et al., 2016). We use SURPRISAL from the LSTM as a baseline.\nRNNGs are higher on this scale because they explicitly build a phrase structure tree using a symbolic stack. We consider as well a degraded version, RNNG−comp which lacks the composition mechanism shown in Figure 2. This degraded version replaces the stack with initial substrings of bracket expressions, following Choe and Charniak (2016); Vinyals et al. (2015). An example would be the length 7 string shown below\n(S (NP the hungry cat )NP (VP\nHere, vertical lines separate symbols whose vector encoding would be considered separately by RNNG−comp. In this degraded representation, the noun phrase is not composed explicitly. It takes up five symbols rather than one. The balanced parentheses (NP and )NP are rather like instructions for some subsequent agent who might later perform the kind of syntactic composition that occurs online in RNNGs, albeit in an implicit manner.\nIn all cases, these language models were trained on chapters 2–12 of Alice’s Adventures in Wonderland. This comprises 24941 words. The stimulus that participants saw during EEG data collection, for which the metrics in Table 2 are calculated, was chapter 1 of the same book, comprising 2169 words.\nRNNGs were trained to match the output trees provided by the Stanford parser (Klein and Manning, 2003). These trees conform to the Penn Treebank annotation standard but do not explicitly mark long-distance dependency or include any empty categories. They seem to adequately represent basic syntactic properties such\nas clausal embedding and direct objecthood; nevertheless we did not undertake any manual correction.\nDuring RNNG training, the first chapter was used as a development set, proceeding until the per-word perplexity over all parser actions on this set reached a minimum, 180. This performance was obtained with a RNNG whose state vector was 170 units wide. The corresponding LSTM language model state vector had 256 units; it reached a per-word perplexity of 90.2. Of course the RNNG estimates the joint probability of both trees and words, so these two perplexity levels are not directly comparable. Hyperparameter settings were determined by grid search in a region near the one which yielded good performance on the Penn Treebank benchmark reported on Table 1."
  }, {
    "heading": "7 Results",
    "text": "To explore the suitability of the RNNG + beam search combination as a cognitive model of language processing difficulty, we fitted regression models as described above in section 5 for each of the metrics in Table 2. We considered six beam sizes k = {100, 200, 400, 600, 800, 1000}. Table 3 summarizes statistical significance levels reached by these Target predictors; no other combinations reached statistical significance."
  }, {
    "heading": "7.1 Whole-Head analysis",
    "text": "Surprisal from the LSTM sequence model did not reliably predict EEG amplitude at any timepoint or electrode. The DISTANCE predictor did derive a central positivity around 600 ms post-word onset as shown in Figure 3a. SURPRISAL predicted an\nearly frontal positivity around 250 ms, shown in Figure 3b. ENTROPY and ENTROPY ∆ seemed to drive effects that were similarly early and frontal, although negative-going (not depicted); the effect for ENTROPY ∆ localized to just the left side."
  }, {
    "heading": "7.2 Region of Interest analysis",
    "text": "We compared RNNG to its degraded cousin, RNNG−comp, in three regions of interest shown in Figure 4. These regions are defined by a selection of electrodes and a time window whose zero-point corresponds to the onset of the spoken word in the naturalistic speech stimulus. Regions “N400” and “P600” are well-known in EEG research, while “ANT” is motivated by findings with a PCFG baseline reported by Brennan and Hale (2018).\nSingle-trial data were averaged across electrodes and time-points within each region and fit with a linear mixed-effects model with fixed effects as described below and random intercepts by-subjects (Alday et al., 2017). We used a stepwise likelihood-ratio test to evaluate whether individual Target predictors from the RNNG significantly improved over RNNG−comp, and whether a RNNG−comp model significantly improve a baseline regression model. The baseline regression model, denoted ∅, contains the Control predictors described in section 5 and SURPRISAL from the LSTM sequence model. Targets represent each of the eight reliable whole-head effects detailed in Table 3. These 24 tests (eight effects by three regions) motivate a Bonferroni correction of α = 0.002 = 0.05/24.\nStatistically significant results obtained for DISTANCE from RNNG−comp in the P600 region and for SURPRISAL for RNNG in the ANT region. No significant results were observed in the N400 region. These results are detailed in Table 4."
  }, {
    "heading": "8 Discussion",
    "text": "Since beam search explores analyses in descending order of probability, DISTANCE and SURPRISAL ought to be yoked, and indeed they are correlated at r = 0.33 or greater across all of the beam sizes k that we considered in this study. However they are reliably associated with different EEG effects. SURPRISAL manifests at anterior electrodes relatively early. This seems to be a different effect from that observed by Frank et al. (2015). Frank and colleagues relate N400 ampli-\ntude to word surprisals from an Elman-net, analogous to the LSTM sequence model evaluated in this work. Their study found no effects of syntax-based predictors over and above sequential ones. In particular, no effects emerged in the 500–700 ms window, where one might have expected a P600. The present results, by contrast, show that an explicitly syntactic model can derive the P600 quite generally via DISTANCE. The absence of an N400 effect in this analysis could be attributable to the choice of electrodes, or perhaps the modality of the stimulus narrative, i.e. spoken versus read.\nThe model comparisons in Table 4 indicate that the early peak, but not the later one, is attributable\nto the RNNG’s composition function. Choe and Charniak’s (2016) “parsing as language modeling” scheme potentially could explain the P600like wave, but it would not account for the earlier peak. This earlier peak is the one derived by the RNNG under SURPRISAL, but only when the RNNG includes the composition mechanism depicted in Figure 2.\nThis pattern of results suggests an approach to the overall modeling task. In this approach, both grammar and processing strategy remain the same, and alternative complexity metrics, such as SURPRISAL and DISTANCE, serve to interpret the unified model at different times or places within the brain. This inverts the approach of Brouwer et al. (2017) and Wehbe et al. (2014) who interpret different layers of the same neural net using the same complexity metric."
  }, {
    "heading": "9 Conclusion",
    "text": "Recurrent neural net grammars indeed learn something about natural language syntax, and what they learn corresponds to indices of human language processing difficulty that are manifested in electroencephalography. This correspondence, between computational model and human electrophysiological response, follows from a system that lacks an initial stage of purely stringbased processing. Previous work was “two-stage” in the sense that the generative model served to\nrerank proposals from a conditional model (Dyer et al., 2016). If this one-stage model is cognitively plausible, then its simplicity undercuts arguments for string-based perceptual strategies such as the Noun-Verb-Noun heuristic (for a textbook presentation see Townsend and Bever, 2001). Perhaps, as Phillips (2013) suggests, these are unnecessary in an adequate cognitive model. Certainly, the road is now open for more fine-grained investigations of the order and timing of individual parsing operations within the human sentence processing mechanism."
  }, {
    "heading": "Acknowledgments",
    "text": "This material is based upon work supported by the National Science Foundation under Grants No. 1607441 and No. 1607251. We thank Max Cantor and Rachel Eby for helping with data collection."
  }],
  "year": 2018,
  "references": [{
    "title": "Electrophysiology reveals the neural dynamics of naturalistic auditory language processing: event-related potentials reflect continuous model updates",
    "authors": ["Phillip M. Alday", "Matthias Schlesewsky", "Ina Bornkessel-Schlesewsky."],
    "venue": "eNeuro, 4(6).",
    "year": 2017
  }, {
    "title": "Imaging neural correlates of syntactic complexity in a naturalistic context",
    "authors": ["Asaf Bachrach."],
    "venue": "Ph.D. thesis, MIT.",
    "year": 2008
  }, {
    "title": "Parallel processing and sentence comprehension difficulty",
    "authors": ["Marisa Ferrara Boston", "John T. Hale", "Shravan Vasishth", "Reinhold Kliegl."],
    "venue": "Language and Cognitive Processes, 26(3):301–349.",
    "year": 2011
  }, {
    "title": "Probabilistic parsing and psychological plausibility",
    "authors": ["Thorsten Brants", "Matthew Crocker."],
    "venue": "Proceedings of 18th International Conference on Computational Linguistics COLING-2000, Saarbrücken/Luxembourg/Nancy.",
    "year": 2000
  }, {
    "title": "Hierarchical structure guides rapid linguistic predictions during naturalistic listening",
    "authors": ["Jonathan R. Brennan", "John T. Hale."],
    "venue": "Forthcoming.",
    "year": 2018
  }, {
    "title": "MEG evidence for incremental sentence composition in the anterior temporal lobe",
    "authors": ["Jonathan R. Brennan", "Liina Pylkkänen."],
    "venue": "Cognitive Science, 41(S6):1515–1531.",
    "year": 2017
  }, {
    "title": "Abstract linguistic structure correlates with temporal activity during naturalistic comprehension",
    "authors": ["Jonathan R. Brennan", "Edward P. Stabler", "Sarah E. Van Wagenen", "Wen-Ming Luh", "John T. Hale."],
    "venue": "Brain and Language, 157-158:81–94.",
    "year": 2016
  }, {
    "title": "A neurocomputational model of the N400 and the P600 in language processing",
    "authors": ["Harm Brouwer", "Matthew W. Crocker", "Noortje J. Venhuizen", "John C.J. Hoeks."],
    "venue": "Cognitive Science, 41:1318–1352.",
    "year": 2017
  }, {
    "title": "Dynamic encoding of structural uncertainty in gradient symbols",
    "authors": ["Pyeong Whan Cho", "Matthew Goldrick", "Richard L. Lewis", "Paul Smolensky."],
    "venue": "In",
    "year": 2018
  }, {
    "title": "Parsing as language modeling",
    "authors": ["Do Kook Choe", "Eugene Charniak."],
    "venue": "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 2331–2336, Austin, Texas.",
    "year": 2016
  }, {
    "title": "Incremental, predictive parsing with psycholinguistically motivated tree-adjoining grammar",
    "authors": ["Vera Demberg", "Frank Keller", "Alexander Koller."],
    "venue": "Computational Linguistics, 39(4):1025–1066.",
    "year": 2013
  }, {
    "title": "Transitionbased dependency parsing with stack long shortterm memory",
    "authors": ["Chris Dyer", "Miguel Ballesteros", "Wang Ling", "Austin Matthews", "Noah A. Smith."],
    "venue": "Proceedings of the 53rd Annual Meeting of the Association for Computational Lin-",
    "year": 2015
  }, {
    "title": "Recurrent neural network grammars",
    "authors": ["Chris Dyer", "Adhiguna Kuncoro", "Miguel Ballesteros", "Noah A. Smith."],
    "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language",
    "year": 2016
  }, {
    "title": "The ERP response to the amount of information conveyed by words in sentences",
    "authors": ["Stefan L. Frank", "Leun J. Otten", "Giulia Galli", "Gabriella Vigliocco."],
    "venue": "Brain and Language, 140:1–11.",
    "year": 2015
  }, {
    "title": "Improving neural parsing by disentangling model combination and reranking effects",
    "authors": ["Daniel Fried", "Mitchell Stern", "Dan Klein."],
    "venue": "Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages",
    "year": 2017
  }, {
    "title": "A Computational Theory of Human Linguistic Processing: Memory Limitations and Processing Breakdown",
    "authors": ["Edward Gibson."],
    "venue": "Ph.D. thesis, Carnegie Mellon University.",
    "year": 1991
  }, {
    "title": "Supervised sequence labelling with recurrent neural networks",
    "authors": ["Alex Graves."],
    "venue": "Springer.",
    "year": 2012
  }, {
    "title": "Information-theoretical complexity metrics",
    "authors": ["John Hale."],
    "venue": "Language and Linguistics Compass, 10(9):397–412.",
    "year": 2016
  }, {
    "title": "Models of human sentence comprehension in computational psycholinguistics",
    "authors": ["John Hale."],
    "venue": "Mark Aronoff, editor, Oxford Research Encyclopedia of Linguistics. Oxford University Press.",
    "year": 2017
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural Computation, 9(8):1735–1780.",
    "year": 1997
  }, {
    "title": "Augmented transition networks as psychological models of sentence comprehension",
    "authors": ["Ronald M. Kaplan."],
    "venue": "Artificial Intelligence, 3:77–100.",
    "year": 1972
  }, {
    "title": "ACL lifetime achievement award: A life of language",
    "authors": ["Martin Kay."],
    "venue": "Computational Linguistics, 31(4).",
    "year": 2005
  }, {
    "title": "Cognitively plausible models of human language processing",
    "authors": ["Frank Keller."],
    "venue": "Proceedings of the ACL 2010 Conference Short Papers, pages 60–67.",
    "year": 2010
  }, {
    "title": "Accurate unlexicalized parsing",
    "authors": ["Dan Klein", "Christopher D. Manning."],
    "venue": "Proceedings of the 41st Annual Meeting of the Association for Computational Linguistics, pages 423–430, Sapporo, Japan.",
    "year": 2003
  }, {
    "title": "What do recurrent neural network grammars learn about syntax",
    "authors": ["Adhiguna Kuncoro", "Miguel Ballesteros", "Lingpeng Kong", "Chris Dyer", "Graham Neubig", "Noah A. Smith"],
    "venue": "In Proceedings of the 15th Conference of the European Chapter",
    "year": 2017
  }, {
    "title": "Assessing the ability of LSTMs to learn syntax-sensitive dependencies",
    "authors": ["Tal Linzen", "Emmanuel Dupoux", "Yoav Goldberg."],
    "venue": "Transactions of the Association for Computational Linguistics, 4:521– 535.",
    "year": 2016
  }, {
    "title": "Producing high-dimensional semantic spaces from lexical cooccurrence",
    "authors": ["Kevin Lund", "Curt Burgess."],
    "venue": "Behavior Research Methods, Instruments, & Computers, 28(2):203–208.",
    "year": 1996
  }, {
    "title": "Nonparametric statistical testing of EEG- and MEG-data",
    "authors": ["Eric Maris", "Robert Oostenveld."],
    "venue": "Journal of Neuroscience Methods, 164(1):177–190.",
    "year": 2007
  }, {
    "title": "Statistical Language Models Based on Neural Networks",
    "authors": ["Tomáš Mikolov."],
    "venue": "Ph.D. thesis, Brno University of Technology.",
    "year": 2012
  }, {
    "title": "Decoding language from the brain",
    "authors": ["Brian Murphy", "Leila Wehbe", "Alona Fyshe."],
    "venue": "Thierry Poibeau and Aline Editors Villavicencio, editors, Language, Cognition, and Computational Models, pages 53–80. Cambridge University Press.",
    "year": 2018
  }, {
    "title": "Bayesian models of human sentence processing",
    "authors": ["Srini Narayanan", "Daniel Jurafsky."],
    "venue": "Proceedings of the 20th Annual Conference of the Cognitive Science Society, University of Wisconsin-Madson.",
    "year": 1998
  }, {
    "title": "Eventrelated brain potentials elicited by syntactic anomaly",
    "authors": ["Lee Osterhout", "Phillip J. Holcomb."],
    "venue": "Journal of Memory and Language, 31:785–806.",
    "year": 1992
  }, {
    "title": "Parser & grammar relations: We don’t understand everything twice",
    "authors": ["Colin Phillips."],
    "venue": "Montserrat Sanz, Itziar Laka, and Michael K. Tanenhaus, editors, Language Down the Garden Path: The Cognitive and Biological Basis of Linguistic Structures,",
    "year": 2013
  }, {
    "title": "Robust garden path parsing",
    "authors": ["Brian Roark."],
    "venue": "Natural Language Engineering, 10(1):1–24.",
    "year": 2004
  }, {
    "title": "Deriving lexical and syntactic expectation-based measures for psycholinguistic modeling via incremental top-down parsing",
    "authors": ["Brian Roark", "Asaf Bachrach", "Carlos Cardenas", "Christophe Pallier."],
    "venue": "Proceedings of the 2009 Conference on Empiri-",
    "year": 2009
  }, {
    "title": "Evidence of syntactic working memory usage in MEG data",
    "authors": ["Marten van Schijndel", "Brian Murphy", "William Schuler."],
    "venue": "Proceedings of CMCL 2015, Denver, Colorado, USA.",
    "year": 2015
  }, {
    "title": "Approximations of predictive entropy correlate with reading times",
    "authors": ["Marten van Schijndel", "William Schuler."],
    "venue": "Proceedings of CogSci 2017, London, UK. Cognitive Science Society.",
    "year": 2017
  }, {
    "title": "Effective inference for generative neural parsing",
    "authors": ["Mitchell Stern", "Daniel Fried", "Dan Klein."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, pages 1695–1700, Copenhagen, Denmark.",
    "year": 2017
  }, {
    "title": "Sentence comprehension : the integration of habits and rules",
    "authors": ["David J. Townsend", "Thomas G. Bever."],
    "venue": "MIT Press.",
    "year": 2001
  }, {
    "title": "Grammar as a foreign language",
    "authors": ["Oriol Vinyals", "Łukasz Kaiser", "Terry Koo", "Slav Petrov", "Ilya Sutskever", "Geoffrey Hinton."],
    "venue": "Advances in Neural Information Processing Systems, pages 2773–2781.",
    "year": 2015
  }, {
    "title": "Aligning context-based statistical models of language with brain activity during reading",
    "authors": ["Leila Wehbe", "Ashish Vaswani", "Kevin Knight", "Tom Mitchell."],
    "venue": "Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing",
    "year": 2014
  }, {
    "title": "Relating dynamic brain states to dynamic machine states: Human and machine solutions to the speech recognition",
    "authors": ["Cai Wingfield", "Li Su", "Xunying Liu", "Chao Zhang", "Phil Woodland", "Andrew Thwaites", "Elisabeth Fonteneau", "William D. Marslen-Wilson"],
    "year": 2017
  }],
  "id": "SP:374174d1c49e79d1f8830a82ccea55e39ea9cda8",
  "authors": [{
    "name": "John Hale",
    "affiliations": []
  }, {
    "name": "Chris Dyer",
    "affiliations": []
  }, {
    "name": "Adhiguna Kuncoro",
    "affiliations": []
  }, {
    "name": "Jonathan R. Brennan",
    "affiliations": []
  }],
  "abstractText": "Recurrent neural network grammars (RNNGs) are generative models of (tree, string) pairs that rely on neural networks to evaluate derivational choices. Parsing with them using beam search yields a variety of incremental complexity metrics such as word surprisal and parser action count. When used as regressors against human electrophysiological responses to naturalistic text, they derive two amplitude effects: an early peak and a P600-like later peak. By contrast, a non-syntactic neural language model yields no reliable effects. Model comparisons attribute the early peak to syntactic composition within the RNNG. This pattern of results recommends the RNNG+beam search combination as a mechanistic model of the syntactic processing that occurs during normal human language comprehension.",
  "title": "Finding Syntax in Human Encephalography with Beam Search"
}