{
  "sections": [{
    "text": "Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing, pages 1433–1443, Lisbon, Portugal, 17-21 September 2015. c©2015 Association for Computational Linguistics."
  }, {
    "heading": "1 Introduction",
    "text": "Fine-grained opinion mining involves identifying the opinion holder who expresses the opinion, detecting opinion expressions, measuring their intensity and sentiment, and identifying the target or aspect of the opinion (Wiebe et al., 2005). For example, in the sentence “John says, the hard disk is very noisy”, John, the opinion holder, expresses a very negative (i.e., sentiment with intensity) opinion towards the target “hard disk” using the opinionated expression “very noisy”. A number of NLP applications can benefit from fine-grained opinion mining including opinion summarization and opinion-oriented question answering.\nThe tasks in fine-grained opinion mining can be regarded as either a token-level sequence labeling problem or as a semantic compositional task at the sequence (e.g., phrase) level. For example, identifying opinion holders, opinion expressions and opinion targets can be formulated as a token-level sequence tagging problem, where the task is to\nlabel each word in a sentence using the conventional BIO tagging scheme. For example, Table 1 shows a sentence tagged with BIO scheme for opinion target (middle row) and for opinion expression (bottom row) identification tasks. On the other hand, characterizing intensity and sentiment of an opinionated expression can be regarded as a semantic compositional problem, where the task is to aggregate vector representations of tokens in a meaningful way and later use them for sentiment classification (Socher et al., 2013).\nConditional random fields (CRFs) (Lafferty et al., 2001) have been quite successful for different fine-grained opinion mining tasks, e.g., opinion expression extraction (Yang and Cardie, 2012). The state-of-the-art model for opinion target extraction is also based on a CRF (Pontiki et al., 2014). However, the success of CRFs depends heavily on the use of an appropriate feature set and feature function expansion, which often requires a lot of engineering effort for each task in hand.\nAn alternative approach of deep learning automatically learns latent features as distributed vectors and have recently been shown to outperform CRFs on similar tasks. For example, Irsoy and Cardie (2014) apply deep recurrent neural networks (RNNs) to extract opinion expressions from sentences and show that RNNs outperform CRFs. Socher et al. (2013) propose recursive neural networks for a semantic compositional task to identify the sentiments of phrases and sentences hierarchically using the syntactic parse trees.\nMeanwhile, recent advances in word embed-\n1433\nding induction methods (Collobert and Weston, 2008; Mikolov et al., 2013b) have benefited researchers in two ways: (i) they have contributed to significant gains when used as extra word features in existing NLP systems (Turian et al., 2010; Lebret and Lebret, 2013), and (ii) they have enabled more effective training of RNNs by providing compact input representations of the words (Mesnil et al., 2013; Irsoy and Cardie, 2014).\nMotivated by the recent success of deep learning, in this paper we propose a general class of models based on RNN architecture and word embeddings, that can be successfully applied to finegrained opinion mining tasks without any taskspecific feature engineering effort. We experiment with several important RNN architectures including Elman-RNN, Jordan-RNN, long short term memory (LSTM) and their variations. We acquire pre-trained word embeddings from several external sources to give better initialization to our RNN models. The RNN models then fine-tune the word vectors during training to learn task-specific embeddings. We also present an architecture to incorporate other linguistic features into RNNs.\nOur results on the task of opinion target extraction show that word embeddings improve the performance of state-of-the-art CRF models, when included as additional features. They also improve RNNs when used as pre-trained word vectors and fine-tuning them on the task gives the best results. A comparison between models demonstrates that RNNs outperform CRFs, even when they use word embeddings as the only features. Incorporating simple linguistic features into RNNs improves the performance even further. Our best results with LSTM RNN outperform the top performing system on the Laptop dataset and achieve the second best on the Restaurant dataset in SemEval-2014. We make our source code available.1\nIn the remainder of this paper, after discussing related work in Section 2, we present our RNN models in Section 3. In Section 4, we briefly describe the pre-trained word embeddings. The experiments and analysis of results are presented in Section 5. Finally, we summarize our contributions with future directions in Section 6."
  }, {
    "heading": "2 Related Work",
    "text": "A line of previous research in fine-grained opinion mining focused on detecting opinion (subjective)\n1https://github.com/ppfliu/opinion-target\nexpressions, e.g., (Wilson et al., 2005; Breck et al., 2007). The common approach was to formulate the problem as a sequence tagging task and use a CRF model. Later approaches extended this to jointly identify opinion holders (Choi et al., 2005), and intensity and polarity (Choi and Cardie, 2010).\nExtracting aspect terms or opinion targets have been actively investigated in the past. Typical approaches include association mining to find frequent item sets (i.e., co-occurring words) as candidate aspects (Hu and Liu, 2004), classificationbased methods such as hidden Markov model (Jin et al., 2009) and CRF (Shariaty and Moghaddam, 2011; Yang and Cardie, 2012; Yang and Cardie, 2013), as well as topic modeling techniques using Latent Dirichlet Allocation (LDA) model and its variants (Titov and McDonald, 2008; Lin and He, 2009; Moghaddam and Ester, 2012).\nConventional RNNs (e.g., Elman type) and LSTM have been successfully applied to various sequence prediction tasks, such as language modeling (Mikolov et al., 2010; Sundermeyer et al., 2012), speech recognition (Graves and Jaitly, 2014; Sak et al., 2014) and spoken language understanding (Mesnil et al., 2013). For sentiment analysis, Socher et al. (2013) propose to use recursive neural networks to hierarchically compose semantic word vectors based on syntactic parse trees, and use the vectors to identify the sentiments of the phrases and sentences. Le and Zuidema (2015) extended recursive neural networks with LSTM to compute a parent vector in parse trees by combining information of both output and LSTM memory cells from its two children.\nMost relevant to our work is the recent work of Irsoy and Cardie (2014), where they apply deep Elman-type RNN to extract opinion expressions and show that deep RNN outperforms CRF, semiCRF and shallow RNN. They used word embeddings from Google without fine-tuning them.\nAlthough inspired, our work differs from the work of Irsoy and Cardie (2014) in many ways. (i) We experiment with not only Elman-type, but also with a Jordan-type and with a more advanced LSTM RNN, and demonstrate the performance of various RNN models. (ii) We use not only Google embeddings as pre-trained word vectors, but also other embeddings including SENNA and Amazon, and show their performances. (iii) We also finetune the embeddings for our task, which is shown to be very crucial. (iv) We present an RNN ar-\nchitecture to include other linguistic features and show its effectiveness. (v) Finally, we present a comprehensive experiment exploring different embedding dimensions and hidden layer sizes for all the variations of the RNNs (i.e., including features and bi-directionality)."
  }, {
    "heading": "3 Recurrent Neural Models",
    "text": "The recurrent neural models in this section compute compositional vector representations for word sequences of arbitrary length. These highlevel (i.e., hidden-layer) distributed representations are then used as features to classify each token in the sentence. We first describe the common properties shared among the RNNs below, followed by the descriptions of the specific RNNs.\nEach word in the vocabulary V is represented by a D dimensional vector in the shared look-up table L ∈ R|V |×D. Note that L is considered as a model parameter to be learned. We can initialize L randomly or by pre-trained word embedding vectors (see Section 4). Given an input sentence s = (s1, · · · , sT ), we first transform it into a feature sequence by mapping each word token st ∈ s to an index in L. The look-up layer then creates a context vector xt ∈ RmD covering m − 1 neighboring tokens for each st by concatenating their respective vectors in L. For example, given the context size m = 3, the context vector xt for the word disk in Figure 1 is formed by concatenating the embeddings of hard, disk and is. This window-based approach is intended to capture short-term dependencies between neighboring words in a sentence (Collobert et al., 2011).\nThe concatenated vector is then passed through non-linear recurrent hidden layers to learn highlevel compositional representations, which are in turn fed to the output layer for classification using softmax. Formally, the probability of k-th label in the output for classification into K classes:\nP (yt = k|s, θ) = exp (w T k ht)∑K\nk=1 exp (w T k ht)\n(1)\nwhere, ht = φ(xt) defines the transformations of xt through the hidden layers, and wk are the weights from the last hidden layer to the output layer. We fit the models by minimizing the negative log likelihood (NLL) of the training data. The NLL for the sentence s can be written as:\nJ(θ) = T∑\nt=1 K∑ k=1 ytk log P (yt = k|s, θ) (2)\nwhere, ytk = I(yt = k) is an indicator variable to encode the gold labels, i.e., ytk = 1 if the gold label yt = k, otherwise 0.2 The loss function minimizes the cross-entropy between the predicted distribution and the target distribution (i.e., gold labels). The main difference between the models described below is how they compute ht = φ(xt)."
  }, {
    "heading": "3.1 Elman-type RNN (Elman, 1990)",
    "text": "In an Elman-type RNN (Fig. 1a), the output of the hidden layer ht at time t is computed from a nonlinear transformation of the current input xt and the previous hidden layer output ht−1. Formally,\nht = f(Uht−1 + V xt + b) (3)\nwhere f is a nonlinear function (e.g., sigmoid) applied to the hidden units. U and V are weight matrices between two consecutive hidden layers, and between the input and the hidden layers, respectively, and b is the bias vector.\nThis RNN thus creates internal states by remembering previous hidden layer, which allows it to exhibit dynamic temporal behavior. We can interpret ht as an intermediate representation summarizing the past, which is in turn used to make a final decision on the current input."
  }, {
    "heading": "3.2 Jordan-type RNN (Jordan, 1997)",
    "text": "Jordan-type RNNs (Fig. 1b) are similar to Elmantype RNNs except that the hidden layer ht at time t is fed from the previous output layer yt−1 instead of the previous hidden layer ht−1. Formally,\nht = f(Uyt−1 + V xt + b) (4)\nwhere U , V , b, and f are similarly defined as before. Both Elman-type and Jordan-type RNNs are known as simple RNNs. These types of RNNs are generally trained using stochastic gradient descent (SGD) with backpropagation through time (BPTT), where errors (i.e., gradients) are propagated back through the edges over time.\nOne common issue with BPTT is that as the errors get propagated, they may soon become very small or very large that can lead to undesired values in weight matrices, causing the training to fail.\n2This is also known as one-hot vector representation.\nThis is known as the vanishing and the exploding gradients problem (Bengio et al., 1994). One simple way to overcome this issue is to use a truncated BPTT (Mikolov, 2012) for restricting the backpropagation to only few steps like 4 or 5. However, this solution limits the RNN to capture long-range dependencies. In the following, we describe an elegant RNN architecture to address this problem."
  }, {
    "heading": "3.3 Long Short-Term Memory RNN",
    "text": "Long Short-Term Memory or LSTM (Hochreiter and Schmidhuber, 1997) is specifically designed to model long term dependencies in RNNs. The recurrent layer in a standard LSTM is constituted with special (hidden) units called memory blocks (Fig. 1c). A memory block is composed of four elements: (i) a memory cell c (i.e., a neuron) with a self-connection, (ii) an input gate i to control the flow of input signal into the neuron, (iii) an output gate o to control the effect of the neuron activation on other neurons, and (iv) a forget gate f to allow the neuron to adaptively reset its current state through the self-connection. The following sequence of equations describe how a layer of memory blocks is updated at every time step t:\nit = σ(Uiht−1 + Vixt + Cict−1 + bi) (5) ft = σ(Ufht−1 + Vfxt + Cfct−1 + bf ) (6) ct = it g(Ucht−1 + Vcxt + bc) + ft ct−1 (7) ot = σ(Uoht−1 + Voxt + Coct + bo) (8) ht = ot h(ct) (9)\nwhere Uk, Vk and Ck are the weight matrices between two consecutive hidden layers, between the input and the hidden layers, and between two consecutive cell activations, respectively, which are associated with gate k (i.e., input, output, forget and cell), and bk is the associated bias vector. The symbol denotes a element-wise product of the\ntwo vectors. The gate function σ is the sigmoid activation, and g and h are the cell input and cell output activations, typically a tanh. LSTMs are generally trained using truncated or full BPTT."
  }, {
    "heading": "3.4 Bidirectionality",
    "text": "Notice that the RNNs defined above only get information from the past. However, information from the future could also be crucial. In our example sentence (Table 1), to correctly tag the word hard as a B-TARG, it is beneficial for the RNN to know that the next word is disk. Our window-based approach, by considering the neighboring words, already captures short-term dependencies like this from the future. However, it requires tuning to find the right window size, and it disregards long-range dependencies that go beyond the context window, which is typically of size 1 (i.e., no context) to 5 (see Section 5.2). For instance, consider the two sentences: (i) Do you know about the crunchy tuna here, it is to die for. and (ii) Do you know about the crunchy tuna here, it is imported from Norway. The phrase crunchy tuna is an aspect term in the first (subjective) sentence, but not in the second (objective) one. The RNN models described above will assign the same labels to crunchy and tuna in both sentences, since the preceding sequences and the context window (of size 1 to 5) are the same.\nTo capture long-range dependencies from the future as well as from the past, we propose to use bidirectional RNNs (Schuster and Paliwal, 1997), which allow bidirectional links in the network. In an Elman-type bidirectional RNN (Fig. 2a), the forward hidden layer −→ ht and the backward hidden layer ←− ht at time t are computed as follows:\n−→ ht = f( −→ U ht−1 + −→ V xt + −→ b ) (10) ←− ht = f( ←− U ht−1 + ←− V xt + ←− b ) (11)\nwhere −→ U , −→ V and −→ b are the forward weight matrices as before; and ←− U , ←− V and ←− b are their backward counterparts. The concatenated vector ht = [ −→ ht, ←− ht] is passed to the output layer. We can thus interpret ht as an intermediate representation summarizing the past and the future, which is then used to make a final decision on the current input.\nSimilarly, the unidirectional LSTM RNN can be extended to bidirectional LSTM by allowing bidirectional connections in the hidden layer. This amounts to having a backward counterpart for each of the equations from 5 to 9.\nNotice that the forward and the backward computations of bidirectional RNNs are independently done until they are combined in the output layer. This means, during training, after backpropagating the errors from the output layer to the forward and to the backward hidden layers, two independent BPTT can be applied – one to each direction."
  }, {
    "heading": "3.5 Fine-tuning of Embeddings",
    "text": "In our RNN framework, we intend to avoid manual feature engineering efforts by using word embeddings as the only features. As mentioned before, we can initialize the embeddings randomly and learn them as part of model parameters by backpropagating the errors to the look-up layer. One issue with random initialization is that it may lead the SGD to get stuck in local minima (Murphy, 2012). On the other hand, one can plug the readily available embeddings from external sources (Section 4) in the RNN model and use them as features without tuning them further for the task, as is done in any other machine learning model. However, this approach does not exploit the automatic fea-\nture learning capability of NN models, which is one of the main motivations of using them.\nIn our work, we use the pre-trained word embeddings to better initialize our models, and we fine-tune them for our task in training, which turns out to be quite beneficial (see Section 5.2)."
  }, {
    "heading": "3.6 Incorporating other Linguistic Features",
    "text": "Although NNs learn word features (i.e., embeddings) automatically, we may still be interested in incorporating other linguistic features like part-ofspeech (POS) tags and chunk information to guide the training and to learn a better model. However, unlike word embeddings, we want these features to be fixed during training. As shown in Figure 2b, this can be done in our RNNs by feeding these additional features directly to the output layer, and learn their associated weights in training."
  }, {
    "heading": "4 Word Embeddings",
    "text": "Word embeddings are distributed representations of words, represented as real-valued, dense, and low-dimensional vectors. Each dimension potentially describes syntactic or semantic properties of the word. Here we briefly describe the three types of pre-trained embeddings that we use in our work."
  }, {
    "heading": "4.1 SENNA Embeddings",
    "text": "Collobert et al. (2011) present a unified NN architecture for various NLP tasks (e.g., POS tagging, chunking, semantic role labeling, named entity recognition) with a window-based approach and a sentence-based approach (i.e., the input layer is a sentence). Each word in the input layer is represented by M features, each of which has an embedding vector associated with it in a lookup table. To give their network a better initialization, they learn word embeddings using a nonprobabilistic language model, which was trained on English Wikipedia for about 2 months. They released their 50-dimensional word embeddings (vocabulary size 130K) under the name SENNA.3"
  }, {
    "heading": "4.2 Google Embeddings",
    "text": "Mikolov et al. (2013a) propose two log-linear models for computing word embeddings from large corpora efficiently: (i) a bag-of-words model CBOW that predicts the current word based on the context words, and (ii) a skip-gram model that predicts surrounding words given the current word.\n3http://ronan.collobert.com/senna/\nThey released their pre-trained 300-dimensional word embeddings (vocabulary size 3M ) trained by the skip-gram model on part of Google news dataset containing about 100 billion words.4"
  }, {
    "heading": "4.3 Amazon Embeddings",
    "text": "Since we work on customer reviews, which are less formal than Wikipedia and news, we have also trained domain-specific embeddings (vocabulary size 1M ) using the CBOW model of word2vec tool (Mikolov et al., 2013b) from a large corpus of Amazon reviews.5 The corpus contains 34, 686, 770 reviews (4.7 billion words) on Amazon products from June 1995 to March 2013 (McAuley and Leskovec, 2013). For comparison with SENNA and Google, we learn word embeddings of 50- and 300-dimensions."
  }, {
    "heading": "5 Experiments",
    "text": "In this section, we present our experimental settings and results for the task of opinion target extraction from customer reviews."
  }, {
    "heading": "5.1 Experimental Settings",
    "text": "Datasets: In our experiments, we use the two review datasets provided by the SemEval-2014 task 4: aspect-based sentiment analysis evaluation campaign (Pontiki et al., 2014), namely the Laptop and the Restaurant datasets. Table 2 shows some basic statistics about the datasets. The majority of aspect terms have only one word, while about one third of them have multiple words. In both datasets, some sentences have no aspect terms and some have more than one aspect terms. We use the standard train:test split to compare our results with the SemEval best systems. In addition, we show a more general performance of our models on the two datasets based on 10–fold cross validation.\n4https://code.google.com/p/word2vec/ 5https://snap.stanford.edu/data/web-Amazon.html\nEvaluation Metric: The evaluation metric measures the standard precision, recall and F1 score based on exact matches. This means that a candidate aspect term is considered to be correct only if it exactly matches with the aspect term annotated by the human. In all our experiments when comparing two models, we use paired t-test on the F1 scores to measure statistical significance and report the corresponding p-value.\nCRF Baseline: We use a linear-chain CRF (Lafferty et al., 2001) of order 2 as our baseline, which is the state-of-the-art model for opinion target extraction (Pontiki et al., 2014). Specifically, the CRF generates (binary) feature functions of order 1 and 2; see (Cuong et al., 2014) for higher order CRFs. The features used in the baseline model include the current word, its POS tag, its prefixes and suffixes between one to four characters, its position, its stylistics (e.g., case, digit, symbol, alphanumeric), and its context (i.e., the same features for the two preceding and the two following words). In addition to the hand-crafted features, we also include the three different types of word embeddings described in Section 4.\nRNN Settings: We pre-processed each dataset by lowercasing all words and spelling out each digit number as DIGIT. We then built the vocabulary from the training set by marking rare words with only one occurrence as UNKNOWN, and adding a PADDDING word to make context windows for boundary words.\nTo implement early stopping in SGD, we prepared a validation set by separating out randomly 10% of the available training data. The remaining 90% is used for training. The weights in the network were initialized by sampling from a small random uniform distribution U(−0.2, 0.2). The time step in the truncated BPTT was fixed to 6 based on the performance on the validation set; smaller values hurt the performance, while larger values showed no significant gains but increased the training time.\nWe use a fixed learning rate of 0.01, but we change the batch size depending on the sentence length following Mesnil et al. (2013). The net effect is a variable step size in the SGD. We run SGD for 30 epochs, calculate the F1 score on the validation set after each epoch, and stop if the accuracy starts to decrease. The size of the context window and the hidden layer are empirically set based on the performance on the validation set. We experimented\nwith the window size∈ {1, 3, 5}, and found 3 to be the optimal on the validation set. The hidden layer sizes we experimented with are 50, 100, 150, and 200; we report the optimal values in Table 3 (see |hl| and |hr| columns). Linguistic Features in RNNs: In addition to the neural features, we also explore the contribution of simple linguistic features in our RNN models using the architecture described in Section 3.6. Specifically, we encode four POS tag classes (noun, adjective, verb, adverb) and BIO-tagged chunk information (NP, VP, PP, ADJP, ADVP) as binary features. We feed these extra features directly to the output layer of the RNNs and learn their relative weights. Part-of-speech and phrasal information are arguably the most informative features for identifying aspect terms (i.e., aspect terms are generally noun phrases). BIO tags could be useful to find the right text spans (i.e., aspect terms are unlikely to violate phrasal boundaries)."
  }, {
    "heading": "5.2 Results and Discussion",
    "text": "Table 3 presents our results of aspect term extraction on the standard testset in F1 scores. In Table 4, we show the results on the whole datasets based on 10-fold cross validation. RNNs in Table 4 are trained using SENNA embeddings. We perform significance tests on the 10-fold results. In the following, we highlight our main findings.\nContributions of Word Embeddings in CRF: From the first group of results in Table 3, we can observe that even though CRF uses a handful of hand-designed features, including word embeddings still leads to sizable improvements on both datasets. The domain-specific Amazon embeddings (300 dim.) yield more general performance across the datasets, delivering the best gain of absolute 3.54% on the Laptop and the second best on the Restaurant dataset. Google embeddings give the best gain on the Restaurant dataset (absolute 3.08%). The contribution of embeddings in CRF is also validated by the 10-fold results in Table 4 (see first two rows), where SENNA embeddings yield significant improvements – absolute 1.47% on Laptop (p < 0.03) and absolute 1.24% on Restaurant (p < 0.01). This demonstrates that word embeddings offer generalizations that complement other strong features, and thus should be considered.\nCRF vs. RNNs: When we compare the results of\nRNNs with those of CRF in Table 3, we see that most of our RNN models outperform CRF models with the maximum absolute gains of 2.80% by LSTM-RNN+Feat. on Laptop and 1.70% by BiElman-RNN+Feat. on Restaurant. What is remarkable is that RNNs without any hand-crafted features outperform feature-rich CRF models by a good margin – absolute maximum gains of 2.23% by Elman-RNN and 1.83% by Bi-LSTM-RNN on Laptop. When we compare their general performance on the 10-folds in Table 4, we observe similar gains, maximum 5.88% on Laptop and 1.97% on Restaurant, which are significant with p < 6 × 10−6 on Laptop and p < 2 × 10−4 on Restaurant. These results demonstrate that RNNs as sequence labelers are more effective than CRFs for fine-grained opinion mining tasks. This can be attributed to RNN’s ability to learn better features automatically and to capture long-range sequential dependencies between the output labels.\nComparison among RNN Models: A comparison among the RNN models in Table 3 tells that Elman RNN generally outperforms Jordan RNN.\nHowever, bi-directionality and LSTM do not provide clear gains over the simple Elman RNN. In fact, bi-directionality hurts the performance in most cases. This finding contrasts the finding of Irsoy and Cardie (2014) in opinion expression detection task, where bi-directional Elman RNNs outperform their uni-directional counterparts. However, when we analyzed the data, we found it to be unsurprising because aspect terms are generally shorter than opinion expressions. For example, the average length of an aspect term in our Restaurant dataset is 1.4, where the average length of an expressive subjective expression in their MPQA corpus is 3.3. Therefore, the information required to correctly identify aspect terms (e.g., hard disk) is already captured by the simple (as opposed to LSTM) unidirectional link and the context window covering the neighboring words. LSTM and Bi-directionality increase the number of parameters in the RNNs, which might contribute to overfitting on this specific task.6\n6Bi-directional links double the number of parameters in RNNs.\nAs a partial solution to this problem, we experimented with a bi-directional Elman-RNN, where both directions share the same parameters. Therefore, the number of parameters remains the same as the uni-directional one. This modification improves the performance over the non-shared one slightly but not significantly. This demands for better modeling of the two sources of information rather than simple concatenation or sharing.\nContributions of Linguistic Features in RNNs: Although our linguistic features are quite simple (i.e., POS tags and chunk), they give gains on both datasets when incorporated into Elman and LSTM RNNs. The maximum gains on the standard testset (Table 3) are 0.64% on Laptop and 1.96% on Restaurant for Bi-Elman, and 1.48% on Laptop and 1.58% on Restaurant for LSTM. Similar gains are also observed on the 10-folds in Table 4, where the maximum gains are 1.25% on Laptop and 1.44% on Restaurant. These gains are significant with p < 0.004 on Laptop and p < 6 × 10−5 on Restaurant. Linguistic features thus complement word embeddings in RNNs.\nImportance of Fine-tuning in RNNs: Finally, in order to show the importance of fine-tuning the word embeddings in RNNs on our task, we present in Table 5 the performance of Elman and Jordan RNNs, when the embeddings are used as they are (‘-tune’), and when they are fine-tuned (‘+tune’) on the task. The table also shows the contributions of pre-trained embeddings as compared to random initialization. Surprisingly, Amazon embeddings without fine-tuning deliver the worst performance, even lower than the Random initialization. We found that with Amazon embeddings the network gets stuck in a local minimum from the very first epoch.\nOther pre-trained (untuned) embeddings improve over the Amazon and Random by providing better initialization. In most cases fine-tuning makes a big difference. For example, the absolute gains for fine-tuning SENNA embeddings in Elman RNN are 13.01% in Laptop and 4.11% in Restaurant. Remarkably, fine-tuning brings both Random and Amazon embeddings close to the best ones.\nComparison with SemEval-2014 Systems: When our RNN results are compared with the top performing systems in the SemEval-2014 (last two rows in Table 3), we see that RNNs\nwithout using any linguistic features achieve the second best results on both Laptop and Restaurant datasets. Note that these RNNs only use word embeddings, while IHS RD and DLIREC use complex features like dependency relations, named entity, sentiment orientation of words, word cluster and many more in their CRF models, most of which are expensive to compute; see (Toh and Wang, 2014; Chernyshevich, 2014). The performance of our RNNs improves when they are given access to very simple features like POS tags and chunks, and LSTM-RNN+Feat. achieves the best results on the Laptop dataset."
  }, {
    "heading": "6 Conclusion and Future Direction",
    "text": "We presented a general class of discriminative models based on recurrent neural network (RNN) architecture and word embeddings, that can be successfully applied to fine-grained opinion mining tasks without any task-specific manual feature engineering effort. We used pre-trained word embeddings from three external sources in different RNN architectures including Elman-type, Jordantype, LSTM and their several variations.\nOur results on the opinion target extraction task demonstrate that word embeddings improve the performance of both CRF and RNN models, however, fine-tuning them in RNNs on the task gives the best results. RNNs outperform CRFs, even when they use word embeddings as the only features. Incorporating simple linguistic features into RNNs improves the performance further. Our best results with LSTM RNN outperform the top performing system on the Laptop dataset and achieve the second best on the Restaurant dataset in SemEval-2014 evaluation campaign. We made our code publicly available for research purposes.\nIn the future, we would like apply our models to other fine-grained opinion mining tasks including opinion expression detection and characterizing the intensity and sentiment of the opinion expressions. We would also like to explore to what extent these tasks can be jointly modeled in an RNN-based multi-task learning framework."
  }, {
    "heading": "Acknowledgments",
    "text": "We are grateful to the anonymous reviewers for their insightful comments and suggestions to improve the paper. This research is affiliated with the Stanley Ho Big Data Decision Analytics Research Centre of The Chinese University of Hong Kong."
  }],
  "year": 2015,
  "references": [{
    "title": "Learning long-term dependencies with gradient descent is difficult",
    "authors": ["Yoshua Bengio", "Patrice Simard", "Paolo Frasconi."],
    "venue": "IEEE Transactions on Neural Networks, 5(2):157–166.",
    "year": 1994
  }, {
    "title": "Identifying expressions of opinion in context",
    "authors": ["Eric Breck", "Yejin Choi", "Claire Cardie."],
    "venue": "Proceedings of the 20th International Joint Conference on Artifical Intelligence, pages 2683–2688. Morgan Kaufmann Publishers Inc.",
    "year": 2007
  }, {
    "title": "IHS R&D Belarus: Cross-domain extraction of product features using conditional random fields",
    "authors": ["Maryna Chernyshevich."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation (SemEval 2014), page 309.",
    "year": 2014
  }, {
    "title": "Hierarchical sequential learning for extracting opinions and their attributes",
    "authors": ["Yejin Choi", "Claire Cardie."],
    "venue": "Proceedings of the ACL 2010 Conference Short Papers, pages 269–274. ACL.",
    "year": 2010
  }, {
    "title": "Identifying sources of opinions with conditional random fields and extraction patterns",
    "authors": ["Yejin Choi", "Claire Cardie", "Ellen Riloff", "Siddharth Patwardhan."],
    "venue": "Proceedings of HLT/EMNLP, pages 355– 362. ACL.",
    "year": 2005
  }, {
    "title": "A unified architecture for natural language processing: deep neural networks with multitask learning",
    "authors": ["Ronan Collobert", "Jason Weston."],
    "venue": "Proceedings of ICML, pages 160–167. ACM.",
    "year": 2008
  }, {
    "title": "Natural language processing (almost) from scratch",
    "authors": ["Ronan Collobert", "Jason Weston", "Léon Bottou", "Michael Karlen", "Koray Kavukcuoglu", "Pavel Kuksa."],
    "venue": "The Journal of Machine Learning Research, 12:2493–2537.",
    "year": 2011
  }, {
    "title": "Conditional random field with high-order dependencies for sequence labeling and segmentation",
    "authors": ["Nguyen Viet Cuong", "Nan Ye", "Wee Sun Lee", "Hai Leong Chieu."],
    "venue": "The Journal of Machine Learning Research, 15(1):981–1009.",
    "year": 2014
  }, {
    "title": "Finding structure in time",
    "authors": ["Jeffrey L Elman."],
    "venue": "Cognitive science, 14(2):179–211.",
    "year": 1990
  }, {
    "title": "Towards endto-end speech recognition with recurrent neural networks",
    "authors": ["Alex Graves", "Navdeep Jaitly."],
    "venue": "Proceedings of ICML, pages 1764–1772.",
    "year": 2014
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural computation, 9(8):1735–1780.",
    "year": 1997
  }, {
    "title": "Mining and summarizing customer reviews",
    "authors": ["Minqing Hu", "Bing Liu."],
    "venue": "Proceedings of SIGKDD, pages 168–177. ACM.",
    "year": 2004
  }, {
    "title": "Opinion mining with deep recurrent neural networks",
    "authors": ["Ozan Irsoy", "Claire Cardie."],
    "venue": "Proceedings of EMNLP, pages 720–728.",
    "year": 2014
  }, {
    "title": "A novel lexicalized HMM-based learning framework for web opinion mining",
    "authors": ["Wei Jin", "Hung Hay Ho", "Rohini K Srihari."],
    "venue": "Proceedings of ICML, pages 465–472. Citeseer.",
    "year": 2009
  }, {
    "title": "Serial order: A parallel distributed processing approach",
    "authors": ["Michael I Jordan."],
    "venue": "Advances in psychology, 121:471–495.",
    "year": 1997
  }, {
    "title": "Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data",
    "authors": ["John D. Lafferty", "Andrew McCallum", "Fernando C.N. Pereira."],
    "venue": "Proceedings of ICML, pages 282–289.",
    "year": 2001
  }, {
    "title": "Compositional distributional semantics with long short term memory",
    "authors": ["Phong Le", "Willem Zuidema."],
    "venue": "Proceedings of the joint Conference on Lexical and Computational Semantics (*SEM).",
    "year": 2015
  }, {
    "title": "Word emdeddings through Hellinger PCA",
    "authors": ["Rémi Lebret", "Ronan Lebret."],
    "venue": "arXiv preprint arXiv:1312.5542.",
    "year": 2013
  }, {
    "title": "Joint sentiment/topic model for sentiment analysis",
    "authors": ["Chenghua Lin", "Yulan He."],
    "venue": "Proceedings of CIKM, pages 375–384. ACM.",
    "year": 2009
  }, {
    "title": "Hidden factors and hidden topics: understanding rating dimensions with review text",
    "authors": ["Julian McAuley", "Jure Leskovec."],
    "venue": "Proceedings of the 7th ACM conference on Recommender systems, pages 165–172. ACM.",
    "year": 2013
  }, {
    "title": "Investigation of recurrent-neuralnetwork architectures and learning methods for spoken language understanding",
    "authors": ["Grégoire Mesnil", "Xiaodong He", "Li Deng", "Yoshua Bengio."],
    "venue": "Proceedings of INTERSPEECH, pages 3771–3775.",
    "year": 2013
  }, {
    "title": "Recurrent neural network based language model",
    "authors": ["Tomas Mikolov", "Martin Karafiát", "Lukas Burget", "Jan Cernockỳ", "Sanjeev Khudanpur."],
    "venue": "Proceedings of INTERSPEECH, pages 1045–1048.",
    "year": 2010
  }, {
    "title": "Efficient estimation of word representations in vector space",
    "authors": ["Tomas Mikolov", "Kai Chen", "Greg Corrado", "Jeffrey Dean."],
    "venue": "arXiv preprint arXiv:1301.3781.",
    "year": 2013
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Greg S Corrado", "Jeff Dean."],
    "venue": "Advances in Neural Information Processing Systems, pages 3111–3119.",
    "year": 2013
  }, {
    "title": "Statistical Language Models based on Neural Networks",
    "authors": ["Tomas Mikolov"],
    "venue": "PhD thesis, Brno University of Technology",
    "year": 2012
  }, {
    "title": "On the design of LDA models for aspect-based opinion mining",
    "authors": ["Samaneh Moghaddam", "Martin Ester."],
    "venue": "Proceedings of CIKM, pages 803–812. ACM.",
    "year": 2012
  }, {
    "title": "Machine Learning A Probabilistic Perspective",
    "authors": ["Kevin Murphy."],
    "venue": "The MIT Press.",
    "year": 2012
  }, {
    "title": "Semeval-2014 task 4: Aspect based sentiment analysis",
    "authors": ["Maria Pontiki", "Haris Papageorgiou", "Dimitrios Galanis", "Ion Androutsopoulos", "John Pavlopoulos", "Suresh Manandhar."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation",
    "year": 2014
  }, {
    "title": "Long short-term memory recurrent neural network architectures for large scale acoustic modeling",
    "authors": ["Hasim Sak", "Andrew Senior", "Françoise Beaufays."],
    "venue": "Proceedings of INTERSPEECH, pages 338– 342.",
    "year": 2014
  }, {
    "title": "Bidirectional recurrent neural networks",
    "authors": ["Mike Schuster", "Kuldip K Paliwal."],
    "venue": "IEEE Transactions on Signal Processing, 45(11):2673–2681.",
    "year": 1997
  }, {
    "title": "Fine-grained opinion mining using conditional random fields",
    "authors": ["Shabnam Shariaty", "Samaneh Moghaddam."],
    "venue": "International Conference on Data Mining Workshops (ICDMW), pages 109–114. IEEE.",
    "year": 2011
  }, {
    "title": "Recursive deep models for semantic compositionality over a sentiment treebank",
    "authors": ["Richard Socher", "Alex Perelygin", "Jean Y Wu", "Jason Chuang", "Christopher D Manning", "Andrew Y Ng", "Christopher Potts."],
    "venue": "Proceedings of EMNLP, pages 1631–",
    "year": 2013
  }, {
    "title": "LSTM neural networks for language modeling",
    "authors": ["Martin Sundermeyer", "Ralf Schlüter", "Hermann Ney."],
    "venue": "Proceedings of INTERSPEECH, pages 194– 197.",
    "year": 2012
  }, {
    "title": "Modeling online reviews with multi-grain topic models",
    "authors": ["Ivan Titov", "Ryan McDonald."],
    "venue": "Proceedings of WWW, pages 111–120. ACM.",
    "year": 2008
  }, {
    "title": "DLIREC: Aspect term extraction and term polarity classification system",
    "authors": ["Zhiqiang Toh", "Wenting Wang."],
    "venue": "Proceedings of the 8th International Workshop on Semantic Evaluation (SemEval 2014), page 235.",
    "year": 2014
  }, {
    "title": "Word representations: a simple and general method for semi-supervised learning",
    "authors": ["Joseph Turian", "Lev Ratinov", "Yoshua Bengio."],
    "venue": "Proceedings of the 48th Annual Meeting of ACL, pages 384–394. ACL.",
    "year": 2010
  }, {
    "title": "Annotating expressions of opinions and emotions in language",
    "authors": ["Janyce Wiebe", "Theresa Wilson", "Claire Cardie."],
    "venue": "Language resources and evaluation, 39(2-3):165–210.",
    "year": 2005
  }, {
    "title": "Recognizing contextual polarity in phrase-level sentiment analysis",
    "authors": ["Theresa Wilson", "Janyce Wiebe", "Paul Hoffmann."],
    "venue": "Proceedings of HLT/EMNLP, pages 347–354. ACL.",
    "year": 2005
  }, {
    "title": "Extracting opinion expressions with semi-Markov conditional random fields",
    "authors": ["Bishan Yang", "Claire Cardie."],
    "venue": "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language",
    "year": 2012
  }, {
    "title": "Joint inference for fine-grained opinion extraction",
    "authors": ["Bishan Yang", "Claire Cardie."],
    "venue": "Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, pages 1640–1649. ACL.",
    "year": 2013
  }],
  "id": "SP:857bd3f2b691bf53ac6ae571f23c093e5c0b62d0",
  "authors": [{
    "name": "Pengfei Liu",
    "affiliations": []
  }, {
    "name": "Shafiq Joty",
    "affiliations": []
  }, {
    "name": "Helen Meng",
    "affiliations": []
  }],
  "abstractText": "The tasks in fine-grained opinion mining can be regarded as either a token-level sequence labeling problem or as a semantic compositional task. We propose a general class of discriminative models based on recurrent neural networks (RNNs) and word embeddings that can be successfully applied to such tasks without any taskspecific feature engineering effort. Our experimental results on the task of opinion target identification show that RNNs, without using any hand-crafted features, outperform feature-rich CRF-based models. Our framework is flexible, allows us to incorporate other linguistic features, and achieves results that rival the top performing systems in SemEval-2014.",
  "title": "Fine-grained Opinion Mining with Recurrent Neural Networks and Word Embeddings"
}