{
  "sections": [{
    "text": "Proceedings of NAACL-HLT 2018, pages 1964–1974 New Orleans, Louisiana, June 1 - 6, 2018. c©2018 Association for Computational Linguistics"
  }, {
    "heading": "1 Introduction",
    "text": "The adoption of NLP methods has led to significant advances in the field of computational social science (Lazer et al., 2009), including political science (Grimmer and Stewart, 2013). Among a myriad of data sources, election manifestos are a core artifact in political analysis. One of the most widely used datasets by political scientists is the Comparative Manifesto Project (CMP) dataset (Volkens et al., 2017), which contains manifestos in various languages, covering over 1000 parties across 50 countries, from elections dating back to 1945.\nIn CMP, a subset of the manifestos has been manually annotated at the sentence-level with one of 57 political themes, divided into 7 major categories.1 Such categories capture party positions (FAVORABLE, UNFAVORABLE or NEITHER)\n1https://manifesto-project.wzb.eu/ coding_schemes/mp_v5\non fine-grained policy themes, and are also useful for downstream tasks including calculating manifesto-level (policy-based) left–right position scores (Budge et al., 2001; Lowe et al., 2011; Däubler and Benoit, 2017). An example sentence from the Green Party of England and Wales 2015 election manifesto where they take an UNFAVORABLE position on MILITARY is:\nWe would: Ensure that ... less is spent on military research.\nElsewhere, they take a FAVORABLE position on WELFARE STATE:\nDouble Child Benefit.\nSuch manual annotations are labor-intensive and prone to annotation inconsistencies (Mikhaylov et al., 2012). In order to overcome these challenges, supervised sentence classification approaches have been proposed (Verberne et al., 2014; Subramanian et al., 2017).\nOther than the sentence-level labels, the manifesto text also has a document-level score that quantifies its position on the left–right spectrum. Different approaches have been proposed to derive this score, based on alternate definitions of “left–right” (Slapin and Proksch, 2008; Benoit and Laver, 2007; Lo et al., 2013; Däubler and Benoit, 2017). Among these, the RILE index is the most widely adopted (Merz et al., 2016; Jou and Dalton, 2017), and has been shown to correlate highly with other popular scores (Lowe et al., 2011). RILE is defined as the difference between RIGHT and LEFT positions on (pre-determined) policy themes across sentences in a manifesto (Volkens et al., 2013); for instance, UNFAVORABLE position on MILITARY is categorized as LEFT. RILE is popular in CMP in particular, as mapping individual sentences to LEFT/RIGHT/NEUTRAL categories has\n1964\nbeen shown to be less sensitive to systematic errors than other sentence-level class sets (Klingemann et al., 2006; Volkens et al., 2013).\nFinally, expert survey scores are gaining popularity as a means of capturing manifesto-level political positions, and are considered to be contextand time-specific, unlike RILE (Volkens et al., 2013; Däubler and Benoit, 2017). We use the Chapel Hill Expert Survey (CHES) (Bakker et al., 2015), which comprises aggregated expert surveys on the ideological position of various political parties. Although CHES is more subjective than RILE, the CHES scores are considered to be the gold-standard in the political science domain.\nIn this work, we address both fine- and coarsegrained multilingual manifesto text policy position analysis, through joint modeling of sentence-level classification and document-level positioning (or ranking) tasks. We employ a two-level structured model, in which the first level captures the structure within a manifesto, and the second level captures context and temporal dependencies across manifestos. Our contributions are as follows: • we employ a hierarchical sequential deep model\nthat encodes the structure in manifesto text for the sentence classification task; • we capture the dependency between the\nsentence- and document-level tasks, and also utilize additional label structure (categorization into LEFT/RIGHT/NEUTRAL: Volkens et al. (2013)) using a joint-structured model; • we incorporate contextual information (such as\npolitical coalitions) and encode temporal dependencies to calibrate the coarse-level manifesto position using probabilistic soft logic (Bach et al., 2015), which we evaluate on the prediction of the RILE index or expert survey party position score."
  }, {
    "heading": "2 Related Work",
    "text": "Analysing manifesto text is a relatively new application at the intersection of political science and NLP. One line of work in this space has been on sentence-level classification, including classifying each sentence according to its major political theme (1-of-7 categories) (Zirn et al., 2016; Glavaš et al., 2017a), its position on various policy themes (Verberne et al., 2014; Biessmann, 2016; Subramanian et al., 2017), or its relative disagreement with other parties (Menini et al., 2017). Recent approaches (Glavaš et al., 2017a; Subrama-\nnian et al., 2017) have also handled multilingual manifesto text (given that manifestos span multiple countries and languages; see Section 5.1) using multilingual word embeddings.\nAt the document level, there has been work on using label count aggregation of (manuallyannotated) fine-grained policy positions, as features for inductive analysis (Lowe et al., 2011; Däubler and Benoit, 2017). Text-based approaches has used dictionary-based supervised methods, unsupervised factor analysis based techniques and graph propagation based approaches (Hjorth et al., 2015; Bruinsma and Gemenis, 2017; Glavaš et al., 2017b). A recent paper closely aligned with our work is Subramanian et al. (2017), who address both sentence- and document-level tasks jointly in a multilingual setting, showing that a joint approach outperforms previous approaches. But they do not exploit the structure of the text and use a much simpler model architecture: averages of word embeddings, versus our bi-LSTM encodings; and they do not leverage domain information and temporal regularities that can influence policy positions (Greene, 2016). This work will act as a baseline in our experiments in Section 5.\nPolicy-specific position classification can be seen as related to target-specific stance classification (Mohammad et al., 2017), except that the target is not explicitly mentioned in most cases. Secondly, manifestos have both fine- and coarsegrained positions, similar to sentiment analysis (McDonald et al., 2007). Finally, manifesto text is well structured within and across documents (based on coalition), has temporal dependencies, and is multilingual in nature."
  }, {
    "heading": "3 Proposed Approach",
    "text": "In this section, we detail the first step of our two-stage approach. We use a hierarchical bidirectional long short-term memory (“biLSTM”) model (Hochreiter and Schmidhuber, 1997; Graves et al., 2013; Li et al., 2015) with a multi-task objective for the sentence classification and document-level regression tasks. A post-hoc calibration of coarse-grained manifesto position is given in Section 4.\nLet D be the set of manifestos, where a manifesto d ∈ D is made up of L sentences, and a sentence si has T words: wi1, wi2, ...wiT . The set Ds ⊂ D is annotated at the sentence-level\nwith positions on fine-grained policy issues (57 classes). The task here is to learn a model that can: (a) classify sentences according to policy issue classes; and (b) score the overall document on the policy-based left–right spectrum (RILE), in an inter-dependent fashion.\nWord encoder: We initialize word vector representations using a multilingual word embedding matrix, We. We construct We by aligning the embedding matrices of all the languages to English, in a pair-wise fashion. Bilingual projection matrices are built using pre-trained FastText monolingual embeddings (Bojanowski et al., 2017) and a dictionary D constructed by translating 5000 frequent English words using Google Translate. Given a pair of embedding matrices E (English) andO (Other), we use singular value decomposition of OTDE (which is UΣV T ) to get the projection matrix (W ∗=UV T ), since it also enforces monolingual invariance (Artetxe et al., 2016; Smith et al., 2017). Finally, we obtain the aligned embedding matrix, We, as OW ∗.\nWe use a bi-LSTM to derive a vector representation of each word in context. The bi-LSTM traverses the sentence si in both the forward and backward directions, and the encoded representation for a given word wit ∈ si, is defined by concatenating its forward ( −→ h it) and backward hidden states ( ←− h it), t ∈ [ 1, T ] .\nSentence model: Similarly, we use a bi-LSTM to generate a sentence embedding from the wordlevel bi-LSTM, where each input sentence si is represented using the last hidden state of both the forward and backward LSTMs. The sentence embedding is obtained by concatenating the hidden representations of the sentence-level bi-LSTM, in both the directions, hi = [−→ h i, ←− h i ] , i ∈ [ 1, L ] . With this representation, we perform fine-grained classification (to one-of-57 classes), using a softmax output layer for each sentence. We minimize the cross-entropy loss for this task, over the sentence-level labeled set Ds ⊂ D. This loss is denoted LS .\nDocument model: To represent a document d we use average-pooling over the sentence representations hi and predicted output distributions (yi) of individual sentences,2 i.e.,\n2Preliminary experiments suggested that this representation performs better than using either hidden representations or just the output distribution.\nVd = 1 L ∑ i∈d [ yi hi ] . The range of RILE is [−100, 100], which we scale to the range [−1, 1], and model using a final tanh layer. We minimize the mean-squared error loss function between the predicted r̂d and actual RILE score rd, which is denoted as LD:\nLD = 1\n|D|\n|D|∑\nd=1\n‖r̂d − rd‖22 (1)\nOverall, the loss function for the joint model (Figure 1), combining LS and LD, is:\nLJ = αLS + (1− α)LD (2)\nwhere 0 ≤ α ≤ 1 is a hyper-parameter which is tuned on a development set."
  }, {
    "heading": "3.1 Joint-Structured Model",
    "text": "The RILE score is calculated directly from the sentence labels, based on mapping each label according to its positioning on policy themes, as LEFT, RIGHT and NEUTRAL (Volkens et al., 2013). Specifically, 13 out of 57 classes are categorized as LEFT, another 13 as RIGHT, and the rest as NEUTRAL. We employ an explicit structured loss which minimizes the deviation between sentencelevel LEFT/RIGHT/NEUTRAL polarity predictions p and the document-level RILE score. The motivation to do this is two-fold: (a) enabling interaction between the sentence- and document-level tasks with homogeneous target space (polarity and RILE); and (b) since we have more documents with just RILE and no sentence-level labels,3 augmenting an explicit semi-supervised learning objective could propagate down the RILE label to generate sentence labels that concord with the document score.\nFor the sentence-level polarity prediction (shown in Figure 1), we use cross-entropy loss over the sentence-level labeled set Ds ⊂ D, which is denoted as LSP . The explicit structured sentence-document loss is given as:\nLstruc = 1\n|D|\n|D|∑\nd=1\n( 1\nLd\n∑ i∈d (piright − pileft )− rd\n)2\n(3)\n3Strictly speaking, for these documents even, sentence annotation was used to derive the RILE score, but the sentencelevel labels were never made available.\nwhere piright and pileft are the predicted RIGHT and LEFT class probabilities for a sentence si (∈ d), rd is the actual RILE score for the document d, and Ld is the length of each document, d ∈ D. We augment the joint model’s loss function (Equation (2)) with LSP and Lstruc to generate a regularized multi-task loss:\nLT = LJ + βLSP + γLstruc (4)\nwhere β, γ ≥ 0 are hyper-parameters which are, once again, tuned on the development set. We refer to the model trained with Equation (2) as “Joint”, and that trained with Equation (4) as “Jointstruc”."
  }, {
    "heading": "4 Manifesto Position Re-ranking",
    "text": "We leverage party-level information to enforce smoothness and regularity in manifesto positioning on the left–right spectrum (Greene, 2016). For example, manifestos released by parties in a coalition are more likely to be closer in RILE score, and a party’s position in an election is often a relative shift from its position in earlier election, so temporal information can provide smoother estimations."
  }, {
    "heading": "4.1 Probabilistic Soft Logic",
    "text": "To address this, we propose an approach using hinge-loss Markov random fields (“HL-MRFs”), a scalable class of continuous, conditional graphical models (Bach et al., 2013). HL-MRFs have\nbeen used for many tasks including political framing analysis on Twitter (Johnson et al., 2017) and user stance classification on socio-political issues (Sridhar et al., 2014). These models can be specified using Probabilistic Soft Logic (“PSL”) (Bach et al., 2015), a weighted first order logical template language. An example of a PSL rule is\nλ : P(a) ∧ Q(a, b)→ R(b)\nwhere P, Q, and R are predicates, a and b are variables, and λ is the weight associated with the rule. PSL uses soft truth values for predicates in the interval [ 0, 1 ] . The degree of ground rule satisfaction is determined using the Lukasiewicz t-norm and its corresponding co-norm as the relaxation of the logical AND and OR, respectively. The weight of the rule indicates its importance in the HL-MRF probabilistic model, which defines a probability density function of the form:\nP (Y|X) ∝ exp ( − M∑\nr=1\nλrφr(Y,X)\n) ,\nφr(Y,X) = max {lr(Y,X), 0}ρr , (5)\nwhere φr(Y,X) is a hinge-loss potential corresponding to an instantiation of a rule, and is specified by a linear function lr and optional exponent ρr ∈ {1, 2}. Note that the hinge-loss potential captures the distance to satisfaction.4"
  }, {
    "heading": "4.2 PSL Model",
    "text": "Here we elaborate our PSL model (given in Table 1) based on coalition information, manifesto content-based features (manifesto similarity and right–left ratio), and temporal dependency. Our target pos (calibrated RILE) is a continuous variable [ 0, 1 ] , where 1 indicates that a manifesto occupies an extreme right position, 0 denotes an extreme left position, and 0.5 indicates center. Each instance of a manifesto and its party affiliation are denoted by the predicates Manifesto and Party.\nCoalition: We model multi-relational networks based on regional coalitions within a given country (RegCoalition),5 and also crosscountry coalitions in the European parliament\n4Degree of satisfaction for the example PSL rule r, ¬P ∨ ¬Q ∨ R, using the Lukasiewicz co-norm is given as min{2− P− Q+ R, 1}. From this, the distance to satisfaction is given as max{P+ Q− R− 1, 0}, where P+ Q− R− 1 indicates the linear function lr .\n5http://www.parlgov.org/\n(EUCoalition).6 We set the scope of interaction between manifestos (x and y) from a country to the same election (SameElec). For manifestos across countries, we consider only the most recent manifesto (Recent) from each party (y), released within 4 years relative to x. We use a logistic transformation of the number of times two parties have been in a coalition in the past (to get a value between 0 and 1), for both RegCoalition and EUCoalition. We also construct rules based on transitivity for both the relational features, i.e., parties which have had common coalition partners, even if they were not allies themselves, are likely to have similar policy positions.\nManifesto similarity: Manifestos that are similar in content are expected to have similar RILE scores (and associated sentence-\n6http://www.europarl.europa.eu\nlevel label distributions), similar to the modeling intuition captured by Burford et al. (2015) in the context of congressional debate vote prediction. For a pair of recent manifestos (Recent) we use the cosine similarity (Similarity) between their respective document vectors Vd (Figure 1).\nRight–left ratio: For a given manifesto, we compute the ratio of sentences categorized under RIGHT to OTHERS ( # RIGHT# RIGHT+# LEFT+# NEUTRAL ), where the categorization for sentences is obtained using the joint-structured model (Equation (4)). We also encode the location of sentence ls in a document, by weighing the count of sentences for each class C by its location value∑\ns∈C log(ls + 1) (referred to as loc lr). The intuition here is that the beginning parts of a manifesto tends to contain generic information such as preamble, compared to\nlater parts which are more policy-dense. We perform a logistic transformation of loc lr to derive the LwRightLeftRatio.\nTemporal dependency: We capture the temporal dependency between a party’s current manifesto position and its previous manifesto position (PreviousManifesto).\nOther than for the look-up based random variables, the network is instantiated with predictions (for Similarity, LwRightLeftRatio and pos) from the joint-structured model (Figure 1). All the random variables, except pos (which is the target variable), are fixed in the network. These values are then used inside a PSL model for collective probabilistic reasoning, where the first-order logic given in Table 1 is used to define the graphical model (HL-MRF) over the random variables detailed above. Inference on the HL-MRF is used to obtain the most probable interpretation such that it satisfies most ground rule instances, i.e., considering the relational and temporal dependencies."
  }, {
    "heading": "5 Evaluation",
    "text": ""
  }, {
    "heading": "5.1 Experimental Setup",
    "text": "As our dataset, we use manifestos from CMP for European countries only, as in Section 5.5 we will validate the manifesto’s overall position on the left-right spectrum, using the Chapel Hill Expert Survey (CHES), which is only available for European countries (Bakker et al., 2015). In this, we sample 1004 manifestos from 12 European countries, written in 10 different languages — Danish (Denmark), Dutch (Netherlands), English (Ireland, United Kingdom), Finnish (Finland), French (France), German (Austria, Germany), Italian (Italy), Portuguese (Portugal), Spanish (Spain), and Swedish (Sweden). Out of the 1004 manifestos, 272 are annotated with both sentence-level labels and RILE scores, and the remainder only have RILE scores (see Table 2 for further statistics).\nThere are (less) scenarios where a natural sentence is segmented into sub-sentences and annotated with different classes (Däubler et al., 2012). Hence we use NLTK sentence tokenizer followed by heuristics from Däubler et al. (2012) to obtain sub-sentences. Consistent with previous work (Subramanian et al., 2017), we present results with manually segmented and annotated test documents."
  }, {
    "heading": "5.2 Baseline Approaches",
    "text": "Sentence-level baseline approaches include:\n• BoW-NN : TF-IDF-weighted unigram bagof-words representation of sentences (Biessmann, 2016), and monolingual training using a multi-layer perceptron (“MLP”) model.\n• BoT-NN : Similar to above, but trigram bagof-words.\n• AE-NN : MLP model with average multilingual word embeddings as the sentence representation (Subramanian et al., 2017).\n• CNN : Convolutional neural network (“CNN”: Glavaš et al. (2017a)) with multilingual word embeddings.\n• Bi-LSTM : Simple bi-LSTM over multilingual word embeddings, last hidden units are concatenated to form the sentence representation, and fed directly into a softmax sentencelevel layer. We evaluate two scenarios: (1) with a trainable embedding matrix We (BiLSTM(+up) ); and (2) without a trainable We.\nDocument-level baseline approaches include:\n• BoC : Bag-of-centroids (BoC) document representation based on clustering the word embeddings (Lebret and Collobert, 2014), fed into a neural network regression model.\n• HCNN : Hierarchical CNN, where we encode both the sentence and document using stacked CNN layers.\n• HNN : State-of-the-art hierarchical neural network model of Subramanian et al. (2017), based on average embedding representations for sentences and the document.\nWe present results evaluated under two different settings: (a) 80–20% random split averaged across 10 runs to validate the hierarchical model (Section 5.3 and Section 5.4); and (b) temporal setting, where train- and test-set are split chronologically, to validate both the hierarchical deep model and the PSL approach especially, since we encode temporal dependencies (Section 5.5)."
  }, {
    "heading": "5.3 Hierarchical Sentence- and Document-level Model",
    "text": "We present sentence-level results with a 80–20% random split in Table 3, stratified by country, averaged across 10 runs. For Bi-LSTM , we found the setting with a trainable embedding matrix (Bi-LSTM(+up) ) to perform better than the nontrainable case (Bi-LSTM ). Hence we use a similar setting for Joint and Jointstruc. We show the effect of α (from Equation (2)) in Figure 2a, based on which we set α = 0.3 hereafter. With the chosen model, we study the effect of the structured loss (Equation (4)), by varying γ with fixed β = 0.1, as shown in Figure 2b. We observe that γ = 0.7 gives the best performance, and varying β with γ at 0.7 does not result in any further improvement (see Figure 2c). Sentence-level results measured using F-measure, for baseline approaches and the proposed models selected from Figure 2a (Joint), Figures 2b and 2c (Jointstruc) are given in Table 3. We also evaluate the special case of α = 1, in the form of sentence-only model Jointsent. For the document-level task, results for overall manifesto positioning measured using Pearson’s correlation (r) and Spearman’s rank correlation (ρ) are given in Table 4. We also evaluate the hierarchical biLSTM model with document-level objective only, Jointdoc.\nWe observe that hierarchical modeling (Jointsent, Joint and Jointstruc) gives the best performance for sentence-level classification for all the languages except Portuguese, on which it performs slightly worse than Bi-LSTM(+up) . Also, Jointstruc, does not improve over Jointsent. We perform further analysis to see the effect of joint-structured model on the sentence-level task under sparsely-labeled conditions in Section 5.4. On the other hand, for the document-level task,\nthe joint model (Joint) performs better than Jointdoc and all the baseline approaches. Lastly, the joint-structured model (Jointstruc) provides further improvement over Joint ."
  }, {
    "heading": "5.4 Analysis of Joint-Structured Model for Sentence-level task",
    "text": "To understand the utility of joint modeling, especially given that there are more manifestos with document-level labels only than both sentenceand document-level labels, we compare the following two settings: (1) Jointstruc, which uses additional manifestos with document-level supervision (RILE); and (2) Jointsent, which uses manifestos with sentence-level supervision only. We vary the proportion of labeled documents at the sentence-level, from 10% to 80%, to study the effect under sparsely-labeled conditions. Note that 80% is the maximum labeled training data under the cross-validation setting. In other cases, a subset (say 10%) is randomly sampled for train-\ning. From Figure 3, having more manifestos with document-level supervision demonstrates the advantage of semi-supervised learning, especially when the sentence-level supervision is sparse (≤ 40%)— Jointstruc performs better than Jointsent."
  }, {
    "heading": "5.5 Manifesto Position Re-ranking using PSL",
    "text": "Finally, we present the results using PSL, which calibrates the overall manifesto position on the left–right spectrum, obtained using the jointstructured model (Jointstruc). As we evaluate the effect of temporal dependency, we use manifestos before 2008-09 for training (868 in total) and the later ones (until 2015, 136 in total) for testing. This test set covers one recent set of election manifestos for most countries, and two for the Nether-\nlands, Spain and United Kingdom. To avoid variance in right-to-left ratio and the target variable (pos, initialized using Jointstruc) between the training and test sets, we build a stacked network (Fast and Jensen, 2008), whereby we estimate values for the training set using cross-validation across the training partition, and estimate values for the test-set with a model trained over the entire training data. Note that we build the Jointstruc model afresh using the chronologically split training set, and the parameters are tuned again using an 80-20 random split of the training set. For a consistent view of results for both the tasks (and stages), we provide micro-averaged results for sentence-classification with the competing approaches (from Table 3): AE-NN (Subramanian et al., 2017), Bi-LSTM(+up) , and Jointstruc. Results are presented in Table 5, noting that the results for a given method will differ from earlier due to the different data split.\nFor the document-level regression task, we also evaluate other approaches based on manifesto similarity and automated scaling with sentence-level policy positions:\n• Cross-lingual scaling (CLS ): A recent unsupervised approach for crosslingual political speech text scoring (Glavaš et al., 2017b), based on TF-IDF weighed average wordembeddings to represent documents, and a graph constructed using pair-wise document\nsimilarity. Given two pivot texts (for left and right), label propagation approach is used to position other documents.\n• PCA: Apply principal component analysis (Gabel and Huber, 2000) on the distribution of sentence-level policy positions (56 classes, without 000), and use the projection on its principal component to explain maximum variance in its sentence-level positions, as a latent manifesto-level position score.\n• Jointstruc: We evaluate the scores obtained using Jointstruc, which we calibrate using PSL.\nWe validate the calibrated position scores using both RILE and CHES7 scores. We use CHES 2010-14, and map the manifestos to the closest survey year (wrt its election date). CHES scores are used only for evaluation and not during training. We provide results in Table 6 by augmenting features for the PSL model (Table 1) incrementally. We observed that the coalition-based feature, and polarity of sentences with its position information improves the overall ranking (r, ρ). Document similarity based relational feature provides only mild improvement (similarly to Burford et al. (2015)), and temporal dependency provides further improvement against CHES. That is, combining content, network and temporal features provides the best results."
  }, {
    "heading": "6 Conclusion and Future Work",
    "text": "This work has been targeted at both fine- and coarse-grained manifesto text position analysis. We have proposed a two-stage approach, where in the first step we use a hierarchical multi-task\n7https://www.chesdata.eu/\ndeep model to handle the sentence- and documentlevel tasks together. We also utilize additional information on label structure, to augment an auxiliary structured loss. Since the first step places the manifesto on the left–right spectrum using text only, we leverage context information, such as coalition and temporal dependencies to calibrate the position further using PSL. We observed that: (a) a hierarchical bi-LSTM model performs best for the sentence-level classification task, offering a 10% improvement over the state-of-art approach (Subramanian et al., 2017); (b) modeling the document-level task jointly, and also augmenting the structured loss, gives the best performance for the document-level task and also helps the sentence-level task under sparse supervision scenarios; and (c) the inclusion of a calibration step with PSL provides significant gains in performance against both RILE and CHES, in the form of an increase from ρ = 0.42 to 0.61 wrt CHES survey scores.\nThere are many possible extensions to this work, including: (a) learning multilingual word embeddings with domain information; and (b) modeling other policy related scores from text, such as “support for EU integration”."
  }, {
    "heading": "Acknowledgements",
    "text": "We thank the anonymous reviewers for their insightful comments and valuable suggestions. This work was funded in part by the Australian Government Research Training Program Scholarship, and the Australian Research Council."
  }],
  "year": 2018,
  "references": [{
    "title": "Learning principled bilingual mappings of word embeddings while preserving monolingual invariance",
    "authors": ["Mikel Artetxe", "Gorka Labaka", "Eneko Agirre."],
    "venue": "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. EMNLP,",
    "year": 2016
  }, {
    "title": "Hinge-loss markov random fields and probabilistic soft logic",
    "authors": ["S.H. Bach", "B. Huang M. Broecheler", "L. Getoor."],
    "venue": "CoRR abs/1505.04406.",
    "year": 2015
  }, {
    "title": "Hinge-loss markov random fields: Convex inference for structured prediction",
    "authors": ["Stephen H. Bach", "Bert Huang", "Ben London", "Lise Getoor."],
    "venue": "Proceedings of the Twenty-Ninth Conference on Uncertainty in Artificial Intelligence.",
    "year": 2013
  }, {
    "title": "Measuring party positions in europe: The chapel hill expert survey trend file, 1999–2010",
    "authors": ["Polk", "Jan Rovny", "Marco Steenbergen", "Milada Anna Vachudova."],
    "venue": "Party Politics 21(1):143–152.",
    "year": 2015
  }, {
    "title": "Estimating party policy positions: Comparing expert surveys and hand-coded content analysis",
    "authors": ["Kenneth Benoit", "Michael Laver."],
    "venue": "Electoral Studies 26(1):90–107.",
    "year": 2007
  }, {
    "title": "Automating political bias prediction",
    "authors": ["Felix Biessmann."],
    "venue": "CoRR abs/1608.02195.",
    "year": 2016
  }, {
    "title": "Enriching word vectors with subword information",
    "authors": ["Piotr Bojanowski", "Edouard Grave", "Armand Joulin", "Tomas Mikolov."],
    "venue": "Transactions of the Association for Computational Linguistics 5:135–146.",
    "year": 2017
  }, {
    "title": "Validating Wordscores",
    "authors": ["B. Bruinsma", "K. Gemenis."],
    "venue": "CoRR abs/1707.04737.",
    "year": 2017
  }, {
    "title": "Mapping Policy Preferences: Parties, Electors and Governments",
    "authors": ["I Budge", "H.D Klingemann", "A Volkens", "J Bara", "E Tannenbaum", "R Fording", "D Hearl", "H.M Kim", "M McDonald", "S Mendes."],
    "venue": "Oxford University Press.",
    "year": 2001
  }, {
    "title": "Collective document classification with implicit inter-document semantic relationships",
    "authors": ["Clint Burford", "Steven Bird", "Timothy Baldwin."],
    "venue": "Proceedings of the Fourth Joint Conference on Lexical and Computational Semantics (*SEM 2015). Den-",
    "year": 2015
  }, {
    "title": "Estimating better left-right positions through statistical scaling of manual content analysis",
    "authors": ["Thomas Däubler", "Kenneth Benoit."],
    "venue": "Retrieved from http://kenbenoit.net/pdfs/text_ in_context_2017.pdf .",
    "year": 2017
  }, {
    "title": "Natural sentences as valid units for coded political texts",
    "authors": ["Thomas Däubler", "Kenneth Benoit", "Slava Mikhaylov", "Michael Laver."],
    "venue": "British Journal of Political Science 42(4):937–951.",
    "year": 2012
  }, {
    "title": "Why stacked models perform effective collective classification",
    "authors": ["Andrew Fast", "David Jensen."],
    "venue": "Proceedings of the Eighth International Conference on Data Mining. IEEE, pages 785–790.",
    "year": 2008
  }, {
    "title": "Putting parties in their place: Inferring party left-right ideological positions from party manifestos data",
    "authors": ["Matthew J Gabel", "John D Huber."],
    "venue": "American Journal of Political Science pages 94–103.",
    "year": 2000
  }, {
    "title": "Cross-lingual classification of topics in political texts",
    "authors": ["Goran Glavaš", "Federico Nanni", "Simone Paolo Ponzetto."],
    "venue": "Proceedings of the Second Workshop on NLP and Computational Social Science. ACL, pages 42–46.",
    "year": 2017
  }, {
    "title": "Unsupervised cross-lingual scaling of political texts",
    "authors": ["Goran Glavaš", "Federico Nanni", "Simone Paolo Ponzetto."],
    "venue": "Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 2, Short",
    "year": 2017
  }, {
    "title": "Speech recognition with deep recurrent neural networks",
    "authors": ["Alex Graves", "Abdel-rahman Mohamed", "Geoffrey Hinton."],
    "venue": "Proceedings of the international conference on Acoustics, speech and signal processing (ICASSP). IEEE, pages 6645–6649.",
    "year": 2013
  }, {
    "title": "Competing on the issues: How experience in government and economic conditions influence the scope of parties policy messages",
    "authors": ["Zachary Greene."],
    "venue": "Party Politics 22(6):809–822.",
    "year": 2016
  }, {
    "title": "Text as data: The promise and pitfalls of automatic content analysis methods for political texts",
    "authors": ["Justin Grimmer", "Brandon M Stewart."],
    "venue": "Political analysis 21(3):267–297.",
    "year": 2013
  }, {
    "title": "Computers, coders, and voters: Comparing automated methods for estimating party positions",
    "authors": ["Frederik Georg Hjorth", "Robert Tranekær Klemmensen", "Sara Binzer Hobolt", "Martin Ejnar Hansen", "Peter Kurrild-Klitgaard."],
    "venue": "Research and Politics 2(2):1–9.",
    "year": 2015
  }, {
    "title": "Long short-term memory",
    "authors": ["Sepp Hochreiter", "Jürgen Schmidhuber."],
    "venue": "Neural Computation 9(8):1735–1780.",
    "year": 1997
  }, {
    "title": "Leveraging behavioral and social information for weakly supervised collective classification of political discourse on twitter",
    "authors": ["Kristen Johnson", "Di Jin", "Dan Goldwasser."],
    "venue": "Proceedings of the Association for Computational Linguistics. ACL, pages",
    "year": 2017
  }, {
    "title": "Left-right orientations and voting behavior",
    "authors": ["Willy Jou", "Russell J. Dalton."],
    "venue": "Oxford Research Encyclopedia of Politics .",
    "year": 2017
  }, {
    "title": "Mapping Policy Preferences II",
    "authors": ["Hans-Dieter Klingemann", "Andrea Volkens", "Judith Bara", "Ian Budge", "Michael McDonald."],
    "venue": "Estimates for Parties, Electors, and Governments in Eastern Europe, European Union, and OECD. Oxford University",
    "year": 2006
  }, {
    "title": "Life in the network: the coming age of computational social",
    "authors": ["David Lazer", "Alex Sandy Pentland", "Lada Adamic", "Sinan Aral", "Albert Laszlo Barabasi", "Devon Brewer", "Nicholas Christakis", "Noshir Contractor", "James Fowler", "Myron Gutmann"],
    "year": 2009
  }, {
    "title": "N-grambased low-dimensional representation for document classification",
    "authors": ["Rémi Lebret", "Ronan Collobert."],
    "venue": "CoRR abs/1412.6277.",
    "year": 2014
  }, {
    "title": "A hierarchical neural autoencoder for paragraphs and documents",
    "authors": ["Jiwei Li", "Luong Minh-Thang", "Jurafsky Dan."],
    "venue": "Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Confer-",
    "year": 2015
  }, {
    "title": "A common left-right scale for voters and parties in europe",
    "authors": ["James Lo", "Sven-Oliver Proksch", "Thomas Gschwend."],
    "venue": "Political Analysis 22(2):205–223.",
    "year": 2013
  }, {
    "title": "Scaling policy preferences from coded political texts",
    "authors": ["Will Lowe", "Kenneth Benoit", "Slava Mikhaylov", "Michael Laver."],
    "venue": "Legislative studies quarterly 36(1):123–155.",
    "year": 2011
  }, {
    "title": "Structured models for fine-to-coarse sentiment analysis",
    "authors": ["Ryan McDonald", "Kerry Hannan", "Tyler Neylon", "Mike Wells", "Jeff Reynar."],
    "venue": "Proceedings of the 45th annual meeting of the association of computational linguistics. ACL, pages 432–439.",
    "year": 2007
  }, {
    "title": "Topic-based agreement and disagreement in us electoral manifestos",
    "authors": ["Stefano Menini", "Federico Nanni", "Simone Paolo Ponzetto", "Sara Tonelli."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Process-",
    "year": 2017
  }, {
    "title": "The manifesto corpus: A new resource for research on political parties and quantitative text analysis",
    "authors": ["Nicolas Merz", "Sven Regel", "Jirka Lewandowski."],
    "venue": "Research & Politics 3(2).",
    "year": 2016
  }, {
    "title": "Coder reliability and misclassification in the human coding of party manifestos",
    "authors": ["Slava Mikhaylov", "Michael Laver", "Kenneth R Benoit."],
    "venue": "Political Analysis 20(1):78–91.",
    "year": 2012
  }, {
    "title": "Stance and sentiment in tweets",
    "authors": ["Saif M Mohammad", "Parinaz Sobhani", "Svetlana Kiritchenko."],
    "venue": "ACM Transactions on Internet Technology (TOIT) 17(3):26.",
    "year": 2017
  }, {
    "title": "A scaling model for estimating time-series party positions from texts",
    "authors": ["Jonathan B Slapin", "Sven-Oliver Proksch."],
    "venue": "American Journal of Political Science 52(3):705–722.",
    "year": 2008
  }, {
    "title": "Offline bilingual word vectors, orthogonal transformations and the inverted softmax",
    "authors": ["Samuel L Smith", "Turban David HP", "Hamblin Steven", "Hammerla Nils Y."],
    "venue": "Proceedings of the 5th International Conference on Learning Representations (ICLR).",
    "year": 2017
  }, {
    "title": "Collective stance classification of posts in online debate forums",
    "authors": ["Dhanya Sridhar", "Lise Getoor", "Marilyn Walker."],
    "venue": "Proceedings of the Joint Workshop on Social Dynamics and Personal Attributes in Social Media. ACL, pages 109–117.",
    "year": 2014
  }, {
    "title": "Joint sentencedocument model for manifesto text analysis",
    "authors": ["Shivashankar Subramanian", "Trevor Cohn", "Timothy Baldwin", "Julian Brooke."],
    "venue": "Proceedings of the 15th Annual Workshop of The Australasian Language Technology Association. ALTA,",
    "year": 2017
  }, {
    "title": "Automatic thematic classification of election manifestos",
    "authors": ["Suzan Verberne", "Eva Dhondt", "Antal van den Bosch", "Maarten Marx."],
    "venue": "Information Processing & Management 50(4):554–567.",
    "year": 2014
  }, {
    "title": "Understanding and validating the left-right scale (RILE)",
    "authors": ["Andrea Volkens", "Judith Bara", "Budge Ian", "Simon Franzmann."],
    "venue": "Mapping Policy Preferences From Texts: Statistical Solutions for Manifesto Analysts, Oxford University Press, chapter 6.",
    "year": 2013
  }, {
    "title": "The Manifesto Data Collection",
    "authors": ["Andrea Volkens", "Pola Lehmann", "Theres Matthie", "Nicolas Merz", "Sven Regel", "Bernhard Weels."],
    "venue": "Manifesto Project (MRG/CMP/MARPOR). Version 2017b. Wissenschaftszentrum Berlin für Sozialforschung,",
    "year": 2017
  }, {
    "title": "Classifying topics and detecting topic shifts in political manifestos",
    "authors": ["Cäcilia Zirn", "Goran Glavaš", "Federico Nanni", "Jason Eichorts", "Heiner Stuckenschmidt."],
    "venue": "Proceedings of the International Conference on the Advances in Computational Analysis of",
    "year": 2016
  }],
  "id": "SP:b7e86ec78a3e818360f38b655fc477d113ca2d5d",
  "authors": [{
    "name": "Shivashankar Subramanian",
    "affiliations": []
  }, {
    "name": "Trevor Cohn",
    "affiliations": []
  }, {
    "name": "Timothy Baldwin",
    "affiliations": []
  }],
  "abstractText": "Election manifestos document the intentions, motives, and views of political parties. They are often used for analysing a party’s finegrained position on a particular issue, as well as for coarse-grained positioning of a party on the left–right spectrum. In this paper we propose a two-stage model for automatically performing both levels of analysis over manifestos. In the first step we employ a hierarchical multi-task structured deep model to predict fineand coarse-grained positions, and in the second step we perform post-hoc calibration of coarse-grained positions using probabilistic soft logic. We empirically show that the proposed model outperforms state-of-art approaches at both granularities using manifestos from twelve countries, written in ten different languages.",
  "title": "Hierarchical Structured Model for Fine-to-coarse Manifesto Text Analysis"
}