{
  "sections": [{
    "heading": "1. Introduction",
    "text": "As a popular algorithm for the estimation of latent variable models, the expectation-maximization (EM) algorithm (Dempster et al., 1977; Wu, 1983) has been widely used in machine learning and statistics (Jain et al., 1999; Tseng, 2004; Han et al., 2011; Little & Rubin, 2014). Although EM is well-known to often converge to an empirically good local estimator (Wu, 1983), finite sample theoretical guarantees for its performance have not been established until recent\n1Facebook, Inc., Menlo Park, CA 94025 2Department of Computer Science, University of Virginia, Charlottesville, VA 22904, USA 3Department of Computer Science, University of Illinois at Urbana-Champaign, Urbana, IL 61801. Correspondence to: Quanquan Gu <qg5w@virginia.edu>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nstudies (Balakrishnan et al., 2014; Wang et al., 2014; Yi & Caramanis, 2015). Specifically, the first local convergence theory and finite sample statistical rates of convergence for the conventional EM algorithm and its gradient ascent variant were established in Balakrishnan et al. (2014). Later on, Wang et al. (2014) extended the conventional EM algorithm as well as gradient ascent EM algorithm to the high-dimensional setting, where the number of parameters is comparable to or even larger than the sample size. A key idea used in their algorithms is an additional truncation step after the maximization step (M-step), which is able to exploit the intrinsic sparse structure of the high-dimensional latent variable models. Yi & Caramanis (2015) also proposed a high-dimensional EM algorithm, which, instead of using truncation, uses a regularized M-estimator in the M-step. In the high-dimensional setting, the gradient EM algorithm is especially appealing, because exact maximization based M-step can be very time consuming, or even ill-posed. Nonetheless, gradient EM algorithms can still be computationally prohibitive when the number of observations is also large, since they need to calculate the full gradient at each iteration, whose time complexity is linear in the sample size.\nIn this paper, we address the aforementioned computational challenge in the large-scale high-dimensional setting, by proposing a novel variance-reduced stochastic gradient EM algorithm with theoretical guarantees. Our algorithm is along the line of gradient EM algorithms (Balakrishnan et al., 2014; Wang et al., 2014), where the M-step is achieved by one-step gradient ascent rather than (regularized) exact maximization (Yi & Caramanis, 2015). Instead of using a full gradient at each iteration as in existing gradient EM algorithms, we significantly reduce the computational cost by utilizing stochastic variance-reduced gradient, which is inspired by recent advances in stochastic optimization (Roux et al., 2012; Johnson & Zhang, 2013; Shalev Shwartz & Zhang, 2013; Defazio et al., 2014; Zhang & Gu, 2016). To accommodate the special bivariate structure of the Qfunction (i.e., the expected value of the log likelihood function, with respect to the conditional distribution of the latent variable given the observed variable under the current estimate of the model parameter) in EM algorithm, we design a novel semi-stochastic variance-reduced gradient which sets\nour work apart from all existing methods and greatly helps reduce the intrinsic variance of the stochastic gradient of the Q-function in the EM algorithm. We apply our algorithm to two popular latent variable models and thorough numerical experiments are provided to backup our theory. In particular, we summarize our major contributions as follows:\n• We propose a novel high-dimensional EM algorithm by incorporating variance reduction into the stochastic gradient method for EM. Specifically, we design a novel semi-stochastic gradient tailored to the bivariate structure of the Q-function in the EM algorithm. To the best of our knowledge, this is the first work ever that brings variance reduction into the stochastic gradient EM algorithm in the high-dimensional scenario. • We prove that our proposed algorithm converges at a linear rate to the unknown model parameter and achieves the best-known statistical rate of convergence with a mild condition on the initialization. • We show that the proposed algorithm has an improved overall computational complexity over the state-of-theart algorithm. Specifically, to achieve an optimization error of , our algorithm needs O ( (N + bκ2) · log(1/ )\n) gradient evaluations1, where N is the sample size, b is the mini batch size that will be discussed later, and κ is the restricted condition number. In contrast, the gradient complexity of the state-of-the-art high-dimensional EM algorithm (Wang et al., 2014) is O ( κN log(1/ ) ) . As\nlong as κ ≤ N/b, which holds in most real cases, the overall gradient complexity of our algorithm is less than Wang et al. (2014). • Different from the proof technique used in existing work\n(Balakrishnan et al., 2014; Wang et al., 2014; Yi & Caramanis, 2015), which analyzes both the population and sample versions of the Q-function, we directly analyze the sample version of the Q-function. Our proof is much simpler and provides a good interface to analyze the semistochastic gradient.\nThe rest of the paper is organized as follows. We introduce the related work in Section 2, and then present our algorithm and its applications to two representative latent variable models in Section 3. We demonstrate the main theoretical result as well as its implication to specific latent variable models in Section 4, followed by experimental results in Section 5. Finally, we conclude our paper and point out some future work in Section 6.\nNotation: Let A = [Aij ] ∈ Rd×d be a matrix and v = (v1, . . . , vd)\n> ∈ Rd be a vector. We define the `q1Throughout this paper, we consider the calculation of the gradient of the Q-function over a data point as a unit gradient evaluation cost. And we use the gradient complexity, i.e., the number of gradient evaluation units, to fairly compare different algorithms.\nnorm (q ≥ 1) of v as ‖v‖q = (∑d j=1 |vj |q )1/q\n. Specifically, ‖v‖0 denotes the number of nonzero entries of v, ‖v‖2 = √∑d j=1 v 2 j and ‖v‖∞ = maxj |vj |. For q ≥ 1, we define ‖A‖q as the operator norm of A. Specifically, ‖A‖2 is the spectral norm. We let ‖A‖∞,∞ = maxi,j |Aij |. For an integer d > 1, we define [d] = {1, . . . , d}. For an index set I ∈ [d] and vector v ∈ Rd, we use vI ∈ Rd to denote the vector where [vI ]j = vj if j ∈ I , and [vI ]j = 0 otherwise. We use supp(v) to denote the index set of its nonzero entries, and supp(v, s) to denote the index set of top s largest |vj |’s. C is used to denote some absolute constants. The values of these constants may be different from case to case. λmax(A) and λmin(A) are used to denote the largest and smallest eigenvalues of matrix A. We use B(r;β) to denote the ball centered at β with radius r."
  }, {
    "heading": "2. Related Work",
    "text": "In this section, we discuss some related work in detail. Even with its long history in theory and practice of the EM algorithm (Dempster et al., 1977; Wu, 1983; Tseng, 2004), the finite sample statistical guarantees on EM algorithm have not been pursued until recent research (Balakrishnan et al., 2014; Wang et al., 2014; Yi & Caramanis, 2015). In a pioneering work by Balakrishnan et al. (2014), both statistical and computational analysis of EM algorithm was conducted in the classical regime. Specifically, the authors treated EM algorithms as a special perturbed form of standard gradient methods, and they showed that with an appropriate initialization, their algorithm achieves a locally linear convergence rate to the unknown model parameter. However, their work is limited to the classical regime. While in the high-dimensional regime, when data dimension is much larger than the number of samples, the M-step is often intractable or even not well defined. In order to extend this work to the high-dimensional scenario, Wang et al. (2014) addressed this challenge by inserting a truncation step to enforce the sparsity of the parameter. They proved that their algorithm also enjoys locally linear convergence to the model parameter up to certain statistical error. Yi & Caramanis (2015) proposed a high-dimensional extension of EM algorithms via a regularized M-estimator, and provided similar theoretical guarantees. In addition, both Balakrishnan et al. (2014) and Wang et al. (2014) proposed gradient variants of the EM algorithm, which can be computationally faster than exact maximization based EM.\nAlthough the gradient based EM algorithms (Balakrishnan et al., 2014; Wang et al., 2014) have been proved to achieve guaranteed performance, these deterministic approaches can incur huge computational cost in big data and highdimensional scenario since they need costly calculation of full gradient at each iteration. Stochastic gradient methods are a common workaround to large scale optimization (Bot-\ntou, 2010; Gemulla et al., 2011), because one only needs to calculate a mini-batch of the stochastic gradients each time. However, due to the intrinsic variance introduced by the stochastic gradient, these methods often have a slower convergence rate compared with full gradient methods. Therefore, a lot of variance reduction techniques have been proposed to reduce the variance of the stochastic gradient and pursue a faster convergence rate. One of the most popular methods is the stochastic variance-reduced gradient (SVRG) (Johnson & Zhang, 2013). Inspired by this method, various machine learning tasks (Li et al., 2016; Chen & Gu, 2016; Garber & Hazan, 2015) have utilized the stochastic variance reduction technique to provide improved performance of nonconvex optimization with univariate structures. Recently, Reddi et al. (2016); Allen-Zhu & Hazan (2016) also analyzed SVRG for the general univariate nonconvex finite-sum optimization. Motivated by all of these SVRG methods, one natural question is that, can we accelerate gradient based EM algorithms using SVRG? We show in this work that the answer is in the affirmative. Since all the aforementioned SVRG methods can not be applied to the special bivariate structure of the Q-function, in order to incorporate the variance reduction technique into stochastic gradient based EM algorithms, we need to construct a new semi-stochastic gradient."
  }, {
    "heading": "3. Methodology",
    "text": "In this section, we present our proposed algorithm. We first introduce the general framework of the EM method, and then give two representative high-dimensional latent variable models as examples before going into the details of our algorithm."
  }, {
    "heading": "3.1. Background",
    "text": "We now briefly review the latent variable model and the conventional EM algorithm. Let Y ∈ Y be the observed random variable and Z ∈ Z be the latent random variable with joint distribution fβ(y, z) and conditional distribution pβ(z|y), with the model parameter β ∈ Rd. Given N observations {yi}Ni=1 of Y , the EM algorithm aims at maximizing the Q-function\nQ̄N (β;β ′) =\n1\nN N∑ i=1 ∫ Z pβ′(z|yi) · log fβ(yi, z) dz.\nParticularly, in the l-th iteration of EM algorithm, we evaluate Q̄N (β;β(l)) in the E-step, and perform the maximization of Q̄N (β;β(l)) on β in the M-step. For example, in the standard gradient ascent implementation of EM algorithm, the M-step is given by\nβ(l+1) = β(l) + η∇1Q̄N (β(l);β(l)),\nwhere∇1Q̄N (·; ·) denotes the gradient on the first variable and η is the learning rate.\nIn the high-dimensional regime, we assume β∗ ∈ Rd is sparse with ‖β‖0 ≤ s∗. In order to ensure the sparsity of the estimator, Wang et al. (2014) proposed to use a truncation step (i.e., T-step) following the M-step."
  }, {
    "heading": "3.2. Illustrative Examples",
    "text": "We now introduce two representative latent variable models as running examples for high-dimensional EM algorithms.\nExample 3.1 (Sparse Gaussian Mixture Model). The random variable Y ∈ Rd is given by\nY = Z · β∗ + V ,\nwhere Z is a random variable with P(Z = 1) = P(Z = −1) = 1/2, and V ∼N(0,Σ) is a Gaussian random vector, with Σ being the covariance matrix, V and Z are independent, and ‖β∗‖0 ≤ s∗. We assume Σ is known for simplicity.\nExample 3.2 (Mixture of Sparse Linear Regression). Let X ∈ Rd ∼ N(0,Σ) be a Gaussian random vector, and V ∼N(0, σ2) be a univariate normal random variable. The random variable Y ∈ R is given by\nY = Z ·X>β∗ + V,\nwhere Z is a random variable with P(Z = 1) = P(Z = −1) = 1/2. Here X , V and Z are independent, and ‖β‖0 ≤ s∗. In addition, we assume that σ is known."
  }, {
    "heading": "3.3. Proposed Algorithm",
    "text": "Now we present our high-dimensional EM algorithm based on stochastic variance-reduced gradient ascent. The outline of the proposed algorithm is described in Algorithm 1.\nSince our algorithm is based on stochastic gradient, we divide theN samples into nmini-batches {Di}ni=1, and define function {qi}ni=1 on these mini-batches, i.e., qi(β;β′) = 1/b ∑ j∈Di ∫ Z pβ′(z|yj) · log fβ(yj , z) dz, where we let b be the mini-batch size, and N = nb. Let Qn(β;β′) = 1/n ∑n i=1 qi(β;β\n′). It is easy to show that Qn(β;β′) = Q̄N (β;β ′).\nNote that in Algorithm 1, to ensure the sparsity of the output estimator , we use the hard thresholding operator (Blumensath & Davies, 2009),Hs(v) = vsupp(v,s), which only keeps the largest s entries in magnitude of a vector v ∈ Rd. The sparsity parameter s controls the sparsity level of the estimated parameter, and is critical to the estimation error as we will show later.\nWe can see that there are two layers of iterations in our algorithm. For each outer iteration, we first conduct E-step,\nAlgorithm 1 Variance Reduced Stochastic Gradient EM Algorithm (VRSGEM) 1: Parameter: Sparsity Parameter s, Maximum Number of\nOuter Iterations m, Number of Inner Iterations T , learning rate η\n2: Initialization: β̃(0) = Hs(βinit), 3: For l = 0 to m− 1 4: E-step:\nEvaluate Qn ( β; β̃(l) ) with the dataset\nβ̃ = β̃(l), µ̃ = ∇1Qn(β̃; β̃) 5: M-step:\nβ(0) = β̃ Randomly select jl uniformly from {0, . . . , T − 1}\n6: For t = 0 to jl Randomly select i from [n] uniformly\n7: v(t) = ∇1qi ( β(t); β̃ ) −∇1qi ( β̃; β̃ ) + µ̃, 8: β(t+0.5) = β(t) + ηv(t), 9: T-step: β(t+1) = Hs(β(t+0.5))\n10: End For 11: β̃(l+1) = β(jl+1) 12: End For 13: Output: β̂ = β̃(m)\nwhere we compute the averaged gradient µ̃ based on the whole dataset and the model parameter from last outer iteration. This averaged gradient will be used repetitively in the M-step for variance reduction. In M-step, we have the inner iterations. We first determine the number of inner iterations, which is randomly selected from [T ] uniformly. At each inner iteration, we make use of the variance reduction technique. Note that we extend the variance reduction idea originally proposed by Johnson & Zhang (2013) to the bivariate structure of the Q-function. Specifically, we design a novel semi-stochastic gradient on mini-batches as v(t) = ∇1qi(β(t); β̃) − ∇1qi(β̃; β̃) + µ̃, which fixes the second variable within each outer iteration for the sake of convergence guarantee. While the standard gradient implementation of EM algorithm (Wang et al., 2014) uses ∇1Q̄N (β(t);β(t)) to update the parameter at each iteration, our newly designed semi-stochastic gradient is proved to better reduce the variance and attain a lower gradient complexity. After finishing all the inner iterations, we use the output from the last inner iteration as the output of this outer iteration. We use the output from the last outer iteration as the final estimator.\nWe believe our newly proposed semi-stochastic gradient is of independent interest for the stochastic optimization of functions with bivariate structures, to prove a faster rate of convergence."
  }, {
    "heading": "4. Main Theoretical Results",
    "text": "In this section, we show the main theory on the theoretical guarantees of our proposed Algorithm 1. We also present the implications of our algorithm applied to two models\ndescribed in Section 3.2.\nTo facilitate the technical analysis of our algorithm, we focus on the resampling version of Algorithm 1 following the convention of previous work (Wang et al., 2014; Yi & Caramanis, 2015). The key difference between the resampling version and Algorithm 1 is that we split the whole dateset into m subsets and use one subset for each outer iteration. The details of the resampling version of our algorithm is provided in the longer version of this paper. It is worth noting that the resampling version of our algorithm is able to decouple the dependence between consecutive outer iterations, and it is only used to simplify the technical proof. In practice including our experiment, we use Algorithm 1 rather than the resampling version.\nBefore we present the main results, we introduce three conditions that are essential for our analysis.\nCondition 4.1 (Smoothness). For any β,β1,β2 ∈ B(p‖β∗‖2;β∗), where p ∈ (0, 1) is a model-dependent constant, for any i ∈ [n], qi(·; ·) in Algorithm 1 satisfies the smoothness condition with respect to the first variable with parameter L:∥∥∇1qi(β1;β)−∇1qi(β2;β)∥∥2 ≤ L∥∥β1 − β2∥∥2. Condition 4.1 says that the gradient of qi(·; ·) we use in each inner iteration is Lipschitz continuous with respect to the first variable when the first and second variables are within the ball B(p‖β∗‖2;β∗). There exists a wide range of models with this condition holding.\nCondition 4.2 (Concavity). For all β,β1,β2 ∈ B(p‖β∗‖2;β∗), where p ∈ (0, 1) is a model-dependent constant, the function Qn(·; ·) satisfies the strong concavity condition with parameter µ:[\n∇1Qn(β1;β)−∇1Qn(β2;β) ]>\n(β1 − β2) ≤ −µ‖β2 − β1‖22.\nCondition 4.2 requires Qn(·; ·) to be strongly concave with respect to the first variable when the first and second variables are within the ball B(p‖β∗‖2;β∗). This is a reasonable requirement when N is large enough.\nCondition 4.3 (First-order stability). For the true model parameter β∗ and any β ∈ B(p‖β∗‖2;β∗), where p ∈ (0, 1) is a model-dependent constant, Qn ( ·; · )\nsatisfies the first-order stability with parameter γ:∥∥∇1Qn(β∗;β)−∇1Qn(β∗;β∗)∥∥2 ≤ γ∥∥β − β∗∥∥2. Condition 4.3 requires that the gradient ∇1Qn(β∗; ·) is stable with regard to the second variable, with the second variable within the ball B(p‖β∗‖2;β∗). There are actually\nvarious versions of this condition in previous work (Yi & Caramanis, 2015; Balakrishnan et al., 2014) on population versionQ(·; ·) = E[Qn(·, ·)]. Here we impose the condition on the sample Q-function, i.e., Qn(·, ·), because our proof technique directly analyzes the sample Q-function. Intuitively, when the sample size N is sufficiently large, Qn(·; ·) andQ(·; ·) should be close. Therefore, this condition should hold for Qn(·; ·) as well.\nDue to the space limit, we verify the above conditions for the two examples in the longer version of this paper. We use κ = L/µ to denote the condition number ."
  }, {
    "heading": "4.1. Theory for the Generic Model",
    "text": "With the above conditions on qi(·; ·) and Qn(·; ·), we have the following theorem to characterize the estimation error of our estimator β̃(r) returned by the resampling version of Algorithm 1.\nTheorem 4.4. Suppose qi(·; ·) satisfies Condition 4.1 and Qn(·; ·) satisfies Conditions 4.2, 4.3. We also assume that ∥∥βinit − β∗∥∥ 2 ≤ p ∥∥β∗∥∥ 2 , where p ∈ (0, 1). If η ≤ µ/(8L2), and T and s are chosen such that\nρ = 1\nT (1− τ) +\n2αη [ ηL2 + (2η + L/µ2)γ2 ] 1− τ < 1,\nwhere τ = α(1−ηµ+ 2η2L2) and α = 1 + √ s∗/ √ s− s∗, then the estimator β̃(r) from the resampling version of Algorithm 1 satisfies\nE ∥∥β̃(r)−β∗∥∥\n2 ≤ ρr/2 ∥∥βinit − β∗∥∥ 2\n+\n√ 2s̃αη(2η + L/µ2)\n(1− τ)(1− ρ) ∥∥∇1Qn(β∗;β∗)∥∥∞,\n(4.1)\nwhere s̃ = 2s+ s∗.\nRemark 4.5. As suggested in Theorem 4.4 that by choosing an appropriate learning rate η, a sufficiently large number of inner iterations T , and sparsity parameter s such that ρ < 1, we can achieve a linear convergence rate. Here we give an example to show that such ρ is achievable. If we choose step size η = µ/(8L2), and truncation parameter s satisfies\ns >\n[ 4(1−K)2\nK2 + 1\n] s∗,\nwhere\nK = 5µ2 96L2 − µ 2γ2 12L4 − γ 2 3Lµ > 0.\nThen, we can get\nα < 1\n1− 5µ2/96L2 + µ2γ2/12L4 + γ2/3Lµ ,\nand the contraction parameter ρ in Theorem 4.4 can be simplified as\nρ ≤ 1 T (1− τ) + 3 4 .\nTherefore, if we choose T ≥ 256κ2/ ( 3(α − 1) ) , we can obtain ρ ≤ 7/8, ensuring the linear convergence rate.\nRemark 4.6. The right hand side of (4.1) in Theorem 4.4 consists of two terms. The first term stands for the optimization error. The second term is the statistical error. According to Remark 4.5, we can ensure the linear convergence rate of our algorithm. Thus for any error bound > 0, we need r ≥ 2 logρ−1 [‖βinit − β∗‖2/ ] iterations to let the optimization error ρr/2‖βinit − β∗‖2 ≤ , which basically requires O ( log(1/ ) ) outer iterations. For each outer iteration, we need to compute T gradients of qi(·, ·), and one full gradient. Since we have T = O(κ2), which is suggested in Remark 4.5, the gradient complexity of our algorithm would be O ( (N + bκ2) · log(1/ ) ) . Nevertheless, for the state-of-the-art gradient based high-dimensional EM algorithm (Wang et al., 2014), its gradient complexity is O ( κN log(1/ ) ) . As long as κ ≤ N/b, the gradient complexity of our algorithm is less than that of Wang et al. (2014). Since in big data scenarios, N is always very large and b as the batch size is relatively small, this condition is naturally satisfied in most real applications.\nThe second term on the right-hand side of (4.1) stands for the upper bound of the statistical error, which depends on specific models as we will introduce later."
  }, {
    "heading": "4.2. Implications for Specific Models",
    "text": "Now we apply our algorithm to the two examples introduced in Section 3.2."
  }, {
    "heading": "4.2.1. SPARSE GAUSSIAN MIXTURE MODEL",
    "text": "The next corollary gives the implication of our main theory for sparse Gaussian mixture models.\nCorollary 4.7. Under the same conditions of Theorem 4.4 and suppose ∥∥βinit − β∗∥∥ 2\n≤ ( √ λmin(Σ)/λmax(Σ)/4) ∥∥β∗∥∥ 2 . Then with probability at least 1 − 2e/d, the estimator β̂ = β̃(m) from the resampling version of Algorithm 1 satisfies\nE ∥∥β̂ − β∗∥∥\n2 ≤ ρm/2 ∥∥βinit − β∗∥∥ 2\n+ CΦκ3/2 √ s∗ log d · logN\nN , (4.2)\nwhere Φ = λmin(Σ) ( ‖Σ−1β∗‖∞ + σλ−1/2min (Σ) ) and κ = L/µ.\nProof Sketch. For sparse Gaussian mixture model, we have Conditions 4.1 to 4.3 hold with parameters L = 1/λmin(Σ), µ = 1/λmax(Σ), and γ = 20(ξ2 + ξ + 1 + ξ−2)e−ξ\n2/64/λmin(Σ), where ξ = ‖Σ−1/2β∗‖2 denotes the signal-to-noise ratio (SNR). Next, s̃ = 2s+ s∗ is of the same order as s∗. For the term ‖∇1Qn(β∗;β∗)‖∞ in (4.1), we have the following inequality holds with probability at least 1− 2e/d\n‖∇1Qn(β∗;β∗)‖∞ ≤ C ( ‖Σ−1β∗‖∞ +\nσ√ λmin(Σ)\n)√ log d · logN\nN .\nThis completes the proof.\nRemark 4.8. We can see that the parameters in Conditions 4.1 and 4.2 are determined by the covariance matrix Σ, which is reasonable because Σ actually denotes the variance of the data. For Condition 4.3, we need to introduce the signal-to-noise ratio (SNR). The concept of SNR in parameter estimation is also proposed in Balakrishnan et al. (2014); Dasgupta & Schulman (2007). Since we have extended the covariance matrix of noise from identity matrix in previous work to any positive definite matrix, our SNR is also a little bit different from their definition. Generally speaking, for GMM with lower SNR, the variance of the noise makes it harder or even impossible for the algorithm to converge. Therefore, it is always reasonable to have a requirement for the SNR of GMM to be large enough for reliable parameter estimation. Spectral method (Anandkumar et al., 2014) can be used to match the requirement on initialization for GMM, however, we find that random initialization also performs reasonably well in practice as we will show later.\nAccording to Remark 4.5, by choosing appropriate learning rate η, inner iterations T , and sparsity parameter s, we can ensure linear convergence rate of our algorithm. Therefore, from Corollary 4.7, we know that after O ( log ( N/(s∗ log d logN) )) number of iterations, the\noutput of our algorithm attainsO( √ s∗ log d · logN/N) statistical error, which matches the best-known error bound (Wang et al., 2014; Yi & Caramanis, 2015) for Gaussian mixture model up to a logarithmic factor logN . Note that the extra logarithmic factor is due to the resampling strategy."
  }, {
    "heading": "4.2.2. MIXTURE OF SPARSE LINEAR REGRESSION",
    "text": "The implication of our main theory for mixture of linear regression is presented in the following corollary.\nCorollary 4.9. Under the same conditions of Theorem 4.4 and suppose ∥∥βinit − β∗∥∥ 2\n≤ ( √ λmin(Σ)/λmax(Σ)/32) ∥∥β∗∥∥ 2 . Then with probability at least 1 − 2e/d, the estimator β̂ = β̃(m) from the\nresampling version of Algorithm 1 satisfies E ∥∥β̂ − β∗∥∥\n2 ≤ ρm/2 ∥∥βinit − β∗∥∥ 2\n+ Cκ3/2 ( ‖β∗‖2 +\nσ√ λmax(Σ)\n)√ s∗ log d · logN\nN ,\nwhere κ = L/µ.\nProof Sketch. For mixture of linear regression, we have Conditions 4.1 to 4.3 hold with parameters L = 2λmax(Σ), µ = λmin(Σ)/2, and γ = γ1λmax(Σ), where γ1 ∈ (0, 1/3) is a constant. We also show that s̃ is of the same order as s∗. Next, for the term ‖∇1Qn(β∗;β∗)‖∞ in (4.1), we have the following inequality holds with probability at least 1−2e/d\n‖∇1Qn(β∗;β∗)‖∞\n≤ C ( λmax(Σ)‖β∗‖2 + λ1/2max(Σ)σ )√ log d · logN N .\nThis completes the proof.\nRemark 4.10. According to Remark 4.5, our algorithm can achieve a linear convergence rate with appropriate learning rate η, inner iterations T , and sparsity parameter s. Thus Corollary 4.9 tells us that after O ( log ( N/(s∗ log d logN) )) number of outer iterations, the output of our algorithm achieves O( √ s∗ log d · logN/N) statistical error, which matches the best-known statistical error (Yi & Caramanis, 2015) for mixture of linear regression up to a logarithmic factor from the resampling strategy. Specifically, the dependence on ‖β∗‖2 is due to the fundamental limits of EM, which also appears in Balakrishnan et al. (2014); Yi & Caramanis (2015). There is also a spectral method (Chaganty & Liang, 2013) helping the initialization of MLR, but we use random initialization which also performs well in our experiments."
  }, {
    "heading": "5. Experiments",
    "text": "In this section, we present experiment results to validate our theory. For parameter estimation, we use Gaussian mixture model and mixture of linear regression, and compare our proposed variance-reduced stochastic gradient EM algorithm (VRSGEM) with two state-of-the-art highdimensional EM algorithms as baselines:\n• (HDGEM) High-Dimensional Gradient EM algorithm proposed in Wang et al. (2014): the gradient variant of high-dimensional EM method enforcing sparsity structure. • (HDREM) High-Dimensional Regularized EM algorithm proposed in Yi & Caramanis (2015): the method based on decaying regularization.\nSince high-dimensional scenario is much more challenging, we only compare our algorithm with high-dimensional EM algorithms."
  }, {
    "heading": "5.1. Experimental Setup",
    "text": "For each latent variable model, we compare both the optimization error ‖β̃(l) − β̂‖2 featuring the convergence of the estimator to the local optima, and the overall estimation error ‖β̃(l)−β∗‖2 featuring the overall estimation accuracy with regard to the true model parameter β∗. We also show the convergence comparison in terms of training time. All the comparisons are under two different parameter settings: s∗ = 5, d = 256, b = 100, N = 5000 and s∗ = 10, d = 512, b = 200, N = 10000. For VRSGEM, we choose m = 30, n = 50 and T = 50 across all settings and models. Besides the comparison of different algorithms, we also verify our statistical rate of convergence by plotting the statistical error ‖β̂ − β∗‖ against √ s∗ log d/N . Specifically, we fix d = 512 and show the plots of three cases s∗ = 5, s∗ = 10 and s∗ = 15 with varying N .\nIn each experiment setting, we run 100 trials and show the averaged results. The learning rate η is tuned by grid search and s is chosen by cross validation. We use random initialization."
  }, {
    "heading": "5.2. Gaussian Mixture Model",
    "text": "We test VRSGEM on Gaussian mixture models introduced in Section 3.2. For the sake of simplicity and better matching the problem setting of the baseline methods, the co-\nvariance matrix Σ of V is chosen to be a diagonal matrix with all elements being 1. We randomly set two elements to λmax(Σ) = 10, and another two elements to λmin(Σ) = 0.1. The results are shown in Figures 1 and 2.\nFrom Figures 1(a) and 2(a), we can see that all three algorithms have linear convergence as Corollary 4.7 suggests. VRSGEM clearly enjoys a faster convergence rate than the baselines. Moreover, as shown in Figures 1(b) and 2(b), the performance on overall estimation error of our algorithm is as good as HDGEM, which is far better than HDREM. In terms of time consumption, our algorithm also enjoys a remarkable advantage over the baselines as shown in Figures 1(c), 1(d), 2(c) and 2(d).\nThe statistical error results are shown in Figure 5. From Figure 5(a), we can see that statistical error of VRSGEM shows a linear dependency on √ s∗ log d/N across different settings of s∗, verifying results in Corollary 4.7."
  }, {
    "heading": "5.3. Mixture of Linear Regression",
    "text": "Similar to the setting for GMM, we use the same covariance matrix Σ in Section 5.2 for X here. For V , we let σ = 1. We show the results in Figures 3 and 4.\nFrom Figures 3(a) and 4(a), we can see that VRSGEM achieves linear convergence which is consistent with Corollary 4.9, and our algorithm significantly outperforms the\nbaselines in terms of optimization error. In terms of overall estimation error shown in Figures 3(b) and 4(b), VRSGEM is as good as HDGEM and beats HDREM by a remarkable margin. Our algorithm also beats the baselines in time consumption for convergence as we can see in Figures 3(c), 3(d), 4(c) and 4(d). Overall, VRSGEM achieves the best performance among all the methods.\nIn addition, from Figure 5(b), we can see that for MLR, the statistical error of VRSGEM is of order √ s∗ log d/N , which supports Corollary 4.9."
  }, {
    "heading": "6. Conclusions and Future Work",
    "text": "We propose a novel accelerated stochastic gradient EM algorithm based on a uniquely constructed semi-stochastic\nvariance reduced gradient. We show that with an appropriate initialization, the proposed algorithm converges at a linear rate and attains the optimal statistical rate. We apply our proposed algorithm to two popular latent variable models in the high-dimensional regime and numerical experiments are provided to support our theory.\nIt is worth noting that, the proposed algorithm is directly applicable to the classical regime, by dropping the T-step. It will give rise to an accelerated stochastic extension of conventional EM algorithm, and the corresponding theory in this paper can be extended to the classical regime analogously (Balakrishnan et al., 2014). We will investigate this by-product in our future work. We also plan to extend our algorithm to the estimation of high-dimensional latent variable models with low-rank parameters (Yi & Caramanis, 2015)."
  }, {
    "heading": "Acknowledgments",
    "text": "We would like to thank the anonymous reviewers for their helpful comments. This research was sponsored in part by the National Science Foundation under Grant Numbers CNS-1513939, CNS-1027965, IIS-1629161, IIS-1618948, IIS-1652539. The views and conclusions contained in this paper are those of the authors and should not be interpreted as representing any funding agencies."
  }],
  "year": 2017,
  "references": [{
    "title": "Variance reduction for faster non-convex optimization",
    "authors": ["Allen-Zhu", "Zeyuan", "Hazan", "Elad"],
    "venue": "arXiv preprint arXiv:1603.05643,",
    "year": 2016
  }, {
    "title": "Tensor decompositions for learning latent variable models",
    "authors": ["Anandkumar", "Animashree", "Ge", "Rong", "Hsu", "Daniel", "Kakade", "Sham M", "Telgarsky", "Matus"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2014
  }, {
    "title": "Statistical guarantees for the EM algorithm: From population to sample-based analysis",
    "authors": ["Balakrishnan", "Sivaraman", "Wainwright", "Martin J", "Yu", "Bin"],
    "venue": "arXiv preprint arXiv:1408.2156,",
    "year": 2014
  }, {
    "title": "Iterative hard thresholding for compressed sensing",
    "authors": ["Blumensath", "Thomas", "Davies", "Mike E"],
    "venue": "Applied and Computational Harmonic Analysis,",
    "year": 2009
  }, {
    "title": "Large-scale machine learning with stochastic gradient descent",
    "authors": ["Bottou", "Léon"],
    "venue": "In Proceedings of COMPSTAT’2010,",
    "year": 2010
  }, {
    "title": "Spectral experts for estimating mixtures of linear regressions",
    "authors": ["Chaganty", "Arun Tejasvi", "Liang", "Percy"],
    "venue": "arXiv preprint arXiv:1306.3729,",
    "year": 2013
  }, {
    "title": "Accelerated stochastic block coordinate gradient descent for sparsity constrained nonconvex optimization",
    "authors": ["Chen", "Jinghui", "Gu", "Quanquan"],
    "venue": "In Proceedings of the ThirtySecond Conference on Uncertainty in Artificial Intelligence,",
    "year": 2016
  }, {
    "title": "A probabilistic analysis of EM for mixtures of separated, spherical Gaussians",
    "authors": ["Dasgupta", "Sanjoy", "Schulman", "Leonard"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2007
  }, {
    "title": "Saga: A fast incremental gradient method with support for non-strongly convex composite objectives",
    "authors": ["Defazio", "Aaron", "Bach", "Francis", "Lacoste-Julien", "Simon"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2014
  }, {
    "title": "Maximum likelihood from incomplete data via the EM algorithm",
    "authors": ["A.P. Dempster", "N.M. Laird", "D.B. Rubin"],
    "venue": "Journal of the Royal Statistical Society. Series B (Statistical Methodology),",
    "year": 1977
  }, {
    "title": "Fast and simple pca via convex optimization",
    "authors": ["Garber", "Dan", "Hazan", "Elad"],
    "venue": "arXiv preprint arXiv:1509.05647,",
    "year": 2015
  }, {
    "title": "Data mining: concepts and techniques",
    "authors": ["Han", "Jiawei", "Pei", "Jian", "Kamber", "Micheline"],
    "year": 2011
  }, {
    "title": "Data clustering: a review",
    "authors": ["Jain", "Anil K", "Murty", "M Narasimha", "Flynn", "Patrick J"],
    "venue": "ACM computing surveys (CSUR),",
    "year": 1999
  }, {
    "title": "Accelerating stochastic gradient descent using predictive variance reduction",
    "authors": ["Johnson", "Rie", "Zhang", "Tong"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Stochastic variance reduced optimization for nonconvex sparse learning",
    "authors": ["Li", "Xingguo", "Zhao", "Tuo", "Arora", "Raman", "Liu", "Han", "Haupt", "Jarvis"],
    "venue": "arXiv preprint arXiv:1605.02711,",
    "year": 2016
  }, {
    "title": "Statistical analysis with missing data",
    "authors": ["Little", "Roderick JA", "Rubin", "Donald B"],
    "year": 2014
  }, {
    "title": "Stochastic variance reduction for nonconvex optimization",
    "authors": ["Reddi", "Sashank J", "Hefny", "Ahmed", "Sra", "Suvrit", "Póczós", "Barnabás", "Smola", "Alex"],
    "venue": "arXiv preprint arXiv:1603.06160,",
    "year": 2016
  }, {
    "title": "A stochastic gradient method with an exponential convergence rate for finite training sets",
    "authors": ["Roux", "Nicolas L", "Schmidt", "Mark", "Bach", "Francis R"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2012
  }, {
    "title": "Stochastic dual coordinate ascent methods for regularized loss minimization",
    "authors": ["Shalev Shwartz", "Shai", "Zhang", "Tong"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2013
  }, {
    "title": "An analysis of the EM algorithm and entropylike proximal point methods",
    "authors": ["Tseng", "Paul"],
    "venue": "Mathematics of Operations Research,",
    "year": 2004
  }, {
    "title": "High dimensional expectation-maximization algorithm: Statistical optimization and asymptotic normality",
    "authors": ["Wang", "Zhaoran", "Gu", "Quanquan", "Ning", "Yang", "Liu", "Han"],
    "venue": "arXiv preprint arXiv:1412.8729,",
    "year": 2014
  }, {
    "title": "On the convergence properties of the EM algorithm",
    "authors": ["Wu", "C.F. Jeff"],
    "venue": "The Annals of Statistics, 11(1):95–103,",
    "year": 1983
  }, {
    "title": "Regularized em algorithms: A unified framework and statistical guarantees",
    "authors": ["Yi", "Xinyang", "Caramanis", "Constantine"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Accelerated stochastic block coordinate descent with optimal sampling",
    "authors": ["Zhang", "Aston", "Gu", "Quanquan"],
    "venue": "In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining,",
    "year": 2016
  }],
  "id": "SP:53d566fab75b01b0e44b3ccd7added16d520f89d",
  "authors": [{
    "name": "Rongda Zhu",
    "affiliations": []
  }, {
    "name": "Lingxiao Wang",
    "affiliations": []
  }, {
    "name": "Chengxiang Zhai",
    "affiliations": []
  }, {
    "name": "Quanquan Gu",
    "affiliations": []
  }],
  "abstractText": "We propose a generic stochastic expectationmaximization (EM) algorithm for the estimation of high-dimensional latent variable models. At the core of our algorithm is a novel semi-stochastic variance-reduced gradient designed for the Qfunction in the EM algorithm. Under a mild condition on the initialization, our algorithm is guaranteed to attain a linear convergence rate to the unknown parameter of the latent variable model, and achieve an optimal statistical rate up to a logarithmic factor for parameter estimation. Compared with existing high-dimensional EM algorithms, our algorithm enjoys a better computational complexity and is therefore more efficient. We apply our generic algorithm to two illustrative latent variable models: Gaussian mixture model and mixture of linear regression, and demonstrate the advantages of our algorithm by both theoretical analysis and numerical experiments. We believe that the proposed semi-stochastic gradient is of independent interest for general nonconvex optimization problems with bivariate structures.",
  "title": "High-Dimensional Variance-Reduced Stochastic Gradient Expectation-Maximization Algorithm"
}