{
  "sections": [{
    "heading": "1 Introduction",
    "text": "Considerable advances have been made over the past decade on fitting high-dimensional structured linear models when the number of samples n is much smaller than the ambient dimensionality p (Banerjee et al., 2014; Negahban et al., 2012; Chandrasekaran et al., 2012). Most of the advances have been made for linear models: yi = 〈xi, θ∗〉 + ωi, i = 1, . . . , n, where θ∗ ∈ Rp is assumed to be structured, e.g., sparse, group sparse, etc. Estimation of such structured θ is usually done using Lasso-type regularized estimators (Negahban et al., 2012; Banerjee et al., 2014) or Dantzig-type constrained estimators (Chandrasekaran et al., 2012; Chatterjee et al., 2014); other related estimators have also been explored (Hsu & Sabato,\n1Department of Computer Science & Engineering, University of Minnesota, Twin Cities. Correspondence to: Vidyashankar Sivakumar <sivak017@umn.edu>, Arindam Banerjee <banerjee@cs.umn.edu>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\n2016; Vershynin, 2015). Such models have been extended to generalized linear models (Banerjee et al., 2014; Negahban et al., 2012), matrix completion (Candès & Recht, 2009), vector auto-regressive models (Melnyk & Banerjee, 2016) among others.\nIn this paper, we consider the problem of structured quantile regression in high-dimensions, which can be posed as follows: given the response variable yi and covariates xi the τ th conditional quantile function of yi given xi is given by: F−1yi|xi(τ |xi) = 〈xi, θ ∗ τ 〉, τ ∈ (0, 1) for some structured θ∗τ whose structure can be captured by a suitable atomic norm R(·), e.g., l1-norm for sparsity, l1/l2 norm for group sparsity, etc. Here F−1yi|xi(·) is the inverse of the conditional distribution function of yi given xi. We consider the following regularized estimator for the structured quantile regression problem:\nθ̂n := argminθ∈Rp Lτ (θ) + λnR(θ)\n:= argminθ∈Rp 1\nn n∑ i=1 ρτ (yi − 〈xi, θ〉) + λnR(θ) ,\n(1)\nwhere ρτ (u) = (τ − I(u ≤ 0))u is the asymmetric absolute deviation function (Koenker, 2005), I(·) is the indicator function. The goal is to get nonasymptotic bounds on the estimation error ‖θ̂ − θ∗‖2.\nMany previous papers analyze the asymptotic performance of the estimator in (1) (Li & Zhu, 2008; Kai et al., 2011; Wu & Liu, 2009; Zou & Yuan, 2008; Wang et al., 2012). In the non-asymptotic setting of interest in this paper, special cases of the estimator in (1) have been studied in recent literature (Belloni & Chernozhukov, 2011; Kato, 2011; Fan et al., 2014a), primarily focusing on specific norms like the l1-norm and nonoverlapping group sparse norm. In contrast, our formulation and analysis is applicable to any atomic norm R(·) giving considerable flexibility in choosing a suitable structure for real world problems, e.g., hierarchical sparsity, k-support norm, OWL norm etc. More recently (Alquier et al., 2017) consider the more general problem of norm regularized regression with Lipschitz loss functions which includes (1) as a special case. They derive similar results to ours for bounds on the estimation error, but their analysis differs significantly and, in our opinion, does not leverage and highlight the key geometric and sta-\ntistical characteristics of the problem.\nIn the setting of norm regularized regression with square loss, including the widely studied Lasso estimator (Tibshirani, 1996; Negahban et al., 2012; Banerjee et al., 2014), the sample complexity n0 of the estimator gets determined by a certain restricted strong convexity (RSC) property which simplifies to the restricted eigenvalue (RE) condition on the matrix XTX (Bickel et al., 2009; Negahban et al., 2012); in the noiseless setting, i.e., when ωi = 0, the sample complexity determines a phase transition phenomenon so that the probability of recovering the structured θ∗ is minimal when n < n0, and one can exactly recover θ∗ with high probability when n > n0. Our work gives an equivalent sample complexity characterization for structured quantile regression, which was not available in prior work. The challenge in characterizing RSC in the context of quantile regression stems partly from the nonsmoothness of the objective, so one has to work with subgradients. However, the unique aspect stems from the geometry of quantile regression, or as the authoritative book on the topic puts it: “How quantile regression works?” (Koenker, 2005)[Section 2.2]. In quantile regression, the n samples get divided into three subsets: ν samples which get exactly interpolated, i.e., yi = 〈xi, θ̂〉, (n − ν)τ samples which lie below the curve, i.e., yi < 〈xi, θ̂〉, and (n − ν)(1 − τ) samples which lie above the curve, i.e., yi > 〈xi, θ̂〉. Note that when ν = n all samples are interpolated, the loss is zero and the same θ̂ is a solution for all quantiles τ . Quantile regression is clearly not working. The Number of InterPolated Samples (NIPS) ν is an important quantity, inherent to structure in θ∗, and determines the sample complexity of structured quantile regression (1). In fact, we show that when n > ν, the RSC condition associated with the estimator in (1) is satisfied. When there is no structure in θ∗, then ν = O(p), and quantile regression needs n > O(p) samples to work. However, when θ∗ has structure, such as sparsity or group sparsity, ν can be substantially smaller than p. Specifically we show that ν is of the order of square of Gaussian width of the error set (Talagrand, 2014; Chandrasekaran et al., 2012) for a class of atomic norms which includes l1, l1/l2 group sparse, ksupport (Argyriou et al., 2012) and the OWL (Bogdan et al., 2013) norms. The Gaussian width as a measure of complexity of a set has been extensively used in prior literature (Chandrasekaran et al., 2012; Tropp, 2015; Banerjee et al., 2014). For example, when θ∗ is sparse with s non-zero entries, we show that ν = cs log p.\nWhen n > ν and the RSC condition is satisfied, building on recent developments in high-dimensional estimation (Negahban et al., 2012; Banerjee et al., 2014), we show that choosing λn ≥ 2R∗(∇Lτ (θ∗))), where R∗(·) is the dual norm of R(·), leads to non-asymptotic bounds on the estimation error ‖θ̂n − θ∗‖2. While the specification of\nλn looks complex, with its dependency on the dual norm and its dependency on θ∗, we show it is sufficient to set λn based on the Gaussian width (Talagrand, 2014) of the unit norm ball for R(·) (Banerjee et al., 2014; Sivakumar et al., 2015)‘. Our analysis and results on the estimation error bound for quantile regression, interestingly, has the same order as that for regularized least squares regression for general norms (Banerjee et al., 2014). In contrast to the least squares loss the quantile loss is more robust as the estimation error is independent of the two norm of the noise. We discuss results for the l1, l1/l2 group sparse and k-support norms as examples, precisely characterizing the sample complexity for recovery and non-asymptotic error bounds. Specifically, our results for the l1-norm matches those from existing literature on sparse quantile regression (Belloni & Chernozhukov, 2011).\nThe rest of the paper is organized as follows. In Section 2, we discuss the problem formulation along with assumptions, review the general framework for analyzing regularized estimation problems and discuss the three atomic norms used as examples throughout the paper. In Section 3, we analyze the number of interpolated samples and establish precise sample complexities for a class of atomic norms in terms of the Gaussian widths of sets. In Section 4 we establish key ingredients of the analysis and provide the main bound. We present experimental results in Section 5 and conclude in Section 6."
  }, {
    "heading": "2 Background and Preliminaries",
    "text": "Problem formulation: We outline the assumptions on the data and estimator. Similar conditions are present in all prior literature on quantile regression and we refer to Section 2.5 in Belloni & Chernozhukov (2011) for examples of data satisfying the conditions.\nWe consider data is generated as y = Xθ + ω, X ∈ Rn×p is the design matrix, θ ∈ Rp and ω ∈ Rn is the noise. We assume subGaussian design matrices X ∈ Rn×p which includes the class of all bounded random variables. Note that this is not a restrictive assumption as to avoid the quantile crossing phenomenon the covariate space has to be bounded. Quantile crossing is when the value of the τ1th quantile is greater than the τ2th quantile for some τ1 < τ2 (See Section 2.5 in (Koenker, 2005)). We do not make any assumptions on the noise vector ω ∈ Rn. More specifically the noise can be sampled from a heavy tailed distribution, can be heteroscedastic as in the location-scale model where ωi = 〈xi, η〉 · i, η ∈ Rp, i is noise independent of xi, bimodal and so on and so forth. Note that this setting is more general than for the least squares loss.\nWe consider a parametric quantile regression model where the τ th conditional quantile function of the response vari-\nable yi given any xi ∈ Rp is given by,\nF−1yi|xi(τ |xi) = 〈xi, θ ∗ τ 〉, θ∗τ ∈ Rp, τ ∈ (0, 1) , (2)\nwhere F−1yi|xi is the inverse of the conditional distribution function of yi given xi. We will assume the conditional density of yi evaluated at the conditional quantile 〈xi, θ∗τ 〉 is bounded away from zero uniformly for all τ , that is, fyi|xi(〈xi, θ∗τ 〉) > f > 0 for all τ and all xi. The goal is to estimate parameter θ̂τ close to θ∗τ using n observations of the data when n < p. The estimator in this paper belongs to the family of regularized estimators and is of the form:\nθ̂λn,τ := argminθ∈Rp Lτ (θ) + λnR(θ) , (3)\nwhere Lτ (θ) = 1n ∑n i=1 ρτ (yi−〈xi, θ〉), ρτ (·) is the quantile loss function and R(·) is any atomic norm. Examples of atomic norms we consider in this paper are the l1, l1/l2 nonoverlapping group sparse norm and the k-support norm. We present all results assuming any single τ ∈ (0, 1) and going forward drop the subscripts from θ∗τ and θ̂λn,τ .\nGaussian Width: All results will be in terms of the Gaussian width of suitable sets. For any set A ∈ Rp, the Gaussian width of the set A is defined as (Gordon, 1985; Chandrasekaran et al., 2012):\nw(A) = Eg [ sup u∈A 〈g, u〉 ] . (4)\nwhere the expectation is over g ∼ N(0, Ip×p). Gaussian widths have been widely used in prior literature on structured estimation (Chandrasekaran et al., 2012; Banerjee et al., 2014; Sivakumar et al., 2015; Tropp, 2015).\nHigh-dimensional estimation: Our analysis is built on developments over the past decade for high-dimensional structured regression for linear and generalized linear models using both regularized as well as constrained estimators (Candes & Tao, 2007; Bickel et al., 2009; Chandrasekaran et al., 2012; Negahban et al., 2012; Banerjee et al., 2014). For the regularized formulation considered in this work Banerjee et al. (2014); Negahban et al. (2012) have established a generalized analysis framework when the loss is least squares or more generally the maximum likelihood estimator for generalized linear models. We give a brief overview of the main components of the analysis.\n1. Regularization parameter: In Banerjee et al. (2014); Negahban et al. (2012) the regularization parameter is assumed to satisfy the following assumption,\nλn ≥ 2R∗(∇Lτ (θ∗)) . (5)\nWith ΩR = {u|R(u) ≤ 1} denoting the unit norm ball, Banerjee et al. (2014) prove that with high probability a\nvalue λn = O(w(ΩR)) satisfies the above condition for subGaussian design matrices, noise and the least squares loss.\n2. Error set: The assumption on the regularization parameter ensures that the error vector ∆ = θ̂− θ∗ lies in the following error set (Banerjee et al., 2014),\nC := {\n∆ | R(θ∗ + ∆) ≤ R(θ∗) + 1 2 R(∆)\n} . (6)\n3. The norm compatibility constant: It is defined as follows (Negahban et al., 2012; Banerjee et al., 2014),\nΨ(C) = sup u∈C\nR(u) ‖u‖2 . (7)\n4. Restricted Strong Convexity (RSC): In Banerjee et al. (2014); Negahban et al. (2012) the loss function is shown to satisfy the following RSC condition with high probability once the number of samples is of the order of the square of the Gaussian width of the error set, that is, n = O(w2(C)).\ninf u∈C δL(θ∗, u) = inf u∈C (L(θ∗ + u)− L(θ∗)− 〈∇L(θ∗), u〉)\n≥ κ‖u‖2 . (8)\nFor the squared loss, the RSC condition simplifies to the Restricted Eigenvalue (RE) condition (Bickel et al., 2009)\ninf u∈C\n1 n ‖Xu‖22 ≥ κ‖u‖22 . (9)\n5. Recovery Bounds: When RSC and bounds on the regularization parameter are satisfied Banerjee et al. (2014) prove the following deterministic error bound,\n‖∆‖2 = ‖θ̂ − θ∗‖2 ≤ c Ψ(C)w(ΩR)\nκ . (10)\nwhere c is any constant.\nAtomic Norms: We consider the class of atomic norms for the regularizer. Mathematically consider a set A ⊆ Rp the collection of atoms that is compact, centrally symmetric about the origin (that is, a ∈ A =⇒ −a ∈ A). Let ‖θ‖A denote the gauge of A,\nR(θ) = ‖θ‖A = inf{t > 0 : θ ∈ tconv(A)} (11) = inf{ ∑ a∈A ca : θ = ∑ a∈A caa, ca ≥ 0,∀a ∈ A} .\n(12)\nFor example when A = {±ei}pi=1 yields ‖θ‖A = ‖θ‖1. Although the atomic set A may contain uncountably many vectors, we assume A can be decomposed as a union of m sets,A = Ai∪A2∪. . . Am similar to the setting considered\nin Chen & Banerjee (2015). Such a decomposition assumption is satisfied by many popular atomic norms like the l1, l1/l2 group sparse norms, k-support norm, OWL norm etc. Throughout the paper we will illustrate our results on the following norms.\n1. l1 norm: For the l1 norm we will consider that θ∗ is an s-sparse vector, that is, ‖θ∗‖0 = s.\n2. l1/l2 nonoverlapping group sparse norm: Let {G1,G2, . . . , GNG} denote a collection of groups which are blocks of any vector θ ∈ Rp. Let θNG denote a vector with coordinates θiNG = θ\ni if i ∈ GNG , else θiNG = 0. The maximum size of any group is l = max\ni∈[1,...,NG ] |Gi|. The norm is given as R(θ) = ∑NG i=1 ‖θi‖2. Let SG ⊆ {1, 2, . . . , NG} with cardinality |SG | = sG . We consider the true parameter θ∗ ∈ Rp is sG-sparse, that is, θ∗NG = ~0,∀NG /∈ SG .\n3. k-support norm: The k-support norm can be expressed as an infimum convolution given by (Argyriou et al., 2012),\nR(θ) = inf∑ i ui=θ {∑ i ‖ui‖2 | ‖ui‖0 ≤ k } . (13)\nClearly it is an atomic norm for which A = {a ∈ Rp | ‖a‖0 ≤ k, ‖a‖2 = 1} and A is a union of ( p k ) subsets, that is, A = A1 ∪ A2 ∪ . . . A(pk). More results on the k-support norm can be looked up in Chatterjee et al. (2014); Chen & Banerjee (2015). We consider the setting where ‖θ∗‖0 = s and k < s. For the results we require the Gaussian widths of the unit norm ball, error set and the norm compatibility constants for the norms. We provide them below for reference. All values are in order notation.\nNorm w(ΩR) w(C) Ψ(C) l1 c √ log p c √ s log p c √ s\nl1/l2 c √ l + logNG c √ lsG + sG logNG c √ sG k-sp c √ k + k logd p\nk e c\n√ s+ s logd p\nk e c\n√ 2s/k"
  }, {
    "heading": "3 Number of InterPolated Samples (NIPS)",
    "text": "We begin with intuitions on the geometry of the problem. In the high sample, low dimension setting n >> p, when R(θ) = 0, the quantile loss is a linear program and hence the solutions are at the vertices, that is, where any p of the n samples are interpolated. Mathematically we define the quantity Z = {i : yi = 〈xi, θ̂〉 = 〈xi, θ∗ + u〉, u ∈ Rp} and note that ν = sup\nu∈Rp |Z| = O(p). In the high di-\nmensional setting considered in this paper n < p and hence with R(θ) = 0 the number of interpolated samples is ν = n. From an optimization perspective there are multiple such solutions and all solutions are optimal for all quantile parameters τ . But practically quantile regression is not working. Now introducing a regularizer\nwith a suitable choice for the regularization parameter ensures that the error vector lies in a restricted subset of Rp, C := { u ∣∣R(θ∗ + u) ≤ R(θ∗) + 12R(u) } ⊆ Rp. We are now interested in characterizing ν = sup u∈C |Z|, Z = {i : yi = 〈xi, θ̂〉 = 〈xi, θ∗ + u〉, u ∈ C}, that is, the maximum number of interpolated samples with the error restricted to a particular subset of Rp. Again if ν = n, quantile regression is not working. Since there are no restrictions on the number of non-zero elements in the error vector u a first crude estimate will be ν ≤ min{n, p, ‖u‖0}, which implies quantile regression will not work unless we have a minimum of p samples. But intuitively ν should depend on properties of the error set C, which the initial crude estimate is failing to take advantage of.\nBelow we state a result which reinforces the intuition of the relation between ν and the properties of the set C. Specifically we show that for the types of atomic norms considered in this work (which includes all popularly known vector norms) the number of interpolated samples does not exceed the product of the square of the norm compatibility constant and the square of the Gaussian width of the unit norm ball. For the norms considered, this is precisely the square of the Gaussian width of the error set C. For example for the l1 norm for an s-sparse vector this evaluates to an upper bound of ν = O(s log p). While the result statement considers subGaussian design matrices, the result will also hold for design matrices sampled from heavy-tailed distributions using arguments similar to Lecué & Mendelson (2014); Sivakumar et al. (2015).\nTheorem 3.1 ConsiderX has isotropic subGaussian rows and θ∗ is an s-sparse vector that can be written as a linear combination of k atoms from an atomic set of cardinality m,\nθ∗ = k∑ i=1 ciai, ai ∈ A, ci ≥ 0, |A| = m . (14)\nFor the regularized quantile regression problem penalized with the atomic norm R(θ) = ‖θ‖A,\nθ̂ = arg min θ∈Rp Lτ (θ)+λR(θ) = arg min θ∈Rp\n1\nn n∑ i=1 ρτ (θ)+λR(θ) ,\n(15) let C := { u|R(θ∗ + u) ≤ R(θ∗) + 12R(u) } denote the error set, let λ ≥ R∗(∇Lτ (θ∗)) and let n ≥ (c1s + c2Ψ\n2(C)w(A)) where Ψ(C) = sup u∈C ‖u‖A ‖u‖2 is the norm compatibility constant in the error set, w(A) is the Gaussian width of the unit norm ball and c1 and c2 are some constants. Then with probability atleast 1 − exp(−c2k1 log(em))−2 exp(−ηw2(C)) the number of in-\nterpolated samples,\nν = sup u∈C |{i : yi = 〈xi, θ∗+u〉, u ∈ C}| ≤ cΨ2(C)w2(A) , (16) where c is a constant.\nTo understand the intuition consider the case of the l1 norm. For an error vector lying in a particular s-dimensional subspace the maximum number of interpolated samples is O(s) with high probability. Extending the argument to all such s-dimensional subspaces by a union bound argument on the ( p s ) subspaces, the maximum number of interpolated samples when the error vector is any s-sparse vector in pdimensional space is O(s log p). Finally the argument is extended to all vectors in the error set using the powerful Maurey’s empirical approximation argument previously employed in Sivakumar et al. (2015); Lecué & Mendelson (2014); Rudelson & Zhou (2013).\nSuprisingly in prior literature on structured high dimensional quantile regression, the importance of ν has not been explicitly discussed. This intuition about the importance of ν also shows up in an elegant form in the analysis of the RSC condition in Section 4.2.\nBelow we provide results for the number of interpolated samples for the l1, l1/l2 nonoverlapping group sparse and k-support norms. For the l1/l2 nonoverlapping group sparse norm and the k-support norm we first illustrate that they are atomic norms. The results then follow from substituting known values for the norm compatibility constant and Gaussian width of unit norm ball for the different norms. For computation of these quantities for any general norm we refer the interested reader to work in Vershynin (2015); Chen & Banerjee (2015).\nCorollary 1 For the l1 norm with θ∗ being an s-sparse vector, when n > (c1s + c2s log p) then with high probability,\nν = sup u∈C |{i : yi = 〈xi, θ∗ + u〉}| ≤ cs log p , (17)\nfor some constant c.\nBefore applying the result to the nonoverlapping group sparse norm note that for any vector θ ∈ Rp,\nθ = NG∑ i=1 ∑ j cijβij , (18)\nwhere βij is any unit norm vector in subspace defined by the group i. For any group i, let θi denote the vector constructed from θ such that it has component k, θk = 0 if k /∈ i. Now by definition of atomic norm cij = ‖θi‖2 for θi\nin the same direction of βij , otherwise cij = 0. Therefore the group sparse norm is an atomic norm with a hierarchical set structure with the number of elements m = NG in the outer set with each element of the outer set itself being a set of an infinite number of elements with any one element chosen for a particular vector θ, that is, cij 6= 0 for only one j amongst an infinite number of j’s.\nCorollary 2 Consider the l1/l2 nonoverlapping groupsparse norm with n > (c1sGl + c2sG logNG). With high probability,\nν = sup u∈C |{i : yi = 〈xi, θ∗ + u〉}| ≤ c(lsG + sG logNG) ,\n(19) for some constant c.\nFor the k-support norm ‖θ‖spk = inf∑ i ui=θ\n{ ∑ i ‖ui‖2 | ‖ui‖0 ≤ k}, can be similarly\nexpressed as,\nθ = (pk)∑ i=1 ∑ j cijβij (20)\nwhere βij is a unit vector in k-dimensional subspace i. The difference compared to the nonoverlapping group sparse norm is that many of the cij’s can now be non zero in the inner sum. This is comparably more complex than the group-sparse norm where the inner set becomes a singleton for some θ, but in terms of the analysis nothing changes.\nCorollary 3 Consider the k-support norm with n > (c1s+ c2s logd pk e). With high probability,\nν = sup u∈C |{i : yi = 〈xi, θ∗ + u〉}| ≤ c(s+ s logdp/ke) ,\n(21) for some constant c."
  }, {
    "heading": "4 Structured Quantile Regression",
    "text": "In this section, we present results for the key components in the general analysis framework of Banerjee et al. (2014) which we briefly described in Section 2 of the paper. We start with results on the regularization parameter by analyzing equation (5) before establishing sample complexity bounds when the restricted strong convexity condition in equation (8) is satisfied. Finally an l2 bound on the error is obtained using (10). We will consider subGaussian design matrices throughout. All results are in terms of Gaussian widths of sets and the norm compatibility constant. Results for l1, l1/l2-nonoverlapping group sparse and ksupport norms are given for illustration purposes."
  }, {
    "heading": "4.1 Regularization Parameter λn",
    "text": "We analyze the bound in equation (5). In prior literature a bound has been established specifically for the l1 norm in Belloni & Chernozhukov (2011) (See Theorem 1). Below we consider the case of any general atomic norm and obtain a result in terms of the Gaussian width of the unit norm ball. The analysis follows from a similar result for the regularization parameter in Banerjee et al. (2014) for the least squares case.\nTheorem 4.1 Let X ∈ Rn×p be a design matrix with independent isotropic subGaussian rows with subGaussian norm |||xi|||ψ2 ≤ κ. Define ΩR = {u : R(u) ≤ 1} the unit norm ball and let φ = sup\nu ‖u‖2/R(u). Then the following\nholds E [R∗(∇Lτ (θ∗))] ≤ c √ τ(1− τ)w(ΩR)√\nn , (22)\nwhere c is any fixed constant depending only on the subGaussian norm κ. Moreover with probability atleast 1 −\nc1 exp\n( − (\nτ c2φκ\n)2) − 2 exp ( −2t2 ) R∗(∇Lτ (θ∗)) ≤ c √ τ(1− τ)w(ΩR) + t√\nn , (23)\nwhere c1, c2, t are absolute constants.\nA major difference to the least squares loss setting, is the independence of the regularization parameter to assumptions on the noise vector (see for example Theorem 3 and Theorem 4 in Banerjee et al. (2014) where the noise is explicitly assumed to be subGaussian and homoscedastic and the noise enters the analysis through properties of ‖ω‖2). This gives the flexibility of considering noise vectors which are heavy tailed or heteroscedastic. Indeed the most interesting applications of quantile regression arise in such settings.\nBelow we provide bounds for the regularization parameter for different norms by substituting known values of the Gaussian width for the unit norm balls. The result for the l1 norm matches with Theorem 1 in Belloni & Chernozhukov (2011) for the regularization parameter.\nCorollary 4 If R(·) is the l1 norm, with high probability R∗(∇Lτ (θ∗)) ≤ c √ τ(1− τ) √ log p+ t√\nn . (24)\nCorollary 5 If R(·) is the l1/l2 nonoverlapping group sparse norm, with high probability,\nR∗(∇Lτ (θ∗)) ≤ c √ τ(1− τ) √ l + logNG + t√ n .\nCorollary 6 If R(·) is the k-support norm, with high probability,\nR∗(∇Lτ (θ∗)) ≤ c √ τ(1− τ) √ k + k logd pk e+ t√ n ."
  }, {
    "heading": "4.2 Restricted Strong Convexity (RSC)",
    "text": "The loss needs to satisfy the RSC condition in equation (8). Prior literature on structured quantile regression has not discussed the RSC condition explicitly, though Fan et al. (2014b) considers it for the quantile huber loss function.\nWe start by providing an intuition for the RSC formulation for the quantile loss. The RSC condition equation (8) on the error set C evaluates to the following,\ninf u∈C\n1\nn n∑ i=1 ∫ 〈xi,u〉 0 (I(yi − 〈xi, θ∗〉 ≤ z)− I(yi − 〈xi, θ∗〉 ≤ 0)) dz .\n(25) Let ν = sup\nu∈C |Z| = sup u∈C |{i|yi = 〈xi, θ∗ + u〉}| is the num-\nber of interpolated samples. For any n < p if the model can interpolate all points, that is, ν = n then (25) evaluates to zero. In general, as shown in Section 3, ν gets determined by the structure. For example for the l1 norm ν = O(s log p) rather than the ambient dimensionality p. Thus, the sum over n points in (25) simply reduces to the sum over the (n−ν) points which are not interpolated, and will ensure the RSC condition when n > ν. The intuition of the NIPS property of Section 3 thus shows up elegantly in the RSC condition. In equation (25), let ξi = yi − 〈xi, θ∗〉, vi =∫ 〈xi,u〉 0\n(I(ξi ≤ z)− I(ξi ≤ 0)) and consider 1 n ∑n i=1E[vi],\n1\nn n∑ i=1 E[vi] = 1 n n∑ i=1 ∫ 〈xi,u〉 0 (Fi(ξi + z)− Fi(ξ))\n= 1\nn n∑ i=1 ∫ 〈xi,u〉 0 fi(ξi)zdz + o(1)\n= 1\n2n n∑ i=1 fi(ξi)〈xi, u〉2 + o(1)\n≥ f\n2n ‖Xu‖22 ≥ fκ‖u‖22 2 .\nThe first line follows from the definition of the cumulative distribution function, the second line by a simple Taylor series expansion, the last line by the assumption that f ≤ fi(ξi),∀i and (1/n)‖Xu‖22 ≥ κ, where κ is the restricted eigenvalue (RE) constant. The RE condition is satisfied as the sample complexity bounds for satisfying the NIPS property is same as the RE condition. More generally RSC is a condition on the minimum eigenvalue of the Jacobian matrix 1n ∑n i=1 fi(ξi)〈xi, u〉2 restricted to the error set\nC. This quantity has also been considered in prior literature (see Section 4.2 in Koenker (2005) and the proof in page 121, also see condition D.1 in Belloni & Chernozhukov (2011)). While the above analysis is in expectation of the quantity vi, we state the following result giving large deviation bounds for the above quantity.\nTheorem 4.2 ConsiderX ∈ Rn×p has subGaussian rows. Let 0 < f < fi(〈xi, θ∗〉) be a uniform lower bound on the conditional density for all xi in the support of x. Let κ denote the RE constant satisfying 1n‖Xu‖ 2 2 ≥ κ‖u‖22. Let the number of samples n > cw2(C) where w(C) is the Gaussian width of the error set C and c is some constant. Then with probability atleast 1− exp(−τ2/2)− exp ( −φ 2 1fξ 2 n ) where φ1, ξ < 1 and τ are constants,\ninf u∈C\nδLτ (θ∗, u) ≥ c1κf‖u‖22 . (26)\nwhere c1 < 0 is a constant.\nBelow we provide results for different norms. The sample complexity for the l1 norm matches the result in Belloni & Chernozhukov (2011) (see equation 2.10).\nCorollary 7 For the l1 norm with n > cs log p with high probability the following RSC condition is satisfied,\ninf u∈C\nδLτ (θ∗, u) ≥ cκf‖u‖22 . (27)\nCorollary 8 For the l1/l2 nonoverlapping group sparse norm with n > c(lsG + sG logNG) with high probability the following RSC condition is satisfied,\ninf u∈C\nδLτ (θ∗, u) ≥ κf‖u‖22 . (28)\nCorollary 9 For the k-support norm with n > c(s + s logd pk e) with high probability the following RSC condition is satisfied,\ninf u∈C\nδLτ (θ∗, u) ≥ cκf‖u‖22 . (29)"
  }, {
    "heading": "4.3 Recovery Bounds",
    "text": "Following the general framework outlined in Banerjee et al. (2014) (see Theorem 2), we state the following high probability bound on the two norm of the error vector ∆ = θ̂−θ∗.\nTheorem 4.3 For the quantile regression problem, when λn ≥ c1 √ τ(1−τ)w(ΩR)√\nn , n > c2w2(C) for some constants\nc1, c2 then with high probability, ‖∆‖2 ≤ c √ τ(1− τ)Ψ(C)w(ΩR)\nfκ . (30)\nwhere Ψ(C) is the norm compatibility constant in the error set.\nThe two norm of the error depends on the two terms√ τ(1− τ) and f . The √ τ(1− τ) term is minimized at the tails and hence has the effect of reducing the estimation error. But typically this is dominated by the lower bound on the density f term which makes the estimate less precise in regions of low density. This is to be expected as there are very few samples to make a very precise estimate in low density regions. While similar observations are made in page 72 of Koenker (2005), the results are asymptotic while we show non-asymptotic recovery bounds. Another aspect we reiterate here is the independence of the results from the form of the noise. All results make no assumptions on the noise apart from an assumption on the lower bound of the noise density.\nBelow we provide recovery bounds for the different norms we consider in the paper.\nCorollary 10 For the l1 norm when λn ≥ c1 √ τ(1−τ)\n√ log p√\nn and n > c2s log p with high proba-\nbility\n‖∆‖2 ≤ c √ s log p\nfκ √ n\n(31)\nCorollary 11 For the l1/l2 nonoverlapping group sparse\nnorm when λn > c1 √ τ(1−τ) √ l+logNG√\nn and n > c(lsG +\nsG logNG) with high probability\n‖∆‖2 ≤ c √ lsG + sG logNG\nfκ √ n\n(32)\nCorollary 12 For the k-support norm when λn > c1 √ τ(1−τ)\n√ k+k logd pk e√ n\nand n > cs + s logd pk e with high probability\n‖∆‖2 ≤ c √ s+ s logd pk e fκ √ n\n(33)"
  }, {
    "heading": "5 Experiments",
    "text": "We perform simulations with synthetic data."
  }, {
    "heading": "5.1 Phase Transition",
    "text": "Data is generated as y = Xθ∗ + ω. θ∗ = [1, 1, 1, 1, 1, 1︸ ︷︷ ︸\n6\n, 0, 0, . . . , 0︸ ︷︷ ︸ p-6 ] ∈ Rp for the l1 norm and\nθ∗ = [1, . . . , 1︸ ︷︷ ︸ 5 , 1, . . . , 1︸ ︷︷ ︸ 5 , 1, . . . , 1︸ ︷︷ ︸ 5 , 0, . . . , 0︸ ︷︷ ︸ 5 , . . . , 0, . . . , 0︸ ︷︷ ︸ 5 ] for the l1/l2 group sparse norm with p ∈ [500, 750, 1000]. The noise ωi ∼ N(0, 0.25),∀i ∈ [n] is Gaussian with zero mean and 0.25 variance. The design matrix X ∼\nN(0, Ip×p) is multivariate Gaussian with identity covariance. We vary n = [10, 20, 30, . . . , 120, 130]. For each n we generate 100 datasets with the probability of success defined as the fraction of times we are able to faithfully estimate the true parameter. For p = 500 we run simulations for τ ∈ [0.1, 0.5, 0.9] and for p ∈ [750, 1000] we run simulations only for τ = 0.5. For the optimization, we use the Alternating Direction Method of Multipliers (Boyd et al., 2010). The details of the updates can be found in the flare\ndocumentation Li et al. (2015). The code was implemented in Python. The plots in Figure 1 clearly show a phase transition for both the l1 and l1/l2 group sparse norms for all quantiles exemplifying the NIPS property described earlier."
  }, {
    "heading": "5.2 Robustness",
    "text": "We showcase the robustness enjoyed by quantile regression over ordinary least squares estimation against heavytailed noise and outliers. We consider the l1 norm with y = Xθ∗ + ω. θ∗ = [1, 1, 1, 1, 1, 1︸ ︷︷ ︸\n6\n, 0, 0, . . . , 0︸ ︷︷ ︸ 494 ] ∈ Rp. For\nheavy-tailed noise we consider the student t-distribution with different degrees of freedom, with lower degrees of freedom corresponding to heavier tailed data. To show the robustness to outliers we randomly pick a certain percentage of samples from the dataset and multiply the noise by 10, that is, ωi = 10 ∗ ωi for a certain proportion of the dataset. We vary the proportion of contamination from 2.5% to 15%. We fix n = 200 for this simulation. Again for both exercises, we run 100 simulations and plot the mean and standard deviation of the estimation error ‖θ̂ − θ∗‖2. The plots in Figure 2 show 1. the estimation error against varying degrees of freedom of the student tdistribution and 2. estimation error against the percent contamination. The observations are in agreement with conventional wisdom on robustness of the quantile regression estimator to heavy-tailed noise and outliers."
  }, {
    "heading": "6 Conclusions",
    "text": "The paper presents a general framework for the analysis of non-asymptotic error and structured recovery for norm regularized quantile regression for any atomic norm. Our results are based on extending the general analysis framework outlined in Banerjee et al. (2014); Negahban et al. (2012) using insights from the geometry of the problem. In particular we introduce the Number of InterPolated Samples (NIPS) as critical for determining the sample complexity for consistent recovery. We prove that once the number of samples crosses the NIPS threshold, we start recovering the true parameter. This phase transition phenomena for norm regularized quantile regression problems has not been discussed in prior literature. We also prove that NIPS is of the order of square of the Gaussian width of the error set for many atomic norms - which is the same order as that for regularized least squares regression and match results from previous work for the l1 norm (Belloni & Chernozhukov, 2011).\nAcknowledgements: We thank reviewers for their valuable comments. This work was supported by NSF grants IIS-1563950, IIS-1447566, IIS-1447574, IIS-1422557, CCF-1451986, CNS-1314560, IIS-0953274, IIS-1029711, NASA grant NNX12AQ39A."
  }],
  "year": 2017,
  "references": [{
    "title": "Estimation Bounds and Sharp Oracle Inequalities of Regularized Procedures with Lipschitz Loss Functions",
    "authors": ["P. Alquier", "V. Cottet", "G. Lecue"],
    "year": 2017
  }, {
    "title": "Sparse Prediction with the k-Support Norm",
    "authors": ["Argyriou", "Andreas", "Foygel", "Rina", "Srebro", "Nathan"],
    "venue": "In Neural Information Processing Systems (NIPS),",
    "year": 2012
  }, {
    "title": "Estimation with Norm Regularization",
    "authors": ["Banerjee", "Arindam", "Chen", "Sheng", "Fazayeli", "Farideh", "Sivakumar", "Vidyashankar"],
    "venue": "In Neural Information Processing Systems (NIPS),",
    "year": 2014
  }, {
    "title": "l1Penalized Quantile Regression in High-Dimensional Sparse Models",
    "authors": ["Belloni", "Alexandre", "Chernozhukov", "Victor"],
    "venue": "The Annals of Statistics,",
    "year": 2011
  }, {
    "title": "Simultaneous analysis of Lasso and Dantzig selector",
    "authors": ["Bickel", "Peter J", "Ritov", "Yaacov", "Tsybakov", "Alexandre B"],
    "venue": "The Annals of Statistics,",
    "year": 2009
  }, {
    "title": "Statistical Estimation and Testing via the Sorted L1 Norm",
    "authors": ["Bogdan", "Malgorzata", "Berg", "Ewout van den", "Su", "Weijie", "Emmanuel", "Candes"],
    "year": 1969
  }, {
    "title": "Distributed Optimization and Statistical Learning via the Alternating Direction Method of Multipliers",
    "authors": ["Boyd", "Stephen", "Parikh", "Neal", "Chu", "Eric", "Peleato", "Borja", "Eckstein", "Jonathan"],
    "venue": "Foundations and Trends in Machine Learning,",
    "year": 2010
  }, {
    "title": "Exact Matrix Completion via Convex Optimization",
    "authors": ["Candès", "Emmanuel J", "Recht", "Benjamin"],
    "venue": "Foundations of Computational Mathematics,",
    "year": 2009
  }, {
    "title": "The Dantzig selector : statistical estimation when p is much larger than n",
    "authors": ["Candes", "Emmanuel J", "Tao", "Terence"],
    "venue": "The Annals of Statistics,",
    "year": 2007
  }, {
    "title": "The Convex Geometry of Linear Inverse Problems",
    "authors": ["Chandrasekaran", "Venkat", "Recht", "Benjamin", "Parrilo", "Pablo A", "Willsky", "Alan S"],
    "venue": "Foundations of Computational Mathematics,",
    "year": 2012
  }, {
    "title": "Generalized Dantzig Selector: Application to the k-support Norm",
    "authors": ["Chatterjee", "Soumyadeep", "Chen", "Sheng", "Banerjee", "Arindam"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2014
  }, {
    "title": "Structured Estimation with Atomic Norms: General Bounds and Applications",
    "authors": ["Chen", "Sheng", "Banerjee", "Arindam"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Adaptive Robust Variable Selection",
    "authors": ["Fan", "Jianqing", "Yingying", "Barut", "Emre"],
    "venue": "Annals of Statistics,",
    "year": 2014
  }, {
    "title": "Robust Estimation of High-Dimensional",
    "authors": ["Fan", "Jianqing", "Li", "Quefeng", "Wang", "Yuyan"],
    "venue": "Mean Regression",
    "year": 2014
  }, {
    "title": "Some Inequalitites for Gaussian Processes and Applications",
    "authors": ["Gordon", "Yehoram"],
    "venue": "Israel Journal of Mathematics,",
    "year": 1985
  }, {
    "title": "Loss Minimization and Parameter Estimation with Heavy Tails",
    "authors": ["Hsu", "Daniel", "Sabato", "Sivan"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }, {
    "title": "New Efficient Estimation and Variable Selection Methods for Semiparametric Varying-Coefficient Partially Linear Models",
    "authors": ["B. Kai", "R. Li", "H. Zou"],
    "venue": "The Annals of Statistics,",
    "year": 2011
  }, {
    "title": "Group Lasso for High Dimensional Sparse Quantile Regression Models",
    "authors": ["Kato", "Kengo"],
    "year": 2011
  }, {
    "title": "Quantile Regression",
    "authors": ["Koenker", "Roger"],
    "year": 2005
  }, {
    "title": "Sparse recovery under weak moment assumptions",
    "authors": ["Lecué", "Guillaume", "Mendelson", "Shahar"],
    "year": 2014
  }, {
    "title": "The flare package for high dimensional linear regression and precision matrix estimation in r",
    "authors": ["Li", "Xingguo", "Zhao", "Tuo", "Yuan", "Xiaoming", "Liu", "Han"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2015
  }, {
    "title": "L1-norm Quantile Regression",
    "authors": ["Y.J. Li", "J. Zhu"],
    "venue": "Journal of Computational and Graphical Statistics,",
    "year": 2008
  }, {
    "title": "Estimating Structured Vector Autoregressive Model",
    "authors": ["Melnyk", "Igor", "Banerjee", "Arindam"],
    "venue": "In International Conference on Machine Learning (ICML),",
    "year": 2016
  }, {
    "title": "A Unified Framework for HighDimensional Analysis ofM -Estimators with Decomposable Regularizers",
    "authors": ["Negahban", "Sahand N", "Ravikumar", "Pradeep", "Wainwright", "Martin J", "Yu", "Bin"],
    "venue": "Statistical Science,",
    "year": 2012
  }, {
    "title": "Reconstruction from anisotropic random measurements",
    "authors": ["Rudelson", "Mark", "Zhou", "Shuheng"],
    "venue": "IEEE Transactions on Information Theory, 59(6):3434–3447,",
    "year": 2013
  }, {
    "title": "Beyond Sub-Gaussian Measurements: High-Dimensional Structured Estimation with SubExponential Designs",
    "authors": ["Sivakumar", "Vidyashankar", "Banerjee", "Arindam", "Ravikumar", "Pradeep"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Regression Shrinkage and Selection via the Lasso",
    "authors": ["Tibshirani", "Robert"],
    "venue": "Journal of the Royal Statistical Society,",
    "year": 1996
  }, {
    "title": "Convex recovery of a structured signal from independent random linear measurements. In Sampling Theory - a Renaissance",
    "authors": ["Tropp", "Joel A"],
    "year": 2015
  }, {
    "title": "Estimation in High Dimensions: A geometric perspective",
    "authors": ["Vershynin", "Roman"],
    "venue": "In Sampling Theory, a Renaissance,",
    "year": 2015
  }, {
    "title": "Quantile Regression for Analyzing Heterogeneity in Ultra-high Dimension",
    "authors": ["Wang", "Lan", "Wu", "Yichao", "Li", "Runze"],
    "venue": "Journal of the American Statistical Association,",
    "year": 2012
  }, {
    "title": "Variable Selection in Quantile Regression",
    "authors": ["Y.C. Wu", "Y.F. Liu"],
    "venue": "Statistica Sinica,",
    "year": 2009
  }, {
    "title": "Composite Quantile Regression and the Oracle Model Selection Theory",
    "authors": ["H. Zou", "M. Yuan"],
    "venue": "The Annals of Statistics,",
    "year": 2008
  }],
  "id": "SP:9b8e2fa4e104cbe0c270eb0d01d7d06e2d479493",
  "authors": [{
    "name": "Vidyashankar Sivakumar",
    "affiliations": []
  }, {
    "name": "Arindam Banerjee",
    "affiliations": []
  }],
  "abstractText": "Quantile regression aims at modeling the conditional median and quantiles of a response variable given certain predictor variables. In this work we consider the problem of linear quantile regression in high dimensions where the number of predictor variables is much higher than the number of samples available for parameter estimation. We assume the true parameter to have some structure characterized as having a small value according to some atomic norm R(·) and consider the norm regularized quantile regression estimator. We characterize the sample complexity for consistent recovery and give non-asymptotic bounds on the estimation error. While this problem has been previously considered, our analysis reveals geometric and statistical characteristics of the problem not available in prior literature. We perform experiments on synthetic data which support the theoretical results.",
  "title": "High-Dimensional Structured Quantile Regression"
}