{
  "sections": [{
    "heading": "1. Introduction",
    "text": "The Gibbs sampler of Geman & Geman (1984), also known as the Glauber dynamics or the heat-bath algorithm, is a leading Markov chain Monte Carlo (MCMC) method for approximating expectations unavailable in closed form. First detailed as a technique for restoring degraded images (Geman & Geman, 1984), Gibbs sampling has since found diverse applications in statistical physics (Janke, 2008), stochastic optimization and parameter estimation (Geyer, 1991), and Bayesian inference (Lunn et al., 2000).\nThe hallmark of any Gibbs sampler is conditional simulation: individual variables are successively simulated from the univariate conditionals of a multivariate target distribu-\n1Department of Computer Science, Stanford University, Stanford, CA 94305 USA 2Microsoft Research New England, One Memorial Drive, Cambridge, MA 02142 USA. Correspondence to: Ioannis Mitliagkas <imit@stanford.edu>, Lester Mackey <lmackey@microsoft.com>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\ntion. The principal degree of freedom is the scan, the order in which variables are sampled (He et al., 2016). While it is common to employ a systematic scan, sweeping through each variable in turn, or a uniform random scan, sampling each variable with equal frequency, it is known that nonuniform scans can lead to more accurate inferences both in theory and in practice (Liu et al., 1995; Levine & Casella, 2006). This effect is particularly pronounced when certain variables are of greater inferential interest. Past approaches to optimizing Gibbs sampler scans were based on asymptotic quality measures approximated with the output of a Markov chain (Levine et al., 2005; Levine & Casella, 2006).\nIn this work, we propose a computable non-asymptotic scan quality measure for discrete target distributions based on Dobrushin’s notion of variable influence (Dobrushin & Shlosman, 1985). We show that for a given subset of variables, this Dobrushin variation (DV) bounds the marginal total variation between a target distribution and T steps of Gibbs sampling with a specified scan. More generally, Dobrushin variation bounds a weighted total variation based on userinputted importance weights for each variable. We couple this quality measure with an efficient procedure for optimizing scan quality by minimizing Dobrushin variation. Our Dobrushin-optimized Gibbs samplers (DoGS) come equipped with a guaranteed bound on scan quality, are never worse than the standard uniform random and systematic scans, and can be tailored to a target number of sampling steps and a subset of target variables. Moreover, Dobrushin variation can be used to evaluate and compare the quality of any user-specified set of scans prior to running any expensive simulations.\nThe improvements achieved by DoGS are driven by an inputted matrix, ¯C, of pairwise variable influence bounds discussed in more detail in Section 3. While DoGS can be used with any discrete distribution, it was designed for targets with total influence k ¯Ck < 1, measured in any matrix norm. This criterion is known to hold for a variety of distributions, including Ising models with sufficiently high temperatures, hard-core lattice gas models, random graph colorings (Hayes, 2006), and classes of weighted constraint satisfaction problems (Feng et al., 2017). Moreover, as we will see in Section 4.1, suitable variable influence bounds are readily available for pairwise and binary Markov random fields. These user-friendly bounds give rise to total\ninfluence k ¯Ck < 1 in all of our experiments and thereby enable improvements in both inferential speed and accuracy over standard scans.\nThe remainder of the paper is organized as follows. Section 2 reviews Gibbs sampling and standard but computationally intractable measures of Gibbs sampler quality. In Section 3, we introduce our scan quality measure and its relationship to (weighted) total variation. We describe our procedures for selecting high-quality Gibbs sampler scans in Section 4. In Section 5, we apply our techniques to three popular applications of the Gibbs sampler: joint image segmentation and object recognition, MCMC maximum likelihood estimation with intractable gradients, and inference in the Ising model. In each case, we observe substantial improvements in full or marginal total variation over standard scans. Section 6 presents our conclusions and discussion of future work.\nNotation For any vector v and index i, we let v i represent the subvector of v with entry v\ni removed. We use diag(v) for a square diagonal matrix with v on the diagonal and for element-wise multiplication. The i-th standard basis vector is denoted by e\ni , I represents an identity matrix, 1 signifies a vector of ones, and kCk is the spectral norm of matrix C. We use the shorthand [p] , {1, . . . , p}."
  }, {
    "heading": "2. Gibbs sampling and total variation",
    "text": "Consider a target distribution ⇡ on a finite p-dimensional state space, X p. Our inferential goal is to approximate expectations – means, moments, marginals, and more complex function averages, E\n⇡\n[f(X)] = P\nx2Xp ⇡(x)f(x) – under ⇡, but we assume that both exact computation and direct sampling from ⇡ are prohibitive due to the large number of states, |X |p. Markov chain Monte Carlo (MCMC) algorithms attempt to skirt this intractability by simulating a sequence of random vectors X0, X1, . . . , XT 2 X p from tractable distributions such that expectations over XT are close to expectations under ⇡."
  }, {
    "heading": "2.1. Gibbs sampling",
    "text": "Algorithm 1 summarizes the specific recipe employed by the Gibbs sampler (Geman & Geman, 1984), a leading MCMC algorithm which successively simulates single variables from their tractable conditional distributions. The principal degree of freedom in a Gibbs sampler is the scan, the sequence of p-dimensional probability vectors q\n1 , . . . , q T\ndetermining the probability of resampling each variable on each round of Gibbs sampling. Typically one selects between the uniform random scan, q\nt = (1/p, . . . , 1/p) for all t, where variable indices are selected uniformly at random on each round and the systematic scan, q\nt = e (t mod p)+1\nfor each t, which repeatedly cycles through each variable\nAlgorithm 1 Gibbs sampling (Geman & Geman, 1984) input Scan (q\nt\n)\nT t=1 ; starting distribution µ; single-variable conditionals of target distribution, ⇡(·|X i)\nSample from starting distribution: X0 ⇠ µ for t in 1, 2, . . . , T do\nSample variable index to update using scan: i t ⇠ q t Sample Xt it ⇠ ⇡(·|Xt 1 it ) from its conditional Copy remaining variables: Xt it = X t 1 it\nend for\noutput Sample sequence (Xt)T t=0\nin turn. However, non-uniform scans are known to lead to better approximations (Liu et al., 1995; Levine & Casella, 2006), motivating the need for practical procedures for evaluating and improving Gibbs sampler scans."
  }, {
    "heading": "2.2. Total variation",
    "text": "Let ⇡ t represent the distribution of the t-th step, Xt, of a Gibbs sampler. The quality of a T -step Gibbs sampler and its scan is typically measured in terms of total variation (TV) distance between ⇡\nT\nand the target distribution ⇡:\nDefinition 1. The total variation distance between probability measures µ and ⌫ is the maximum difference in expectations over all [0, 1]-valued functions,\nkµ ⌫k TV , sup f :Xp![0,1] |E µ [f(X)] E ⌫ [f(Y )]|.\nWe view TV as providing a bound on the bias of a large class of Gibbs sampler expectations; note, however, that TV does not control the variance of these expectations."
  }, {
    "heading": "2.3. Marginal and weighted total variation",
    "text": "While we typically sample all p variables in the process of Gibbs sampling, it is common for some variables to be of greater interest than others. For example, when modeling a large particle system, we may be interested principally in the behavior in local region of the system; likewise, when segmenting an image into its component parts, a particular region, like the area surrounding a face, is often of primary interest. In these cases, it is more natural to consider a marginal total variation that measures the discrepancy in expectation over only those variables of interest.\nDefinition 2 (Marginal total variation). The marginal total variation between probability measures µ and ⌫ on a subset of variables S 2 [p] is the maximum difference in expectations over all [0, 1]-valued functions of X\nS , the restriction of X to the coordinates in S:\nkµ ⌫k S,TV , sup f :X |S|![0,1] E µ\n⇥ f X S ⇤ E ⌫ ⇥ f Y S ⇤ .\nMore generally, we will seek to control an arbitrary userdefined weighted total variation that assigns an independent non-negative weight to each variable and hence controls the approximation error for functions with varying sensitivities in each variable. Definition 3 (d-bounded differences). We say f : X p ! R has d-bounded differences for d 2 Rd if, for all X,Y 2 X p,\n|f(X) f(Y )|  pX\ni=1\nd i I[X i 6= Y i ].\nFor example, every function with range [0, 1] is a 1- Lipschitz feature, and the value of the first variable, x 7! x\n1 , is an e\n1 -Lipschitz feature. This definition leads to a measure of sample quality tailored to d-bounded difference functions. Definition 4 (d-weighted total variation). The d-weighted total variation between probability measures µ and ⌫ is the maximum difference in expectations across d-bounded difference functions:\nkµ ⌫k d,TV , sup d bounded di↵erencef |E µ [f(X)] E ⌫ [f(Y )]|"
  }, {
    "heading": "3. Measuring scan quality with Dobrushin",
    "text": "variation\nSince the direct computation of total variation measures is typically prohibitive, we will define an efficiently computable upper bound on the weighted total variation of Definition 4. Our construction is inspired by the Gibbs sampler convergence analysis of Dobrushin & Shlosman (1985).\nThe first step in Dobrushin’s approach is to control total variation in terms of coupled random vectors, (X\nt , Y t ) T\nt=0 , where Xt has the distribution, ⇡\nt , of the t-th step of the Gibbs sampler and Y t follows the target distribution ⇡. For any such coupling, we can define the marginal coupling probability p\nt,i , P(Xt i 6= Y t i ). The following lemma, a generalization of results in (Dobrushin & Shlosman, 1985; Hayes, 2006), shows that weighted total variation is controlled by these marginal coupling probabilities. The proof is given in Appendix A.1, and similar arguments can be found in Rebeschini & van Handel (2014). Lemma 5 (Marginal coupling controls weighted TV). For any joint distribution (X, Y ) such that X ⇠ µ and Y ⇠ ⌫ for probability measures µ and ⌫ on X p and any nonnegative weight vector d 2 Rp,\nkµ ⌫k d,TV\n X\ni\nd i P(X i 6= Y i ).\nDobrushin’s second step is to control the marginal coupling probabilities p\nt in terms of influence, a measure of how much a change in variable j affects the conditional distribution of variable i.\nDefinition 6 (Dobrushin influence matrix). The Dobrushin influence of variable j on variable i is given by\nC ij , max (X,Y )2Nj k⇡(·|X i) ⇡(·|Y i)kTV (1)\nwhere (X, Y ) 2 N j signifies X l = Y l for all l 6= j.\nThis influence matrix is at the heart of our efficiently computable measure of scan quality, Dobrushin variation. Definition 7 (Dobrushin variation). For any nonnegative weight vector d 2 Rp and entrywise upper bound ¯C on the Dobrushin influence (1), we define the Dobrushin variation of a scan (q\nt\n)\nT t=1\nas\nV(q 1 , . . . , q T ; d, ¯C) , d>B(q T ) · · · B(q 1 )1\nfor B(q) , (I diag(q)(I ¯C)).\nTheorem 8 shows that Dobrushin variation dominates weighted TV and thereby provides target- and scan-specific guarantees on the weighted TV quality of a Gibbs sampler. The proof in Appendix A.2 rests on the fact that, for each t, b\nt , B(q t ) · · · B(q 1 )1 provides an elementwise upper bound on the vector of marginal coupling probabilities, p\nt . Theorem 8 (Dobrushin variation controls weighted TV). Suppose that ⇡\nT is the distribution of the T -th step of a Gibbs sampler with scan (q\nt\n)\nT t=1 . Then, for any nonnegative weight vector d 2 Rp and entrywise upper bound ¯C on the Dobrushin influence (1),\nk⇡ T ⇡k d,TV  V (q t ) T t=1 ; d, ¯C ."
  }, {
    "heading": "4. Improving scan quality with DoGS",
    "text": "We next present an efficient algorithm for improving the quality of any Gibbs sampler scan by minimizing Dobrushin variation. We will refer to the resulting customized Gibbs samplers as Dobrushin-optimized Gibbs samplers or DoGS for short. Algorithm 2 optimizes Dobrushin variation using coordinate descent, with the selection distribution q\nt for each time step serving as a coordinate. Since Dobrushin variation is linear in each q\nt , each coordinate optimization (in the absence of ties) selects a degenerate distribution, a single coordinate, yielding a fully deterministic scan. If m  p is a bound on the size of the Markov blanket of each variable, then our forward-backward algorithm runs in time O(kdk\n0 + min(m log p + m2, p)T ) with O(p + T ) storage for deterministic input scans. The T (m log p + m2) term arises from maintaining the derivative vector, w, in an efficient sorting structure, like a max-heap.\nA user can initialize DoGS with any baseline scan, including a systematic or uniform random scan, and the resulting customized scan is guaranteed to have the same or better Dobrushin variation. Moreover, DoGS scans will always\nAlgorithm 2 DoGS: Scan selection via coordinate descent input Scan (q\n⌧\n)\nT ⌧=1 ; variable weights d; influence entrywise upper bound ¯C; (optional) target accuracy ✏.\n// Forward: Precompute coupling bounds of Section 3, // b\nt = B(q t ) · · · B(q 1 )1 = B(q t )b t 1 with b0 = 1.\n// Only store b = b T and sequence of changes ( b t ) T 1 t=0 . // Also precompute Dobrushin variation V = d>b\nT\n// and derivatives w = @V/@q T = d (I ¯C)b T . b 1, V d>b, w d (I ¯C)b for t in 1, 2, . . . T do\nb t 1 diag (qt)(I ¯C)b b b b\nt 1 // bt = bt 1 bt 1 V V d> b\nt 1 // V = d>bt w w + d (I ¯C) b\nt 1 // w = d (I ¯C)bt end for\n// Backward: Optimize scan one step, q⇤ t , at a time. for t in T, T 1, . . . , 1 do\nIf V  ✏, then q⇤ t\nq t ; break // early stopping b b + b\nt 1 // bt 1 = bt + bt 1 // Update w = @V/@q\nt = d t (I ¯C)b t 1\n// for d> t , d>B(q⇤ T ) · · · B(q⇤ t+1 ) and d> T , d> w w d (I ¯C) b t 1 // Pick probability vector q⇤\nt minimizing d> t B(q t )b t 1\nq⇤ t\ne argmini wi\nV V + d> diag(q⇤ t q t )b // V = d> t 1bt 1\nd > d> diag(q⇤ t\n)(I ¯C) d> d> d> // d>\nt 1 = d > t B(q⇤ t )\nw w+ d (I ¯C)b // w = d t 1 (I ¯C)bt 1\nend for\noutput Optimized scan (q ⌧ ) t 1 ⌧=1 , (q⇤ ⌧ ) T ⌧=t\nbe d-ergodic (i.e., k⇡ T ⇡k d,TV ! 0 as T ! 1) when initialized with a systematic or uniform random scan and ¯C\n< 1. This follows from the following proposition, which shows that Dobrushin variation—and hence the dweighted total variation by Theorem 8—goes to 0 under these conditions and standard scans. The proof relies on arguments in (Hayes, 2006) and is outlined in Appendix A.3. Proposition 9. Suppose that ¯C is an entrywise upper bound on the Dobrushin influence matrix (1) and that (q\nt\n)\nT t=1 is a systematic or uniform random scan. If ¯C < 1, then, for any nonnegative weight vector d, the Dobrushin variation vanishes as the chain length T increases. That is,\nlim T!1 V(q 1 , . . . , q T ; d, ¯C) = 0."
  }, {
    "heading": "4.1. Bounding influence",
    "text": "An essential input to our algorithms is the entrywise upper bound ¯C on the influence matrix (1). Fortunately, Liu &\nDomke (2014) showed that useful influence bounds are particularly straightforward to compute for any pairwise Markov random field (MRF) target,\n⇡(X) / exp( P\ni,j P a,b2X ✓ ij\nab\nI[X i = a, X j = b]). (2)\nTheorem 10 (Pairwise MRF influence (Liu & Domke, 2014, Lems. 10, 11)). Using the shorthand (s) , 1\n1+e s , the influence (1) of the target ⇡ in (2) satisfies\nC ij  max xj ,yj |2 ( 1 2 max a,b (✓ij axj ✓ij ayj ) (✓ij bxj ✓ij byj )) 1|.\nPairwise MRFs with binary variables X i 2 { 1, 1} are especially common in statistical physics and computer vision. A general parameterization for binary pairwise MRFs is given by\n⇡(X) / exp( P i 6=j ✓ijXiXj + P i ✓ i X i ), (3)\nand our next theorem, proved in Appendix A.4, leverages the strength of the singleton parameters ✓\ni to provide a tighter bound on the influence of these targets. Theorem 11 (Binary pairwise influence). The influence (1) of the target ⇡ in (3) satisfies\nC ij\n |exp(2✓ij) exp( 2✓ij)| b ⇤\n(1 + b⇤ exp(2✓ ij ))(1 + b⇤ exp( 2✓ ij ))\nfor b⇤ = max(e 2 P k 6=j |✓ik| 2✓i , min[e2 P k 6=j |✓ik| 2✓i , 1]).\nTheorem 11 in fact provides an exact computation of the Dobrushin influence C\nij whenever b⇤ 6= 1. The only approximation comes from the fact that the value b⇤ = 1 may not belong to the set B = {e2 P k 6=j ✓ikXk 2✓i | X 2 { 1, 1}p}. An exact computation of C ij\nwould replace the cutoff of 1 with its closest approximation in B.\nSo far, we have focused on bounding influence in pairwise MRFs, as these bounds are most relevant to our experiments; indeed, in Section 5, we will use DoGS in conjunction with the bounds of Theorems 10 and 11 to improve scan quality for a variety of inferential tasks. However, user-friendly bounds are also available for non-pairwise MRFs (note that any discrete distribution can be represented as an MRF with parameters in the extended reals), and we include a simple extension of Theorem 11 that applies to binary MRFs with higher-order interactions. Its proof is in Appendix A.5 Theorem 12 (Binary higher-order influence). The target\n⇡(X) / exp( P S2S ✓S Q k2S Xk + P i ✓ i X i ),\nfor X 2 { 1, 1}d and S a set of non-singleton subsets of [p], has influence (1) satisfying\nC ij\n | exp(2 P S2S:i,j2S |✓S |) exp( 2 P S2S:i,j2S |✓S |)| b ⇤\n(1+b ⇤ ) 2\nfor b⇤ = max(exp( 2 P\nS2S:i2S,j /2S |✓S | 2✓\ni\n), min(exp(2 P\nS2S:i2S,j /2S |✓S | 2✓i), 1))."
  }, {
    "heading": "4.2. Related Work",
    "text": "In related work, Latuszynski et al. (2013) recently analyzed an abstract class of adaptive Gibbs samplers parameterized by an arbitrary scan selection rule. However, as noted in their Rem. 5.13, no explicit scan selection rules were provided in that paper. The only prior concrete scan selection rules of which we are aware are the Minimax Adaptive Scans with asymptotic variance or convergence rate objective functions (Levine & Casella, 2006). Unless some substantial approximation is made, it is unclear how to implement these procedures when the target distribution of interest is not Gaussian.\nLevine & Casella (2006) approximate these Minimax Adaptive Scans for specific mixture models by considering single ad hoc features of interest; the approach has many hyperparameters to tune including the order of the Taylor expansion approximation, which sample points are used to approximate asymptotic quantities online, and the frequency of adaptive updating. Our proposed quality measure, Dobrushin variation, requires no approximation or tuning and can be viewed as a practical non-asymptotic objective function for the abstract scan selection framework of Levine and Casella. In the spirit of (Lacoste-Julien et al., 2011), DoGS can also be viewed as an approximate inference scheme calibrated for downstream inferential tasks depending only on subsets of variables.\nLevine et al. (2005) employ the Minimax Adaptive Scans of Levine and Casella by finding the mode of their target distribution using EM and then approximating the distribution by a Gaussian. They report that this approach to scan selection introduces substantial computational overhead (10 minutes of computation for an Ising model with 64 variables). As we will see in Section 5, the overhead of DoGS scan selection is manageable (15 seconds of computation for an Ising model with 1 million variables) and outweighed by the increase in scan quality and sampling speed."
  }, {
    "heading": "5. Experiments",
    "text": "In this section, we demonstrate how our proposed scan quality measure and efficient optimization schemes can be used to both evaluate and improve Gibbs sampler scans when either the full distribution or a marginal distribution is of principal interest. For all experiments with binary MRFs, we adopt the model parameterization of (3) (with no additional temperature parameter) and use Theorem 11 to produce the Dobrushin influence bound ¯C. On all ensuing plots, the numbers in the legend state the best guarantee achieved for each algorithm plotted. Due to space constraints, we display only one representative plot per experiment; the analogous plots from independent replicates of each experiment can be found in Appendix B.\n2"
  }, {
    "heading": "5.1. Evaluating and optimizing Gibbs sampler scans",
    "text": "In our first experiment, we illustrate how Dobrushin variation can be used to select between standard scans and how DoGS can be used to efficiently improve upon standard scan quality when total variation quality is of interest. We remind the reader that both scan evaluation and scan selection are performed offline prior to any expensive simulation from the Gibbs sampler. Our target is a 10 ⇥ 10 Ising model arranged in a two-dimensional lattice, a standard model of ferromagnetism in statistical physics. In the notation of (3), we draw the unary parameters ✓\ni uniformly at random from {0, 1}, and the interaction parameters uniformly at random: ✓\nij\n⇠ Uniform([0, 0.25]).\nFigure 1 compares, as a function of the number of steps T , the total variation guarantee provided by Dobrushin variation (see Theorem 8) for the standard systematic and uniform random scans. We see that the systematic scan, which traverses variables in row major order, obtains a significantly better TV guarantee than its uniform random counterpart for all sampling budgets T . Hence, the systematic scan would be our standard scan of choice for this target. DoGS (Algorithm 2) initialized with d = 1 and the systematic scan further improves the systematic scan guarantee by two orders of magnitude. Iterating Algorithm 2 on its own scan output until convergence (“Iterated DoGS” in Figure 1) provides additional improvement. However, since we consistently find that the bulk of the improvement is obtained with a single run of Algorithm 2, non-iterated DoGS remains our recommended recipe for quickly improving scan quality.\nNote that since our TV guarantee is an upper bound provided by the exact computation of Dobrushin variation, the actual gains in TV may differ from the gains in Dobrushin variation. In practice and as evidenced in Section 5.4, we find that the actual gains in (marginal) TV over standard scans are typically larger than the Dobrushin variation gains."
  }, {
    "heading": "5.2. End-to-end wall clock time performance",
    "text": "In this experiment, we demonstrate that using DoGS to optimize a scan can result in dramatic inferential speed-ups. This effect is particularly pronounced for targets with a large number of variables and in settings that require repeated sampling from a low-bias Gibbs sampler. The setting is the exactly same as in the previous experiment, with the exception of model size: here we simulate a 103⇥103 Ising model, with 1 million variables in total. We target a single marginal X\n1 with d = e 1 and take a systematic scan of length T = 2 ⇥ 106 as our input scan. After measuring the Dobrushin variation ✏ of the systematic scan, we use an efficient length-doubling scheme to select a DoGS scan: (0) initialize ˜T = 2; (1) run Algorithm 2 with the first ˜T steps of the systematic scan as input; (2) if the resulting DoGS scan has Dobrushin variation less than ✏, we keep it; otherwise we double ˜T and return to step (1). The resulting DoGS scan has length ˜T = 16.\n0\nWe repeatedly draw independent sample points from either the length T systematic scan Gibbs sampler or the length ˜T DoGS scan Gibbs sampler. Figure 2 evaluates the bias of the resulting Monte Carlo estimates of E\n⇡ [X 1 ] as a function of time, including the 15s of setup time for DoGS on this 1 million variable model. In comparison, Levine et al. (2005) report 10 minutes of setup time for their adaptive Gibbs scans when processing a 64 variable Ising model. The bottom plot of Figure 2 uses the average measured time for a single step1, the measured setup time for DoGS and the size of the two scan sequences to give an estimate of the speedup as a function of the number of sample points drawn. Additional timing experiments are deferred to Appendix B.2."
  }, {
    "heading": "5.3. Accelerated MCMC maximum likelihood",
    "text": "estimation\nWe next illustrate how DoGS can be used to accelerate MCMC maximum likelihood estimation, while providing guarantees on parameter estimation quality. We replicate\n1Each Gibbs step took 12.65µs on a 2015 Macbook Pro.\nthe Ising model maximum likelihood estimation experiment of (Domke, 2015, Sec. 6) and show how we can provide the same level of accuracy faster. Our aim is to learn the parameters of binary MRFs based on training samples with independent Rademacher entries. On each step of MCMCMLE, Domke uses Gibbs sampling with a uniform random scan to produce an estimate of the gradient of the log likelihood. Our DoGS variant employs Algorithm 2 with d = 1, early stopping parameter ✏ = 0.01, and a Dobrushin influence bound constructed from the latest parameter estimate ˆ✓ using Theorem 11. We set the number of gradient steps, MC steps per gradient, and independent runs of Gibbs sampling to the suggested values in (Domke, 2015). After each gradient update, we record the distance between the optimal and estimated parameters. Figure 3 displays the estimation error of five independent replicates of this experiment using each of two scans (uniform or DoGS) for two models (a 3⇥ 3 and a 4⇥ 4 Ising model). The results show that DoGS consistently achieves the desired parameter accuracy much more quickly than standard Gibbs."
  }, {
    "heading": "5.4. Customized scans for fast marginal mixing",
    "text": "In this section we demonstrate how DoGS can be used to dramatically speed up marginal inference while providing target-dependent guarantees. We use a 40⇥ 40 non-toroidal Ising model and set our feature to be the top left variable with d = e\n1 . Figure 4 compares guarantees for a uniform random scan and a systematic scan; we also see how we can further improve the total variation guarantees by feeding a systematic scan into Algorithm 2. Again we see that a single run of Algorithm 2 yields the bulk of the improvement, and iterated applications only provide small further benefits. For the DoGS sequence, the figure also shows a histogram of the distance of sampled variables from the target variable, X\n1\n, at the top left corner of the grid.\nFigure 5 shows that optimizing our objective actually improves performance by reducing the marginal bias much more quickly than systematic scan. For completeness, we include additional experiments on a toroidal Ising model in Appendix B.3."
  }, {
    "heading": "5.5. Targeted image segmentation and object",
    "text": "recognition\nThe Markov field aspect model (MFAM) of Verbeek & Triggs (2007) is a generative model for images designed to automatically divide an image into its constituent parts (image segmentation) and label each part with its semantic object class (object recognition). For each test image k, the MFAM extracts a discrete feature descriptor from each image patch i, assigns a latent object class label X\ni\n2 X to\neach patch, and induces the posterior distribution\n⇡(X|y; k) / exp( P\n(i,j) spatial neighbors I{Xi = Xj} (4) + P i log( P a2X ✓k,a a,yiI{Xi = a})),\nover the configuration of patch levels X . When the Potts parameter = 0, this model reduces to probabilistic latent semantic analysis (PLSA) (Hofmann, 2001), while a positive value of encourages nearby patches to belong to similar classes. Using the Microsoft Research Cambridge (MSRC) pixel-wise labeled image database v12, we follow the weakly supervised setup of Verbeek & Triggs (2007) to fit the PLSA parameters ✓ and to a training set of images and then, for each test image k, use Gibbs sampling to generate patch label configurations X targeting the MFAM posterior (4) with = 0.48. We generate a segmentation by assigning each patch the most frequent label encountered during Gibbs sampling and evaluate the accuracy of this labeling using the Hamming error described in (Verbeek & Triggs, 2007). This experiment is repeated over 20 indepen-\n2http://research.microsoft.com/vision/cambridge/recognition/\ndently generated 90% training / 10% test partitions of the 240 image dataset.\nWe select our DoGS scan to target a 12⇥ 8 marginal patch rectangle at the center of each image (the {0,1} entries of d indicate whether a patch is in the marginal rectangle highlighted in Figure 6) and compare its segmentation accuracy and efficiency with that of a standard systematic scan of length T = 620. We initialize DoGS with the systematic scan, the influence bound ¯C of Theorem 10, and a target accuracy ✏ equal to the marginal Dobrushin variation guarantee of the systematic scan. In 11.5ms, the doubling scheme described in Section 5.2 produced a DoGS sequence of length 110 achieving the Dobrushin variation guarantee ✏ on marginal TV. Figure 7 shows that DoGS achieves a slightly better average Hamming error than systematic scan using a 5.5⇥ shorter sequence. Systematic scan takes 1.2s to resample each variable of interest, while DoGS consumes 0.37s. Moreover, the 11.5ms DoGS scan selection was performed only once and then used to segment all test images. For\neach chain, X0 was initialized to the maximum a posteriori patch labeling under the PLSA model (obtained by setting = 0 in the MFAM)."
  }, {
    "heading": "6. Discussion",
    "text": "We introduced a practical quality measure – Dobrushin variation – for evaluating and comparing existing Gibbs sampler scans and efficient procedures – DoGS – for developing customized fast-mixing scans tailored to marginals or distributional features of interest. We deployed DoGS for three common Gibbs sampler applications – joint image segmentation and object recognition, MCMC maximum likelihood estimation, and Ising model inference – and in each case achieved higher quality inferences with significantly smaller sampling budgets than standard Gibbs samplers. In the future, we aim to enlist DoGS for additional applications in computer vision and natural language processing, extend the reach of DoGS to models containing continuous variables, and integrate DoGS into large inference engines built atop Gibbs sampling."
  }],
  "year": 2017,
  "references": [{
    "title": "Maximum likelihood learning with arbitrary",
    "authors": ["Domke", "Justin"],
    "year": 1985
  }, {
    "title": "Unsupervised learning by probabilistic latent",
    "authors": ["Hofmann", "Thomas"],
    "venue": "Information Processing Systems,",
    "year": 2016
  }, {
    "title": "Projecting markov random",
    "authors": ["Liu", "Xianghang", "Domke", "Justin"],
    "venue": "(Methodological),",
    "year": 1995
  }, {
    "title": "Region classification with markov",
    "authors": ["Verbeek", "Jakob", "Triggs", "Bill"],
    "year": 2014
  }],
  "id": "SP:c4140f83f3a1840051cdb200dabba5fda1f5925b",
  "authors": [{
    "name": "Ioannis Mitliagkas",
    "affiliations": []
  }, {
    "name": "Lester Mackey",
    "affiliations": []
  }],
  "abstractText": "The pairwise influence matrix of Dobrushin has long been used as an analytical tool to bound the rate of convergence of Gibbs sampling. In this work, we use Dobrushin influence as the basis of a practical tool to certify and efficiently improve the quality of a discrete Gibbs sampler. Our Dobrushin-optimized Gibbs samplers (DoGS) offer customized variable selection orders for a given sampling budget and variable subset of interest, explicit bounds on total variation distance to stationarity, and certifiable improvements over the standard systematic and uniform random scan Gibbs samplers. In our experiments with joint image segmentation and object recognition, Markov chain Monte Carlo maximum likelihood estimation, and Ising model inference, DoGS consistently deliver higher-quality inferences with significantly smaller sampling budgets than standard Gibbs samplers.",
  "title": "Improving Gibbs Sampler Scan Quality with DoGS"
}