{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Intelligent agents rarely act in isolation in the real world and often seek to achieve their goals through interaction with other agents. Such interactions give rise to rich, complex behaviors formalized as per-agent policies in a multiagent system (Ferber, 1999; Wooldridge, 2009). Depending on the underlying motivations of the agents, interactions could be directed towards achieving a shared goal in a collaborative setting, opposing another agent in a competitive setting, or be a mixture of these in a setting where agents collaborate in teams to compete against other teams. Learning useful representations of the policies of agents based on their interactions is an important step towards characterization of the agent behavior and more generally inference and reasoning in multiagent systems.\n1Stanford University 2Carnegie Mellon University 3OpenAI. Correspondence to: Aditya Grover <adityag@cs.stanford.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nIn this work, we propose an unsupervised encoder-decoder framework for learning continuous representations of agent policies given access to only a few episodes of interaction. For any given agent, the representation function is an encoder that learns a mapping from an interaction (i.e., one or more episodes of observation and action pairs involving the agent) to a continuous embedding vector. Using such embeddings, we condition a policy network (decoder) and train it simultaneously with the encoder to imitate other interactions involving the same (or a coupled) agent. Additionally, we can explicitly discriminate between the embeddings corresponding to different agents using triplet losses.\nFor the embeddings to be useful, the representation function should generalize to both unseen interactions and unseen agents for novel downstream tasks. Generalization is wellunderstood in the context of supervised learning where a good model is expected to attain similar train and test performance. For multiagent systems, we consider a notion of generalization based on agent-interaction graphs. An agentinteraction graph provides an abstraction for distinguishing the agents (nodes) and interactions (edges) observed during training, validation, and testing.\nOur framework is agnostic to the nature of interactions in multiagent systems, and hence broadly applicable to competitive and cooperative environments. In particular, we consider two multiagent environments: (i) a competitive continuous control environment, RoboSumo (Al-Shedivat et al., 2018), and (ii) a ParticleWorld environment of cooperative communication where agents collaborate to achieve a common goal (Mordatch & Abbeel, 2018). For evaluation, we show how representations learned by our framework are effective for downstream tasks that include clustering of agent policies (unsupervised), classification such as win or loss outcomes in competitive systems (supervised), and policy optimization (reinforcement). In the case of policy optimization, we show how these representations can serve as privileged information for better training of agent policies. In RoboSumo, we train agent policies that can condition on the opponent’s representation and achieve superior win rates much more quickly as compared to an equally expressive baseline policy with the same number of parameters. In ParticleWorld, we train speakers that can communicate more effectively with a much wider range of listeners given knowledge of their representations."
  }, {
    "heading": "2. Preliminaries",
    "text": "In this section, we present the necessary background and notation relevant to the problem setting of this work.\nMarkov games. We use the classical framework of Markov games (Littman, 1994) to represent multiagent systems. A Markov game extends the general formulation of partially observable Markov decision processes (POMDP) to the multiagent setting. In a Markov game, we are given a set of n agents on a state-space S with action spaces A1,A2, · · · ,An and observation spaces O1,O2, · · · ,On respectively. At every time step t, an agent i receives an observation o(t)i ∈ Oi and executes an action a (t) i ∈ Ai based on a stochastic policy π(i) : Oi × Ai → [0, 1]. Based on the executed action, the agent receives a reward r (t) i : S × Ai → R and the next observation o (t+1) i . The state dynamics are determined by a transition function T : S×A1×· · ·×An → S . The agent policies are trained to maximize their own expected reward r̄i = ∑H t=1 r (t) i over a time horizon H .\nExtended Markov games. In this work, we are interested in interactions that involve not all but only a subset of agents. For this purpose, we generalize Markov games as follows. First, we augment the action space of each agent with a NO-OP (i.e., no action). Then, we introduce a problem parameter, 2 ≤ k ≤ n, with the following semantics. During every rollout of the Markov game, all but k agents deterministically execute the NO-OP operator while the k agents execute actions as per the policies defined on the original observation and action spaces. Accordingly, we assume that each agent receives rewards only in the interaction episode it participates in. Informally, the extension allows for multiagent systems where all agents do not necessarily have to participate simultaneously in an interaction. For instance, this allows to consider one-vs-one multiagent tournaments where only two players participate in any given match.\nTo further introduce the notation, consider a multiagent system as a generalized Markov game. We denote the set of agent policies with P = {π(i)}ni=1, interaction episodes with E = {EMj}mj=1 where Mj ⊆ {1, 2, · · · , n}, |Mj | = k is the set of k agents participating in episodeEMj . To simplify presentation for the rest of the paper, we assume k = 2 and, consequently, denote the set of interaction episodes between agents i and j as Eij . A single episode, eij ∈ Eij , consists of a sequence of observations and actions for the specified time horizon, H .\nImitation learning. Our approach to learning policy representations relies on behavioral cloning (Pomerleau, 1991)— a type of imitation learning where we train a mapping from observations to actions in a supervised manner. Although there exist other imitation learning algorithms (e.g., inverse reinforcement learning, Abbeel & Ng, 2004), our frame-\nwork is largely agnostic to the choice of the algorithm, and we restrict our presentation to behavioral cloning, leaving other imitation learning paradigms to future work."
  }, {
    "heading": "3. Learning framework",
    "text": "The dominant paradigm for unsupervised representation learning is to optimize the parameters of a representation function that can best explain or generate the observed data. For instance, the skip-gram objective used for language and graph data learns representations of words and nodes predictive of representations of surrounding context (Mikolov et al., 2013; Grover & Leskovec, 2016). Similarly, autoencoding objectives, often used for image data, learn representations that can reconstruct the input (Bengio et al., 2009).\nIn this work, we wish to learn a representation function that maps episode(s) from an agent policy, π(i) ∈ Π to a real-valued vector embedding where Π is a class of representable policies. That is, we optimize for the parameters θ for a function fθ : E → Rd where E denotes the space of episodes corresponding to a policy and d is the dimension of the embedding. Here, we have assumed the agent policies are black-boxes, i.e., we can only access them based on interaction episodes with other agents in a Markov game. Hence, for every agent i, we wish to learn policies using Ei = ∪jE(i)ij . Here, E (i) ij refers the episode data for interactions between agent i and j, but consisting of only the observation and action pairs of agent i. For a multiagent system, we propose the following auxiliary tasks for learning a good representation of an agent’s policy:\n1. Generative representations. The representation should be useful for simulating the agent’s policy.\n2. Discriminative representations. The representation should be able to distinguish the agent’s policy with the policies of other agents.\nAccordingly, we now propose generative and discriminative objectives for representation learning in multiagent systems."
  }, {
    "heading": "3.1. Generative representations via imitation learning",
    "text": "Imitation learning does not require direct access to the reward signal, making it an attractive task for unsupervised representation learning. Formally, we are interested in learning a policy π(i)φ : S×A → [0, 1] for an agent i given access to observation and action pairs from interaction episode(s) involving the agent. For behavioral cloning, we maximize the following (negative) cross-entropy objective:\nEe∼Ei  ∑ 〈o,a〉∼e [ log π (i) φ (a|o) ] where the expectation is over interaction episodes of agent i and the optimization is over the parameters φ.\nAlgorithm 1 Learn Policy Embedding Function (fθ) input {Ei}ni=1 – interaction episodes, λ – hyperparameter.\n1: Initialize θ and φ 2: for i = 1, 2, . . . , n do 3: Sample a positive episode pe ← e+ ∼ Ei 4: Sample a reference episode re ← e∗ ∼ Ei\\e+ 5: Compute Im loss← −\n∑ 〈o,a〉∼e+ log πφ,θ(a|o, e∗)\n6: for j = 1, 2, . . . , n do 7: if j 6= i then 8: Sample a negative episode ne ← e− ∼ Ej 9: Compute Id loss← dθ(e+, e−, e∗)\n10: Set Loss← Im loss + λ · Id loss 11: Update θ and φ to minimize Loss 12: end if 13: end for 14: end for output θ\nLearning individual policies for every agent can be computationally and statistically prohibitive for large-scale multiagent systems, especially when the number of interaction episodes per agent is small. Moreover, it precludes generalization across the behaviors of such agents. On the other hand, learning a single policy for all agents increases sample efficiency but comes at the cost of reduced modeling flexibility in simulating diverse agent behaviors. We offset this dichotomy by learning a single conditional policy network. To do so, we first specify a representation function, fθ : E → Rd, with parameters θ, where E represents the space of episodes. We use this embedding to condition the policy network. Formally, the policy network is denoted by πφ,θ : S × A × E → [0, 1] and φ are parameters for the function mapping the agent observation and embedding to a distribution over the agent’s actions.\nThe parameters θ and φ for the conditional policy network are learned jointly by maximizing the following objective:\n1\nn n∑ i=1 Ee1∼Ei, e2∼Ei\\e1  ∑ 〈o,a〉∼e1 log πφ,θ(a|o, e2)  (1) For every agent, the objective function samples two distinct episodes e1 and e2. The observation and action pairs from e2 are used to learn an embedding fθ(e2) that conditions the policy network trained on observation and action pairs from e1. The conditional policy network shares statistical strength through a common set of parameters for the policy network and the representation function across all agents."
  }, {
    "heading": "3.2. Discriminative representations via identification",
    "text": "An intuitive requirement for any representation function learned for a multiagent system is that the embeddings should reflect characteristics of an agent’s behavior that dis-\ntinguish it from other agents. To do so in an unsupervised manner, we propose an objective for agent identification based on the triplet loss directly in the space of embeddings.\nTo learn a representation for agent i based on interaction episodes, we use the representation function fθ to compute three sets of embeddings: (i) a positive embedding for an episode e+ ∼ Ei involving agent i, (ii) a negative embedding for an episode e− ∼ Ej involving a random agent j 6= i, and (iii) a reference embedding for an episode e∗ ∼ Ei again involving agent i, but different from e+. Given these embeddings, we define the triplet loss:\ndθ(e+, e−, e∗) =\n(1 + exp {‖re − ne‖2 − ‖re − pe‖2})−2 (2)\nwhere pe = fθ(e+), ne = fθ(e−), re = fθ(e∗). Intuitively, the loss encourages the positive embedding to be closer to the reference embedding than the negative embedding, which makes the embeddings of the same agent tend to cluster together and be further away from embeddings of other agents. We note that various other notions of distance can also be used. The one presented above corresponding to a squared softmax objective (Hoffer & Ailon, 2015)."
  }, {
    "heading": "3.3. Hybrid generative-discriminative representations",
    "text": "Conditional imitation learning encourages fθ to learn representations that can learn and simulate the entire policy of the agents and agent identification incentivizes representations that can distinguish between agent policies. Both objectives are complementary, and we combine Eq. (1) and Eq. (2) to get the final objective used for representation learning:\n1\nn n∑ i=1 Ee+∼Ei, e∗∼Ei\\e+  ∑ 〈o,a〉∼e+ log πφ,θ(a|o, e∗)︸ ︷︷ ︸ imitation − λ ∑ j 6=i\nEe−∼Ej [dθ(e+, e−, e∗)]︸ ︷︷ ︸ agent identification\n (3)\nwhere λ > 0 is a tunable hyperparameter that controls the relative weights of the discriminative and generative terms. The pseudocode for the proposed algorithm is given in Algorithm 1. In experiments, we parameterize the conditional policy πθ,φ using neural networks and use stochastic gradient-based methods for optimization."
  }, {
    "heading": "4. Generalization in MAS",
    "text": "Generalization is well-understood for supervised learning— models that shows similar train and test performance exhibit good generalization. To measure the quality of the learned representations for a multiagent system (MAS), we introduce a graphical formalism for reasoning about agents and their interactions."
  }, {
    "heading": "4.1. Generalization across agents & interactions",
    "text": "In many scenarios, we are interested in generalization of the policy representation function fθ across novel agents and interactions in a multiagent system. For instance, we would like fθ to output useful embeddings for a downstream task, even when evaluated with respect to unseen agents and interactions. This notion of generalization is best understood using agent-interaction graphs (Grover et al., 2018).\nThe agent-interaction graph describes interactions between a set of agent policies P and a set of interaction episodes I through a graph G = (P, I).1 An example graph is shown in Figure 1a. The graph represents a multiagent system consisting of interactions between pairs of agents, and we will especially focus on the interactions involving Alice, Bob, Charlie, and Davis. The interactions could be competitive (e.g., a match between two agents) or cooperative (e.g., two agents communicating for a navigation task).\nWe learn the representation function fθ on a subset of the interactions, denoted by the solid black edges in Figure 1a. At test time, fθ is evaluated on some downstream task of interest. The agents and interactions observed at test time can be different from those used for training. In particular, we consider the following cases:\nWeak generalization.2 Here, we are interested in the generalization performance of the representation function on an unseen interaction between existing agents, all of which are observed during training. This corresponds to the red edge representing the interaction between Alice and Bob in Figure 1a. From the context of an agent-interaction graph, the test graph adds only edges to the train graph.\nStrong generalization. Generalization can also be evaluated with respect to unseen agents (and their interactions). This corresponds to the addition of agents Charlie and Davis in Figure 1a. Akin to a few shot learning setting, we observe a few of their interactions with existing agents Alice and\n1If we have more than two participating agents per interaction episode, we could represent the interactions using a hypergraph.\n2Also referred to as intermediate generalization by Grover et al. (2018).\nBob (green edges) and generalization is evaluated on unseen interactions involving Charlie and Davis (blue edges). The test graph adds both nodes and edges to the train graph.\nFor brevity, we skip discussion of weaker forms of generalization that involves evaluation of the test performance on unseen episodes of an existing training edge (black edge)."
  }, {
    "heading": "4.2. Generalization across tasks",
    "text": "Since the representation function is learned using an unsupervised auxiliary objective, we test its generalization performance by evaluating the usefulness of these embeddings for various kinds downstream tasks described below.\nUnsupervised. These embeddings can be used for clustering, visualization, and interpretability of agent policies in a low-dimensional space. Such semantic associations between the learned embeddings can be defined for a single agent wherein we expect representations for the same agent based on distinct episodes to be embedded close to each other, or across agents wherein agents with similar policies will have similar embeddings on average.\nSupervised. Deep neural network representations are especially effective for predictive modeling. In a multiagent setting, the embeddings serve as useful features for learning agent properties and interactions, including assignment of role categories to agents with different skills in a collaborative setting, or prediction of win or loss outcomes of interaction matches between agents in a competitive setting.\nReinforcement. Finally, we can use the learned representation functions to improve generalization of the policies learned from a reinforcement signal in competitive and cooperative settings. We design policy networks that, in addition to observations, take embedding vectors of the opposing agents as inputs. The embeddings are computed from the past interactions of the opposing agent either with the agent being trained or with other agents using the representation function (Figure 2). Such embeddings play the role of privileged information and allow us to train a policy network that uses this information to learn faster and generalize better to opponents or cooperators unseen at training time."
  }, {
    "heading": "5. Evaluation methodology & results",
    "text": "We evaluate the proposed framework for both competitive and collaborative environments on various downstream machine learning tasks. In particular, we use the RoboSumo and ParticleWorld environments for the competitive and collaborative scenarios, respectively. We consider the embedding objectives in Eq. (1), Eq. (2), and Eq. (3) independently and refer to them as Emb-Im, Emb-Id, and Emb-Hyb respectively. The hyperparameter λ for Emb-Hyb is chosen by grid search over λ ∈ {0.01, 0.05, 0.1, 0.5} on a held-out set of interactions.\nIn all our experiments, the representation function fθ is specified through a multi-layer perceptron (MLP) that takes as input an episode and outputs an embedding of that episode. In particular, the MLP takes as input a single (observation, action) pair to output an intermediate embedding. We average the intermediate embeddings for all (observation, action) pairs in an episode to output an episode embedding. To condition a policy network on the embedding, we simply concatenate the observation fed as input to the network with the embedding. Experimental setup and other details beyond what we state below are deferred to the Appendix.\n5.1. The RoboSumo environment\nFor the competitive environment, we use RoboSumo (AlShedivat et al., 2018)—a 3D environment with simulated physics (based on MuJoCo (Todorov et al., 2012)) that allows agents to control multi-legged 3D robots and compete against each other in continuous-time wrestling games (Figure 1b). For our analysis, we train a diverse collection of 25 agents, some of which are trained via self-play and others are trained in pairs concurrently using Proximal Policy Optimization (PPO) algorithm (Schulman et al., 2017).\nWe start with a fully connected agent-interaction graph (clique) of 25 agents. Every edge in this graph corresponds to 10 rollout episodes involving the corresponding agents.\nThe maximum length (or horizon) of any episode is 500 time steps, after which the episode is declared a draw. To evaluate weak generalization, we sample a connected subgraph for training with approximately 60% of the edges preserved for training, and remaining split equally for validation and testing. For strong generalization, we preserve 15 agents and their interactions with each other for training, and similarly, 5 agents and their within-group interactions each for validation and testing."
  }, {
    "heading": "5.1.1. EMBEDDING ANALYSIS",
    "text": "To evaluate the robustness of the embeddings, we compute multiple embeddings for each policy based on different episodes of interaction at test time. Our evaluation metric is based on the intra- and inter-cluster Euclidean distances between embeddings. The intra-cluster distance for an agent is the average pairwise distance between its embeddings computed on the set of test interaction episodes involving the agent. Similarly, the inter-cluster distance is the average pairwise distance between the embeddings of an agent with those of other agents. Let Ti = {t(i)c }nic=1 denote the set of test interactions involving agent i. We define the intra-inter cluster ratio (IICR) as:\nIICR =\n1 n ∑n i=1 1 n2i ∑ni a=1 ∑ni b=1 ‖t (i) a − t(i)b ‖2\n1 n(n−1) n∑ i=1 n∑ j 6=i 1 ninj ni∑ a=1 nj∑ b=1 ‖t(i)a − t(j)b ‖2 .\nThe intra-inter clustering ratios are reported in Table 1. A ratio less than 1 suggests that there is signal that identifies the agent, and the signal is stronger for lower ratios. Even though this task might seem especially suited for the agent identification objective, we interestingly find that the Emb-Im attains lower clustering ratios than Emb-Id for both weak and strong generalization. Emb-Hyb outperforms both these methods. We qualitatively visualize the embeddings learned using Emb-Hyb by projecting them on the leading principal components, as shown in Figures 3a and 3b for 10 test interaction episodes of 5 randomly selected agents in the weak and strong generalization settings respectively."
  }, {
    "heading": "5.1.2. OUTCOME PREDICTION",
    "text": "We can use these embeddings directly for training a classifier to predict the outcome of an episode (win/loss/draw). For classification, we use an MLP with 3 hidden layers\nof 100 units each and the learning objective minimizes the cross entropy error. The input to the classifier are the embeddings of the two agents involved in the episode. The results are reported in Table 1. Again, imitation based methods seem more suited for this task with Emb-Hyb and Emb-Im outperforming other methods for weak and strong generalization respectively."
  }, {
    "heading": "5.1.3. POLICY OPTIMIZATION",
    "text": "Here we ask whether embeddings can be used to improve learned policies in a reinforcement learning setting both in terms of end performance and generalization. To this end, we select 5 training, 5 validation, and 5 testing opponents from the pool of 25 pre-trained agents. Next, we train a new agent with reinforcement learning to compete against the selected 5 training opponents; the agent is trained concurrently against all 5 opponents using a distributed version of PPO algorithm, as described in Al-Shedivat et al. (2018). Throughout training, we evaluate new agents on the 5 testing opponents and record the average win and draw rates.\nUsing this setup, we compare a baseline agent with MLP-based policy with an agent whose policy takes 100- dimensional embeddings of the opponents as additional inputs at each time step and uses that information to condition its behavior on the opponent’s representation. The embed-\ndings for each opponent are either computed online, i.e., based on an interaction episode rolled out during training at a previous time step (Figure 2), or offline, i.e., pre-computed before training the new agent using only interactions between the pre-trained opponents.\nFigure 4 shows the average win rates against the set of training and testing opponents for the baseline and our agents that use different types of embeddings. While every new agent is able to achieve almost 100% win rate against the training opponents, we see that the agents that condition their policies on the opponent’s embeddings perform better on the held-out set of opponents, i.e., generalize better, with the best performance achieved with Emb-Hyb. We also note that embeddings computed offline turn out to lead to better performance than if computed online3. As an ablation test, we also evaluate our agents when they are provided an incorrect embedding (either all zeros, Emb-zero, or an embedding selected for a different random opponent, Emb-rand) and observe that such embeddings lead to a degradation in performance4.\n3Perhaps, this is due to differences in the interactions of the opponents between themselves and with the new agent that the embedding network was not able to capture entirely.\n4Performance decrease is most significant for Emb-zero, which is an out-of-distribution all-zeros vector.\nFinally, to evaluate strong generalization in the RL setting, we pit the newly trained baseline and agents with embedding-conditional policies against each other. Since the embedding network has never seen the new agents, it must exhibit strong generalization to be useful in such setting. The results are give in Figures 5 and 6. Even though the margin is not very large, the agents that use Emb-Hyb perform the best on average.\n5.2. The ParticleWorld environment\nFor the collaborative setting, we evaluate the framework on the ParticleWorld environment for cooperative communication (Mordatch & Abbeel, 2018; Lowe et al., 2017). The environment consists of a continuous 2D grid with 3 landmarks and two kinds of agents collaborating to navigate to a common landmark goal (Figure 1c). At the beginning of every episode, the speaker agent is shown the RGB color of a single target landmark on the grid. The speaker then communicates a fixed length binary message to the listener agent. Based on the received messages, the listener agent the moves in a particular direction. The final reward, shared across the speaker and listener agents, is the distance of the listener to the target landmark after a fixed time horizon.\nThe agent-interaction graph for this environment is bipartite with only cross edges between speaker and listener agents. Every interaction edge in this graph corresponds to 1000 rollout episodes where the maximum length of any episode is 25 steps. We pretrain 28 MLP parameterized speaker and listener agent policies. Every speaker learns through communication with only two different listeners\nand vice-versa, giving an extremely sparse agent-interaction graph. We explicitly encoded diversity in these speakers and listener agents by masking bits in the communication channel. In particular, we masked 1 or 2 randomly selected bits for every speaker agent in the graph to give a total of( 7 1 ) + ( 7 2 ) = 28 distinct speaker agents. Depending on the neighboring speaker agents in the agent-interaction graph, the listener agents also show diversity in the learned policies. The policies are learned using multiagent deep deterministic policy gradients (MADDPG, Lowe et al., 2017).\nIn this environment, the speakers and listeners are tightly coupled. Hence we vary the setup used previously in the competitive scenario. We wish to learn embeddings of listeners based on their interactions with speakers. Since the agent-interaction graph is bipartite, we use the embeddings of listener agents to condition a shared policy network for the respective speaker agents."
  }, {
    "heading": "5.2.1. EMBEDDING ANALYSIS",
    "text": "For the weak generalization setting, we remove an outgoing edge from every listener agent in the original graph to obtain the training graph. In the case of strong generalization, we set aside 7 listener agents (and their outgoing edges) each for validation and testing while the representation function is learned on the remaining 14 listener agents and their interactions. The intra-inter clustering ratios are shown\nin Table 2, and the projections of the embeddings learned using Emb-Hyb are visualized in Figure 3c and Figure 3d for weak and strong generalization respectively. In spite of the high degree of sparsity in the training graph, the intrainter clustering ratio for the test interaction embeddings is less than unity suggesting an agent-specific signal. Emb-id works particularly well in this environment, achieving best results for both weak and strong generalization."
  }, {
    "heading": "5.2.2. POLICY OPTIMIZATION",
    "text": "Here, we are interested in learning speaker agents that can communicate more effectively with a much wider range of listeners given knowledge of their embeddings. Referring back to Figure 2, we learn a policy πψ for a speaker agent that conditions on the representation function fθ for the listener agents. For cooperative communication, we consider interactions with 14 pre-trained listener agents split as 6 training, 4 validation, and 4 test agents.5 Similar to the competitive setting, we compare performance against a baseline speaker agent that does not have access to any privilege information about the listeners. We summarize the results for the best validated models during training and 100 interaction episodes per test listener agent across 5 initializations in Table 3. From the results, we observe that online embedding based methods can generalize better than the baseline methods. The baseline MADDPG achieves the lowest training error, but fails to generalize well enough and incurs a low average reward for the test listener agents."
  }, {
    "heading": "6. Discussion & Related Work",
    "text": "Agent modeling is a well-studied topic within multiagent systems. See Albrecht & Stone (2017) for an excellent recent survey on this subject. The vast majority of literature concerns with learning models for a specific predictive task. Predictive tasks are typically defined over actions, goals, and beliefs of other agents (Stone & Veloso, 2000). In competitive domains such as Poker and Go, such tasks are often integrated with domain-specific heuristics to model opponents and learn superior policies (Rubin & Watson, 2011; Mnih et al., 2015). Similarly, intelligent tutoring systems take into account pedagogical features of students and teachers to accelerate learning of desired behaviors in a collaborative environment (McCalla et al., 2000).\nIn this work, we proposed an approach for modeling agent behavior in multiagent systems through unsupervised representational learning of agent policies. Since we sidestep any domain specific assumptions and learn in an unsupervised manner, our framework learns representations that are\n5None of the methods considered were able to learn a nontrivial speaker agent when trained simultaneously with all 28 listener agents. Hence, we simplified the problem by considering the 14 listener agents that attained the best rewards during pretraining.\nuseful for several downstream tasks. This extends the use of deep neural networks in multiagent systems to applications beyond traditional reinforcement learning and predictive modeling (Mnih et al., 2015; Hoshen, 2017).\nBoth the generative and discriminative components of our framework have been explored independently in prior work. Imitation learning has been extensively studied in the singleagent setting and recent work by Le et al. (2017) proposes an algorithm for imitation in a coordinated multiagent system. Wang et al. (2017) proposed an imitation learning algorithm for learning robust controllers with few expert demonstrations in a single-agent setting that conditions the policy network on an inference network, similar to the encoder in our framework. In another recent work, Li et al. (2017) propose an algorithm for learning interpretable representations using generative adversarial imitation learning. Agent identification which represents the discriminative term in the learning objective is inspired from triplet losses and Siamese networks that are used for learning representations of data using distance comparisons (Hoffer & Ailon, 2015).\nA key contribution of this work is a principled methodology for evaluating generalization of representations in multiagent systems based on the graphs of the agent interactions. Graphs are a fundamental abstraction for modeling relational data, such as the interactions arising in multiagent systems (Zhou et al., 2016a;b; Chen et al., 2017; Battaglia et al., 2016; Hoshen, 2017) and concurrent work proposes to learn such graphs directly from data (Kipf et al., 2018)."
  }, {
    "heading": "7. Conclusion & Future Work",
    "text": "In this work, we presented a framework for learning representations of agent policies in multiagent systems. The agent policies are accessed using a few interaction episodes with other agents. Our learning objective is based on a novel combination of a generative component based on imitation learning and a discriminative component for distinguishing the embeddings of different agent policies. Our overall framework is unsupervised, sample-efficient, and domainagnostic, and hence can be readily extended to many environments and downstream tasks. Most importantly, we showed the role of these embeddings as privileged information for learning more adaptive agent policies in both collaborative and competitive settings.\nIn the future, we would like to explore multiagent systems with more than two agents participating in the interactions. Semantic interpolation of policies directly in the embedded space in order to obtain a policy with desired behaviors quickly is another promising direction. Finally, it would be interesting to extend and evaluate the proposed framework to learn representations for history dependent policies such as those parameterized by long short-term memory networks."
  }, {
    "heading": "Acknowledgements",
    "text": "We are thankful to Lisa Lee, Daniel Levy, Jiaming Song, and everyone at OpenAI for helpful comments and discussion. AG is supported by a Microsoft Research PhD Fellowship. MA is partially supported by NIH R01GM114311. JKG is partially supported by the Army Research Laboratory through the Army High Performance Computing Research Center under Cooperative Agreement W911NF-07-2-0027."
  }],
  "year": 2018,
  "references": [{
    "title": "Apprenticeship learning via inverse reinforcement learning",
    "authors": ["P. Abbeel", "A.Y. Ng"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2004
  }, {
    "title": "Continuous adaptation via metalearning in nonstationary and competitive environments",
    "authors": ["M. Al-Shedivat", "T. Bansal", "Y. Burda", "I. Sutskever", "I. Mordatch", "P. Abbeel"],
    "venue": "In International Conference on Learning Representations,",
    "year": 2018
  }, {
    "title": "Autonomous agents modeling other agents: A comprehensive survey and open problems",
    "authors": ["S.V. Albrecht", "P. Stone"],
    "venue": "arXiv preprint arXiv:",
    "year": 2017
  }, {
    "title": "Interaction networks for learning about objects, relations and physics",
    "authors": ["P. Battaglia", "R. Pascanu", "M. Lai", "Rezende", "D. J"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2016
  }, {
    "title": "Multiplayer reachavoid games via pairwise outcomes",
    "authors": ["M. Chen", "Z. Zhou", "C.J. Tomlin"],
    "venue": "IEEE Transactions on Automatic Control,",
    "year": 2017
  }, {
    "title": "Multi-agent systems: An introduction to distributed artificial intelligence, volume 1",
    "authors": ["J. Ferber"],
    "year": 1999
  }, {
    "title": "node2vec: Scalable feature learning for networks",
    "authors": ["A. Grover", "J. Leskovec"],
    "venue": "In SIGKDD Conference on Knowledge Discovery and Data Mining,",
    "year": 2016
  }, {
    "title": "Evaluating generalization in multiagent systems using agent-interaction graphs",
    "authors": ["A. Grover", "M. Al-Shedivat", "J.K. Gupta", "Y. Burda", "H. Edwards"],
    "venue": "In International Conference on Autonomous Agents and Multiagent Systems,",
    "year": 2018
  }, {
    "title": "Deep metric learning using triplet network",
    "authors": ["E. Hoffer", "N. Ailon"],
    "venue": "In International Workshop on Similarity-Based Pattern Recognition,",
    "year": 2015
  }, {
    "title": "VAIN: Attentional multi-agent predictive modeling",
    "authors": ["Y. Hoshen"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Neural relational inference for interacting systems",
    "authors": ["T. Kipf", "E. Fetaya", "Wang", "K.-C", "M. Welling", "R. Zemel"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2018
  }, {
    "title": "Coordinated multi-agent imitation learning",
    "authors": ["H.M. Le", "Y. Yue", "P. Carr"],
    "venue": "In International Conference on Machine Learning,",
    "year": 2017
  }, {
    "title": "Inferring the latent structure of human decision-making from raw visual inputs",
    "authors": ["Y. Li", "J. Song", "S. Ermon"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Markov games as a framework for multiagent reinforcement learning",
    "authors": ["M.L. Littman"],
    "venue": "In International Conference on Machine Learning,",
    "year": 1994
  }, {
    "title": "Multi-agent actor-critic for mixed cooperativecompetitive environments",
    "authors": ["R. Lowe", "Y. Wu", "A. Tamar", "J. Harb", "P. Abbeel", "I. Mordatch"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Active learner modelling",
    "authors": ["G. McCalla", "J. Vassileva", "J. Greer", "S. Bull"],
    "venue": "In Intelligent tutoring systems,",
    "year": 2000
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["T. Mikolov", "I. Sutskever", "K. Chen", "G.S. Corrado", "J. Dean"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Human-level control through deep reinforcement learning",
    "authors": ["V. Mnih", "K. Kavukcuoglu", "D. Silver", "A.A. Rusu", "J. Veness", "M.G. Bellemare", "A. Graves", "M. Riedmiller", "A.K. Fidjeland", "G Ostrovski"],
    "year": 2015
  }, {
    "title": "Emergence of grounded compositional language in multi-agent populations",
    "authors": ["I. Mordatch", "P. Abbeel"],
    "venue": "In AAAI Conference on Artificial Intelligence,",
    "year": 2018
  }, {
    "title": "Efficient training of artificial neural networks for autonomous navigation",
    "authors": ["D.A. Pomerleau"],
    "venue": "Neural Computation,",
    "year": 1991
  }, {
    "title": "Computer poker: A review",
    "authors": ["J. Rubin", "I. Watson"],
    "venue": "Artificial intelligence,",
    "year": 2011
  }, {
    "title": "Proximal policy optimization algorithms",
    "authors": ["J. Schulman", "F. Wolski", "P. Dhariwal", "A. Radford", "O. Klimov"],
    "venue": "arXiv preprint arXiv:1707.06347,",
    "year": 2017
  }, {
    "title": "Multiagent systems: A survey from a machine learning perspective",
    "authors": ["P. Stone", "M. Veloso"],
    "venue": "Autonomous Robots,",
    "year": 2000
  }, {
    "title": "MuJoCo: A physics engine for model-based control",
    "authors": ["E. Todorov", "T. Erez", "Y. Tassa"],
    "venue": "In International Conference on Intelligent Robots and Systems,",
    "year": 2012
  }, {
    "title": "Robust imitation of diverse behaviors",
    "authors": ["Z. Wang", "J. Merel", "S. Reed", "G. Wayne", "N. de Freitas", "N. Heess"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Dynamics on linear influence network games under stochastic environments",
    "authors": ["Z. Zhou", "N. Bambos", "P. Glynn"],
    "venue": "In International Conference on Decision and Game Theory for Security,",
    "year": 2016
  }, {
    "title": "A game-theoretical formulation of influence networks",
    "authors": ["Z. Zhou", "B. Yolken", "R.A. Miura-Ko", "N. Bambos"],
    "venue": "In American Control Conference,",
    "year": 2016
  }],
  "id": "SP:a0e89cbb2e078a7692f9af3d75febc952d46cfb6",
  "authors": [{
    "name": "Aditya Grover",
    "affiliations": []
  }, {
    "name": "Maruan Al-Shedivat",
    "affiliations": []
  }, {
    "name": "Jayesh K. Gupta",
    "affiliations": []
  }, {
    "name": "Yura Burda",
    "affiliations": []
  }, {
    "name": "Harrison Edwards",
    "affiliations": []
  }],
  "abstractText": "Modeling agent behavior is central to understanding the emergence of complex phenomena in multiagent systems. Prior work in agent modeling has largely been task-specific and driven by handengineering domain-specific prior knowledge. We propose a general learning framework for modeling agent behavior in any multiagent system using only a handful of interaction data. Our framework casts agent modeling as a representation learning problem. Consequently, we construct a novel objective inspired by imitation learning and agent identification and design an algorithm for unsupervised learning of representations of agent policies. We demonstrate empirically the utility of the proposed framework in (i) a challenging highdimensional competitive environment for continuous control and (ii) a cooperative environment for communication, on supervised predictive tasks, unsupervised clustering, and policy optimization using deep reinforcement learning.",
  "title": "Learning Policy Representations in Multiagent Systems"
}