{
  "sections": [{
    "text": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 627–632 Brussels, Belgium, October 31 - November 4, 2018. c©2018 Association for Computational Linguistics\n627"
  }, {
    "heading": "1 Introduction",
    "text": "Translating words between languages, or more generally inferring bilingual dictionaries, is a long-studied research direction with applications including machine translation (Lample et al., 2017), multilingual word embeddings (Klementiev et al., 2012), and knowledge transfer to low resource languages (Guo et al., 2016). Research here has a long history under the guise of decipherment (Knight et al., 2006). Current contemporary methods have achieve effective word translation through theme-aligned corpora (Gouws et al., 2015), or seed dictionaries (Mikolov et al., 2013).\nMikolov et al. (2013) showed that monolingual word embeddings exhibit isomorphism across languages, and can be aligned with a simple linear transformation. Given two sets word vectors learned independently from monolingual corpora, and a dictionary of seed pairs to learn a linear transformation for alignment; they were able to\nestimate a complete bilingual lexicon. Many studies have since followed this approach, proposing various improvements such as orthogonal mappings (Artetxe et al., 2016) and improved objectives (Lazaridou et al., 2015).\nObtaining aligned corpora or bilingual seed dictionaries is nevertheless not straightforward for all language pairs. This has motivated a wave of very recent research into unsupervised word translation: inducing bilingual dictionaries given only monolingual word embeddings (Conneau et al., 2018; Zhang et al., 2017b,a; Artetxe et al., 2017). The most successful have leveraged ideas from Generative Adversarial Networks (GANs) (Goodfellow et al., 2014). In this approach the generator provides the cross-modal mapping, taking embeddings of dictionary words in one language and ‘generating’ their translation in another. The discriminator tries to distinguish between this ‘fake’ set of translations and the true dictionary of embeddings in the target language. The two play a competitive game, and if the generator learns to fool the discriminator, then its cross-modal mapping should be capable of inducing a complete dictionary, as per Mikolov et al. (2013).\nDespite these successes, such adversarial methods have a number of well-known drawbacks (Arjovsky et al., 2017): Due to the nature of their min-max game, adversarial training is very unstable, and they are prone to divergence. It is extremely hyper-parameter sensitive, requiring problem-specific tuning. Convergence is also hard to diagnose and does not correspond well to efficacy of the generator in downstream tasks (Hoshen and Wolf, 2018).\nIn this paper, we propose an alternative statistical dependency-based approach to unsupervised word translation. Specifically, we propose to search for the cross-lingual word pairing that maximizes statistical dependency in terms of squared\nloss mutual information (SMI) (Yamada et al., 2015; Suzuki and Sugiyama, 2010). Compared to prior statistical dependency-based approaches such as Kernelized Sorting (KS) (Quadrianto et al., 2009) we advance: (i) through use of SMI rather than their Hilbert Schmidt Independence Criterion (HSIC) and (ii) through jointly optimising cross-modal pairing with representation learning within each view. In contrast to prior work that uses a fixed representation, by non-linearly projecting monolingual world vectors before matching, we learn a new embedding where statistical dependency is easier to establish. Our method: (i) achieves similar unsupervised translation performance to recent adversarial methods, while being significantly easier to train and (ii) clearly outperforms prior non-adversarial methods."
  }, {
    "heading": "2 Proposed model",
    "text": ""
  }, {
    "heading": "2.1 Deep Distribution Matching",
    "text": "Let dataset D contain two sets of unpaired monolingual word embeddings from two languages D = ({xi}ni=1, {yj}nj=1) where x,y ∈ Rd. Let π be a permutation function over {1, 2, . . . , n}, and Π the corresponding permutation indicator matrix: Π ∈ {0, 1}n×n,Π1n = 1n, and Π>1n = 1n. Where 1n is the n-dimensional vector with all ones. We aim to optimize for both the permutation Π (bilingual dictionary), and non-linear transformations gx(·) and gy(·) of the respective wordvectors, that maximize statistical dependency between the views. While regularising by requiring the original word embedding information is preserved through reconstruction using decoders fx(·) and fy(·). Our overall loss function is:\nmin Θx,Θy ,Π Ω(D; Θx,Θy)︸ ︷︷ ︸ Regularizer −λDΠ(D; Θx,Θy)︸ ︷︷ ︸ Dependency ,\nDΠ(D; Θx,Θy) = DΠ({gx(xi), gy(yπ(i))}ni=1),\nΩ(D; Θx,Θy) = n∑ i=1 ‖xi − fx(gx(xi))‖22\n+ ‖yi − fy(gy(yi))‖22 +R(Θx) +R(Θy).\n(1)\nwhere Θs parameterize the encoding and reconstruction transformations, R(·) is a regularizer (e.g., `2-norm and `1-norm), and DΠ(·, ·) is a statistical dependency measure. Crucially compared to prior methods such as matching CCA (Haghighi\net al., 2008), dependency measures such as SMI do not need comparable representations to get started, making the bootstrapping problem less severe."
  }, {
    "heading": "2.2 Dependence Estimation",
    "text": "Squared-Loss Mutual Information (SMI) The squared loss mutual information between two random variables x and y is defined as (Suzuki and Sugiyama, 2010):\nSMI = ∫∫ ( p(x,y) p(x)p(y) − 1 )2 p(x)p(y)dxdy,\nwhich is the Pearson divergence (Pearson, 1900) from p(x,y) to p(x)p(y). The SMI is an f - divergence (Ali and Silvey, 1966). That is, it is a non-negative measure and is zero only if the random variables are independent.\nTo measure SMI from a set of samples we take a direct density ratio estimation approach (Suzuki and Sugiyama, 2010), which leads (Yamada et al., 2015) to the estimator:\nŜMI({(xi,yi)}ni=1) = 1 2n tr (diag (α̂)KL)− 1 2 ,\nwhere K ∈ Rn×n and L ∈ Rn×n are the gram matricies for x and y respectively, and\nĤ = 1\nn2 (KK>) ◦ (LL>),\nĥ = 1\nn (K ◦L)1n, α̂ =\n( Ĥ + λIn )−1 ĥ,\nλ > 0 is a regularizer and In ∈ Rn×n is the identity matrix.\nSMI for Matching SMI computes the dependency between two sets of variables, under an assumption of known correspondence. In our application this corresponds to a measure of dependency between two aligned sets of monolingual wordvectors. To exploit SMI for matching, we introduce a permutation variable Π by replacing L→ Π>LΠ in the estimator:\nŜMI({(xi,yπ(i))}n1 )= 1 2n tr ( diag (α̂Π)KΠ >LΠ ) − 1 2 ,\nthat will enable optimizing Π to maximize SMI."
  }, {
    "heading": "2.3 Optimization of parameters",
    "text": "To initialize Θx and Θy, we first independently estimate them using autoencoders. Then we employ an alternative optimization on Eq. (1) for\n(Θx,Θy) and Π until convergence. We use 3 layer MLP neural networks for both f and g. Algorithm 1 summarises the steps. Optimization for Θx and Θy With fixed permutation matrix Π (or π), the objective function\nmin Θx,Θy\nΩ(D; Θx,Θy)− λDΠ(D; Θx,Θy) (2)\nis an autoencoder optimization with regularizer DΠ(·), and can be solved with backpropagation. Optimization for Π To find the permutation (word matching) Π that maximizes SMI given fixed encoding parameters Θx,Θy, we only need to optimize the dependency term DΠ in Eq. (1). We employ the LSOM algorithm (Yamada et al., 2015). The estimator of SMI for samples {gx(xi), gy(yπ(i))}ni=1 encoded with gx, gy is:\nŜMI = 1 2n tr ( diag (α̂Θ,Π)KΘxΠ >LΘyΠ ) − 1 2 .\nWhich leads to the optimization problem:\nmax Π∈{0,1}n×n\ntr (\ndiag (α̂Θ,Π)KΘxΠ >LΘyΠ ) s.t. Π1n = 1n,Π>1n = 1n. (3)\nSince the optimization problem is NP-hard, we iteratively solve the relaxed problem (Yamada et al., 2015):\nΠnew = (1− η)Πold+\nη argmax Π\ntr ( diag ( α̂Θ,Πold ) KΘxΠ >LΘyΠ old ) ,\nwhere 0 < η ≤ 1 is a step size. The optimization problem is a linear assignment problem (LAP). Thus, we can efficiently solve the algorithm by using the Hungarian method (Kuhn, 1955). To get discrete Π, we solve the last step by setting η = 1.\nIntuitively, this can be seen as searching for the permutation Π for which the data in the two (initially unsorted views) have a matching withinview affinity (gram) matrix, where matching is defined by maximum SMI."
  }, {
    "heading": "3 Experiments",
    "text": "In this section, we evaluate the efficacy of our proposed method against various state of the art methods for word translation. Implementation Details Our autoencoder consists of two layers with dropout and a tanh nonlinearity. We use polynomial kernel to compute\nAlgorithm 1 SMI-based unsupervised word translation Input: Unpaired word embeddings D = ({xi}ni=1, {yj}nj=1).\n1: Init: weights Θx, Θy, permutation matrix Π. 2: while not converged do 3: Update Θx,Θy given Π: Backprop (2). 4: Update Π given Θx,Θy: LSOM (3). 5: end while\nOutput: Permutation Matrix Π. Params Θx, Θy.\nthe gram matrices K and L. For all pairs of languages, we fix the number of training epochs to 20. All the word vectors are `2 unit normalized. For CSLS we set the number of neighbors to 10. For optimizing Π at each epoch, we set the step size η = 0.75 and use 20 iterations. For the regularization R(Θ), we use the sum of the Frobenius norms of weight matrices. We train Θ using full batch gradient-descent, with learning rate 0.05. Datasets We performed experiments on the publicly available English-Italian, EnglishSpanish and English-Chinese datasets released by (Dinu and Baroni, 2015; Zhang et al., 2017b; Vulic and Moens, 2013). We name this collective set of benchmarks BLI. We also conduct further experiments on a much larger recent public benchmark, MUSE (Conneau et al., 2018)1. Setting and Metrics We evaluate all methods in terms of Precision@1, following standard practice. We note that while various methods in the literature were initially presented as fully supervised (Mikolov et al., 2013), semi-supervised (using a seed dictionary) (Haghighi et al., 2008), or unsupervised (Zhang et al., 2017b), most of them can be straightforwardly adapted to run in any of these settings. Therefore we evaluate all methods both in the unsupervised setting in which we are primarily interested, and also the commonly evaluated semi-supervised setting with 500 seed pairs. Competitors: Non-Adversarial In terms of competitors that, like us, do not make use of GANs, we evaluate: Translation Matrix (Mikolov et al., 2013), which alternates between estimating a linear transformation by least squares and matching by nearest neighbour (NN). Multilingual Correlation (Faruqui and Dyer, 2014), and Matching CCA (Haghighi et al., 2008), which alternates between matching and estimat-\n1https://github.com/facebookresearch/MUSE/\ning a joint linear subspace. Kernelized Sorting (Quadrianto et al., 2009), which directly uses HSIC-based statistical dependency to match heterogeneous data points. Self Training (Artetxe et al., 2017) A recent state of the art method that alternate between estimating an orthonormal transformation, and NN matching.\nCompetitors: Adversarial In terms of competitors that do make use of adversarial training, we compare: W-GAN and EMDOT (Zhang et al., 2017b) make use of adversarial learning using Wasserstein GAN and Earth Movers Distance respectively. GAN-NN (Conneau et al., 2018) uses adversarial learning to train an orthogonal transformation, along with some refinement steps and an improvement to the conventional NN matching procedure called ‘cross-domain similarity lo-\ncal scaling’ (CSLS). Since this is a distinct step, we also evaluate our method with CSLS.\nWe use the provided code for GAN-NN and Self-Train, while re-implementing EDOT/WGAN to avoid dependency on theano."
  }, {
    "heading": "3.1 Results",
    "text": "Fully Unsupervised Table 1 presents comparative results for unsupervised word translation on BLI and MUSE. From these we observe: (i) Our method (bottom) is consistently and significantly better than non-adversarial alternatives (top). (ii) Compared to adversarial alternatives Deep-SMI performs comparably.\nAll methods generally perform better on the MUSE dataset than BLI. These differences are due to a few factors: MUSE is a significantly\nlarger dataset than BLI, benefitting methods that can exploit a large amount of training data. In the ground-truth annotation, BLI contains 1-1 translations while MUSE contains more realistic 1-many translations (if any correct translation is picked, a success is counted), making it easier to reach a higher score.\nSemi-supervised Results using a 500-word bilingual seed dictionary are presented in Table 2. From these we observe: (i) The conventional methods’ performances (top) jump up, showing that they are more competitive if at least some sparse data is available. (ii) Deep-SMI performance also improves, and still outperforms the classic methods significantly overall. (iii) Again, we perform comparably to the GAN methods."
  }, {
    "heading": "3.2 Discussion",
    "text": "Figure 1 shows the convergence process of DeepSMI. From this we see that: (i) Unlike the adversarial methods, our objective (Eq. (1)) improves smoothly over time, making convergence much easier to assess. (ii) Unlike the adversarial methods, our accuracy generally mirrors the model’s loss. In contrast, the various losses of the adversarial approaches do not well reflect translation accuracy, making model selection or early stopping a challenge in itself. Please compare our Figure 1 with Fig 3 in Zhang et al. (2017b), and Fig 2 in Conneau et al. (2018).\nThere are two steps in our optimization: matching permutation Π and representation weights Θ. Although this is an alternating optimization, it is analogous to an EM-type algorithm optimizing latent variables (Π) and parameters (Θ). While local minima are a risk, every optimisation step for either variable reduces our objective Eq. (1).\nThere is no min-max game, so no risk of divergence as in the case of adversarial GAN-type methods.\nOur method can also be understood as providing an unsupervised Deep-CCA type model for relating heterogeneous data across two views. This is in contrast to the recently proposed unsupervised shallow CCA (Hoshen and Wolf, 2018), and conventional supervised Deep-CCA (Chang et al., 2018) that requires paired data for training; and using SMI rather than correlation as the optimisation objective."
  }, {
    "heading": "4 Conclusion",
    "text": "We have presented an effective approach to unsupervised word translation that performs comparably to adversarial approaches while being significantly easier to train and diagnose; as well as outperforming prior non-adversarial approaches."
  }],
  "year": 2018,
  "references": [{
    "title": "A general class of coefficients of divergence of one distribution from another",
    "authors": ["Syed M. Ali", "Samuel. D. Silvey."],
    "venue": "Journal of the Royal Statistical Society. Series B (Methodological), 28(1):131–142.",
    "year": 1966
  }, {
    "title": "Wasserstein generative adversarial networks",
    "authors": ["Martín Arjovsky", "Soumith Chintala", "Léon Bottou."],
    "venue": "ICML.",
    "year": 2017
  }, {
    "title": "Learning principled bilingual mappings of word embeddings while preserving monolingual invariance",
    "authors": ["Mikel Artetxe", "Gorka Labaka", "Eneko Agirre."],
    "venue": "EMNLP.",
    "year": 2016
  }, {
    "title": "Learning bilingual word embeddings with (almost) no bilingual data",
    "authors": ["Mikel Artetxe", "Gorka Labaka", "Eneko Agirre."],
    "venue": "ACL.",
    "year": 2017
  }, {
    "title": "Scalable and effective deep CCA via soft decorrelation",
    "authors": ["Xiaobin Chang", "Tao Xiang", "Timothy M. Hospedales."],
    "venue": "CVPR.",
    "year": 2018
  }, {
    "title": "Word translation without parallel data",
    "authors": ["Alexis Conneau", "Guillaume Lample", "Marc’Aurelio Ranzato", "Ludovic Denoyer", "Hervé Jégou"],
    "venue": "In ICLR",
    "year": 2018
  }, {
    "title": "Improving zero-shot learning by mitigating the hubness problem",
    "authors": ["Georgiana Dinu", "Marco Baroni."],
    "venue": "ICLR Workshops.",
    "year": 2015
  }, {
    "title": "Improving vector space word representations using multilingual correlation",
    "authors": ["Manaal Faruqui", "Chris Dyer."],
    "venue": "EACL.",
    "year": 2014
  }, {
    "title": "Generative adversarial nets",
    "authors": ["Ian Goodfellow", "Jean Pouget-Abadie", "Mehdi Mirza", "Bing Xu", "David Warde-Farley", "Sherjil Ozair", "Aaron Courville", "Yoshua Bengio."],
    "venue": "NIPS.",
    "year": 2014
  }, {
    "title": "Bilbowa: Fast bilingual distributed representations without word alignments",
    "authors": ["Stephan Gouws", "Yoshua Bengio", "Greg Corrado."],
    "venue": "ICML.",
    "year": 2015
  }, {
    "title": "A distributed representation-based framework for cross-lingual transfer parsing",
    "authors": ["Jiang Guo", "Wanxiang Che", "David Yarowsky", "Haifeng Wang", "Ting Liu."],
    "venue": "JAIR, 55(1):995–1023.",
    "year": 2016
  }, {
    "title": "Learning bilingual lexicons from monolingual corpora",
    "authors": ["Aria Haghighi", "Percy Liang", "Taylor Berg-Kirkpatrick", "Dan Klein."],
    "venue": "ACL.",
    "year": 2008
  }, {
    "title": "Unsupervised correlation analysis",
    "authors": ["Yedid Hoshen", "Lior Wolf."],
    "venue": "CVPR.",
    "year": 2018
  }, {
    "title": "Inducing crosslingual distributed representations of words",
    "authors": ["Alexandre Klementiev", "Ivan Titov", "Binod Bhattarai."],
    "venue": "COLING.",
    "year": 2012
  }, {
    "title": "Unsupervised analysis for decipherment problems",
    "authors": ["K. Knight", "A. Nair", "N. Rathod", "K. Yamada."],
    "venue": "Proc. ACL-COLING.",
    "year": 2006
  }, {
    "title": "The hungarian method for the assignment problem",
    "authors": ["Harold W Kuhn."],
    "venue": "Naval research logistics quarterly, 2(1-2):83–97.",
    "year": 1955
  }, {
    "title": "Unsupervised machine translation using monolingual corpora only",
    "authors": ["Guillaume Lample", "Ludovic Denoyer", "Marc’Aurelio Ranzato"],
    "venue": "arXiv preprint arXiv:1711.00043",
    "year": 2017
  }, {
    "title": "Hubness and pollution: Delving into cross-space mapping for zero-shot learning",
    "authors": ["Angeliki Lazaridou", "Georgiana Dinu", "Marco Baroni."],
    "venue": "ACL.",
    "year": 2015
  }, {
    "title": "On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling",
    "authors": ["Karl Pearson."],
    "venue": "The London, Edinburgh, and",
    "year": 1900
  }, {
    "title": "Kernelized sorting",
    "authors": ["Novi Quadrianto", "Le Song", "Alex J Smola."],
    "venue": "NIPS.",
    "year": 2009
  }, {
    "title": "Sufficient dimension reduction via squared-loss mutual information estimation",
    "authors": ["Taiji Suzuki", "Masashi Sugiyama."],
    "venue": "AISTATS.",
    "year": 2010
  }, {
    "title": "Crosslingual semantic similarity of words as the similarity of their semantic word responses",
    "authors": ["Ivan Vulic", "Marie-Francine Moens."],
    "venue": "HLT-NAACL.",
    "year": 2013
  }, {
    "title": "Cross-domain matching with squared-loss mutual information",
    "authors": ["Makoto Yamada", "Leonid Sigal", "Michalis Raptis", "Machiko Toyoda", "Yi Chang", "Masashi Sugiyama."],
    "venue": "IEEE TPAMI, 37(9):1764– 1776.",
    "year": 2015
  }, {
    "title": "Adversarial training for unsupervised bilingual lexicon induction",
    "authors": ["Meng Zhang", "Yang Liu", "Huanbo Luan", "Maosong Sun."],
    "venue": "ACL.",
    "year": 2017
  }, {
    "title": "Earth mover’s distance minimization for unsupervised bilingual lexicon induction",
    "authors": ["Meng Zhang", "Yang Liu", "Huanbo Luan", "Maosong Sun."],
    "venue": "EMNLP.",
    "year": 2017
  }],
  "id": "SP:5dd38dcd146f944d53f44bedcd9e9398b38630ca",
  "authors": [{
    "name": "Tanmoy Mukherjee",
    "affiliations": []
  }, {
    "name": "Makoto Yamada",
    "affiliations": []
  }, {
    "name": "Timothy Hospedales",
    "affiliations": []
  }],
  "abstractText": "Word translation, or bilingual dictionary induction, is an important capability that impacts many multilingual language processing tasks. Recent research has shown that word translation can be achieved in an unsupervised manner, without parallel seed dictionaries or aligned corpora. However, state of the art methods for unsupervised bilingual dictionary induction are based on generative adversarial models, and as such suffer from their well known problems of instability and hyperparameter sensitivity. We present a statistical dependency-based approach to bilingual dictionary induction that is unsupervised – no seed dictionary or parallel corpora required; and introduces no adversary – therefore being much easier to train. Our method performs comparably to adversarial alternatives and outperforms prior non-adversarial methods.",
  "title": "Learning Unsupervised Word Translations Without Adversaries"
}