{
  "sections": [{
    "heading": "1. Introduction",
    "text": "The sheer number and variety of online social networks (OSN) today is staggering. Although the purpose and the shaping of these networks vary generously, the majority of them has one aspect in common: the value of most OSNs is in its user data and the information that one can infer from the data. This, unfortunately, results in a big incentive for culprits to intrude OSNs and manipulate their data. One popular method of intruding and attacking an OSN is referred to as Sybil attack, where the intruder creates a whole bunch of fake (Sybil) accounts that are all under the attacker’s control. The intruder’s influence over the OSN\n1MathPlan, 10587 Berlin, Germany 2Machine Learning Group, Berlin Institute of Technology, 10587 Berlin, Germany 3Berlin Big Data Center 4Max Planck Society 5Korea University. Correspondence to: János Höner <janos.hoener@campus.tuberlin.de>, Nico Görnitz <nico.goernitz@tu-berlin.de>, KlausRobert Müller <klaus-robert.mueller@tu-berlin.de>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nis multiplied by the number of accounts created, which opens possibilities of manipulation typically for gaining some monetary advantage in the end.\nThe term, Sybil attack, was coined by Douceur (2002) who showed that this kind of attack will be always possible unless a trusted agency certifies identities. Unfortunately, this approach is orthogonal to how OSNs grow. The threshold of registration must be as low as possible to attract as many new users as possible. On the other hand, Sybil attacks can damage the value of OSNs significantly, which has been proved by the fact that Facebook shares dropped in 2012 after the company revealed that a significant share of its network is made up by Sybil accounts (The Associated Press, 2012).\nThere exists a number of “classic” feature-based solutions (Stein et al., 2011; Cao et al., 2012; Stringhini et al., 2010; Yang et al., 2014). However, up until now, it remains an unsolved problem as those methods can be evaded by cleverly designed attacking schemes (Bilge et al., 2009; Boshmaf et al., 2011; Wagner et al., 2012; Lowd & Meek, 2005) and manual detection is too expensive, time consuming, and simply unfeasible in large OSNs (Cao et al., 2012).\nMore recent graph-based Sybil detection methods assume that honest (non-Sybil) nodes form a strongly connected subgraph and attackers can establish a limited amount of edges which leads to a sparse cut between the honest subraph and the Sybil nodes. The majority of the graph-based methods define trusted nodes, which the defender is sure to be honest, and use random walks (Yu et al., 2010; Danezis, 2009; Cao et al., 2012) or other typical graph-based algorithms like breadth-first-search (Tran et al., 2011) and belief propagation (Gong et al., 2014) to convey trust from the trusted nodes. A node is identified as Sybil if sufficient ammount of trust is not delivered to it. Among random-walk based approaches, SybilRank is known to be the state-ofthe-art, of which the performance is theoretically guaranteed (Cao et al., 2012). However, the theory holds only under unrealistic topological assumptions of the network. In this paper, we show that the same theoretical guarantee can be obtained under more realistic situations.\nWe further dicuss the robustness of the random walk approach against adversarial strategies. To this end, we formally introduce adversarial settings for graph-based Sybil\ndetection and derive an optimal attacking strategy that is based on the exploitation of trust leaks. Based on our analysis, we propose a transductive Sybil ranking (TSR), an integrated approach capable of adjusting edge weights based on sampled trust leaks. We empirically show good performance of TSR against the state-of-the-art baselines on a variety of attacking scenarios using artificially generated data as well as real-world Facebook data."
  }, {
    "heading": "2. Preliminaries",
    "text": "We are given a graph G = (V,E) consisting of nodes V and pairwise edges E between nodes. We denote GS = (VS , ES) the Sybil sub-graph, GH = (VH , EH) the disjunct honest sub-graph, and VT ✓ VH our trusted (verified nonSybil nodes) random walk seed nodes. EA is the set of edges connecting any node in GS and any node in GH . Sybil Rank is considered the state-of-the-art graph-based method to detect Sybil accounts as it outperformed all its contestants (Cao et al., 2012). It is also based on random walks and operates solely on the topology of the graph. Sybil Rank starts from the initial distribution {p(i)0 2 [0, 1]}|V |i=1 (without superscript refers to a vector containing all elements), in which “trust” is assigned to the known honest nodes VT :\np (i) 0 =\n( 1\n|VT | if vi 2 VT , 0 otherwise.\n(1)\nThen, it “propagates” the trust via a short (k steps) random walk:\np > k = p > k 1Q = · · · = p>0 Qk , (2)\nwhere Q 2 R|V |⇥|V | is the transition matrix through the edges with Qi,j = ( P j0 1[(i, j 0 ) 2 E]) 1, if (i, j) 2 E, and else 0. It is known that the stationary distribution ⇡ ⌘ p1 is the normalized degree distribution (Behrends, 2000)\n⇡ > = ⇣ deg(v1) Vol(V ) , . . . , deg(v|V |) Vol(V ) ⌘ , (3)\nwhere deg(v) is the degree of node v, i.e., the number of all incident edges of v, and Vol(V ) = P v2V deg(v) is the sum of the degrees for all nodes in V . SybilRank conpensates the effect of degrees, and use the degree-normalized probability\np (i) = p (i) k /⇡ (i) (4)\nas the ranking score, where a high ranking indicates a high probability of being an honest node.\nEssentially, SybilRank relies on the assumption that the total number of attacking edges is bounded. Under this assumption, only a small fraction of the trust is propagated\nthrough the sparse cut between the honest network and the Sybil nodes during the short random walk, while ”trust” go through the ”non-trusted” honest nodes through the dense connections within the the honest subgraph.\nBoshmaf et al. (2016) developed Integro to cope with a larger number of attacking edges. To this end, Integro introduces weights on the edges to bias the random walk, where the weights are determined after its pre-processing step to detect victims. Here a victim is defined as a node that established a connection to one of the Sybil nodes. The set of all victim nodes is defined by Vv = {v 2 Vh : 9(v, s) 2 EA}. After the detection step, Integro lowers the weights to all incident edges to the detected victims, which prevents the trust to propagate through victim nodes. As the victims form a natural border between the honest and the Sybil graph, this reduces the overall flow of trust into the Sybil graph. Boshmaf et al. found that traditional feature-based classification methods yield good and robust detection of victims. A notable advantage against the feature-based Sybil detection is that, unlike Sybils, victims generally do not behave adversarial, as they don’t have any incentive to ”hide”."
  }, {
    "heading": "3. SybilRank’s Security Guarantee Under",
    "text": "More Realistic Assumptions\nCao et al. (2012) gave a security guarantee for SybilRank. Let g := |EA| be the number of attacking edges and n := |V | be the number of all nodes in the graph. their theory relies on the notion of trust leaks. Definition 1. (Trust leaks) Let rk0 = P i2VH p (i) k0 be the trust that remains in the honest graph after k0 random walk steps. We call l = Pk k0=1(rk0+1 rk0) the absolute trust leak. Assume that the attacking edges are created randomly, following a distribution ↵(EA). We call CH(k 0 ) = E↵(EA)[ rk0+1 rk0 rk0\n] the expected relative trust leak.\nCH(k 0 ) is actually a constant with respect to k0 under reasonable assumptions on ↵(EA). The following lemma has been proved: Lemma 1. (Cao et al., 2012) Assume that the graph G is created randomly, following the configuration model (Molloy & Reed, 1995). Then, the expected relative trust leak in each iteration is given by CH = gvol(VH) .\nThis leads to a theoretical guarantee of SybilRank. Theorem 1. (Cao et al., 2012) Assume that the graph G is created randomly, following the configuration model. The total number of Sybils that are ranked higher than nonSybils by SybilRank is O(g log n). Theorem 1 implies good performance of SybilRank, but\nit holds under the assumption that the attacking edges are created in the same process as the honest graph,1 which is not realistic.\nBelow, we show that the same guarantee is obtained under the following more realistic assumption: Assumption 1. The graph G is constructed by the following steps:\n1. Honest graph GH construction: GH is connected, nonbipartite, and scale free, i.e., the degree distribution follows the power law distribution.\n2. Sybil graph GS construction: The topology of GS is arbitrary.\n3. Attacking edges EA generation: The attacking edges are genarated on all possible edges EA ⇢ VS ⇥ VH between the honest and the Sybil subgraphs with equal propability.\nUnder Assumption 1, evaluating the expected trust leak is less straightforward. Nevertheless, we can show that it results in the same formal security guarantee stated in Theorem 1.\nTo properly compute the expected trust leak, the following random variables are defined. Xv counts the number of attacking edges incident to node v, Yv = ⇡(v)\nXv deg(v,GH)+Xv = ⇡(v) Xv deg(v,G) is the trust leak in node\nv and Z = P\nv2VH Yv is the total trust leak. Note that here ⇡(v) is the current amount of trust in node v and not the stationary distribution of the random walk. This notation is used to avoid confusion with the probability mass function denoted by P . From Assumption 1 it follows that Xv is hypergeometrically distributed (Tuckwell, 1995) with the following parameters: the population size: N = |VH⇥VS |, successes: K = |{v}⇥ VS |, and the draws n = |EA|. Let g := |EA| be the number of attacking edges. Moreover, let nH := |VH | and nS := |VS | denote the number of honest nodes and Sybil nodes, respectively.\nThe probability mass function of Xv is given by P (Xv =\nk) =\n✓ K\nk ◆✓ N K n k ◆ / ✓ N n ◆ and according to Tuckwell\n(1995), its expected value can be computed by E[Xv] = n\nK N = |EA| |{v}⇥VS ||VH⇥VS | = |EA| |VH | = g nH\n. The final goal is to compute the expected value of Z. The linearity of the expected value yields E[Z] =\nP v2VH E[Yv] and for the\nexpected value of Yv we get\nE[Yv] = ⇡(v)deg(v,G) P1 k=0 kP (Xv = k)\n= ⇡(v) deg(v,G)E[Xv] = ⇡(v) deg(v,G) g nH .\n1This assumption is not explicitly stated in Cao et al. (2012), but apparent from their derivation.\nUsing this result, the expected value of Z becomes E[Z] =P v2VH E[Yv] = g nH P v2VH ⇡(v) deg(v,G) , where the right hand side still contains a sum that needs to be evaluated individually for each node to compute its actual value. In order to “average out” this sum, we rely on the assumption that the honest nodes GH is power law-distributed (Barabási, 2009). To do this, a new random variable Dv is introduced which measures the degree of v. Then, the assumption results in the probability of a node having a degree of d being P (Dv = d) = d\n⇣( ) , where ⇣ is the Riemann zeta function ⇣(s) := P1 n=0 n s (Barabási, 2009).\nWith this expression, it is possible to “average out” the exact topology of the graph by computing the expected value with respect to the newly defined random variable Dv:\nE[Z] = gnH P1 d=1 P v2VH ⇡(v) d P (Dv = d)\n= g nH P v2VH ⇡(v) P1 d=1 1 d d ⇣( )\n= g nH P v2VH ⇡(v) ⇣( ) P1 d=1 d ( +1)\n= g nH ⇣( +1) ⇣( ) P v2VH ⇡(v).| {z }\nTotal trust in the honest graph\nThis yields the following lemma. Lemma 2. Under Assumption 1 the expected relative trust leak in each iteration of the random walk is given by\n˜ CH = g\nnH ⇣( +1) ⇣( )| {z } =:e\nwhere e < 1 is a constant that depends on the parameter of the assumed power law distribution for the degree distribution.\nAlthough Lemma 2 gives a different expected relative trust leak from Lemma 1, the fact that the maximum number of connection for each node is bounded in every OSN and therefore O(nH) = O(vol(VH)) leads to the same asymptotic behavior as Theorem 2: Theorem 2. Under Assuption 1, the total number of Sybils that are ranked higher than non-Sybils by SybilRank is O(g log n). This result explicitly shows that, asymptotically, SybilRank’s security guarantee remains unchanged even under more realistic Assumption 1."
  }, {
    "heading": "4. Adversarial Strategies",
    "text": "In this section, we discuss adversarial strategies against graph-based Sybil detection methods.\nAttacker’s Action Although attackers in general can take variety of actions, we restricts their action to adding attacking edges.\nDefinition 2 (Attacking strategy). Given an honest graph GH and a Sybil graph GS , an attacking strategy describes the set of attacking edges established by the intruder.\nThe cost of action is measured by the number of attacking edges.\nAttacker’s Knowledge Generally, we focus on adversarial attacks against random walk based approaches. That is, an attacker’s strategy for establishing edges from Sybil nodes to honest nodes in order to cloak an attacker’s Sybil sub-network. For analysis, we assume different levels of knowledge that the attacker has on the defender’s strategy and information:\nA.1 Strategy only.\nA.2 Strategy + topology.\nA.3 Strategy + topology + trusted nodes (positively labeled nodes).\nB.1 Strategy + topology + trusted nodes (positively labeled nodes) + untrusted nodes (negatively labeled nodes).\nHere, we divided the level of access to inside information for the attacker into two groups. In group A (i.e., A.1, A.2, A.3) attackers are able to gather sophisticated information based on publicly available sources, whereas in group B (i.e., B.1) either some back-channel provides non-public information (e.g. defender marked Sybil nodes based on their analysis), or, the attackers are provided with all information visible to the defenders.\nClearly, it is too hard, if not impossible, to have an out-ofthe-box solution for the setting described in group B and we therefore resort our analysis on the settings in group A. In the first case (A.1), no efficient adversarial strategies for graph-based random walk approaches is possible. The attackers must build up sufficient attacking edges to trusted nodes in order to absorb enough trust. In A.3 (and A.2 as a special case) on the other hand, the attacker gained enough information to guide the creation of attacking edges efficiently. This paper focuses on this most interesting situation. More specifically, we assume the following: the intruder knows defender’s strategy (algorithm details), the topology of the honest graph, and the set of trusted nodes, i.e., she knows about GH = (VH , EH) and VT . Based on that knowledge the intruder can establish attacking edges to honest nodes of her choice with the goal to create an attacking scenario where the applied defense method fails. Although the exact topology of the Sybil graph is not specified any further, for the following results it is assumed that it is designed in a way that suits the intruder well.\nAttacker’s Goal Attackers can have various final goals, e.g., spamming honest users to earn money, feeding wrong information to honest nodes, stealing nonpublic information, damaging countries/companies, etc. Depending on the goal, the objective of the optimal strategy can differ. We assume that attacker’s try to maximize their influence and hence, have an inherent need to increase the number of attacking edges.\nRandom-walk based approaches such as SybilRank and Integro rely on the fact that the absolute trust leak l from the honest graph to the Sybil graph is small (i.e., below the amount needed to reach the stationary distribution within the Sybil sub-graph) which ensures low trust scores for the Sybil nodes. However, if enough trust is being propagated to the Sybil graph, trust values will be close to the stationary distribution in the Sybil graph as well as in the honest graph. Consequently, the degree-normalized ranking values will be similar to the ones in the honest graph, which makes Sybil nodes indistinguishable from honest nodes and therefore disables the detector. Definition 3 (Disabling Attacking Strategy). Let GH and GS be the honest graph and the Sybil graph. Let l : 2E ! R be the absolute trust leak as a function of an attacking strategy. Then, an attacking strategy EA ⇢ VH ⇥ VS is said to be disabling if\nl(EA) td, (5) where td is the disabling threshold, which depends on the topology of the Sybil graph and the detection algorithm.\nSurely, an attacker does not aim for just any disabling strategy but for the one that comes at the lowest cost. As the cost of an attacking strategy is assumed to be increasing in the number of attacking edges, an optimal/minimal disabling strategy is given by the following definition. Definition 4 (Optimal Disabling Strategy). An attacking strategy AE is said to be optimal if it is the solution to the following optimization problem:\nmin EA⇢VH⇥VS |EA| (6)\ns. t. l(EA) td.\nTo solve this, the disabling threshold td and the trust leak function must be known to the attacker. Ignoring the edge weights (which are unknown to the attacker) the amount of trust needed within the Sybil graph to reach the stationary distribution of the random walk is given by td =P\nvi2VS ⇡i = vol(VS) vol(V ) . To exactly evaluate l(EA) the entire random walk needs to be simulated which is infeasible for the attacker without knowing its exact length and the edge weights. A useful estimate is to consider only the first iteration. The computation of this value is feasible and the trust leak per attacking edge is by far the\nlargest in the first iteration because all the trust is concentrated in the relatively small subset of trusted nodes VT . The trust leak in the first iteration ˜l(EA) is given by l(EA) = P v2VT (v) deg(v,GH)+(v)\n, where (v) is the attacking degree (i.e., the number of attacking edges) of node v. This leads to a greedy strategy where the intruder iteratively adds those attacking edges which produce the largest increase in ˜l. In the following the term adversarial strategy/attacker refers to this greedy strategy."
  }, {
    "heading": "5. Proposed Method",
    "text": "In this section, we propose our new method and derive its efficient solver. Our method is specifically designed to cope with a large number of attacking edges by minimizing “trust leaks”, that is, minimizing a sampled trust leak by adjusting the edge weights—a missing mechanism for SybilRank and Integro.\nTransductive Sybil Ranking Combining the approach of Backstrom & Leskovec (2011) and SybilRank (Cao et al., 2012), our proposed method, called transductive Sybil ranking (TSR), tries to leverage potential prior knowledge, negative labels, to bias a short random walk so that random walk methods work even with the existence of a large number of attacking edges.\nAssume that all nodes carry attributes and n  |V | nodes are additionally attached with label information, i.e., the defender knows a subset of nodes are honest, and another subset of nodes are sybil. More formally, the defender is given labeled nodes L := {(xi, yi) 2 X ⇥ {+1, 1}}ni=1 and unlabeled nodes U := {xi 2 X}|V |i=n+1. Since only the honest nodes can be trusted, VT ✓ {vi 2 V ; yi = +1} holds.\nWe define an edge feature function u,v between nodes u and v as u,v : X ⇥ X ! Y . A corresponding parameterized, non-negative scoring function fw : Y ! R+ is learned during training and applied as edge weight au,v = fw( u,v) in the weighted adjacency matrix Q 2 R|V |⇥|V |:\nQu,v =\n( au,vP x au,x\nif (u, v) 2 E, 0 otherwise.\n(7)\nThroughout our experiments, we restrict ourselves to the following differentiable edge feature function:\nfw( u,v) = (1 exp( w> u,v)) 1. (8) Once the transition matrix is fixed, The remaining procedure is the same as SybilRank. Namely, starting form the initial distribution (1), k-steps random walk (2) is applied with the transition matrix (7). After that, the degreenormalized ranking probability (4) is used for classification. However, we are also given negatively labeled nodes,\nwhich are used to train the parameter w of the edge feature function (8), so that p(i) < p(j), 8 i, j 2 {1, . . . , n} with yi = 1 and yj = +1. In the spirit of regularized risk minimization (Vapnik, 1999), this problem is formalized as follows:\nDefinition 5 (TSR optimization problem). TSR solves a quadratically regularized, non-convex optimization problem with generic loss-functions h : [0, 1]⇥{+1, 1} ! R:\nminimize w F (w) =\n2\nkwk2 + nX\ni=1\nh(p (i) (w), yi) . (9)\nUsing the notion of p(i)(w) visually indicates that node ranking probabilities p are (non-linearly) dependent on the parameter vector w. As for the choice of loss-functions, we examine the following:\n• Wilcoxon-Mann-Whitney (WMW) loss (Yan et al., 2003). WMW maximizes the area under the ROC curve:\nh(p, y) =\nnX\nj=1\n1[y = +1^yj = 1] ⇣ 1 + exp p pjb ⌘ 1 .\n• Smooth hinge-loss variant A smooth variant of the classical support vector machine hinge-loss with two additional parameters: a decision boundary b 2 R and a scaling parameter a 2 R:\nh(p, y) =\n8 ><\n>: 1 2 y(ap b) if y(ap b)  0, 1 2 (1 y(ap b))2 if 0 < y(ap b)  1, 0 if 1 < y(ap b).\nIn this work, we focus on smooth, differentiable lossfunctions only, ensuring fast convergence to local optima via gradient-based methods, i.e., fast second-order methods (BFGS). A pivotal point is hence, to assess the gradient w.r.t. w.\nGradient Computation The remaining of this section is dedicated to the derivation of the gradient:\n@F (w) @w = @ kwk2 @2w + Pn i @h(p(i)(w),yi) @w ,\nwhere the loss-function h can be further split into @h(p(i)(w),yi)\n@w = @h(p(i)(w),yi) @p(i)(w) @p(i)(w) @w . Since we con-\nstrained ourselves to differentiable loss-function h(p, y), the partial derivative w.r.t. p can be calculated rather straightforward. More complicated is the evaluation of\n@p(i)\n@w = @ @w p(i)k ⇡(i) = ✓ @p(i)k @w ⇡ (i) p(i)k @⇡ (i) @w ◆ ⇡ (i) 2 . (10)\nThe derivative of the i-th component of ⇡ is given by:\n@⇡(i)\n@w =\n⇣ @deg⇤(vi) @w vol(V ) @vol(V )@w deg⇤(vi) ⌘ vol(V ) 2,\nwhere @deg ⇤(vi) @w = P e2E vi2e @ae @w = P e2E vi2e @fw( e) @w and @vol(V ) @w = 2 P e2E @ae @w = 2 P e2E @fw( e) @w . As fw is said to be differentiable the only part of Eq. (10) that remains is the Jacobian @pk/@w.\nTheorem 3. The derivative @pk/@w for k 1 is given by:\n@pk @w = ✓ k 1P l=0 plQ k 1 l ◆ @Q @w . (11)\n(the proof is given in Appendix A). The derivative of Q, defined in Eq. (7), is given by\n@Quv @w =\n8 <\n:\n@auv @w P x aux auv P x @aux @w\n( P x aux) 2 if (u, v) 2 E, 0 otherwise.\nThis completes the computation of the gradient and enables the application of gradient-based methods, i.e., BFGS to find a (locally) optimal estimate ŵ. By using this estimate, TSR weights the whole graph, with which a short random walk is performed to obtain the final ranking p.\nRobustness of TSR against Attacks By using the negative label information, our TSR, in principle, monitors “trust leak” through random walk, and adjusts the edge weights so that the leak is minimized. As a result, the weights tend to be lower on the attacking edges (to reduce the propagation), and higher on the Sybil edges (to boost the stationary distribution). Thus, we can expect that our TSR, which is an advanced integrated method, is more robust against attacks than the SybilRank and the two-step Integro approach."
  }, {
    "heading": "6. Empirical Evaluation on Synthetic Data",
    "text": "To assess the robustness of the proposed method and the baseline methods, we generate artificially network topology and edge and node attributes in order to have full control of the underlying ground truth. We separately create two graphs, the honest and the Sybil graph. Both use the generation method proposed by Holme & Kim (2002) for scale free networks. Node features are generated randomly and correlated through dependency injection. The edge features function u,v simply stacks node features of the two adjacent nodes xu and xv (see Appendix B for more details). Connections between Sybil and honest graphs are established according to a random attacking strategy that iteratively adds attacking edges randomly, i.e., equally distributed on the set of all possible attacking edges VH ⇥ VS\nor a adversarial attacking strategy that solves Problem (6) for optimal attacks. This strategy only chooses an honest node to be attacked next and the corresponding Sybil node is chosen randomly (equally distributed on the set of all Sybil nodes VS). We test our method, TSR, using the proposed loss functions and compare against the stateof-the-art methods SybilRank and Integro. As Integro depends on a preceding victim prediction, we simulated one that achieves highest possible rankings (ROC-AUC close to 1.0).2\nRandom Attacking Strategy We generated a sample network (|VH | = 200 and |VS | = 30) and select 15 honest nodes and 8 Sybil nodes randomly, which will be used as labeled examples for our TSR. The labeled honest nodes are also used as the set VT of trusted seeding nodes for the random walks in all methods. We evaluate the performance in terms of ROC-AUC-values for the computed ranking. This procedure was repeated 20 times for varying number of attacking edges (10-200 edges). Figure 1 shows ROC-AUC curves for all methods under the random attacking setting. We can obsreve that our TSR, regardless of the choice of loss function, performs superior to the other methods. Integro’s accuracy deteriorates fast but still has an edge over SybilRank up to the point where the ROCAUC-value reaches 0.5. After that SybilRank and Integro essentially perform similar.\nAdversarial Attacking Strategy For the adversarial setting, we ran the same benchmarks but this time attacking edges were added according to the adversarial attacking strategy. Due to the much more aggressive setting, we varied the number of attacking edges from 1-40 and repeated this procedure 20 times to report averaged ROCAUC accuracies. The results are depicted in Figure 2. All choices of loss functions outperform SybilRank and Integro clearly. The results confirm our considerations that SybilRank’s performance drops fast and steep as soon as a certain amount of attacking edges is established. Integro behaves more robust than SybilRank, but, ultimately, must resign after a few more attacking edges. Again, our TSR is significantly more robust against adversarial attacks and can withstand higher number of attacking edges until its performance finally deteriorates."
  }, {
    "heading": "7. Empirical Evaluation on Real-world Data",
    "text": "We also evaluated our method on a sample of the Facebook graph Leskovec & Mcauley collected from survey participants using the Facebook app. The dataset includes the topology (|V | = 4039 users and |E| = 88234 friend-\n2SybiRank, Integro, and TSR rely on different information, and therefore, the fairness of comparison is not trivial. We discuss this issue in Appendix C.\nships) as well as node features for every node (see Table 1 for summary), Figure 3). Node features are comprised of obfuscated categorical features of users profiles including education, work, hometown, language, last name, etc. As with most of real world social graphs, the data exhibits strong multi-cluster structure, as seen in Figure 3 and Figure 4. These clusters pose additional challenges to the application of random walk-based methods as the trust propagation between two loosely inter-connected clusters is low (Cao et al., 2012; Boshmaf et al., 2016). Hence, trust seeds should be distributed among all clusters. Following SybilRank and Integro (Cao et al., 2012), we employ the Louvian clustering method (Blondel et al., 2008) first.\nAs common, the Sybil graph needs to be generated. For this purpose, a (small) subgraph was copied and declared as Sybil. The attacking edges were created to link the honest and the Sybil graph following one of the attacking strategies (random or adversarial). It was made sure that no Sybil node attacked one of the direct neighbors of its origin which is reasonable for most social graphs. Edge features\nfor TSR are as follows: the number of shared features (in total), the number of shared friends, and the number of shared features within specific categories. The other experimental setup is the same as the previous section.\nRandom Attacks The trusted nodes |VT | = 50 were randomly distributed among all clusters and a small subset of Sybils |VD| = 30 was chosen as known Sybil nodes. Attacking edges EA were established following the random attacking strategy ranging from |EA| = 1 to |EA| = 1400. Experiments were repeated 10 times. Integro was run with\nsarial attacking scenario on the Facebook graph.\ntwo levels of accuracy in simulated victim detection, i.e., perfect (AUROC = 1) and almost perfect (AUROC = 0.9). Figure 5 shows the AUROC-values. The detection performance of SybilRank is the lowest and drops soon as attacking edges increase. Integro with the perfect victim detection outperforms the other methods, but with just a slight reduction in the victim detection accuracy (AUROC = 0.9), its performance drops significantly. All versions of TSR perform almost on par with perfect version of Integro in the lower range of attacking edges (1—800). In the higher range (800—1400), the hinge loss drop fast to end up with a performance similar to Integro with the almost perfect victim detection. However, the variant that uses the WMW-loss does not show this performance drop and stays close to the upper-bound of Integro.\nAdversarial Attacks The number of adversarial attack edges ranged from |EA| = 1 to |EA| = 45. Figure 6 shows\nthe recorded average AUROC-values. Again, SybilRank’s performance drops the fastest and steepest and Integro is insignificantly better in this adversarial scenario. Both variants of TSR performs better than the baselines. However, the WMW-loss variant performs only slightly better than SybilRank and Integro, while the hinge-loss variant keeps good performance even for a large number of attacking edges. As our future work, we will investigate which loss function should be chosen, depending on data and assumed attacker’s strategy. Overall, whereas SybilRank’s and Integro’s performance drops to an average AUROC-value below 0.5 at |EA| = 30, the hinge-loss variant of TSR still achieves an average value over 0.9 at the same amount of attacking edges."
  }, {
    "heading": "8. Conclusion & Outlook",
    "text": "In this paper, we studied the problem of Sybil detection. We first refined the security guarantees of random walk approaches towards more realistic assumptions. Then, we formalized and coined the adversarial setting and introduced optimal strategies for attackers. Further, we proposed a new method, transductive Sybil ranking (TSR), that leverages prior information, network topology as well as node and edge features. Unlike Integro, it is fused in a single optimization framework and can be solved efficiently by using gradient-based optimizer. In our empirical evaluation, we showed the advantages of our method and investigated the susceptibility of our method and baseline competitors to adversarial attacks. Further research will focus on the application of our method to real-world, large-scale OSNs."
  }, {
    "heading": "9. Acknowledgments",
    "text": "JH was supported by MathPlan GmbH and innoCampus, TU-Berlin. SN, AB and KRM were supported by the German Ministry for Education and Research as Berlin Big Data Center BBDC, funding mark 01IS14013A. KRM thanks for the Institute for Information & Communications Technology Promotion (IITP) grant funded by the Korea government (No.2017-0-00451). NG was supported by BMBF ALICE II grant 01IB15001B."
  }],
  "year": 2017,
  "references": [{
    "title": "Supervised random walks",
    "authors": ["Backstrom", "Lars", "Leskovec", "Jure"],
    "venue": "Proceedings of the fourth ACM international conference on Web search and data mining - WSDM",
    "year": 2011
  }, {
    "title": "Scale-free networks: A decade and beyond",
    "authors": ["Barabási", "Albert-Lzl"],
    "venue": "Science, 325(5939):412–413,",
    "year": 2009
  }, {
    "title": "All your contacts are belong to us: Automated identity theft attacks on social networks",
    "authors": ["Bilge", "Leyla", "Strufe", "Thorsten", "Balzarotti", "Davide", "Kirda", "Engin", "Antipolis", "Sophia"],
    "venue": "WWW",
    "year": 2009
  }, {
    "title": "Fast unfolding of communities in large networks",
    "authors": ["Blondel", "Vincent D", "Guillaume", "Jean-Loup", "Lambiotte", "Renaud", "Lefebvre", "Etienne"],
    "venue": "Journal of Statistical Mechanics: Theory and Experiment,",
    "year": 2008
  }, {
    "title": "The socialbot network: when bots socialize for fame and money",
    "authors": ["Boshmaf", "Yazan", "Muslukhov", "Ildar", "Beznosov", "Konstantin", "Ripeanu", "Matei"],
    "venue": "Acm, pp",
    "year": 2011
  }, {
    "title": "Aiding the detection of fake accounts in large scale social online services. NSDI’12",
    "authors": ["Cao", "Qiang", "Sirivianos", "Michael", "Yang", "Xiaowei", "Pregueiro", "Tiago"],
    "venue": "Proceedings of the 9th USENIX conference on Networked Systems Design and Implementation,",
    "year": 2012
  }, {
    "title": "sybilinfer: Detecting Sybil nodes using social networks",
    "authors": ["Danezis", "George"],
    "venue": "Network & Distributed System Security Symposium(NDSS),",
    "year": 2009
  }, {
    "title": "The Sybil attack",
    "authors": ["Douceur", "John R"],
    "venue": "Peer-to-peer Systems, pp",
    "year": 2002
  }, {
    "title": "Sybilbelief: A semi-supervised learning approach for structure-based sybil detection",
    "authors": ["Gong", "Neil Zhenqiang", "Frank", "Mario", "Mittal", "Prateek"],
    "venue": "IEEE Transactions on Information Forensics and Security,",
    "year": 2014
  }, {
    "title": "Growing scale-free networks with tunable clustering",
    "authors": ["Holme", "Petter", "Kim", "Beom Jun"],
    "venue": "Physical Review E Statistical, Nonlinear, and Soft Matter Physics,",
    "year": 2002
  }, {
    "title": "Learning to discover social circles in ego networks",
    "authors": ["Leskovec", "Jure", "Mcauley", "Julian J"],
    "venue": "In Advances in Neural Information Processing Systems",
    "year": 2012
  }, {
    "title": "Adversarial learning",
    "authors": ["Lowd", "Daniel", "Meek", "Christopher"],
    "venue": "Proceeding of the eleventh ACM SIGKDD international conference on Knowledge discovery in data mining,",
    "year": 2005
  }, {
    "title": "A critical point for random graphs with a given degree sequence",
    "authors": ["Molloy", "Michael", "Reed", "Bruce"],
    "venue": "Random Structures & Algorithms,",
    "year": 1995
  }, {
    "title": "Facebook immune system",
    "authors": ["Stein", "Tao", "Chen", "Erdong", "Mangla", "Karan"],
    "venue": "Proceedings of the 4th Workshop on Social Network Systems,",
    "year": 2011
  }, {
    "title": "Detecting spammers on social networks",
    "authors": ["Stringhini", "Gianluca", "Kruegel", "Christopher", "Vigna", "Giovanni"],
    "venue": "Proceedings of the 26th Annual Computer Security Applications Conference,",
    "year": 2010
  }, {
    "title": "Optimal Sybilresilient node admission control",
    "authors": ["Tran", "Nguyen", "Li", "Jinyang", "Subramanian", "Lakshminarayanan", "Chow", "Sherman S M"],
    "venue": "Proceedings - IEEE INFOCOM,",
    "year": 2011
  }, {
    "title": "Elementary applications of probability theory, second edition",
    "authors": ["Tuckwell", "Henry C"],
    "venue": "Chapman and Hall/CRC,",
    "year": 1995
  }, {
    "title": "An overview of statistical learning",
    "authors": ["Vapnik", "V N"],
    "year": 1999
  }, {
    "title": "When social bots attack: Modeling susceptibility of users in online social networks. Making Sense of Microposts",
    "authors": ["Wagner", "Claudia", "Mitter", "Silvia", "Körner", "Christian", "Strohmaier", "Markus"],
    "venue": "MSM2012), pp",
    "year": 2012
  }, {
    "title": "Optimizing classifier performance via an approximation to the Wilcoxon-Mann-Whitney statistic",
    "authors": ["Yan", "Lian", "Dodier", "Robert", "Mozer", "Michael C", "Wolniewicz", "Richard"],
    "venue": "ICML 03,",
    "year": 2003
  }, {
    "title": "A la cartelearning fast kernels",
    "authors": ["Z Yang", "AJ Smola", "L Song", "Wilson", "AG"],
    "venue": "arXiv preprint arXiv:1412.6493,",
    "year": 2014
  }, {
    "title": "SybilLimit: A near-optimal social network defense against Sybil attacks",
    "authors": ["Yu", "Haifeng", "Gibbons", "Phillip B", "Kaminsky", "Michael", "Xiao", "Feng"],
    "venue": "IEEE/ACM Transactions on Networking,",
    "year": 2010
  }],
  "id": "SP:45d731944e809b86e7e0b0f1092c38563a94a11b",
  "authors": [{
    "name": "Shinichi Nakajima",
    "affiliations": []
  }, {
    "name": "Alexander Bauer",
    "affiliations": []
  }],
  "abstractText": "Sybil detection is a crucial task to protect online social networks (OSNs) against intruders who try to manipulate automatic services provided by OSNs to their customers. In this paper, we first discuss the robustness of graph-based Sybil detectors SybilRank and Integro and refine theoretically their security guarantees towards more realistic assumptions. After that, we formally introduce adversarial settings for the graph-based Sybil detection problem and derive a corresponding optimal attacking strategy by exploitation of trust leaks. Based on our analysis, we propose transductive Sybil ranking (TSR), a robust extension to SybilRank and Integro that directly minimizes trust leaks. Our empirical evaluation shows significant advantages of TSR over stateof-the-art competitors on a variety of attacking scenarios on artificially generated data and realworld datasets.",
  "title": "Minimizing Trust Leaks for Robust Sybil Detection"
}