{
  "sections": [{
    "heading": "1 Introduction",
    "text": "We study the problem of composite non-convex minimization:\nmin x∈Rd\n{ F (x) := ψ(x) + f(x) := ψ(x) + 1\nn n∑ i=1 fi(x) }\n(1.1) where each fi(x) is nonconvex but smooth, and ψ(·) is proper convex, possibly nonsmooth, but relatively simple. We are interested in finding a point x that is an approximate local minimum of F (x).\n• The finite-sum structure f(x) = 1n ∑n i=1 fi(x) arises\nprominently in large-scale machine learning tasks. In particular, when minimizing loss over a training set, each example i corresponds to one loss function fi(·) in the summation. This finite-sum structure allows one to perform stochastic gradient descent with respect to a\nFuture version of this paper shall be found at http:// arxiv.org/abs/1702.00763. 1Microsoft Research. Correspondence to: Zeyuan Allen-Zhu <zeyuan@csail.mit.edu>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nrandom∇fi(x). • The so-called proximal term ψ(x) adds more general-\nity to the model. For instance, if ψ(x) is the indicator function of a convex set, then problem (1.1) becomes constraint minimization; if ψ(x) = ‖x‖1, then we can allow problem (1.1) to perform feature selection. In general, ψ(x) has to be a simple function where the projection operation arg minx{ψ(x) + 12η‖x − x0‖\n2} is efficiently computable. At a first reading of this paper, one can assume ψ(x) ≡ 0 for simplicity.\nMany non-convex machine learning problems fall into problem (1.1). Most notably, training deep neural networks and classifications with sigmoid loss correspond to (1.1) where neither fi(x) or f(x) is convex. However, our understanding to this challenging non-convex problem is very limited."
  }, {
    "heading": "1.1 Strongly Non-Convex Optimization",
    "text": "LetL be the smoothness parameter for each fi(x), meaning all the eigenvalues of∇2fi(x) lie in [−L,L].1\nWe denote by σ ∈ [0, L] the strong-nonconvexity parameter of f(x) = 1n ∑n i=1 fi(x), meaning that\nall the eigenvalues of∇2f(x) lie in [−σ, L].\nWe emphasize that parameter σ is analogous to the strongconvexity parameter µ for convex optimization, where all the eigenvalues of ∇2f(x) lie in [µ,L] for some µ > 0. We wish to find an ε-approximate stationary point (a.k.a. critical point) of F (x), that is\na point x satisfying ‖G(x)‖ ≤ ε\nwhere G(x) is the so-called gradient mapping of F (x) (see Section 2 for a formal definition). In the special case of ψ(·) ≡ 0, gradient mapping G(x) is the same as gradient ∇f(x), so x satisfies ‖∇f(x)‖ ≤ ε. Since f(·) is σ-strongly nonconvex, any ε-approximate stationary point is automatically also an (ε, σ)-approximate local minimum — meaning that the Hessian of the output point ∇2f(x) −σI is approximately positive semidefinite (PSD).\n1This definition also applies to functions f(x) that are not twice differentiable, see Section 2 for details."
  }, {
    "heading": "1.2 Motivations and Remarks",
    "text": "• We focus on strongly non-convex optimization because introducing this parameter σ allows us to perform a more refined study of non-convex optimization. If σ equals L then L-strongly nonconvex optimization is equivalent to the general non-convex optimization.\n• We focus only on finding stationary points as opposed to local minima, because in a recent study — see Appendix A— researchers have shown that finding (ε, δ)-approximate local minima reduces to finding εapproximate stationary points in an O(δ)-strongly nonconvex function.\n• Parameter σ is often not constant and can be much smaller than L. For instance, second-order methods often find (ε, √ ε)-approximate local minima (Nesterov,\n2008) and this corresponds to σ = √ ε."
  }, {
    "heading": "1.3 Known Results",
    "text": "Despite the widespread use of nonconvex models in machine learning and related fields, our understanding to nonconvex optimization is still very limited. Until recently, nearly all research papers have been mostly focusing on either σ = 0 or σ = L:\n• If σ = 0, the accelerated SVRG method (ShalevShwartz, 2016; Allen-Zhu & Yuan, 2016) finds x satisfying F (x) − F (x∗) ≤ ε, in gradient complexity Õ ( n + n3/4 √ L/ε ) .2 This result is irrelevant to this\npaper because f(x) is simply convex.\n• If σ = L, the SVRG method (Allen-Zhu & Hazan, 2016) finds an ε-approximate stationary point of F (x) in gradient complexity O(n+ n2/3L/ε2).\n• If σ = L, gradient descent finds an ε-approximate stationary point in gradient complexity O(nL/ε2).\n• If σ = L, stochastic gradient descent finds an ε-approx. stationary point in gradient complexity O(L2/ε4).\nThroughout this paper, we refer to gradient complexity as the total number of stochastic gradient computations ∇fi(x) and proximal computations y ← Proxψ,η(x) := arg miny{ψ(y) + 12η‖y − x‖ 2}.3 Very recently, it was observed by two independent groups (Agarwal et al., 2017; Carmon et al., 2016) — although implicitly, see Section 2.1— that for solving the σ-strongly nonconvex problem, one can repeatedly regularize F (x) to make it σ-strongly convex, and then apply the accelerated SVRG method to minimize this regularized\n2We use Õ to hide poly-logarithmic factors in n,L, 1/ε. 3Some authors also refer to them as incremental first-order oracle (IFO) and proximal oracle (PO) calls. In most machine learning applications, each IFO and PO call can be implemented to run in time O(d) where d is the dimension of the model, or even in time O(s) if s is the average sparsity of the data vectors.\nfunction. Under mild assumption σ ≥ ε2, this approach • finds an ε-approximate stationary point in gradient\ncomplexity Õ ( nσ+n3/4 √ Lσ\nε2\n) .\nWe call this method repeatSVRG in this paper. Unfortunately, repeatSVRG is even slower than the vanilla SVRG for σ = L by a factor n1/3, see Figure 1.\nRemark on SGD. Stochastic gradient descent (SGD) has a slower convergence rate (i.e., in terms of 1/ε4) than other cited first-order methods (i.e., in terms of 1/ε2), see for instance (Ghadimi & Lan, 2015). However, the complexity of SGD does not depend on n and thus is incomparable to gradient descent, SVRG, or repeatSVRG.4 This is one of the main motivations to study how to reduce the complexity of non-SGD methods, especially in terms of n."
  }, {
    "heading": "1.4 Our New Results",
    "text": "In this paper, we identify an interesting dichotomy with respect to the spectrum of the nonconvexity parameter σ ∈ [0, L]. In particular, we showed that if σ ≥ L/ √ n, then our new method Natasha finds an ε-approximate stationary point of F (x) in gradient complexity\nO ( n log 1\nε + n2/3(L2σ)1/3 ε2\n) .\nIn other words, together with repeatSVRG, we have improved the gradient complexity for σ-stringly nonconvex optimization to5\nÕ ( min {n3/4√Lσ\nε2 , n2/3(L2σ)1/3 ε2 }) and the first term in the min is smaller if σ < L/ √ n and the second term is smaller if σ > L/ √ n. We illustrate our\n4In practice, there are examples in non-convex empirical risk minimization (Allen-Zhu & Hazan, 2016) and in training neural networks (Allen-Zhu & Hazan, 2016; Reddi et al., 2016) where SVRG can outperform SGD. Of course, for deep learning tasks, SGD remains to be the best practical method of choice.\n5We remark here that this is under mild assumptions for ε being sufficiently small. For instance, the result of (Agarwal et al., 2017; Carmon et al., 2016) requires ε2 ≤ σ. In our result, the term n log 1\nε disappears when ε6 ≤ L2σ/n.\nperformance improvement in Figure 1. Our result matches that of SVRG for σ = L, and has a much simpler analysis.\nAdditional Results. One can take a step further and ask what if each function fi(x) is (`1, `2)-smooth for parameters `1, `2 ≥ σ, meaning that all the eigenvalues of∇2fi(x) lie in [−`2, `1]. We show that a variant of our method, which we call Natashafull, solves this more refined problem of (1.1) with total gradient complexity O ( n log 1ε + n2/3(`1`2σ) 1/3 ε2 ) as long as `1`2σ2 ≤ n 2. Remark 1.1. In applications, `1 and `2 can be of very different magnitudes. The most influential example is finding the leading eigenvector of a symmetric matrix. Using the so-called shift-and-invert reduction (Garber et al., 2016), computing the leading eigenvector reduces to the convex version of problem (1.1), where each fi(x) is (λ, 1)- smooth for λ 1. Other examples include all the applications that are built on shift-and-invert, including high rank SVD/PCA (Allen-Zhu & Li, 2016), canonical component analysis (Allen-Zhu & Li, 2017a), online matrix learning (Allen-Zhu & Li, 2017b), and approximate local minima algorithms (Agarwal et al., 2017; Carmon et al., 2016).\nMini-Batch. Our result generalizes trivially to the minibatch stochastic setting, where in each iteration one computes∇fi(x) for b random choices of index i ∈ [n] and average them. The stated gradient complexities of Natasha and Natashafull can be adjusted so that the factor n2/3 is replaced with n2/3b1/3."
  }, {
    "heading": "1.5 Our Techniques",
    "text": "Let us first recall the main idea behind stochastic variancereduced methods, such as SVRG (Johnson & Zhang, 2013).\nThe SVRG method divides iterations into epochs, each of length n. It maintains a snapshot point x̃ for each epoch, and computes the full gradient ∇f(x̃) only for snapshots. Then, in each iteration t at point xt, SVRG defines gradient estimator ∇̃ = ∇fi(xt)−∇fi(x̃)+∇f(x̃) which satisfies Ei[∇̃] = ∇f(xt), and performs proximal update xt+1 ← Proxψ,α ( xt − α∇̃ ) for some learning rate α. (Recall that if ψ(·) ≡ 0 then we would have xt+1 ← xt − α∇̃.) In nearly all the aforementioned results for nonconvex optimization, researchers have either directly applied SVRG (Allen-Zhu & Hazan, 2016) (for the case σ = L), or repeatedly applied SVRG (Agarwal et al., 2017; Carmon et al., 2016) (for general σ ∈ [0, L]). This puts some limitation in the algorithmic design, because SVRG requires each epoch to be of length exactly n.6\n6The epoch length of SVRG is always n (or a constant multiple of n in practice), because this ensures the computation of ∇̃ is of amortized gradient complexity O(1). The per-iteration complexity of SVRG is thus the same as the traditional stochastic\nOur New Idea. In this paper, we propose Natasha and Natashafull, two methods that are no longer black-box reductions to SVRG. Both of them still divide iterations into epochs of length n, and compute gradient estimators ∇̃ the same way as SVRG. However, we do not apply compute xt − α∇̃ directly. • In our base algorithm Natasha, we divide each epoch\ninto p sub-epochs, each with a starting vector x̂. Our theory suggests the choice p ≈ ( σ 2\nL2n) 1/3. Then, we\nreplace the use of ∇̃ with ∇̃ + 2σ(xt − x̂). This is equivalent to replacing f(x) with its regularized version f(x)+σ‖x− x̂‖2, where the center x̂ varies across subepochs. We provide pseudocode in Algorithm 1 and illustrate it in Figure 2.\nWe view this additional term 2σ(xt − x̂) as a type of retraction, which stabilizes the algorithm by moving the vector a bit in the backward direction towards x̂.\n• In our full algorithm Natashafull, we add one more ingredient on top of Natasha. That is, we perform updates zt+1 ← Proxψ,α(zt − α∇̃) with respect to a different sequence {zt}, and then define xt = 12zt + 1 2 x̂\nand compute gradient estimators ∇̃ at points xt. We provide pseudocode in Algorithm 2 in the appendix.\nWe view this averaging xt = 12zt + 1 2 x̂ as another type of retraction, which stabilizes the algorithm by moving towards x̂. The technique of computing gradients at points xt but moving a different sequence of points zt is related to the Katyusha momentum recently developed for convex optimization (Allen-Zhu, 2017)."
  }, {
    "heading": "1.6 Other Related Work",
    "text": "Methods based on variance-reduced stochastic gradients were first introduced for convex optimization. The first such method is SAG by Schmidt et al (Schmidt et al., 2013). The two most popular choices for gradient estimators are the SVRG-like one we adopted in this paper (independently introduced by (Johnson & Zhang, 2013; Zhang et al., 2013), and the SAGA-like one introduced by (Defazio et al., 2014). In nearly all applications, the results proven for SVRG-like estimators and SAGA-like estimators are simply exchangeable (therefore, the results of this paper naturally generalize to SAGA-like estimators).\nThe first “non-convex use” of variance reduction is by Shalev-Shwartz (Shalev-Shwartz, 2016) who assumes that each fi(x) is non-convex but their average f(x) is still convex. This result has been slightly improved to several more refined settings (Allen-Zhu & Yuan, 2016). The first truly non-convex use of variance reduction (i.e., for f(x) being also non-convex) is independently by (Allen-Zhu & Hazan, 2016) and (Reddi et al., 2016). First-order methods only\ngradient descent (SGD).\nfind stationary points (unless there is extra assumption on the randomness of the data), and converge no faster than 1/ε2.\nWhen the second-order Hessian information is used, one can (1) find local minima instead of stationary points, and (2) improve the 1/ε2 rate to 1/ε1.5. The first such result is by cubic-regularized Newton’s method (Nesterov, 2008); however, its per-iteration complexity is very high. Very recently, two independent groups of authors tackled this problem from a somewhat similar viewpoint (Carmon et al., 2016; Agarwal et al., 2017): if the computation of Hessian-vector multiplications (i.e., ( ∇2fi(x) ) v) is on the same order of the computation of gradients ∇fi(x),7 then one can obtain a (ε, √ ε)-approximate local minimum in\ngradient complexity Õ ( n ε1.5 + n3/4 ε1.75 ) , if we use big-O to also hide dependencies on the smoothness parameters.\nOther related papers include Ge et al. (Ge et al., 2015) where the authors showed that a noise-injected version of SGD converges to local minima instead of critical points, as long as the underlying function is “strict-saddle.” Their theoretical running time is a large polynomial in the dimension. Lee et al. (Lee et al., 2016) showed that gradient descent, starting from a random point, almost surely converges to a local minimum if the function is “strict-saddle”. The rate of convergence required is somewhat unknown."
  }, {
    "heading": "2 Preliminaries",
    "text": "Throughout this paper, we denote by ‖ · ‖ the Euclidean norm. We use i ∈R [n] to denote that i is generated from [n] = {1, 2, . . . , n} uniformly at random. We denote by ∇f(x) the full gradient of function f if it is differentiable, and ∂f(x) any subgradient if f is only Lipschitz continuous at point x. We let x∗ be any minimizer of F (x).\nRecall some definitions on strong convexity (SC), strongly nonconvexity, and smoothness.\nDefinition 2.1. For a function f : Rd → R, 7A lot of interesting problems satisfy this property, including training neural nets.\n• f is σ-strongly convex if ∀x, y ∈ Rd, it satisfies\nf(y) ≥ f(x) + 〈∂f(x), y − x〉+ σ 2 ‖x− y‖2 .\n• f is σ-strongly nonconvex if ∀x, y ∈ Rd, it satisfies\nf(y) ≥ f(x) + 〈∂f(x), y − x〉 − σ 2 ‖x− y‖2 .\n• f is (`1, `2)-smooth if ∀x, y ∈ Rd, it satisfies\nf(x) + 〈∇f(x), y − x〉+ `12 ‖x− y‖ 2 ≥ f(y)\n≥ f(x) + 〈∇f(x), y − x〉 − `2 2 ‖x− y‖2 .\n• f is L-smooth if it is (L,L)-smooth.\nThe (`1, `2)-smoothness parameters were introduced in (Allen-Zhu & Yuan, 2016) to tackle the convex setting of problem (1.1). The notion of strong nonconvexity is also known as “almost convexity (Carmon et al., 2016)” or “lower smoothness (Allen-Zhu & Yuan, 2016).” We refrain from using the name “almost convexity” because it coincides with several other non-equivalent definitions in optimization literatures.\nDefinition 2.2. Given a parameter η > 0, the gradient mapping of F (·) in (1.1) at point x is\nGη(x) := 1\nη\n( x− x′ ) where x′ = arg miny { ψ(y) + 〈∇f(x), y〉+ 12η‖y−x‖ 2 }\n."
  }, {
    "heading": "In particular, if ψ(·) ≡ 0, then Gη(x) ≡ ∇f(x).",
    "text": "The following theorem for the SVRG method can be found for instance in (Allen-Zhu & Yuan, 2016), which is built on top of the results (Shalev-Shwartz, 2016; Lin et al., 2015; Frostig et al., 2015):\nTheorem 2.3 (SVRG). Let G(y) := ψ(y) + 1n ∑n i=1 gi(y) be σ-strongly convex, then the SVRG method finds a point y satisfying G(y)−G(y∗) ≤ ε\n• with gradient complexity O ( (n + L 2\nσ2 ) log 1 ε\n) , if each\ngi(·) is L-smooth (for L ≥ σ); or\n• with gradient complexity O ( (n + `1`2σ2 ) log 1 ε ) , if each\ngi(·) is (`1, `2)-smooth (for `1, `2 ≥ σ)."
  }, {
    "heading": "If one performs acceleration, the running times become",
    "text": "Õ ( n+ n3/4 √ L/σ ) and Õ ( n+ n3/4(`1`2σ 2)1/4 ) ."
  }, {
    "heading": "2.1 RepeatSVRG",
    "text": "We recall the idea behind a simple algorithm —that we call repeatSVRG— which finds the ε-approximate stationary points for problem (1.1) when f(x) is σ-strongly nonconvex. The algorithm is divided into stages. In each stage t, consider a modified function Ft(x) := F (x)+σ‖x−xt‖2. It is easy to see that Ft(x) is σ-strongly convex, so one can apply the accelerated SVRG method to minimize Ft(x). Let xt+1 be any sufficiently accurate approximate minimizer of Ft(x).8\nNow, one can prove (c.f. Section 4) that xt+1 is an O(σ‖xt − xt+1‖)-approximate stationary point for F (x). Therefore, if σ‖xt − xt+1‖ ≤ ε we can stop the algorithm because we have already found an O(ε)-approximate stationary point. If σ‖xt − xt+1‖ > ε , then it must satisfy that F (xt) − F (xt+1) ≥ σ‖xt − xt+1‖2 ≥ Ω(ε2/σ), but this cannot happen for more than T = O ( σ ε2 (F (x0) − F ∗) stages. Therefore, the total gradient complexity is T multiplied with the complexity of accelerated SVRG in each stage (which is Õ(n + n3/4 √ L/σ) according to Theorem 2.3). Remark 2.4. The complexity of repeatSVRG can be inferred from (Agarwal et al., 2017; Carmon et al., 2016), but is not explicitly stated. For instance, the paper (Carmon et al., 2016) does not allow F (x) to have a non-smooth proximal term ψ(x), and applies accelerated gradient descent instead of accelerated SVRG."
  }, {
    "heading": "3 Our Algorithms",
    "text": "We introduce two variants of our algorithms: (1) the base method Natasha targets on the simple regime when f(x) and each fi(x) are both L-smooth, and (2) the full method Natashafull targets on the more refined regime when f(x) is L-smooth but each fi(x) is (`1, `2)-smooth.\nBoth methods follow the general idea of variance-reduced stochastic gradient descent: in each inner-most iteration, they compute a gradient estimator ∇̃ that is of the form ∇̃ = ∇f(x̃)−∇fi(x̃)+∇fi(x) and satisfies Ei∈R[n][∇̃] = ∇f(x). Here, x̃ is a snapshot point that is changed once every n iterations (i.e., for each different k = 1, 2, . . . , T ′ in the pseudocode), and we call it a full epoch for every distinct k. Notice that the amortized gradient complexity for computing ∇̃ is O(1) per-iteration.\nBase Method. In Natasha (see Algorithm 1), as illustrated by Figure 2, we divide each full epoch into p subepochs s = 0, 1, . . . , p − 1, each of length m = n/p. In\n8Since the accelerated SVRG method has a linear convergence rate for strongly convex functions, the complexity to find such xt+1 only depends logarithmically on this accuracy.\neach sub-epoch s, we start with a point x0 = x̂, and replace f(x) with its regularized version fs(x) := f(x) + σ‖x − x̂‖2. Then, in each iteration t of the sub-epoch s, we • compute gradient estimator ∇̃ with respect to fs(xt), • perform update xt+1 = arg miny { ψ(y) + 〈∇̃, y〉 +\n1 2α‖y − xt‖\n2 }\nwith learning rate α.\nEffectively, the introduction of the regularizer σ‖x − x̂‖2 makes sure that when performing update xt ← xt+1, we also move a bit towards point x̂ (i.e., retraction by regularization). Finally, when the sub-epoch is done, we define x̂ to be a random one from {x0, . . . , xm−1}.\nFull Method. In Natashafull (see full version), we also divide each full epoch into p sub-epochs. In each sub-epoch s, we start with a point x0 = z0 = x̂ and define fs(x) := f(x) + σ‖x − x̂‖2. However, this time in each iteration t, we\n• compute gradient estimator ∇̃ with respect to fs(xt), • perform update zt+1 = arg miny { ψ(y) + 〈∇̃, y〉 +\n1 2α‖y − zt‖\n2 }\nwith learning rate α, and\n• choose xt+1 = 12zt+1 + 1 2 x̂.\nEffectively, the regularizer σ‖x− x̂‖2 makes sure that when performing updates, we move a bit towards point x̂ (i.e., retraction by regularization); at the same time, the choice xt+1 = 1 2zt+1 + 1 2 x̂ also helps us move towards point x̂ (i.e., retraction by the so-called “Katyusha momentum”9). Finally, when the sub-epoch is over, we define x̂ to be a random one from the set {x0, . . . , xm−1}, and move to the next sub-epoch."
  }, {
    "heading": "4 A Sufficient Stopping Criterion",
    "text": "In this section, we present a sufficient condition for finding approximate stationary points in a σ-strongly nonconvex function. Lemma 4.1 below states that, if we regularize the original function and define G(x) := F (x) + σ‖x − x̂‖2 for an arbitrary point x̂, then the minimizer of G(x) is an approximate saddle-point for F (x).\nLemma 4.1. Suppose G(y) = F (y) +σ‖y− x̂‖2 for some given point x̂, and let x∗ be the minimizer of G(y). If we minimize G(y) and obtain a point x satisfying\nG(x)−G(x∗) ≤ δ2σ , then for every η ∈ ( 0, 1max{L,4σ} ] we have the gradient mapping\n‖Gη(x)‖2 ≤ 12σ2‖x∗ − x̂‖2 +O ( δ2 ) .\nNotice that when ψ(x) ≡ 0 this lemma is trivial, and can be found for instance in (Carmon et al., 2016). The main\n9The idea for this second kind of retraction, and the idea of having the updates on a sequence zt but computing gradients at points xt, is largely motivated by our recent work on the Katyusha momentum and the Katyusha acceleration (Allen-Zhu, 2017).\nAlgorithm 1 Natasha(x∅, p, T ′, α)\nInput: starting vector x∅, sub-epoch count p ∈ [n], epoch count T ′, learning rate α > 0. Output: vector xout.\n1: x̂← x∅; m← n/p; X ← []; 2: for k ← 1 to T ′ do T ′ full epochs 3: x̃← x̂; µ← ∇f(x̃); 4: for s← 0 to p− 1 do p sub-epochs in each epoch 5: x0 ← x̂; X ← [X, x̂]; 6: for t← 0 to m− 1 do m iterations in each sub-epoch 7: i← a random choice from {1, · · · , n}. 8: ∇̃ ← ∇fi(xt)−∇fi(x̃) + µ+ 2σ(xt − x̂) Ei[∇̃] = ∇ ( f(x) + σ‖x− x̂‖2 )∣∣ xt\n9: xt+1 = arg miny∈Rd { ψ(y) + 12α‖y − xt‖ 2 + 〈∇̃, y〉 }\n10: end for 11: x̂← a random choice from {x0, x1, . . . , xm−1}; for practitioners, choose the average 12: end for 13: end for 14: x̂← a random vector in X; for practitioners, choose the last 15: xout ← an approximate minimizer of G(y) := F (y) + σ‖y − x̂‖2 using SVRG. 16: return xout. it suffices to run SVRG for O(n log 1\nε ) iterations.\ntechnical difficulty arises in order to deal with ψ(x) 6= 0. The proof is included in the full version."
  }, {
    "heading": "5 Base Method: Analysis for One Full Epoch",
    "text": "In this section, we consider problem (1.1) where each fi(x) is L-smooth and F (x) is σ-strongly nonconvex. We use our base method Natasha to minimize F (x), and analyze its behavior for one full epoch in this section. We assume σ ≤ L without loss of generality, because any L-smooth function is also L-strongly nonconvex.\nNotations. We introduce the following notations for analysis purpose only.\n• Let x̂s be the vector x̂ at the beginning of sub-epoch s. • Let xst be the vector xt in sub-epoch s. • Let ist be the index i ∈ [n] in sub-epoch s at iteration t. • Let fs(x) := f(x) + σ‖x − x̂s‖2, F s(x) := F (x) + σ‖x− x̂s‖2, and xs∗ := arg minx{F s(x)}.\n• Let ∇̃fs(xst ) := ∇fi(xst )−∇fi(x̃)+∇f(x̃)+2σ(xt− x̂) where i = ist .\n• Let ∇̃f(xst ) := ∇fi(xst ) − ∇fi(x̃) + ∇f(x̃) where i = ist . We obviously have that fs(x) and F s(x) are σ-strongly convex, and fs(x) is (L+ 2σ)-smooth."
  }, {
    "heading": "5.1 Variance Upper Bound",
    "text": "The following lemma gives an upper bound on the variance of the gradient estimator ∇̃fs(xst ):\nLemma 5.1. We have Eist [ ‖∇̃fs(xst ) − ∇fs(xst )‖2 ] ≤\npL2‖xst − x̂s‖2 + pL2 ∑s−1 k=0 ‖x̂k − x̂k+1‖2 .\nProof. We have Eist [ ‖∇̃fs(xst )−∇fs(xst )‖2 ] = Eist [ ‖∇̃f(xst )−∇f(xst )‖2 ] = Ei∈R[n]\n[∥∥(∇fi(xst )−∇fi(x̃))− (∇f(xst )−∇f(x̃)))∥∥2] ¬\n≤ Ei∈R[n] [∥∥∇fi(xst )−∇fi(x̃)∥∥2]\n ≤ pEi∈R[n] [∥∥∇fi(xst )−∇fi(x̂s)∥∥2]\n+ p ∑s−1 k=0 Ei∈R[n] [∥∥∇fi(x̂k)−∇fi(x̂k+1)∥∥2] ®\n≤ pL2‖xst − x̂s‖2 + pL2 ∑s−1 k=0 ‖x̂ k − x̂k+1‖2 .\nAbove, inequality ¬ is because for any random vector ζ ∈ Rd, it holds that E‖ζ−Eζ‖2 = E‖ζ‖2−‖Eζ‖2; inequality  is because x̂0 = x̃ and for any p vectors a1, a2, . . . , ap ∈ Rd, it holds that ‖a1+· · ·+ap‖2 ≤ p‖a1‖2+· · ·+p‖ap‖2; and inequality ® is because each fi(·) is L-smooth."
  }, {
    "heading": "5.2 Analysis for One Sub-Epoch",
    "text": "The following inequality is classically known as the “regret inequality” for mirror descent (Allen-Zhu & Orecchia, 2017), and its proof is classical (see full version):\nFact 5.2. 〈∇̃fs(xst ), xst+1 − u〉 + ψ(xst+1) − ψ(u) ≤ ‖xst−u‖ 2\n2α − ‖xst+1−u‖ 2 2α − ‖xst+1−x s t‖ 2 2α for every u ∈ R d.\nThe following lemma is our main contribution for the base method Natasha.\nLemma 5.3. As long as α ≤ 12L+4σ , we have E [( F s(x̂s+1)− F s(xs∗) )] ≤ E [F s(x̂s)− F s(xs∗) σαm/2 +αpL2 ( s∑ k=0 ‖x̂k−x̂k+1‖2 )] .\nProof. We first compute that F s(xst+1)− F s(u) = fs(xst+1)− fs(u) + ψ(xst+1)− ψ(u)\n¬ ≤ fs(xst ) + 〈∇fs(xst ), xst+1 − xst 〉+ L+ 2σ\n2 ‖xst − xst+1‖2\n− fs(u) + ψ(xst+1)− ψ(u)  ≤ 〈∇fs(xst ), xst+1 − xst 〉+ L+ 2σ\n2 ‖xst − xst+1‖2\n+ 〈∇fs(xst ), xst − u〉+ ψ(xst+1)− ψ(u) . (5.1)\nAbove, inequality ¬ uses the fact that fs(·) is (L + 2σ)smooth; and inequality  uses the convexity of fs(·). Now, we take expectation with respect to ist on both sides of (5.1), and derive that:\nEist [ F s(xst+1) ] − F s(u)\n¬ ≤ Eist [ 〈∇̃fs(xst )−∇fs(xst ), xst − xst+1〉+ 〈∇̃fs(xst ), xst+1 − u〉\n+ L+ 2σ\n2 ‖xst − xst+1‖2 + ψ(xst+1)− ψ(u) ] \n≤ Eist [ 〈∇̃fs(xst )−∇fs(xst ), xst − xst+1〉+ ‖xst − u‖2\n2α\n− ‖x s t+1 − u‖2 2α − ( 1 2α − L+ 2σ 2 ) ‖xst+1 − xst‖2 ] ®\n≤ Eist [ α ∥∥∇̃fs(xst )−∇fs(xst )∥∥2 + ‖xst − u‖2 2α − ‖x s t+1 − u‖2 2α ] ¯\n≤ Eist [ αpL2‖xst − x̂s‖2 + αpL2 s−1∑ k=0 ‖x̂k − x̂k+1‖2\n+ ‖xst − u‖2 2α − ‖x s t+1 − u‖2 2α\n] . (5.2)\nAbove, inequality ¬ is follows from (5.1) together with the fact that Eist [∇̃f s(xst )] = ∇fs(xst ) implies\nEist [ 〈∇fs(xst ), xst+1 − xst 〉+ 〈∇fs(xst ), xst − u〉 ] = Eist [ 〈∇̃fs(xst )−∇fs(xst ), xst−xst+1〉+〈∇̃fs(xst ), xst+1−u〉 ] ;\ninequality  uses Fact 5.2; inequality ® uses α ≤ 12L+4σ together with Young’s inequality 〈a, b〉 ≤ 12‖a‖ 2 + 12‖b‖ 2; and inequality ¯ uses Lemma 5.1. Finally, choosing u = xs∗ to be the (unique) minimizer of F s(·) = fs(·) + ψ(·), and telescoping inequality (5.2) for t = 0, 1, . . . ,m− 1, we have\nE [m−1∑ t=1 ( F s(xst )− F s(xs∗) )] ≤ E [‖xs0 − xs∗‖2 2α + m−1∑ t=0 ( αpL2‖xst − x̂s‖2\n+ αpL2 s−1∑ k=0 ‖x̂k − x̂k+1‖2 )]\n≤ E [F s(x̂s)− F s(xs∗)\nσα + αpmL2 ( s∑ k=0 ‖x̂k − x̂k+1‖2 )] .\nAbove, the second inequality uses the fact that x̂s+1 is chosen from {xs0, . . . , xsm−1} uniformly at random, as well as the σ-strong convexity of F s(·).\nDividing both sides by m and rearranging the terms (using 1 2σα ≥ 1), we have\nE [( F s(x̂s+1)− F s(xs∗) )] ≤ E [F s(x̂s)− F s(xs∗) σαm/2 + αpL2 ( s∑ k=0 ‖x̂k − x̂k+1‖2 )] ."
  }, {
    "heading": "5.3 Analysis for One Full Epoch",
    "text": "One can telescope Lemma 5.3 for an entire epoch and arrive at the following lemma (see full version):\nLemma 5.4. If α ≤ 12L+4σ , α ≥ 4 σm and α ≤ σ p2L2 , we have p−1∑ s=0 E [( F s(x̂s)− F s(xs∗) )] ≤ 2E [ F (x̂0)− F (x̂p) ] ."
  }, {
    "heading": "6 Base Method: Final Theorem",
    "text": "We are now ready to state and prove our main convergence theorem for Natasha: Theorem 1. Suppose in (1.1), each fi(x) is L-smooth and F (x) is σ-strongly nonconvex for σ ≤ L. Then, if L2\nσ2 ≤ n, p = Θ ( ( σ 2 L2n) 1/3 )\nand α = Θ( σp2L2 ), our base method Natasha outputs a point xout satisfying\nE[‖Gη(xout)‖2] ≤ O ( (L2σ)1/3n2/3\nT ′n\n) · (F (x∅)− F ∗) .\nfor every η ∈ ( 0, 1max{L,4σ} ] . In other words, to obtain E[‖Gη(xout)‖2] ≤ ε2, we need gradient complexity\nO ( n log 1\nε +\n(L2σ)1/3n2/3\nε2 · (F (x∅)− F ∗)\n) .\nIn the above theorem, we have assumed σ ≤ L without loss of generality because any L-smooth function is also L-strongly nonconvex. Also, we have assumed L 2\nσ2 ≤ n and if this inequality does not hold, then one should apply repeatSVRG for a faster running time (see Figure 1). Proof of Theorem 1. We choose p = ( σ2 24L2n )1/3\n, m = n/p, and α = 4σm = σ 6p2L2 ≤ 1 2L+4σ , so we can apply Lemma 5.4. If we telescope Lemma 5.4 for the entire algorithm (which has T ′ full epochs), and use the fact that x̂p of the previous epoch equals x̂0 of the next epoch, we conclude that if we choose a random epoch and a random subepoch s, we will have\nE[F s(x̂s)− F s(xs∗)] ≤ 2 pT ′ (F (x∅)− F ∗) .\nBy the σ-strong convexity of F s(·), we have E[σ‖x̂s − xs∗‖2] ≤ 4pT ′ (F (x ∅)− F ∗).\nNow, F s(x) = F (x)+σ‖x− x̂s‖2 satisfies the assumption of G(x) in Lemma 4.1. If we use the SVRG method (see Theorem 2.3) to minimize the convex function F s(x), we\nget an output xout satisfying F s(xout) − F s(xs∗) ≤ ε2σ in gradient complexity O ( (n+ L 2\nσ2 ) log 1 ε ) ≤ O(n log 1ε ).\nWe can therefore apply Lemma 4.1 and conclude that this output xout satisfies\nE[‖Gη(xout)‖2] ≤ O ( σ pT ′ ) · (F (x∅)− F ∗)\n= O ( (L2σ)1/3n2/3\nT ′n\n) · (F (x∅)− F ∗) .\nIn other words, we obtain E[‖Gη(xout)‖2] ≤ ε2 using T ′n = O ( n+ (L 2σ)1/3n2/3\nε2 · (F (x ∅)− F ∗) ) computations of the stochastic gradients. Here, the additive term n is because T ′ ≥ 1. Finally, adding this withO(n log 1ε ), the gradient complexity for the application of SVRG in the last line of Natasha, we finish the proof of the total gradient complexity."
  }, {
    "heading": "7 Full Method: Final Theorem",
    "text": "We analyze and state the main theorems for our full method Natashafull in the full version of this paper."
  }, {
    "heading": "8 Conclusion",
    "text": "Stochastic gradient descent and gradient descent (including alternating minimization) have become the canonical methods for solving non-convex machine learning tasks. However, can we design new non-convex methods to run even faster than SGD or GD?\nThis present paper tries to tackle this general question, by providing a new Natashamethod which is intrinsically different from GD or SGD. It runs faster than GD and SVRGbased methods at least in theory. We hope that this could be a non-negligible step towards our better understanding of non-convex optimization.\nFinally, our results give rise to an interesting dichotomy in the best-known complexity of first-order non-convex optimization: the complexity scales with n3/4 for σ < L/ √ n and with n2/3 for σ > L/ √ n. It remains open to investigate whether this dichotomy is intrinsic, or we can design a more efficient algorithm that outperforms both."
  }],
  "year": 2017,
  "references": [{
    "title": "Finding Approximate Local Minima for Nonconvex Optimization in Linear Time",
    "authors": ["Agarwal", "Naman", "Allen-Zhu", "Zeyuan", "Bullins", "Brian", "Hazan", "Elad", "Ma", "Tengyu"],
    "year": 2017
  }, {
    "title": "Katyusha: The First Direct Acceleration of Stochastic Gradient Methods",
    "authors": ["Allen-Zhu", "Zeyuan"],
    "venue": "In STOC,",
    "year": 2017
  }, {
    "title": "Variance Reduction for Faster Non-Convex Optimization",
    "authors": ["Allen-Zhu", "Zeyuan", "Hazan", "Elad"],
    "venue": "In NIPS,",
    "year": 2016
  }, {
    "title": "LazySVD: Even Faster SVD Decomposition Yet Without Agonizing Pain",
    "authors": ["Allen-Zhu", "Zeyuan", "Li", "Yuanzhi"],
    "venue": "In NIPS,",
    "year": 2016
  }, {
    "title": "Doubly Accelerated Methods for Faster CCA and Generalized Eigendecomposition",
    "authors": ["Allen-Zhu", "Zeyuan", "Li", "Yuanzhi"],
    "venue": "In Proceedings of the 34th International Conference on Machine Learning,",
    "year": 2017
  }, {
    "title": "Follow the Compressed Leader: Faster Online Learning of Eigenvectors and Faster MMWU",
    "authors": ["Allen-Zhu", "Zeyuan", "Li", "Yuanzhi"],
    "venue": "In Proceedings of the 34th International Conference on Machine Learning,",
    "year": 2017
  }, {
    "title": "Linear Coupling: An Ultimate Unification of Gradient and Mirror Descent",
    "authors": ["Allen-Zhu", "Zeyuan", "Orecchia", "Lorenzo"],
    "venue": "In Proceedings of the 8th Innovations in Theoretical Computer Science,",
    "year": 2017
  }, {
    "title": "Improved SVRG for Non-Strongly-Convex or Sum-of-Non-Convex Objectives",
    "authors": ["Allen-Zhu", "Zeyuan", "Yuan", "Yang"],
    "venue": "In ICML,",
    "year": 2016
  }, {
    "title": "Accelerated Methods for Non-Convex Optimization",
    "authors": ["Carmon", "Yair", "Duchi", "John C", "Hinder", "Oliver", "Sidford", "Aaron"],
    "venue": "ArXiv e-prints,",
    "year": 2016
  }, {
    "title": "SAGA: A Fast Incremental Gradient Method With Support for Non-Strongly Convex Composite Objectives",
    "authors": ["Defazio", "Aaron", "Bach", "Francis", "Lacoste-Julien", "Simon"],
    "venue": "In NIPS,",
    "year": 2014
  }, {
    "title": "Un-regularizing: approximate proximal point and faster stochastic algorithms for empirical risk minimization",
    "authors": ["Frostig", "Roy", "Ge", "Rong", "Kakade", "Sham M", "Sidford", "Aaron"],
    "venue": "In ICML,",
    "year": 2015
  }, {
    "title": "Robust shift-and-invert preconditioning: Faster and more sample efficient algorithms for eigenvector computation",
    "authors": ["Garber", "Dan", "Hazan", "Elad", "Jin", "Chi", "Kakade", "Sham M", "Musco", "Cameron", "Netrapalli", "Praneeth", "Sidford", "Aaron"],
    "year": 2016
  }, {
    "title": "Escaping from saddle points—online stochastic gradient for tensor decomposition",
    "authors": ["Ge", "Rong", "Huang", "Furong", "Jin", "Chi", "Yuan", "Yang"],
    "venue": "In Proceedings of the 28th Annual Conference on Learning",
    "year": 2015
  }, {
    "title": "Accelerated gradient methods for nonconvex nonlinear and stochastic programming",
    "authors": ["Ghadimi", "Saeed", "Lan", "Guanghui"],
    "venue": "Mathematical Programming,",
    "year": 2015
  }, {
    "title": "Accelerating stochastic gradient descent using predictive variance reduction",
    "authors": ["Johnson", "Rie", "Zhang", "Tong"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Gradient descent only converges to minimizers",
    "authors": ["Lee", "Jason D", "Simchowitz", "Max", "Jordan", "Michael I", "Recht", "Benjamin"],
    "venue": "In Proceedings of the 29th Conference on Learning Theory, COLT 2016,",
    "year": 2016
  }, {
    "title": "A Universal Catalyst for First-Order Optimization",
    "authors": ["Lin", "Hongzhou", "Mairal", "Julien", "Harchaoui", "Zaid"],
    "venue": "In NIPS,",
    "year": 2015
  }, {
    "title": "Accelerating the cubic regularization of newton’s method on convex problems",
    "authors": ["Nesterov", "Yurii"],
    "venue": "Mathematical Programming,",
    "year": 2008
  }, {
    "title": "Stochastic variance reduction for nonconvex optimization",
    "authors": ["Reddi", "Sashank J", "Hefny", "Ahmed", "Sra", "Suvrit", "Poczos", "Barnabas", "Smola", "Alex"],
    "venue": "ArXiv e-prints,",
    "year": 2016
  }, {
    "title": "Minimizing finite sums with the stochastic average gradient",
    "authors": ["Schmidt", "Mark", "Le Roux", "Nicolas", "Bach", "Francis"],
    "venue": "arXiv preprint arXiv:1309.2388,",
    "year": 2013
  }, {
    "title": "SDCA without Duality, Regularization, and Individual Convexity",
    "authors": ["Shalev-Shwartz", "Shai"],
    "venue": "In ICML,",
    "year": 2016
  }, {
    "title": "Linear convergence with condition number independent access of full gradients",
    "authors": ["Zhang", "Lijun", "Mahdavi", "Mehrdad", "Jin", "Rong"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }],
  "id": "SP:298138e121aa60c15615b565ebf8a785591da3e0",
  "authors": [{
    "name": "Zeyuan Allen-Zhu",
    "affiliations": []
  }],
  "abstractText": "Given a non-convex function f(x) that is an average of n smooth functions, we design stochastic first-order methods to find its approximate stationary points. The performance of our new methods depend on the smallest (negative) eigenvalue −σ of the Hessian. This parameter σ captures how strongly non-convex f(x) is, and is analogous to the strong convexity parameter for convex optimization. At least in theory, our methods outperform known results for a range of parameter σ, and can also be used to find approximate local minima. Our result implies an interesting dichotomy: there exists a threshold σ0 so that the (currently) fastest methods for σ > σ0 and for σ < σ0 have different behaviors: the former scales with n and the latter scales with n.",
  "title": "Natasha: Faster Non-Convex Stochastic Optimization  via Strongly Non-Convex Parameter"
}