{
  "sections": [{
    "heading": "1. Introduction",
    "text": "The cardinality constraint is an intrinsic way to restrict the solution structure in many real problems, for example, sparse learning (Olshausen & Field, 1997), feature selection (Zhang, 2009), and compressed sensing (Candes et al., 2006). The generic cardinality constrained optimization can be expressed as\nmin w2Rp f(w) (1a) subject to kwgk0  sg 8g 2 G (1b) 1University of Rochester, Rochester, NY, USA 2NEC, Cupertino, CA, USA. Correspondence to: Haichuan Yang <h.yang@rochester.edu>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\nwhere w is the optimization variable, g is an index subset of [p] := {1, 2, · · · , p}, wg is the sub-vector of w indexed by g. kwgk0 denotes the cardinality of the sub-vector, i.e., the number of nonzeros in wg , G is the hyper set of all predefined groups, and s 2 R|G| is the upper bound vector - sg 2 R refers to the upper bound of the sparsity over group g. Objective f is the loss function which could be defined with different form according to the specific application. The problem (1) refers to a nonconvex optimization (NP-hard) due to the cardinality constraint. Some efficient iterative methods such as IHT (Yuan et al., 2014), CoSaMP (Needell & Tropp, 2009), GradMP (Nguyen et al., 2012), and their variants can guarantee to solve the original problem under some mild conditions. A key component in all of these methods is the projection operator\nP ⌦(G,s)(v) := argmin w2⌦(G,s) kw vk2 (2)\nwhere ⌦(G, s) denotes the feasible set to the constraint (1b). While in some special case, for example, G = {[p]}, the projection is trivial, it is quite challenging, especially when G includes multiple overlapped index sets (even NP-hard in some cases).\nIn this paper, we consider the scenario where the overlapped cardinality constraints (1b) satisfy a Three-view Cardinality Structure (TVCS):\nDefinition 1. (Three-view Cardinality Structure (TVCS)) For ⌦(G, s), the hyper set G consisting of subsets of [p] admits the TVCS structure if the following conditions are satisfied:\n• There exists a partition G 0 , G 1 and G 2 such that G = G 0 [ G 1 [ G 2 ;\n• G 0 = {[p]};\n• All element sets in G 1 have no overlap;\n• All element sets in G 2 have no overlap.\nThis definition basically requires that G can be partitioned into three hyper sets G\n0 , G 1 , and G 2 , and overlaps can only happen between element sets in different hyper sets. G\n0\nis\nusually used to restrict the overall sparsity. Figure 1 provides two examples of G for TVCS.\nThe TVCS model is motivated from some important applications, for example, in recommendation, task-worker assignment, and bioinformatics.\n• Online recommendation. Suppose we want to recommend a certain number of books (among p books) to a customer - corresponding to the G\n0 based sparsity constraint. Among the selected books, we want to maintain some diversities - the recommended books by the same author should not exceed a certain number (G\n1 based sparsity constraint) and about the same topic should not exceed a certain number either (G\n2\nbased sparsity constraint). One can refer to the top graph in Figure 1: G\n1 is grouped by authors and G 2 is grouped by topics.\n• Task-worker assignment. Suppose we have a bunch of tasks and workers, and we want to assign the tasks to workers. For example, in crowdsourcing, we usually assign several different workers to each task since we want to use the answers from multiple workers to improve the accuracy. On the other hand, each worker is usually assigned to multiple tasks so there is a “many to many” relationship in this assignment.\nThe goal is to pursue the optimal assignment under a certain criteria in crowdsourcing, while satisfying some restrictions. For example, the total assignments should be bounded by the total budget (corresponding to G\n0 ), the total cost of assignments to a single worker cannot exceed a certain threshold (corresponding to G 1\n), and the total cost of assignments on a single task cannot exceed a certain threshold (corresponding to G 2\n). Let X be the assignment matrix, and its rows are indexed by workers and the columns are indexed by tasks. These constraints can be illustrated by the bottom graph in Figure 1.\n• Identification of gene regulatory networks. The essential goal of identifying gene regulatory network is to identify a weighted directed graph, which can be represented by a square matrix W with p = N ⇥ N elements in total where N is the number of vertices. A sparse network constraint is to restrict the in-degree and out-degree for each vertex, which corresponds to the sparsity in each row and column of W .\nTo solve the TVCS constrained projection (2), we show an interesting connection between the projection and a linear programming (LP) that the vertex solution to this linear programming is an integer solution which solves the original problem.\nTo find an integer solution to such LP efficiently, we formulate it into a feasibility problem, and further an equivalent quadratic convex optimization. By using the rounding technique, we can avoid solving the exact solution of this LP problem. We propose an iterative algorithm to solve it and each iteration can be completed in linear time. We also show that the iterate linearly converges to the optimal point. Finally, the proposed TVCS model is validated by the synthetic experiment and two important and novel applications in identification of gene regulatory networks and task assignment problem of crowdsourcing."
  }, {
    "heading": "2. Related Works",
    "text": "Recent years have witnessed many research works in the field of structured sparsity and group-based sparsity. Yuan & Lin (2006) introduced the group LASSO, which pursues group-wise sparsity that restricts the number of groups for the selected variables. Jenatton et al. (2011) construct a hierarchical structure over the variables and use group LASSO with overlapped groups to solve it. Exclusive LASSO (Zhou et al., 2010; Kong et al., 2014) was proposed for the exclusive group sparsity which can be treated as relaxing our cardinality constraints to convex regularizations. In (Kong et al., 2014), the authors discussed the overlapping situation and tried to solve the problem using convex relaxation, which is different from our approach.\nBesides the aforementioned works, some proposed more general models to cover various sparsity structures. Bach et al. (2012) extended the usage of L\n1 -norm relaxation to several different categories of structures. And recently, another generalization work (El Halabi & Cevher, 2015) proposed convex envelopes for various sparsity structures. They built the framework by defining a totally unimodular penalty, and showed how to formulate different sparsity structures using the penalty. The work above concentrated on using convex relaxation to control the sparsity.\nBesides using convex relaxation, there are also some works focusing on projection-based methods. When the exact projection operator was provided, Baraniuk et al. (2010) extended the traditional IHT and CoSaMP methods to general sparsity structures. In this work, the authors also introduced the projection operator for block sparsity and tree sparsity. Cevher et al. (2009) investigated cluster sparsity and they applied dynamic programming to solve the projection operator for their sparsity model. Hegde et al. (2009) introduced a “spike trains” signal model, which is also related to exclusive group sparsity. Its groups always have consecutive coordinates, and each group cannot contain more than one nonzero element. To solve the projection problem of their model, they showed the basic feasible solutions of the relaxed linear programming (LP) are always integer points. In our work, we also use LP to solve the projection problem. But our model defines the group structure differently and aims at different applications.\nIn addition, there are some works for the cases without an efficient exact projection operator (Hegde et al., 2015a;b; Nguyen et al., 2014). This is meaningful since the projection operator for complex structured sparsity often involves solving complicated combinatorial optimization problems. Hegde et al. (2015a) discussed how to guarantee convergence if using approximate projection in IHT and CoSaMP for compressive sensing. They proved that the convergence needs a “head approximation” to project the update (gradient) before applying it. Hegde et al. (2015b) proposed a general framework to formulate a series of models as a weighted graph, and designed an efficient approximate projection operator for the models. Nguyen et al. (2014) applied the approximate projection-based IHT and CoSaMP to general convex functions and stochastic gradients."
  }, {
    "heading": "3. Preliminary: GradMP and IHT Frameworks",
    "text": "This section briefly reviews two commonly used algorithm frameworks to solve the cardinality constrained optimization (1): iterative hard thresholding (IHT) (Yuan et al., 2014; Nguyen et al., 2014) and gradient matching pursuit (GradMP) (Nguyen et al., 2012; 2014) (the general version of CoSaMP (Needell & Tropp, 2009)) for solving\ncardinality constrained problem. Other methods like hard thresholding pursuit (HTP) also follows similar steps and has been shown to be effective both empirically and theoretically (Yuan et al., 2016). The procedures of IHT and GradMP for our model are shown in Algorithms 1 and 2, where supp(·) is the support set of the argument vector.\nTherefore, one can see that the efficiency of both algorithms relies on the computation of the gradient and the projection. To avoid the expensive computation of the gradient, GradMP and IHT can be extended to the stochastic versions (Nguyen et al., 2014) by assigning g the stochastic gradient at the gradient computation step.\nBoth Algorithms 1 and 2 (and their stochastic variants) guarantee some nice properties: the iterate converges to a small ball surrounding the true solution at a linear rate under certain RIP-type conditions (Nguyen et al., 2014) and the radius of such ball converges to zero when the number of samples goes to infinity.\nAlgorithm 1: Iterative Hard Thresholding. Input: Sparsity parameter s. Result: Problem solution wt. Initialize w0, t = 0; while stop criterion is not met do\ng = rf(wt) ; // Gradient computation z t = w\nt g ; // Gradient descent w t+1 = P ⌦(G,s)(z t ) ; // Projection\nt = t+ 1; end\nAlgorithm 2: Gradient Matching Pursuit. Input: Sparsity parameter s. Result: Problem solution wt. Initialize w0, t = 0; while stop criterion is not met do\ng = rf(wt); // Gradient computation = supp(P\n⌦(G,2s)(g)); ˆ\n= [ supp(wt) ; // Subspace selection z\nt = argminsupp(z)=ˆ f(z) ; // Subspace\noptimization\nw t+1 = P ⌦(G,s)(z t ) ; // Projection\nt = t+ 1; end\nA common component in Algorithms 1 and 2 is the projection operator. If all the groups except [p] in G do not overlap each other, the projection problem can be easily solved by sequential projections (Yang et al., 2016). But for those cases involving overlapped groups, it is generally challenging to solve them efficiently."
  }, {
    "heading": "4. Projection Operator",
    "text": "This section introduces how to solve the essential projection step. Note that the projection onto a nonconvex set is NP-hard in general. By utilizing the special structure of TVCS, we show that the projection can be solved efficiently. Due to the page limitation, all proofs are provided in the supplementary material."
  }, {
    "heading": "4.1. LP Relaxation",
    "text": "Firstly, we can cast the projection problem (2) to an equivalent integer linear programming problem (ILP) according to Lemma 1. Lemma 1. The projection problem (2) is equivalent to the following integer linear programming problem (ILP):\nmax\nx\nhv2,xi (3)\nsubject to Ax  s x 2 {0, 1}p\nwhere v2 is applying element-wise square operation on vector v. A is a |G|⇥ p matrix which is defined as:\nA =\n 1 >\nC\n(4)\nwhere C 2 {0, 1}|G1[G2|⇥p, whose rows represent the indicator vector of each group g 2 G\n1 and G 2 .\nEach row in A corresponds to one group g from G. For example, Cij = 1 if the j-th coordinate is in the i-th group, otherwise Cij = 0. The first row 1> corresponds to the overall sparsity i.e. G\n0\n.\nIt is NP-hard to solve an ILP in general. One common way to handle such ILP is making a linear programming (LP) relaxation. In our case, we can use a box constraint x 2 [0, 1]p to replace the integer constraint x 2 {0, 1}p:\nmax\nx\nhv2,xi (5)\nsubject to Ax  s x 2 [0, 1]p\nHowever, there is no guarantee that a general ILP can be solved via its LP relaxation, because the solution of the relaxed LP is not always integer. Although one can make a rounding to the LP solution and acquire a integer solution, such solution is not guaranteed to be optimal (or even feasible) to the original ILP.\nFortunately, due to the special structure of our TVCS model, we find that its relaxed LP has some nice properties which make it possible to get the optimal solution of the ILP efficiently. The following theorem reveals the relationship between the ILP problem and the relaxed LP problem.\nTheorem 2. Given G satisfying TV CS, all the vertices of the feasible set to (5) are integer points. Furthermore, there is an optimal solution on the vertex that solves the ILP (3).\nThis theorem suggests that finding a vertex solution of the relaxed LP can solve the original projection problem onto a TVCS G. The proof basically shows that matrix A (for TVCS) is a totally unimodular matrix (Papadimitriou & Steiglitz, 1982). We provide the detailed proof in the supplementary material."
  }, {
    "heading": "4.2. Linearly Convergent Algorithm for Projection Operator onto TVCS",
    "text": "To find a solution on the vertex, one can use the Simplex method. Although Simplex method guarantees to find an optimal solution on the vertex and could be very efficient in practice, it does not have a deterministic complexity bound. In the IHT and GradMP algorithms, projection operator is only a sub-procedure in one iteration. Hence, we are usually supposed to solve lots of instances of problem (3). Simplex might be efficient practically, but its worst case may lead to exponential time complexity (Papadimitriou & Steiglitz, 1982). In this section, the integer solution to the linear programming can be found within the complexity proportional to the number of variables and constraints.\nEquivalent Feasibility Problem Formulation. The dual of LP problem (5) can be written as:\nmin\ny\nh[s> 1>]>,yi (6)\nsubject to ⇥ A> I ⇤ y v2,y 0\nSince the duality gap of LP is zero, combining the primal LP (5) and dual LP (6), we can formulate an equivalent problem, i.e. the feasibility problem over the following constraints:\nfind x,y\nsubject to h[s> 1>]>,yi = hv2,xi ⇥ A> I ⇤ y v2\n A I x   s 1\ny 0,x 0\nIterative Algorithm. The feasibility problem with linear constraints above is equivalent to the following optimiza-\ntion problem:\nmin\nx,y\n1\n2\n(h[s> 1>]>,yi hv2,xi)2\n+\n1\n2\nk[v2 [A> I]y] +\nk2 + 1 2 k[Ax s] + k2\n(7)\nsubject to 0  x  1,y 0\nwhere [z] + is the element-wise hinge operator, i.e. it transforms each element zi to max(zi, 0).\nThis is a convex optimization problem with a quadratic objective and box constraints. We adopt the projected gradient descent to solve this problem, and show it converges linearly.\nTheorem 3. For the optimization problem with the form\nmin\nz\nf(z) := k[Az a] + k2 + kBz bk2\nsubject to z 2 ⌦\nwhere ⌦ = {z | Cz  c}, the projected gradient descent algorithm zt+1 P\n⌦\n(z t rf(zt)) has a linear convergence rate with some ↵ < 1 (depending on A and B):\nkzt+1 P z ⇤ (z t+1 )k  ↵kzt P z ⇤ (z t )k,\nwhere P z ⇤ (·) is the projection onto the optimal solution set.\nNotice that the objective function f in Theorem 3 is not necessarily strongly convex, which means the well recognized linear convergence conclusion from the strong convexity is not applicable here.\nTheorem 3 mainly applies Hoffman’s Theorem (Hoffman, 2003) to show that f is an optimal strongly convex function (Liu & Wright, 2015). This leads to a linear convergence rate.\nThe convergence rate ↵ = 1/(1+ L ), where is the Hoffman constant (Hoffman, 2003) that depends on A,B and is always positive. L is the Lipschitz continuous gradient constant. More details are included in the supplementary materials.\nTo show the complexity of this algorithm, we firstly count how many iterations we need. Since we know that we can just make a rounding1 to the result xt when we attain kxt ˜ x\n⇤k1 < 0.5. Let z := [x> y>]> represent all the variables in (7). Because kzt z⇤k kzt z⇤k1 kxt x⇤k1, we can do the rounding safely when kzt z⇤k < 0.5, where z\n⇤,x⇤ are the optimal points of this problem. According to 1Acute readers may notice that the convergent point may be on the face of the polytope in some cases instead of vertex. However, we can add a small random perturbation to ensure the optimal point to be vertices with probability 1.\nTheorem 3, we have the linear convergence rate ↵ < 1, so the number of iterations we need is\nt > log↵ 1\n2kz0 z⇤k Therefore, we claim that we can obtain the solution x⇤ by rounding after log↵ 1 2kz0 z⇤k iterations.\nSecondly, we show that the computation complexity in each iteration is linear with dimensionality p and the amount of groups |G|. Since each column of A contains at most 3 nonzero elements, the complexity of the matrix multiplications in computing the gradient of (7) is O(p+ |G|). Together with other computation, the complexity for each iteration is O(p+ |G|)."
  }, {
    "heading": "5. Empirical Study",
    "text": "This section will validate the proposed method on both synthetic data and two practical applications: crowdsourcing and identification of gene regulatory networks."
  }, {
    "heading": "5.1. Linear Regression and Classification on Synthetic Data",
    "text": "In this section, we validate the proposed method with linear regression objective and squared hinge objective (classification) on synthetic data. Let w 2 R p p⇥pp be a matrix, G 1 and G 2\nare defined as groups with all rows and all columns respectively. The linear regression loss is defined as Pn i=1(hXi,wi yi)2 and the squared hinge loss is de-\nfined as Pn\ni=1 max(0, 1 yihXi,wi)2, where n is the total number of training samples. Xi and yi are the features and label of the i-th sample respectively."
  }, {
    "heading": "In the linear regression experiment, the true model ¯w 2",
    "text": "R p p⇥pp is generated from the following procedure: generate a random vector and apply the projection operator to get a support set which satisfy our sparsity constraints; the elements of positions in support set are drawn from standard normal distribution. p is fixed as 400 and n is gradually increased. The group sparsity upper bounds sg for g 2 G\n1 and g 2 G 2 are uniformly generated from the integers in the range[1,pp]. The overall sparsity upper bound is set by 0.8⇥min(\nP g2G1 s g, P g2G2 s g ). Each Xi’s is anp\np ⇥ pp i.i.d. Gaussian random matrix. yi is generated from yi = hXi, ¯wi + ei, where ei is the i.i.d. Gaussian random noise drawn from N (0, 0.012). We compare the proposed methods to bilevel exclusive sparsity with nonoverlapped groups (row-wise or column-wise) (Yang et al., 2016), overall sparsity (Needell & Tropp, 2009), and exclusive LASSO (Kong et al., 2014). For fairness we project the final result of all the compared methods to satisfy all constraints. All the experiments are repeated 30 times and we use the averaged result. We use selection recall and successful recovery rate to evaluate the performance. Selection\nrecall is defined as |supp(w⇤)\\supp( ¯w)|/k ¯wk0, where w⇤ is the optimization result. Successful recovery rate is the ratio of the successful feature selection i.e. supp(w⇤) = supp( ¯w) to the total number of repeated experiments. In Figure 2 we can observe that our model with all sparsity constraints always have the best performance. While the performance of exclusive LASSO and our method is comparable when the number of samples are very limited, our method outperforms exclusive LASSO when the number of samples increases.\nFor classification experiments, we use the same settings of sparsity with linear regression. Here we set p = 400, and change n from 200 to 800. The true model ¯w and feature matrices are generated by the same way as the linear regression experiment. The class label yi 2 { 1, 1} is got by yi = signhXi, ¯wi. Besides the selection recall, we also compare the classification error. In Figure 3, we can see that the superiority of our method is even more significant in the classification experiment. Although the overall sparsity has the lowest selection recall, it still has a similar classification error with the methods that consider row or column groups."
  }, {
    "heading": "5.2. Application in Crowdsourcing",
    "text": "This section applies the proposed method to the workertask assignment problem in crowdsourcing. Take the im-\nage labeling task as an example. Given n workers and m images, each image can be assigned to multiple workers and each worker can label multiple images. The predicted label for each image is decided by all the labels provided by the assigned workers and the quality of each worker on the image. The goal is to maximize the expected prediction accuracy based on the assignment. Let X 2 {0, 1}n⇥m be the assignment matrix, i.e. Xij = 1 if assign the i-th worker to j-th task, otherwise Xij = 0. Q 2 [0, 1]n⇥m is the corresponding quality matrix, which is usually estimated from the golden standard test (Ho et al., 2013). The whole formulation is defined to maximize the average of the expected prediction accuracy over m tasks over a TVCS constraint:\nmax\nX\n1\nm\nmX\nj=1\nEacc(Q·,j , X·,j) (8)\nsubject to nX\ni=1\nXij  sworker, 8j;\nmX\nj=1\nXij  stask, 8i;\nX\ni,j\nXij  stotal; X 2 {0, 1}n⇥m\nwhere Eacc(·, ·) is the expected prediction accuracy, sworker is the “worker sparsity”, i.e. the largest number of assigned workers for each task, and stask is the “task sparsity”, i.e. each worker can be assigned with at most stask tasks, and s\ntotal is the total sparsity to control the budget, i.e., the maximal number of assignment. In image labeling task, we assume that each image can only have two possible classes and the percentage of images in each class is one half. We use the Bayesian rule to infer the predicted labels given the workers’ answer. Here we consider the binary classification task. Let yj 2 {1, 0} be the true label of the j-th task and ˆyj be the prediction given labels by selected workers, i.e.,\nˆ yj = ( 0, if P(yj = 1| ˆY⌦j ,j) < P(yj = 0| ˆY⌦j ,j); 1, otherwise\nwhere ˆYij is the i-th worker’s predication on j-th task. Set ⌦j contains the indices of the selected workers for j-th task, i.e. Xij = 1, 8i 2 ⌦j , and Xi0j = 0, 8i0 /2 ⌦j"
  }, {
    "heading": "Then Eacc(Q·,j , X·,j) can be defined in the following:",
    "text": "Eacc(Q·,j , X·,j) = P(ˆyj = 1,yj = 1)+P(ˆyj = 0,yj = 0)\nBy this way, the expected accuracy will not be continuous, so we use smooth function to approximate the expected accuracy and adopt the stochastic gradient with the proposed\nprojection operator to optimize it. Due to the space limitation, the detailed derivation of the objective formulation can be found in the supplemental material.\nWe conduct experiment for crowdsourcing task assignment on synthetic data. Specifically, we generate the quality matrix Q from uniformly random distribution with interval [0.5, 0.9]. The prior probability P(yj = 1) and P(yj = 0) are set as 0.5 for all the tasks.\nTo avoid evaluating the expectation term, we apply the stochastic iterative hard thresholding framework (Nguyen et al., 2014). Each iteration we get ˆY |yj = 1 and ˆY |yj = 0 by sampling based on Q i.e. P( ˆYij = 1|yj = 1) = Qij , P( ˆYij = 0|yj = 0) = Qij . Then we can get a stochastic gradient based on the sampled ˆY .\nBesides the proposed formulation (8), we evaluate the random assignment algorithm and the Q-based linear programming (Ho et al., 2013). The random assignment algorithm widely used in practice is the most straightforward approach: given the total assignment budget stotal and the restrictions (sworker and stask) for workers and tasks, randomly assign tasks to the workers. The Q-based linear programming uses the linear combination of Qij over i to evaluate the overall accuracy on task j for simpler formulation. In addition, it does not consider the restriction on tasks, thus it may assign lots of workers to a difficult task2. To make a fair comparison, the task restriction is added into this method. To get the assignment result which satisfies the task and worker restriction, we use our projection operator in the other methods too.\nWe evaluate the experiments on different value of s\ntask, sworker by setting them as different ratios of the total number of tasks and workers. The overall sparsity is set by the same way as in Section 5.1. To measure the performance, we compare the sampled expected accuracy. The samples (i.e., ˆY ) are independent to the samples used in training. Figure 4 shows the comparison of the expected accuracy of the three approaches. We can observe that the accuracy increases with larger ratio (i.e. more assignments). The random assignment strategy needs more assignments to get the same accuracy compared with the other two methods."
  }, {
    "heading": "5.3. Application in Identification of Gene Regulatory Networks",
    "text": "In this section, we apply the projection operator to the identification of gene regulatory networks (GRN).\n2A “difficult” task means that all workers’ qualities are low on this task.\nBackground. Gene regulatory network represents the relations between different genes, which plays important roles in biological processes and activities by controlling the expression level of RNAs. There is a well-known biological competition named DREAM challenge about identifying GRN. Based on the time series gene expression data which are RNAs’ level along time sequence, contestants are required to recover the whole gene network of given size. One popular way to infer GRN is to utilize the sparse property of GRN: e.g., one gene in the network is only related to a small number of genes and we already know that there exists no relationship between some genes. Therefore, the amount of edges connecting to one vertex is far less than the dimension of the graph. It is a practical case of row-wise and column-wise sparsity for matrix. We could apply the projection operator to constrain the number of edges related to each vertex to identify the whole network. Recently, the dynamic Bayesian network (DBN) (Zou & Conzen, 2005) is supposed to be an effective model to recover GRNs. The RNAs’ level of all genes in GRN at time t is stored in gene expression vector xt 2 RN , where each entry corresponds to one gene respectively and N is the number of genes in GRN. Hence, We define the total amount of time points in the experiment as T . Gene activity model is usually assumed to be\nxt+1 = Pxt + et, t = 1 . . . T 1,\nwhere P 2 RN⇥N is the covariance matrix of GRN and et 2 RN is Gaussian white noise. Then the difference of RNA levels between time points t + 1 and t, i.e. yt+1,t 2 RN is defined as follows:\nyt+1,t := xt+1 xt = ¯Wxt + et, t = 1 . . . T 1,\nwhere ¯W = P I is the true sparse N -by-N matrix. Therefore, the GRN is only considered between different genes and we eliminate edges whose start and end vertex are the same. We define that Y := [y\n2,1, . . . ,yT,T 1] 2 RN⇥(T 1) and X := [x\n1 , . . . ,xT 1] 2 RN⇥(T 1). The objective function is\nf(W ) = 1\n2\nkY ¯WXk2F = 1\n2\nT 1X\nt=1\nk(xt+1 xt) ¯Wxtk2.\nTime-course Gene Expression Data. To evaluate our method, we employ GeneNetWeaver (Marbach et al., 2009; Schaffter et al., 2011), the official DREAM Challenge tool for time-series expression data generation. With typical gene network structure and ordinary differential equation (ODE) models, GeneNetWeaver will produce the timecourse gene expression data at pre-specified time points. In the simulation studies, we control the size of gene network to be N = 30 vertexes and the gene expression data are generated under 10% Gaussian white noise.\nThe network is shown in Figure 5. In this Figure, it is clear that one gene only has a few connections to other genes. Therefore, the GRN is sparse and we are able to restrict the in-degree and out-degree of every vertex by representing the network as a matrix and controlling the sparsity within each row and column.\nPerformance evaluation. Six commonly-used criteria are considered to measure the performance, i.e., sensitivity (SN), specificity (SP), accuracy (ACC), F-measure, Matthews correlation coefficient (MCC), and the Area Under ROC Curve (AUC):\nSN = TP\nTP + FN , SP = TN TN + FP ,\nACC = TP + TN\nTP + FP + TN + FN ,\nF-measure = 2⇥ SN ⇥ SP\nSN + SP ,\nMCC = TP ⇥ TN FP ⇥ FNp\n(TP + FP)(TP + FN)(TN + FP)(TN + FN) ,\nwhere TP and TN denote the true positive and true negative, and FP and FN denote the false positive and false negative, respectively. With these criteria, we compare the performance of our method with six representative algorithms, including PCC, ARACNE (Margolin et al., 2006), CLR (Faith et al., 2007), MINET (Meyer et al., 2008), GENIE3 (Huynh-Thu et al., 2010), TIGRESS (Haury et al., 2012). The results are summarized in Table 1. Our method outperforms other six state-of-art methods: the AUC of our method achieve 0.7 higher which is far more than other methods; 5 out of 6 different measure show that our method has significant advantage compared to other algorithms."
  }, {
    "heading": "6. Conclusion",
    "text": "This paper considers the TVCS constrained optimization, motivated by the intrinsic restrictions for many important applications, for example, in bioinformatics, recommendation system, and crowdsourcing. To solve the cardinality constrained problem, the key step is the projection onto the cardinality constraints. Although the projection onto the overlapped cardinality constraints is NP-hard in general, we prove that if the TVCS condition is satisfied the projection can be reduced to a linear programming. We further prove that there is an iterative algorithm which finds an integer solution to the linear programming within time complexity O((p+ |G|) log↵ 1R ), where R is the distance from the initial point to the optimization solution and ↵ < 1 is the convergence rate. We finally use synthetic experiments and two interesting applications in bioinformatics and crowdsourcing to validate the proposed TVCS model."
  }, {
    "heading": "Acknowledgements",
    "text": "This project is supported in part by the NSF grant CNS1548078 and the NEC fellowship."
  }, {
    "heading": "Baraniuk, Richard G, Cevher, Volkan, Duarte, Marco F,",
    "text": "and Hegde, Chinmay. Model-based compressive sensing. Information Theory, IEEE Transactions on, 56(4): 1982–2001, 2010.\nCandes, Emmanuel J, Romberg, Justin K, and Tao, Terence. Stable signal recovery from incomplete and inaccurate measurements. Communications on pure and applied mathematics, 59(8):1207–1223, 2006.\nCevher, Volkan, Indyk, Piotr, Hegde, Chinmay, and Baraniuk, Richard G. Recovery of clustered sparse signals from compressive measurements. Technical report, DTIC Document, 2009.\nEl Halabi, Marwa and Cevher, Volkan. A totally unimodular view of structured sparsity. In Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics, pp. 223–231, 2015."
  }, {
    "heading": "Faith, Jeremiah J, Hayete, Boris, Thaden, Joshua T,",
    "text": "Mogno, Ilaria, Wierzbowski, Jamey, Cottarel, Guillaume, Kasif, Simon, Collins, James J, and Gardner, Timothy S. Large-scale mapping and validation of escherichia coli transcriptional regulation from a compendium of expression profiles. PLoS biol, 5(1):e8, 2007."
  }, {
    "heading": "Haury, Anne-Claire, Mordelet, Fantine, Vera-Licona,",
    "text": "Paola, and Vert, Jean-Philippe. Tigress: trustful inference of gene regulation using stability selection. BMC systems biology, 6(1):145, 2012."
  }, {
    "heading": "Hegde, Chinmay, Duarte, Marco F, and Cevher, Volkan.",
    "text": "Compressive sensing recovery of spike trains using a structured sparsity model. In SPARS’09-Signal Processing with Adaptive Sparse Structured Representations, 2009.\nHegde, Chinmay, Indyk, Piotr, and Schmidt, Ludwig. Approximation algorithms for model-based compressive sensing. Information Theory, IEEE Transactions on, 61 (9):5129–5147, 2015a."
  }, {
    "heading": "Hegde, Chinmay, Indyk, Piotr, and Schmidt, Ludwig. A",
    "text": "nearly-linear time framework for graph-structured sparsity. In Proceedings of the 32nd International Conference on Machine Learning (ICML-15), pp. 928–937, 2015b.\nHo, Chien-Ju, Jabbari, Shahin, and Vaughan, Jennifer Wortman. Adaptive task assignment for crowdsourced classification. In Proceedings of The 30th International Conference on Machine Learning, pp. 534–542, 2013.\nHoffman, Alan J. On approximate solutions of systems of linear inequalities. In Selected Papers Of Alan J Hoffman: With Commentary, pp. 174–176. 2003.\nHuynh-Thu, Vn Anh, Irrthum, Alexandre, Wehenkel, Louis, and Geurts, Pierre. Inferring regulatory networks from expression data using tree-based methods. PloS one, 5(9):e12776, 2010."
  }, {
    "heading": "Jenatton, Rodolphe, Mairal, Julien, Obozinski, Guillaume,",
    "text": "and Bach, Francis. Proximal methods for hierarchical sparse coding. Journal of Machine Learning Research, 12(Jul):2297–2334, 2011."
  }, {
    "heading": "Kong, Deguang, Fujimaki, Ryohei, Liu, Ji, Nie, Feiping,",
    "text": "and Ding, Chris. Exclusive feature learning on arbitrary structures via l\n1,2-norm. In Advances in Neural Information Processing Systems, pp. 1655–1663, 2014."
  }, {
    "heading": "Liu, Ji and Wright, Stephen J. Asynchronous stochastic",
    "text": "coordinate descent: Parallelism and convergence properties. SIAM Journal on Optimization, 25(1):351–376, 2015."
  }, {
    "heading": "Marbach, Daniel, Schaffter, Thomas, Mattiussi, Claudio,",
    "text": "and Floreano, Dario. Generating realistic in silico gene networks for performance assessment of reverse engineering methods. Journal of computational biology, 16 (2):229–239, 2009."
  }, {
    "heading": "Margolin, Adam A, Nemenman, Ilya, Basso, Katia, Wiggins, Chris, Stolovitzky, Gustavo, Favera, Riccardo D,",
    "text": "and Califano, Andrea. Aracne: an algorithm for the reconstruction of gene regulatory networks in a mammalian cellular context. BMC bioinformatics, 7(Suppl 1):S7, 2006.\nMeyer, Patrick E, Lafitte, Frederic, and Bontempi, Gianluca. minet: Ar/bioconductor package for inferring large transcriptional networks using mutual information. BMC bioinformatics, 9(1):461, 2008.\nNeedell, Deanna and Tropp, Joel A. Cosamp: Iterative signal recovery from incomplete and inaccurate samples. Applied and Computational Harmonic Analysis, 26(3): 301–321, 2009."
  }, {
    "heading": "Nguyen, Nam, Chin, Sang, and Tran, Trac D. A unified",
    "text": "iterative greedy algorithm for sparsity constrained optimization. 2012.\nNguyen, Nam, Needell, Deanna, and Woolf, Tina. Linear convergence of stochastic iterative greedy algorithms with sparse constraints. arXiv preprint arXiv:1407.0088, 2014.\nOlshausen, Bruno A and Field, David J. Sparse coding with an overcomplete basis set: A strategy employed by v1? Vision research, 37(23):3311–3325, 1997.\nPapadimitriou, Christos H and Steiglitz, Kenneth. Combinatorial optimization: algorithms and complexity. Courier Corporation, 1982."
  }, {
    "heading": "Schaffter, Thomas, Marbach, Daniel, and Floreano, Dario.",
    "text": "Genenetweaver: in silico benchmark generation and performance profiling of network inference methods. Bioinformatics, 27(16):2263–2270, 2011."
  }, {
    "heading": "Yang, Haichuan, Huang, Yijun, Tran, Lam, Liu, Ji, and",
    "text": "Huang, Shuai. On benefits of selection diversity via bilevel exclusive sparsity. In Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. IEEE, 2016.\nYuan, Ming and Lin, Yi. Model selection and estimation in regression with grouped variables. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 68(1):49–67, 2006.\nYuan, Xiaotong, Li, Ping, and Zhang, Tong. Gradient hard thresholding pursuit for sparsity-constrained optimization. In Proceedings of The 31st International Conference on Machine Learning, pp. 127–135, 2014.\nYuan, Xiaotong, Li, Ping, and Zhang, Tong. Exact recovery of hard thresholding pursuit. In Advances in Neural Information Processing Systems, pp. 3558–3566, 2016.\nZhang, Tong. On the consistency of feature selection using greedy least squares regression. Journal of Machine Learning Research, 10(Mar):555–568, 2009."
  }, {
    "heading": "Zhou, Yang, Jin, Rong, and Hoi, Steven CH. Exclusive",
    "text": "lasso for multi-task feature selection. In AISTATS, volume 9, pp. 988–995, 2010."
  }, {
    "heading": "Zou, Min and Conzen, Suzanne D. A new dynamic",
    "text": "bayesian network (dbn) approach for identifying gene regulatory networks from time course microarray data. Bioinformatics, 21(1):71–79, 2005."
  }],
  "year": 2017,
  "references": [{
    "title": "Structured sparsity through convex optimization",
    "authors": ["Bach", "Francis", "Jenatton", "Rodolphe", "Mairal", "Julien", "Obozinski", "Guillaume"],
    "venue": "Statistical Science,",
    "year": 2012
  }, {
    "title": "Model-based compressive sensing",
    "authors": ["Baraniuk", "Richard G", "Cevher", "Volkan", "Duarte", "Marco F", "Hegde", "Chinmay"],
    "venue": "Information Theory, IEEE Transactions on,",
    "year": 1982
  }, {
    "title": "Stable signal recovery from incomplete and inaccurate measurements",
    "authors": ["Candes", "Emmanuel J", "Romberg", "Justin K", "Tao", "Terence"],
    "venue": "Communications on pure and applied mathematics,",
    "year": 2006
  }, {
    "title": "Recovery of clustered sparse signals from compressive measurements",
    "authors": ["Cevher", "Volkan", "Indyk", "Piotr", "Hegde", "Chinmay", "Baraniuk", "Richard G"],
    "venue": "Technical report, DTIC Document,",
    "year": 2009
  }, {
    "title": "A totally unimodular view of structured sparsity",
    "authors": ["El Halabi", "Marwa", "Cevher", "Volkan"],
    "venue": "In Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics,",
    "year": 2015
  }, {
    "title": "Tigress: trustful inference of gene regulation using stability selection",
    "authors": ["Haury", "Anne-Claire", "Mordelet", "Fantine", "Vera-Licona", "Paola", "Vert", "Jean-Philippe"],
    "venue": "BMC systems biology,",
    "year": 2012
  }, {
    "title": "Compressive sensing recovery of spike trains using a structured sparsity model",
    "authors": ["Hegde", "Chinmay", "Duarte", "Marco F", "Cevher", "Volkan"],
    "venue": "In SPARS’09-Signal Processing with Adaptive Sparse Structured Representations,",
    "year": 2009
  }, {
    "title": "Approximation algorithms for model-based compressive sensing",
    "authors": ["Hegde", "Chinmay", "Indyk", "Piotr", "Schmidt", "Ludwig"],
    "venue": "Information Theory, IEEE Transactions on,",
    "year": 2015
  }, {
    "title": "A nearly-linear time framework for graph-structured sparsity",
    "authors": ["Hegde", "Chinmay", "Indyk", "Piotr", "Schmidt", "Ludwig"],
    "venue": "In Proceedings of the 32nd International Conference on Machine Learning",
    "year": 2015
  }, {
    "title": "Adaptive task assignment for crowdsourced classification",
    "authors": ["Ho", "Chien-Ju", "Jabbari", "Shahin", "Vaughan", "Jennifer Wortman"],
    "venue": "In Proceedings of The 30th International Conference on Machine Learning,",
    "year": 2013
  }, {
    "title": "On approximate solutions of systems of linear inequalities",
    "authors": ["Hoffman", "Alan J"],
    "venue": "In Selected Papers Of Alan J Hoffman: With Commentary,",
    "year": 2003
  }, {
    "title": "Inferring regulatory networks from expression data using tree-based methods",
    "authors": ["Huynh-Thu", "Vn Anh", "Irrthum", "Alexandre", "Wehenkel", "Louis", "Geurts", "Pierre"],
    "venue": "PloS one,",
    "year": 2010
  }, {
    "title": "Proximal methods for hierarchical sparse coding",
    "authors": ["Jenatton", "Rodolphe", "Mairal", "Julien", "Obozinski", "Guillaume", "Bach", "Francis"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2011
  }, {
    "title": "Asynchronous stochastic coordinate descent: Parallelism and convergence properties",
    "authors": ["Liu", "Ji", "Wright", "Stephen J"],
    "venue": "SIAM Journal on Optimization,",
    "year": 2015
  }, {
    "title": "Generating realistic in silico gene networks for performance assessment of reverse engineering methods",
    "authors": ["Marbach", "Daniel", "Schaffter", "Thomas", "Mattiussi", "Claudio", "Floreano", "Dario"],
    "venue": "Journal of computational biology,",
    "year": 2009
  }, {
    "title": "minet: Ar/bioconductor package for inferring large transcriptional networks using mutual information",
    "authors": ["Meyer", "Patrick E", "Lafitte", "Frederic", "Bontempi", "Gianluca"],
    "venue": "BMC bioinformatics,",
    "year": 2008
  }, {
    "title": "Cosamp: Iterative signal recovery from incomplete and inaccurate samples",
    "authors": ["Needell", "Deanna", "Tropp", "Joel A"],
    "venue": "Applied and Computational Harmonic Analysis,",
    "year": 2009
  }, {
    "title": "A unified iterative greedy algorithm for sparsity constrained optimization",
    "authors": ["Nguyen", "Nam", "Chin", "Sang", "Tran", "Trac D"],
    "year": 2012
  }, {
    "title": "Linear convergence of stochastic iterative greedy algorithms with sparse constraints",
    "authors": ["Nguyen", "Nam", "Needell", "Deanna", "Woolf", "Tina"],
    "venue": "arXiv preprint arXiv:1407.0088,",
    "year": 2014
  }, {
    "title": "Sparse coding with an overcomplete basis set: A strategy employed by v1",
    "authors": ["Olshausen", "Bruno A", "Field", "David J"],
    "venue": "Vision research,",
    "year": 1997
  }, {
    "title": "Combinatorial optimization: algorithms and complexity",
    "authors": ["Papadimitriou", "Christos H", "Steiglitz", "Kenneth"],
    "venue": "Courier Corporation,",
    "year": 1982
  }, {
    "title": "Genenetweaver: in silico benchmark generation and performance profiling of network inference methods",
    "authors": ["Schaffter", "Thomas", "Marbach", "Daniel", "Floreano", "Dario"],
    "year": 2011
  }, {
    "title": "On benefits of selection diversity via bilevel exclusive sparsity",
    "authors": ["Yang", "Haichuan", "Huang", "Yijun", "Tran", "Lam", "Liu", "Ji", "Shuai"],
    "venue": "In Computer Vision and Pattern Recognition (CVPR),",
    "year": 2016
  }, {
    "title": "Model selection and estimation in regression with grouped variables",
    "authors": ["Yuan", "Ming", "Lin", "Yi"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2006
  }, {
    "title": "Gradient hard thresholding pursuit for sparsity-constrained optimization",
    "authors": ["Yuan", "Xiaotong", "Li", "Ping", "Zhang", "Tong"],
    "venue": "In Proceedings of The 31st International Conference on Machine Learning,",
    "year": 2014
  }, {
    "title": "Exact recovery of hard thresholding pursuit",
    "authors": ["Yuan", "Xiaotong", "Li", "Ping", "Zhang", "Tong"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2016
  }, {
    "title": "On the consistency of feature selection using greedy least squares regression",
    "authors": ["Zhang", "Tong"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2009
  }, {
    "title": "Exclusive lasso for multi-task feature selection",
    "authors": ["Zhou", "Yang", "Jin", "Rong", "Hoi", "Steven CH"],
    "venue": "In AISTATS,",
    "year": 2010
  }, {
    "title": "A new dynamic bayesian network (dbn) approach for identifying gene regulatory networks from time course microarray",
    "authors": ["Zou", "Min", "Conzen", "Suzanne D"],
    "venue": "data. Bioinformatics,",
    "year": 2005
  }],
  "id": "SP:26e21ea765d0a347c42d0dc5aafaa0a935fe1d4b",
  "authors": [{
    "name": "Haichuan Yang",
    "affiliations": []
  }, {
    "name": "Shupeng Gui",
    "affiliations": []
  }, {
    "name": "Chuyang Ke",
    "affiliations": []
  }, {
    "name": "Daniel Stefankovic",
    "affiliations": []
  }, {
    "name": "Ryohei Fujimaki",
    "affiliations": []
  }, {
    "name": "Ji Liu",
    "affiliations": []
  }],
  "abstractText": "The cardinality constraint is an intrinsic way to restrict the solution structure in many domains, for example, sparse learning, feature selection, and compressed sensing. To solve a cardinality constrained problem, the key challenge is to solve the projection onto the cardinality constraint set, which is NP-hard in general when there exist multiple overlapped cardinality constraints. In this paper, we consider the scenario where the overlapped cardinality constraints satisfy a Three-view Cardinality Structure (TVCS), which reflects the natural restriction in many applications, such as identification of gene regulatory networks and task-worker assignment problem. We cast the projection into a linear programming, and show that for TVCS, the vertex solution of this linear programming is the solution for the original projection problem. We further prove that such solution can be found with the complexity proportional to the number of variables and constraints. We finally use synthetic experiments and two interesting applications in bioinformatics and crowdsourcing to validate the proposed TVCS model and method.",
  "title": "On The Projection Operator to A Three-view Cardinality Constrained Set"
}