{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 778–788 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n778"
  }, {
    "heading": "1 Introduction",
    "text": "Cross-lingual word representations enable us to reason about word meaning in multilingual contexts and facilitate cross-lingual transfer (Ruder et al., 2018). Early cross-lingual word embedding models relied on large amounts of parallel data (Klementiev et al., 2012; Mikolov et al., 2013a), but more recent approaches have tried to minimize the amount of supervision necessary (Vulić and Korhonen, 2016; Levy et al., 2017; Artetxe et al., 2017). Some researchers have even presented unsupervised methods that do not rely on any form\nof cross-lingual supervision at all (Barone, 2016; Conneau et al., 2018; Zhang et al., 2017).\nUnsupervised cross-lingual word embeddings hold promise to induce bilingual lexicons and machine translation models in the absence of dictionaries and translations (Barone, 2016; Zhang et al., 2017; Lample et al., 2018a), and would therefore be a major step toward machine translation to, from, or even between low-resource languages.\nUnsupervised approaches to learning crosslingual word embeddings are based on the assumption that monolingual word embedding graphs are approximately isomorphic, that is, after removing a small set of vertices (words) (Mikolov et al., 2013b; Barone, 2016; Zhang et al., 2017; Conneau et al., 2018). In the words of Barone (2016):\n. . . we hypothesize that, if languages are used to convey thematically similar information in similar contexts, these random processes should be approximately isomorphic between languages, and that this isomorphism can be learned from the statistics of the realizations of these processes, the monolingual corpora, in principle without any form of explicit alignment.\nOur results indicate this assumption is not true in general, and that approaches based on this assumption have important limitations.\nContributions We focus on the recent stateof-the-art unsupervised model of Conneau et al. (2018).1 Our contributions are: (a) In §2, we show that the monolingual word embeddings used in Conneau et al. (2018) are not approximately isomorphic, using the VF2 algorithm (Cordella et al., 2001) and we therefore introduce a metric for quantifying the similarity of word embeddings, based on Laplacian eigenvalues. (b) In §3, we identify circumstances under which the unsupervised bilingual\n1Our motivation for this is that Artetxe et al. (2017) use small dictionary seeds for supervision, and Barone (2016) seems to obtain worse performance than Conneau et al. (2018). Our results should extend to Barone (2016) and Zhang et al. (2017), which rely on very similar methodology.\ndictionary induction (BDI) algorithm proposed in Conneau et al. (2018) does not lead to good performance. (c) We show that a simple trick, exploiting a weak supervision signal from words that are identical across languages, makes the algorithm much more robust. Our main finding is that the performance of unsupervised BDI depends heavily on all three factors: the language pair, the comparability of the monolingual corpora, and the parameters of the word embedding algorithms."
  }, {
    "heading": "2 How similar are embeddings across languages?",
    "text": "As mentioned, recent work focused on unsupervised BDI assumes that monolingual word embedding spaces (or at least the subgraphs formed by the most frequent words) are approximately isomorphic. In this section, we show, by investigating the nearest neighbor graphs of word embedding spaces, that word embeddings are far from isomorphic. We therefore introduce a method for computing the similarity of non-isomorphic graphs. In §4.7, we correlate our similarity metric with performance on unsupervised BDI.\nIsomorphism To motivate our study, we first establish that word embeddings are far from graph isomorphic2—even for two closely re-\n2Two graphs that contain the same number of graph vertices connected in the same way are said to be isomorphic. In the context of weighted graphs such as word embeddings, a\nlated languages, English and German, and using embeddings induced from comparable corpora (Wikipedia) with the same hyper-parameters.\nIf we take the top k most frequent words in English, and the top k most frequent words in German, and build nearest neighbor graphs for English and German using the monolingual word embeddings used in Conneau et al. (2018), the graphs are of course very different. This is, among other things, due to German case and the fact that the translates into der, die, and das, but unsupervised alignment does not have access to this kind of information. Even if we consider the top k most frequent English words and their translations into German, the nearest neighbor graphs are not isomorphic. Figure 1a-b shows the nearest neighbor graphs of the top 10 most frequent English words on Wikipedia, and their German translations.\nWord embeddings are particularly good at capturing relations between nouns, but even if we consider the top k most frequent English nouns and their translations, the graphs are not isomorphic; see Figure 1c-d. We take this as evidence that word embeddings are not approximately isomorphic across languages. We also ran graph isomorphism checks on 10 random samples of frequent English nouns and their translations into Spanish, and only in 1/10 of the samples were the corresponding nearest neighbor graphs isomorphic.\nEigenvector similarity Since the nearest neighbor graphs are not isomorphic, even for frequent translation pairs in neighboring languages, we want to quantify the potential for unsupervised BDI using a metric that captures varying degrees of graph similarity. Eigenvalues are compact representations of global properties of graphs, and we introduce a spectral metric based on Laplacian eigenvalues (Shigehalli and Shettar, 2011) that quantifies the extent to which the nearest neighbor graphs are isospectral. Note that (approximately) isospectral graphs need not be (approximately) isomorphic, but (approximately) isomorphic graphs are always (approximately) isospectral (Gordon et al., 1992). Let A1 and A2 be the adjacency matrices of the nearest neighbor graphs G1 and G2 of our two word embeddings, respectively. Let L1 = D1−A1 and L2 = D2−A2 be the Laplacians of the nearest neighbor graphs, where D1 and D2 are the corresponding diagonal matrices of degrees. We now\nweak version of this is to require that the underlying nearest neighbor graphs for the most frequent k words are isomorphic.\ncompute the eigensimilarity of the Laplacians of the nearest neighbor graphs, L1 and L2. For each graph, we find the smallest k such that the sum of the k largest Laplacian eigenvalues is <90% of the Laplacian eigenvalues. We take the smallest k of the two, and use the sum of the squared differences between the largest k Laplacian eigenvalues ∆ as our similarity metric.\n∆ = k∑ i=1 (λ1i − λ2i)2\nwhere k is chosen s.t.\nmin j { ∑k i=1 λji∑n i=1 λji > 0.9}\nNote that ∆ = 0 means the graphs are isospectral, and the metric goes to infinite. Thus, the higher ∆ is, the less similar the graphs (i.e., their Laplacian spectra). We discuss the correlation between unsupervised BDI performance and approximate isospectrality or eigenvector similarity in §4.7."
  }, {
    "heading": "3 Unsupervised cross-lingual learning",
    "text": ""
  }, {
    "heading": "3.1 Learning scenarios",
    "text": "Unsupervised neural machine translation relies on BDI using cross-lingual embeddings (Lample et al., 2018a; Artetxe et al., 2018), which in turn relies on the assumption that word embedding graphs are approximately isomorphic. The work of Conneau et al. (2018), which we focus on here, also makes several implicit assumptions that may or may not be necessary to achieve such isomorphism, and which may or may not scale to low-resource languages. The algorithms are not intended to be limited to learning scenarios where these assumptions hold, but since they do in the reported experiments, it is important to see to what extent these assumptions are necessary for the algorithms to produce useful embeddings or dictionaries.\nWe focus on the work of Conneau et al. (2018), who present a fully unsupervised approach to aligning monolingual word embeddings, induced using fastText (Bojanowski et al., 2017). We describe the learning algorithm in §3.2. Conneau et al. (2018) consider a specific set of learning scenarios:\n(a) The authors work with the following languages: English-{French, German, Chinese, Russian, Spanish}. These languages, except\nFrench, are dependent marking (Table 1).3 We evaluate Conneau et al. (2018) on (English to) Estonian (ET), Finnish (FI), Greek (EL), Hungarian (HU), Polish (PL), and Turkish (TR) in §4.2, to test whether the selection of languages in the original study introduces a bias.\n(b) The monolingual corpora in their experiments are comparable; Wikipedia corpora are used, except for an experiment in which they include Google Gigawords. We evaluate across different domains, i.e., on all combinations of Wikipedia, EuroParl, and the EMEA medical corpus, in §4.3. We believe such scenarios are more realistic for low-resource languages.\n(c) The monolingual embedding models are induced using the same algorithms with the same hyper-parameters. We evaluate Conneau et al. (2018) on pairs of embeddings induced with different hyper-parameters in §4.4. While keeping hyper-parameters fixed is always possible, it is of practical interest to know whether the unsupervised methods work on any set of pre-trained word embeddings.\nWe also investigate the sensitivity of unsupervised BDI to the dimensionality of the monolingual word embeddings in §4.5. The motivation for this is that dimensionality reduction will alter the geometric shape and remove characteristics of the embedding graphs that are important for alignment; but on the other hand, lower dimensionality introduces regularization, which will make the graphs more similar. Finally, in §4.6, we investigate the impact of different types of query test words on performance, including how performance varies across part-of-speech word classes and on shared vocabulary items."
  }, {
    "heading": "3.2 Summary of Conneau et al. (2018)",
    "text": "We now introduce the method of Conneau et al. (2018).4 The approach builds on existing work on learning a mapping between monolingual word embeddings (Mikolov et al., 2013b; Xing et al., 2015) and consists of the following steps: 1) Monolingual word embeddings: An off-the-shelf word embedding algorithm (Bojanowski et al., 2017) is used to learn source and target language spaces X\n3A dependent-marking language marks agreement and case more commonly on dependents than on heads.\n4https://github.com/facebookresearch/ MUSE\nand Y . 2) Adversarial mapping: A translation matrix W is learned between the spaces X and Y using adversarial techniques (Ganin et al., 2016). A discriminator is trained to discriminate samples from the translated source space WX from the target space Y , while W is trained to prevent this. This, again, is motivated by the assumption that source and target language word embeddings are approximately isomorphic. 3) Refinement (Procrustes analysis): W is used to build a small bilingual dictionary of frequent words, which is pruned such that only bidirectional translations are kept (Vulić and Korhonen, 2016). A new translation matrix W that translates between the spaces X and Y of these frequent word pairs is then induced by solving the Orthogonal Procrustes problem:\nW ∗ = argminW ‖WX − Y ‖F = UV >\ns.t. UΣV > = SVD(Y X>) (1)\nThis step can be used iteratively by using the new matrix W to create new seed translation pairs. It requires frequent words to serve as reliable anchors for learning a translation matrix. In the experiments in Conneau et al. (2018), as well as in ours, the iterative Procrustes refinement improves performance across the board. 4) Cross-domain similarity local scaling (CSLS) is used to expand high-density areas and condense low-density ones, for more accurate nearest neighbor calculation, CSLS reduces the hubness problem in high-dimensional spaces (Radovanović et al., 2010; Dinu et al., 2015). It relies on the mean similarity of a source language embedding x to itsK target language nearest neighbours (K = 10 suggested) nn1, . . . , nnK :\nmnnT (x) = 1\nK K∑ i=1 cos(x, nni) (2)\nwhere cos is the cosine similarity. mnnS(y) is defined in an analogous manner for any target language embedding y. CSLS(x, y) is then calculated as follows:\n2cos(x, y)−mnnT (x)−mnnS(y) (3)"
  }, {
    "heading": "3.3 A simple supervised method",
    "text": "Instead of learning cross-lingual embeddings completely without supervision, we can extract inexpensive supervision signals by harvesting identically spelled words as in, e.g. (Artetxe et al., 2017;\nSmith et al., 2017). Specifically, we use identically spelled words that occur in the vocabularies of both languages as bilingual seeds, without employing any additional transliteration or lemmatization/normalization methods. Using this seed dictionary, we then run the refinement step using Procrustes analysis of Conneau et al. (2018)."
  }, {
    "heading": "4 Experiments",
    "text": "In the following experiments, we investigate the robustness of unsupervised cross-lingual word embedding learning, varying the language pairs, monolingual corpora, hyper-parameters, etc., to obtain a better understanding of when and why unsupervised BDI works.\nTask: Bilingual dictionary induction After the shared cross-lingual space is induced, given a list of N source language words xu,1, . . . , xu,N , the task is to find a target language word t for each query word xu relying on the representations in the space. ti is the target language word closest to the source language word xu,i in the induced cross-lingual space, also known as the cross-lingual nearest neighbor. The set of learned N (xu,i, ti) pairs is then run against a gold standard dictionary.\nWe use bilingual dictionaries compiled by Conneau et al. (2018) as gold standard, and adopt their evaluation procedure: each test set in each language consists of 1500 gold translation pairs. We rely on CSLS for retrieving the nearest neighbors, as it consistently outperformed the cosine similarity in all our experiments. Following a standard evaluation practice (Vulić and Moens, 2013; Mikolov et al., 2013b; Conneau et al., 2018), we report Precision at 1 scores (P@1): how many times one of the correct translations of a source word w is retrieved as the nearest neighbor of w in the target language."
  }, {
    "heading": "4.1 Experimental setup",
    "text": "Our default experimental setup closely follows the setup of Conneau et al. (2018). For each language we induce monolingual word embeddings for all languages from their respective tokenized and lowercased Polyglot Wikipedias (Al-Rfou et al., 2013) using fastText (Bojanowski et al., 2017). Only words with more than 5 occurrences are retained for training. Our fastText setup relies on skip-gram with negative sampling (Mikolov et al., 2013a) with standard hyper-parameters: bag-of-words contexts with the window size 2, 15 negative samples, subsampling rate 10−4, and character n-gram length\n3-6. All embeddings are 300-dimensional. As we analyze the impact of various modeling assumptions in the following sections (e.g., domain differences, algorithm choices, hyper-parameters), we also train monolingual word embeddings using other corpora and different hyper-parameter choices. Quick summaries of each experimental setup are provided in the respective subsections."
  }, {
    "heading": "4.2 Impact of language similarity",
    "text": "Conneau et al. (2018) present results for several target languages: Spanish, French, German, Russian, Chinese, and Esperanto. All languages but Esperanto are isolating or exclusively concatenating languages from a morphological point of view. All languages but French are dependent-marking. Ta-\nble 1 lists three important morphological properties of the languages involved in their/our experiments.\nAgglutinative languages with mixed or double marking show more morphological variance with content words, and we speculate whether unsupervised BDI is challenged by this kind of morphological complexity. To evaluate this, we experiment with Estonian and Finnish, and we include Greek, Hungarian, Polish, and Turkish to see how their approach fares on combinations of these two morphological traits.\nWe show results in the left column of Table 2. The results are quite dramatic. The approach achieves impressive performance for Spanish, one of the languages Conneau et al. (2018) include in their paper. For the languages we add here, performance is less impressive. For the languages with dependent marking (Hungarian, Polish, and Turkish), P@1 scores are still reasonable, with Turkish being slightly lower (0.327) than the others. However, for Estonian and Finnish, the method fails completely. Only in less than 1/1000 cases does a nearest neighbor search in the induced embeddings return a correct translation of a query word.5\nThe sizes of Wikipedias naturally vary across languages: e.g., fastText trains on approximately 16M sentences and 363M word tokens for Spanish, while it trains on 1M sentences and 12M words for Finnish. However, the difference in performance cannot be explained by the difference in training data sizes. To verify that near-zero performance in Finnish is not a result of insufficient training data, we have conducted another experiment using the large Finnish WaC corpus (Ljubešić et al., 2016) containing 1.7B words in total (this is similar in size to the English Polyglot Wikipedia). However, even with this large Finnish corpus, the model does not induce anything useful: P@1 equals 0.0.\nWe note that while languages with mixed marking may be harder to align, it seems unsupervised BDI is possible between similar, mixed marking languages. So while unsupervised learning fails for English-Finnish and English-Estonian, performance is reasonable and stable for the more similar Estonian-Finnish pair (Table 2). In general, unsupervised BDI, using the approach in Conneau et al. (2018), seems challenged when pairing En-\n5We note, though, that varying our random seed, performance for Estonian, Finnish, and Greek is sometimes (approximately 1 out of 10 runs) on par with Turkish. Detecting main causes and remedies for the inherent instability of adversarial training is one the most important avenues for future research.\nglish with languages that are not isolating and do not have dependent marking.6\nThe promise of zero-supervision models is that we can learn cross-lingual embeddings even for low-resource languages. On the other hand, a similar distribution of embeddings requires languages to be similar. This raises the question whether we need fully unsupervised methods at all. In fact, our supervised method that relies on very naive supervision in the form of identically spelled words leads to competitive performance for similar language pairs and better results for dissimilar pairs. The fact that we can reach competitive and more robust performance with such a simple heuristic questions the true applicability of fully unsupervised approaches and suggests that it might often be better to rely on available weak supervision."
  }, {
    "heading": "4.3 Impact of domain differences",
    "text": "Monolingual word embeddings used in Conneau et al. (2018) are induced from Wikipedia, a nearparallel corpus. In order to assess the sensitivity of unsupervised BDI to the comparability and domain similarity of the monolingual corpora, we replicate the experiments in Conneau et al. (2018) using combinations of word embeddings extracted from three different domains: 1) parliamentary proceedings from EuroParl.v7 (Koehn, 2005), 2) Wikipedia (Al-Rfou et al., 2013), and 3) the EMEA corpus in the medical domain (Tiedemann, 2009). We report experiments with three language pairs: English{Spanish, Finnish, Hungarian}.\nTo control for the corpus size, we restrict each corpus in each language to 1.1M sentences in total (i.e., the number of sentences in the smallest, EMEA corpus). 300-dim fastText vectors are induced as in §4.1, retaining all words with more than 5 occurrences in the training data. For each pair of monolingual corpora, we compute their domain (dis)similarity by calculating the Jensen-Shannon divergence (El-Gamal, 1991), based on term distributions.7 The domain similarities are displayed in Figures 2a–c.8\nWe show the results of unsupervised BDI in Figures 2g–i. For Spanish, we see good performance in all three cases where the English and Spanish\n6One exception here is French, which they include in their paper, but French arguably has a relatively simple morphology.\n7In order to get comparable term distributions, we translate the source language to the target language using the bilingual dictionaries provided by Conneau et al. (2018).\n8We also computed A-distances (Blitzer et al., 2007) and confirmed that trends were similar.\ncorpora are from the same domain. When the two corpora are from different domains, performance is close to zero. For Finnish and Hungarian, performance is always poor, suggesting that more data is needed, even when domains are similar. This is in sharp contrast with the results of our minimally supervised approach (Figures 2d–f) based on identical words, which achieves decent performance in many set-ups.\nWe also observe a strong decrease in P@1 for English-Spanish (from 81.19% to 46.52%) when using the smaller Wikipedia corpora. This result indicates the importance of procuring large monolingual corpora from similar domains in order to enable unsupervised dictionary induction. However, resource-lean languages, for which the unsupervised method was designed in the first place, cannot be guaranteed to have as large monolingual training corpora as available for English, Spanish or other major resource-rich languages."
  }, {
    "heading": "4.4 Impact of hyper-parameters",
    "text": "Conneau et al. (2018) use the same hyperparameters for inducing embeddings for all languages. This is of course always practically possible, but we are interested in seeing whether their approach works on pre-trained embeddings induced with possibly very different hyper-parameters. We focus on two hyper-parameters: context windowsize (win) and the parameter controlling the number of n-gram features in the fastText model (chn), while at the same time varying the underlying algorithm: skip-gram vs. cbow. The results for EnglishSpanish are listed in Table 3.\nThe small variations in the hyper-parameters with the same underlying algorithm (i.e., using skipgram or cbow for both EN and ES) yield only slight drops in the final scores. Still, the best scores are obtained with the same configuration on both sides. Our main finding here is that unsupervised BDI fails (even) for EN-ES when the two monolingual embedding spaces are induced by two different algorithms (see the results of the entire Spanish cbow column).9 In sum, this means that the unsupervised approach is unlikely to work on pre-trained word embeddings unless they are induced on same-\n9We also checked if this result might be due to a lowerquality monolingual ES space. However, monolingual word similarity scores on available datasets in Spanish show performance comparable to that of Spanish skip-gram vectors: e.g., Spearman’s ρ correlation is ≈ 0.7 on the ES evaluation set from SemEval-2017 Task 2 (Camacho-Collados et al., 2017).\nor comparable-domain, reasonably-sized training data using the same underlying algorithm."
  }, {
    "heading": "4.5 Impact of dimensionality",
    "text": "We also perform an experiment on 40-dimensional monolingual word embeddings. This leads to reduced expressivity, and can potentially make the geometric shapes of embedding spaces harder to align; on the other hand, reduced dimensionality may also lead to less overfitting. We generally\nsee worse performance (P@1 is 50.33 for Spanish, 21.81 for Hungarian, 20.11 for Polish, and 22.03 for Turkish) – but, very interestingly, we obtain better performance for Estonian (13.53), Finnish (15.33), and Greek (24.17) than we did with 300 dimensions. We hypothesize this indicates monolingual word embedding algorithms over-fit to some of the rarer peculiarities of these languages."
  }, {
    "heading": "4.6 Impact of evaluation procedure",
    "text": "BDI models are evaluated on a held-out set of query words. Here, we analyze the performance of the unsupervised approach across different parts-ofspeech, frequency bins, and with respect to query words that have orthographically identical counterparts in the target language with the same or a different meaning.\nPart-of-speech We show the impact of the partof-speech of the query words in Table 4; again on a representative subset of our languages. The results indicate that performance on verbs is lowest across the board. This is consistent with research on distributional semantics and verb meaning (Schwartz et al., 2015; Gerz et al., 2016).\nFrequency We also investigate the impact of the frequency of query words. We calculate the word frequency of English words based on Google’s Trillion Word Corpus: query words are divided in groups based on their rank – i.e., the first group contains the top 100 most frequent words, the second one contains the 101th-1000th most frequent words, etc. – and plot performance (P@1) relative to rank in Figure 3. For EN-FI, P@1 was 0 across all frequency ranks. The plot shows sensitivity to frequency for HU, but less so for ES.\nHomographs Since we use identical word forms (homographs) for supervision, we investigated\nwhether these are representative or harder to align than other words. Table 5 lists performance for three sets of query words: (a) source words that have homographs (words that are spelled the same way) with the same meaning (homonyms) in the target language, e.g., many proper names; (b) source words that have homographs that are not homonyms in the target language, e.g., many short words; and (c) other words. Somewhat surprisingly, words which have translations that are homographs, are associated with lower precision than other words. This is probably due to loan words and proper names, but note that using homographs as supervision for alignment, we achieve high precision for this part of the vocabulary for free."
  }, {
    "heading": "4.7 Evaluating eigenvector similarity",
    "text": "Finally, in order to get a better understanding of the limitations of unsupervised BDI, we correlate the graph similarity metric described in §2 (right column of Table 2) with performance across languages (left column). Since we already established that the monolingual word embeddings are far from isomorphic—in contrast with the intuitions motivating previous work (Mikolov et al., 2013b; Barone, 2016; Zhang et al., 2017; Conneau et al., 2018)— we would like to establish another diagnostic metric that identifies embedding spaces for which the approach in Conneau et al. (2018) is likely to work. Differences in morphology, domain, or embedding parameters seem to be predictive of poor performance, but a metric that is independent of linguistic\ncategorizations and the characteristics of the monolingual corpora would be more widely applicable. We plot the values in Table 2 in Figure 4. Recall that our graph similarity metric returns a value in the half-open interval [0,∞). The correlation between BDI performance and graph similarity is strong (ρ ∼ 0.89)."
  }, {
    "heading": "5 Related work",
    "text": "Cross-lingual word embeddings Cross-lingual word embedding models typically, unlike Conneau et al. (2018), require aligned words, sentences, or documents (Levy et al., 2017). Most approaches based on word alignments learn an explicit mapping between the two embedding spaces (Mikolov et al., 2013b; Xing et al., 2015). Recent approaches try to minimize the amount of supervision needed (Vulić and Korhonen, 2016; Artetxe et al., 2017; Smith et al., 2017). See Upadhyay et al. (2016) and Ruder et al. (2018) for surveys.\nUnsupervised cross-lingual learning Haghighi et al. (2008) were first to explore unsupervised BDI, using features such as context counts and orthographic substrings, and canonical correlation analysis. Recent approaches use adversarial learning (Goodfellow et al., 2014) and employ a discriminator, trained to distinguish between the translated source and the target language space, and a generator learning a translation matrix (Barone, 2016). Zhang et al. (2017), in addition, use different forms of regularization for convergence, while Conneau et al. (2018) uses additional steps to refine the induced embedding space.\nUnsupervised machine translation Research on unsupervised machine translation (Lample et al., 2018a; Artetxe et al., 2018; Lample et al., 2018b) has generated a lot of interest recently with a\npromise to support the construction of MT systems for and between resource-poor languages. All unsupervised NMT methods critically rely on accurate unsupervised BDI and back-translation. Models are trained to reconstruct a corrupted version of the source sentence and to translate its translated version back to the source language. Since the crucial input to these systems are indeed cross-lingual word embedding spaces induced in an unsupervised fashion, in this paper we also implicitly investigate one core limitation of such unsupervised MT techniques."
  }, {
    "heading": "6 Conclusion",
    "text": "We investigated when unsupervised BDI (Conneau et al., 2018) is possible and found that differences in morphology, domains or word embedding algorithms may challenge this approach. Further, we found eigenvector similarity of sampled nearest neighbor subgraphs to be predictive of unsupervised BDI performance. We hope that this work will guide further developments in this new and exciting field."
  }, {
    "heading": "Acknowledgments",
    "text": "We thank the anonymous reviewers, as well as Hinrich Schütze and Yova Kementchedjhieva, for their valuable feedback. Anders is supported by the ERC Starting Grant LOWLANDS No. 313695 and a Google Focused Research Award. Sebastian is supported by Irish Research Council Grant Number EBPPG/2014/30 and Science Foundation Ireland Grant Number SFI/12/RC/2289. Ivan is supported by the ERC Consolidator Grant LEXICAL No. 648909."
  }],
  "year": 2018,
  "references": [{
    "title": "Polyglot: Distributed word representations for multilingual NLP",
    "authors": ["Rami Al-Rfou", "Bryan Perozzi", "Steven Skiena."],
    "venue": "Proceedings of CoNLL, pages 183–192.",
    "year": 2013
  }, {
    "title": "Learning bilingual word embeddings with (almost) no bilingual data",
    "authors": ["Mikel Artetxe", "Gorka Labaka", "Eneko Agirre."],
    "venue": "Proceedings of ACL, pages 451–462.",
    "year": 2017
  }, {
    "title": "Unsupervised neural machine translation",
    "authors": ["Mikel Artetxe", "Gorka Labaka", "Eneko Agirre", "Kyunghyun Cho."],
    "venue": "Proceedings of ICLR (Conference Track).",
    "year": 2018
  }, {
    "title": "Towards crosslingual distributed representations without parallel",
    "authors": ["Antonio Valerio Miceli Barone"],
    "year": 2016
  }, {
    "title": "Biographies, Bollywood, boom-boxes and blenders: Domain adaptation for sentiment classification",
    "authors": ["John Blitzer", "Mark Dredze", "Fernando Pereira."],
    "venue": "Proceedings of ACL, 1, pages 440–447.",
    "year": 2007
  }, {
    "title": "Enriching word vectors with subword information",
    "authors": ["Piotr Bojanowski", "Edouard Grave", "Armand Joulin", "Tomas Mikolov."],
    "venue": "Transactions of the Association for Computational Linguistics, 5:125–136.",
    "year": 2017
  }, {
    "title": "SemEval2017 Task 2: Multilingual and cross-lingual semantic word similarity",
    "authors": ["Jose Camacho-Collados", "Mohammad Taher Pilehvar", "Nigel Collier", "Roberto Navigli."],
    "venue": "Proceedings of SEMEVAL, pages 15–26.",
    "year": 2017
  }, {
    "title": "Word translation without parallel data",
    "authors": ["Alexis Conneau", "Guillaume Lample", "Marc’Aurelio Ranzato", "Ludovic Denoyer", "Hervé Jégou"],
    "venue": "Proceedings of ICLR",
    "year": 2018
  }, {
    "title": "An improved algorithm for matching large graphs",
    "authors": ["L.P. Cordella", "P. Foggia", "C. Sansone", "M. Vento."],
    "venue": "Proceedings of the 3rd IAPR TC-15 Workshop on Graphbased Representations in Pattern Recognition, 17:1–35.",
    "year": 2001
  }, {
    "title": "Improving zero-shot learning by mitigating the hubness problem",
    "authors": ["Georgiana Dinu", "Angeliki Lazaridou", "Marco Baroni."],
    "venue": "Proceedings of ICLR (Workshop Papers).",
    "year": 2015
  }, {
    "title": "The role of priors in active Bayesian learning in the sequential statistical decision framework",
    "authors": ["M. A El-Gamal."],
    "venue": "Maximum Entropy and Bayesian Methods, pages 33–38. Springer Netherlands.",
    "year": 1991
  }, {
    "title": "Domain-adversarial training of neural networks",
    "authors": ["Yaroslav Ganin", "Evgeniya Ustinova", "Hana Ajakan", "Pascal Germain", "Hugo Larochelle", "Francois Laviolette", "Mario Marchand", "Victor Lempitsky."],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }, {
    "title": "SimVerb-3500: A largescale evaluation set of verb similarity",
    "authors": ["Daniela Gerz", "Ivan Vulić", "Felix Hill", "Roi Reichart", "Anna Korhonen."],
    "venue": "Proceedings of EMNLP, pages 2173–2182.",
    "year": 2016
  }, {
    "title": "Generative adversarial nets",
    "authors": ["Ian Goodfellow", "Jean Pouget-Abadie", "Mehdi Mirza", "Bing Xu", "David Warde-Farley", "Sherjil Ozair", "Aaron Courville", "Yoshua Bengio."],
    "venue": "Proceedings of NIPS, pages 2672– 2680.",
    "year": 2014
  }, {
    "title": "One cannot hear the shape of a drum",
    "authors": ["Carolyn Gordon", "David L. Webb", "Scott Wolpert."],
    "venue": "Bulletin of the American Mathematical Society.",
    "year": 1992
  }, {
    "title": "Learning bilingual lexicons from monolingual corpora",
    "authors": ["Aria Haghighi", "Percy Liang", "Taylor Berg-Kirkpatrick", "Dan Klein."],
    "venue": "Proceedings of ACL, pages 771–779.",
    "year": 2008
  }, {
    "title": "Inducing crosslingual distributed representations of words",
    "authors": ["Alexandre Klementiev", "Ivan Titov", "Binod Bhattarai."],
    "venue": "Proceedings of COLING, pages 1459–1474.",
    "year": 2012
  }, {
    "title": "Europarl: A parallel corpus for statistical machine translation",
    "authors": ["Philipp Koehn."],
    "venue": "Proceedings of the 10th Machine Translation Summit (MT SUMMIT), pages 79–86.",
    "year": 2005
  }, {
    "title": "Unsupervised machine translation using monolingual corpora only",
    "authors": ["Guillaume Lample", "Ludovic Denoyer", "Marc’Aurelio Ranzato"],
    "venue": "In Proceedings of ICLR (Conference Papers)",
    "year": 2018
  }, {
    "title": "2018b. Phrase-based & neural unsupervised machine translation. CoRR, abs/1804.07755",
    "authors": ["Guillaume Lample", "Myle Ott", "Alexis Conneau", "Ludovic Denoyer", "Marc’Aurelio Ranzato"],
    "year": 2018
  }, {
    "title": "A strong baseline for learning cross-lingual word embeddings from sentence alignments",
    "authors": ["Omer Levy", "Anders Søgaard", "Yoav Goldberg."],
    "venue": "Proceedings of EACL, pages 765–774.",
    "year": 2017
  }, {
    "title": "Finnish Web corpus fiWaC 1.0. Slovenian language resource repository CLARIN.SI",
    "authors": ["Nikola Ljubešić", "Tommi Pirinen", "Antonio Toral"],
    "year": 2016
  }, {
    "title": "Distributed representations of words and phrases and their compositionality",
    "authors": ["Tomas Mikolov", "Kai Chen", "Greg Corrado", "Jeffrey Dean."],
    "venue": "Proceedings of NIPS, pages 3111–3119.",
    "year": 2013
  }, {
    "title": "Exploiting similarities among languages for machine translation",
    "authors": ["Tomas Mikolov", "Quoc V. Le", "Ilya Sutskever"],
    "year": 2013
  }, {
    "title": "Hubs in space: Popular nearest neighbors in high-dimensional data",
    "authors": ["Milos Radovanović", "Alexandros Nanopoulos", "Mirjana Ivanovic."],
    "venue": "Journal of Machine Learning Research, 11:2487–2531.",
    "year": 2010
  }, {
    "title": "A survey of cross-lingual word embedding models",
    "authors": ["Sebastian Ruder", "Ivan Vulić", "Anders Søgaard."],
    "venue": "Journal of Artificial Intelligence Research.",
    "year": 2018
  }, {
    "title": "Symmetric pattern based word embeddings for improved word similarity prediction",
    "authors": ["Roy Schwartz", "Roi Reichart", "Ari Rappoport."],
    "venue": "Proceedings of CoNLL, pages 258–267.",
    "year": 2015
  }, {
    "title": "Spectral technique using normalized adjacency matrices for graph matching",
    "authors": ["Vijayalaxmi Shigehalli", "Vidya Shettar."],
    "venue": "International Journal of Computational Science and Mathematics, 3:371–378.",
    "year": 2011
  }, {
    "title": "Offline bilingual word vectors, orthogonal transformations and the inverted softmax",
    "authors": ["Samuel L. Smith", "David H.P. Turban", "Steven Hamblin", "Nils Y. Hammerla."],
    "venue": "Proceedings of ICLR (Conference Papers).",
    "year": 2017
  }, {
    "title": "News from OPUS - A collection of multilingual parallel corpora with tools and interfaces",
    "authors": ["Jörg Tiedemann."],
    "venue": "Proceedings of RANLP, pages 237– 248.",
    "year": 2009
  }, {
    "title": "Cross-lingual models of word embeddings: An empirical comparison",
    "authors": ["Shyam Upadhyay", "Manaal Faruqui", "Chris Dyer", "Dan Roth."],
    "venue": "Proceedings of ACL, pages 1661–1670.",
    "year": 2016
  }, {
    "title": "On the role of seed lexicons in learning bilingual word embeddings",
    "authors": ["Ivan Vulić", "Anna Korhonen."],
    "venue": "Proceedings of ACL, pages 247–257.",
    "year": 2016
  }, {
    "title": "A study on bootstrapping bilingual vector spaces from nonparallel data (and nothing else)",
    "authors": ["Ivan Vulić", "Marie-Francine Moens."],
    "venue": "Proceedings of EMNLP, pages 1613–1624.",
    "year": 2013
  }, {
    "title": "Normalized word embedding and orthogonal transform for bilingual word translation",
    "authors": ["Chao Xing", "Chao Liu", "Dong Wang", "Yiye Lin."],
    "venue": "Proceedings of NAACL-HLT, pages 1005–1010.",
    "year": 2015
  }, {
    "title": "Adversarial training for unsupervised bilingual lexicon induction",
    "authors": ["Meng Zhang", "Yang Liu", "Huanbo Luan", "Maosong Sun."],
    "venue": "Proceedings of ACL, pages 1959–1970.",
    "year": 2017
  }],
  "id": "SP:f706d24c013e67862b783e67628e4efc8f2449cb",
  "authors": [{
    "name": "Anders Søgaard",
    "affiliations": []
  }, {
    "name": "Sebastian Ruder",
    "affiliations": []
  }, {
    "name": "Ivan Vulić",
    "affiliations": []
  }],
  "abstractText": "Unsupervised machine translation—i.e., not assuming any cross-lingual supervision signal, whether a dictionary, translations, or comparable corpora—seems impossible, but nevertheless, Lample et al. (2018a) recently proposed a fully unsupervised machine translation (MT) model. The model relies heavily on an adversarial, unsupervised alignment of word embedding spaces for bilingual dictionary induction (Conneau et al., 2018), which we examine here. Our results identify the limitations of current unsupervised MT: unsupervised bilingual dictionary induction performs much worse on morphologically rich languages that are not dependent marking, when monolingual corpora from different domains or different embedding algorithms are used. We show that a simple trick, exploiting a weak supervision signal from identical words, enables more robust induction, and establish a near-perfect correlation between unsupervised bilingual dictionary induction performance and a previously unexplored graph similarity metric.",
  "title": "On the Limitations of Unsupervised Bilingual Dictionary Induction"
}