{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Let the input space H be a separable Hilbert space with inner product denoted by 〈·, ·〉H , and the output space R. Let ρ be an unknown probability measure on H ×R. In this paper, we study the following expected risk minimization,\ninf ω∈H Ẽ(ω), Ẽ(ω) = ∫ H×R (〈ω, x〉H − y)2dρ(x, y), (1)\nwhere the measure ρ is known only through a sample z = {zi = (xi, yi)}ni=1 of size n ∈ N, independently and identically distributed (i.i.d.) according to ρ. The above regression setting covers nonparametric regression over a reproducing kernel Hilbert space (Cucker & Zhou, 2007; Steinwart & Christmann, 2008), and it is close\n1 Laboratory for Information and Inference Systems, École Polytechnique Fédérale de Lausanne, Lausanne, Switzerland. Correspondence to: Junhong Lin <junhong.lin@epfl.ch>, Volkan Cevher <volkan.cevher@epfl.ch>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nto functional regression (Ramsay, 2006) and linear inverse problems (Engl et al., 1996). A basic algorithm for the problem is ridge regression, and its generalization, spectralregularized algorithm. Such algorithms can be viewed as solving an empirical, linear equation with the empirical covariance operator replaced by a regularized one, see (Caponnetto & Yao, 2006; Bauer et al., 2007; Gerfo et al., 2008; Lin et al., 2018) and references therein. Here, the regularization is used to control the complexity of the solution to against over-fitting and to achieve best generalization ability. The function/estimator generated by classic regularized algorithm is in the subspace span{x} of H , where x = {x1, · · · , xn}. More often, the search of an estimator for some specific algorithms is restricted to a different (and possibly smaller) subspace S, which leads to regularized algorithms with projection. Such approaches have computational advantages in nonparametric regression with kernel methods (Williams & Seeger, 2000; Smola & Schölkopf, 2000). Typically, with a subsample/sketch dimension m < n, S = span{x̃j : 1 ≤ j ≤ m} where x̃j is chosen randomly from the input set x, or S = span{ ∑m j=1Gijxj : 1 ≤ i ≤ m} where G = [Gij ]1≤i≤m,1≤j≤n is a general randomized matrix whose rows are drawn according to a distribution. The resulted algorithms are called Nyström regularized algorithm and sketched-regularized algorithm, respectively. Our starting points of this paper are recent papers (Bach, 2013; Alaoui & Mahoney, 2015; Yang et al., 2015; Rudi et al., 2015; Myleiko et al., 2017) where convergence results on Nyström/sketched regularized algorithms for learning with kernel methods are given. Particularly, within the fixed design setting, i.e., the input set x are deterministic while the output set y = {y1, · · · , yn} treated randomly, convergence results have been derived, in (Bach, 2013; Alaoui & Mahoney, 2015) for Nyström ridge regression and in (Yang et al., 2015) for sketched ridge regression. Within the random design setting (which is more meaningful (Hsu et al., 2014) in statistical learning theory) and involving a regularity/smoothness condition on the target function (Smale & Zhou, 2007), optimal statistical results on generalization error bounds (excess risks) have been obtained in (Rudi et al., 2015) for Nyström ridge regression. The latter results were further generalized in (Myleiko et al., 2017) to a general\nNyström regularized algorithm. Although results have been developed for sketched ridge regression in the fixed design setting, it is still unclear if one can get statistical results for a general sketched-regularized algorithms in the random design setting. Besides, all the derived results, either for sketched or Nyström regularized algorithms, are only for the attainable case, i.e., the case that the expected risk minimization (1) has at least one solution in H . Moreover, they saturate (Bauer et al., 2007) at a critical value, meaning that they can not lead to better convergence rates even with a smoother target function. Motivated by these, in this paper, we study statistical results of projected-regularized algorithms for least-squares regression over a separable Hilbert space within the random design setting. We first extend the analysis in (Lin et al., 2018) for classicregularized algorithms to projected-regularized algorithms, and prove statistical results with respect to a broader class of norms. We then show that optimal rates can be retained for sketched-regularized algorithms, provided that the sketch dimension is proportional to the effective dimension (Zhang, 2005) up to a logarithmic factor. As a byproduct, we obtain similar results for Nyström regularized algorithms. Interestingly, our results are the first ones with optimal, distribution-dependent rates that do not have any saturation effect for sketched/Nyström regularized algorithms, considering both the attainable and non-attainable cases. In our proof, we naturally integrate proof techniques from (Smale & Zhou, 2007; Caponnetto & De Vito, 2007; Rudi et al., 2015; Myleiko et al., 2017; Lin et al., 2018). Our novelties lie in a new estimates on the projection error for sketched-regularized algorithms, a novel analysis to conquer the saturation effect, and a refined analysis for Nyström regularized algorithms, see Section 4 for details. The rest of the paper is organized as follows. Section 2 introduces some auxiliary notations and projected-regularized algorithms. Section 3 present assumptions and our main results, followed with simple discussions. Finally, Section 4 gives the proofs of our main results."
  }, {
    "heading": "2. Learning with Projected-regularized Algorithms",
    "text": "In this section, we introduce some notations as well as auxiliary operators, and present projected-regularized algorithms."
  }, {
    "heading": "2.1. Notations and Auxiliary Operators",
    "text": "Let Z = H ×R, ρX(·) the induced marginal measure on H of ρ, and ρ(·|x) the conditional probability measure on R with respect to x ∈ H and ρ. For simplicity, we assume that the support of ρX is compact and that there exists a constant κ ∈ [1,∞[, such that\n〈x, x′〉H ≤ κ2, ∀x, x′ ∈ H, ρX -almost every. (2)\nDefine the hypothesis space Hρ = {f : H → R|∃ω ∈ H with f(x) = 〈ω, x〉H , ρX -almost surely}. Denote L2ρX the Hilbert space of square integral functions from H to R with respect to ρX , with its norm given by ‖f‖ρ =(∫ H |f(x)|2dρX ) 1 2 . For a given bounded operator L : L2ρX → H, ‖L‖ denotes the operator norm of L, i.e., ‖L‖ = supf∈L2ρX ,‖f‖ρ=1\n‖Lf‖H . Let r ∈ N+, the set {1, · · · , r} is denoted by [r]. For any real number a, a+ = max(a, 0), a− = min(0, a). Let Sρ : H → L2ρX be the linear map ω → 〈ω, ·〉H , which is bounded by κ under Assumption (2). Furthermore, we consider the adjoint operator S∗ρ : L2ρX → H , the covariance operator T : H → H given by T = S∗ρSρ, and the integeral operator L : L2ρX → L 2 ρX given by SρS ∗ ρ . It\ncan be easily proved that S∗ρg = ∫ H xg(x)dρX(x), Lf =∫\nH f(x)〈x, ·〉HdρX(x) and T = ∫ H 〈·, x〉HxdρX(x). Under Assumption (2), the operators T and L can be proved to be positive trace class operators (and hence compact):\n‖L‖ = ‖T ‖ ≤ tr(T ) = ∫ H tr(x⊗ x)dρX(x)\n= ∫ H ‖x‖2HdρX(x) ≤ κ2. (3)\nFor any ω ∈ H , it is easy to prove the following isometry property (Bauer et al., 2007),\n‖Sρω‖ρ = ‖ √ T ω‖H . (4)\nMoreover, according to the singular value decomposition of a compact operator, one can prove that\n‖L− 12Sρω‖ρ ≤ ‖ω‖H . (5)\nWe define the sampling operator Sx : H → Rn by (Sxω)i = 〈ω, xi〉H , i ∈ [n], where the norm ‖ · ‖Rn in Rn is the Euclidean norm times 1/ √ n. Its adjoint operator S∗x : Rn → H, defined by 〈S∗xy, ω〉H = 〈y,Sxω〉Rn for y ∈ Rn is thus given by S∗xy = 1n ∑n i=1 yixi. Moreover, we can define the empirical covariance operator Tx : H → H such that Tx = S∗xSx. Obviously, Tx = 1n ∑n i=1〈·, xi〉Hxi. By Assumption (2), similar to (3), we have\n‖Tx‖ ≤ tr(Tx) ≤ κ2. (6)\nIt is easy to see that Problem (1) is equivalent to\ninf f∈Hρ E(f), E(f) = ∫ H×R (f(x)− y)2dρ(x, y), (7)\nThe function that minimizes the expected risk over all measurable functions is the regression function (Cucker & Zhou, 2007; Steinwart & Christmann, 2008), defined as,\nfρ(x) = ∫ R ydρ(y|x), x ∈ H, ρX -almost every. (8)\nA simple calculation shows that the following well-known fact holds (Cucker & Zhou, 2007; Steinwart & Christmann, 2008), for all f ∈ L2ρX , E(f)− E(fρ) = ‖f − fρ‖ 2 ρ. Then it is easy to see that (7) is equivalent to inff∈Hρ ‖f − fρ‖2ρ. Under Assumption (2), Hρ is a subspace of L2ρX . Using the projection theorem, one can prove that a solution fH for the problem (7) is the projection of the regression function fρ onto the closure of Hρ in L2ρX , and moreover, for all f ∈ Hρ (Lin & Rosasco, 2017),\nS∗ρfρ = S∗ρfH , (9)\nand E(f)− E(fH) = ‖f − fH‖2ρ. (10)\nNote that fH does not necessarily be in Hρ, as indicated by a simple example constructed in the appendix. Throughput this paper, S is a closed, finite-dimensional subspace of H , and P is the projection operator onto S."
  }, {
    "heading": "2.2. Projected-regularized Algorithms",
    "text": "In this subsection, we demonstrate and introduce projectedregularized algorithms. The expected risk Ẽ(ω) in (1) can not be computed exactly. It can be only approximated through the empirical risk Ẽz(ω), Ẽz(ω) = 1n ∑n i=1(〈ω, xi〉H − yi)2. A first idea to deal with the problem is to replace the objective function in (1) with the empirical risk. Moreover, we restrict the solution to the subspace S. This leads to the projected empirical risk minimization, infω∈S Ẽz(ω). Using P 2 = P, a simple calculation shows that a solution for the above is given by ω̂ = Pα̂, with α̂ satisfying PTxPα̂ = PS∗xy. Motivated by the classic (iterated) ridge regression, we replace PTxP with a regularized one, and thus leads to the following projected (iterated) ridge regression.\nAlgorithm 1. The projected (iterated) ridge regression algorithm of order τ over the samples z and the subspace S is given by fzλ = Sρωzλ, where 1\nωzλ = PGλ(PTxP )PS∗xy, Gλ(u) = τ∑ i=1 λi−1(λ+ u)−i.\n(11)\nRemark 1. 1) In this paper, we focus on projected ridge regression, but all the derived results hold for a general projected-regularized algorithm, in which Gλ is a general filter function. Given Λ ⊂ R+, a class of functions {Gλ : [0, κ2] → [0,∞[, λ ∈ Λ} are called filter functions with qualification τ (τ ≥ 1) if there exist some positive constants\n1Let L be a self-adjoint, compact operator over a separable Hilbert space H . Gλ(L) is an operator on L defined by spectral calculus: suppose that {(σi, ψi)}i is a set of normalized eigenpairs of L with the eigenfunctions {ψi}i forming an orthonormal basis of H , then Gλ(L) = ∑ i Gλ(σi)ψi ⊗ ψi.\nE,F <∞ such that\nsup λ∈Λ sup u∈]0,κ2]\n|Gλ(u)(u+ λ)| ≤ E. (12)\nand\nsup α∈[0,τ ] sup λ∈Λ sup u∈]0,κ2]\n|1− Gλ(u)u|(u+ λ)αλ−α ≤ F. (13)\n2) A simple calculation shows that\nGλ(u) = 1− qτ\nu =\n∑τ−1 i=0 q i\nu+ λ , q =\nλ\nλ+ u . (14)\nThus, Gλ(u) is a filter function with qualification τ , E = τ and F = 1. When τ = 1, it is a filter function for classic ridge regression and the algorithm is projected ridge regression. 3) Another typical filter function studied in the literature is Gλ(u) = u−11{u≥λ}, which corresponds to principal component (spectral cut-off) regularization. Here, 1{·} denotes the indication function. In this case, E = 2, F = 2τ and τ could be any positive number.\nIn the above, λ is a regularization parameter which needs to be well chosen in order to achieve best performance. Throughout this paper, we assume that 1/n ≤ λ ≤ 1. The performance of an estimator fzλ can be measured in terms of excess risk (generalization error), E(fzλ) − infHρ E = Ẽ(ωzλ)−infH Ẽ ,which is exactly ‖fzλ−fH‖2ρ according to (10). Assuming that fH ∈ Hρ, i.e., fH = Sρω∗ for some ω∗ ∈ H (in this case, the solution with minimalHnorm for fH = Sρω is denoted by ωH ), it can be measured in terms of H-norm, ‖ωzλ − ωH‖H , which is closely related to ‖L− 12Sρ(ωzλ−ωH)‖H = ‖L− 1 2 (fzλ − fH)‖ρ, according to (5). In what follows, we will measure the performance of an estimator fzλ in terms of a broader class of norms, ‖L−a(fzλ − fH)‖ρ, where a ∈ [0, 12 ] is such that L\n−afH is well defined. But one should keep in mind that all the derived results also hold if we replace ‖L−a(fzλ − fH)‖ρ with ‖T 12−a(ωzλ − ωH)‖H in the attainable case, i.e., fH ∈ Hρ. We will report these results in a longer version of this paper. Convergence with respect to different norms has its strong backgrounds in convex optimization, inverse problems, and statistical learning theory. Particularly, convergence with respect to target function values and H-norm has been studied in convex optimization. Interestingly, convergence in H-norm can imply convergence in target function values (although the derived rate is not optimal), while the opposite is not true."
  }, {
    "heading": "3. Convergence Results",
    "text": "In this section, we first introduce some basic assumptions and then present convergence results for projectedregularized algorithms. Finally, we give results for sketched/Nyström regularized algorithms."
  }, {
    "heading": "3.1. Assumptions",
    "text": "In this subsection, we introduce three standard assumptions made in statistical learning theory (Steinwart & Christmann, 2008; Cucker & Zhou, 2007; Lin et al., 2018). The first assumption relates to a moment condition on the output value y.\nAssumption 1. There exist positive constants Q and M such that for all l ≥ 2 with l ∈ N,∫\nR |y|ldρ(y|x) ≤ 1 2 l!M l−2Q2, (15)\nρX -almost surely.\nTypically, the above assumption is satisfied if y is bounded almost surely, or if y = 〈ω∗, x〉H + , where is a Gaussian random variable with zero mean and it is independent from x. Condition (15) implies that the regression function is bounded almost surely, using the Cauchy-Schwarz inequality. The next assumption relates to the regularity/smoothness of the target function fH .\nAssumption 2. fH satisfies∫ H (fH(x)− fρ(x))2x⊗ xdρX(x) B2T , (16)\nand the following Hölder source condition\nfH = Lζg0, with ‖g0‖ρ ≤ R. (17)\nHere, B,R, ζ are non-negative numbers.\nCondition (16) is trivially satisfied if fH − fρ is bounded almost surely. Moreover, when making a consistency assumption, i.e., infHρ E = E(fρ), as that in (Smale & Zhou, 2007; Caponnetto, 2006; Caponnetto & De Vito, 2007; Steinwart et al., 2009), for kernel-based non-parametric regression, it is satisfied with B = 0. Condition (17) characterizes the regularity of the target function fH (Smale & Zhou, 2007). A bigger ζ corresponds to a higher regularity and a stronger assumption, and it can lead to a faster convergence rate. Particularly, when ζ ≥ 1/2, fH ∈ Hρ (Steinwart & Christmann, 2008). This means that the expected risk minimization (1) has at least one solution inH , which is referred to as the attainable case. Finally, the last assumption relates to the capacity of the space H (Hρ).\nAssumption 3. For some γ ∈ [0, 1] and cγ > 0, T satisfies\ntr(T (T + λI)−1) ≤ cγλ−γ , for all λ > 0. (18)\nThe left hand-side of (18) is called degrees of freedom (Zhang, 2005), or effective dimension (Caponnetto & De Vito, 2007). Assumption 3 is always true for γ = 1\nand cγ = κ2, since T is a trace class operator. This is referred to as the capacity independent setting. Assumption 3 with γ ∈ [0, 1] allows to derive better rates. It is satisfied, e.g., if the eigenvalues of T satisfy a polynomial decaying condition σi ∼ i−1/γ , or with γ = 0 if T is finite rank."
  }, {
    "heading": "3.2. Results for Projected-regularized Algorithms",
    "text": "We are now ready to state our first result as follows. Throughout this paper, C denotes a positive constant that depends only on κ2, cγ , γ, ζ B,M,Q,R, τ and ‖T ‖, and it could be different at its each appearance. Moreover, we write a1 . a2 to mean a1 ≤ Ca2. Theorem 1. Under Assumptions 1, 2 and 3, let λ = nθ−1 for some θ ∈ [0, 1], τ ≥ ζ, and a ∈ [0, 12 ∧ ζ]. Then the following holds with probability at least 1− δ (0 < δ < 1). 1) If ζ ∈ [0, 1],\n‖L−a(fzλ − fH)‖ρ . λ−a log 2 3 δ t1−aθ,n ×(\nλζ + 1√ nλγ\n+ λζ−1 ( ∆5 + ∆ 1−a 5 λ\na ))\n. (19)"
  }, {
    "heading": "2) If ζ ≥ 1 and λ ≥ n−1/2,",
    "text": "‖L−a(fzλ − fH)‖ρ . λ−a log 2 3\nδ ×(\nλζ + 1√ nλγ + (∆5 + λ∆ (ζ−1)∧1 5 + ∆ 1−a 5 λ a)\n) . (20)\nHere, ∆5 is the projection error ‖(I − P )T 1 2 ‖2 and\ntθ,n = [1 ∨ (θ−1 ∧ log nγ)]. (21)\nThe above result provides high-probability error bounds with respect to variants of norms for projected-regularized algorithms. The upper bound consists of three terms. The first term depends on the regularity parameter ζ, and it arises from estimating bias. The second term depends on the sample size, and it arises from estimating variance. The third term depends on the projection error. Note that there is a trade-off between the bias and variance terms. Ignoring the projection error, solving this trade-off leads to the best choice on λ and the following results.\nCorollary 2. Under the assumptions and notations of Theorem 1, let λ = n− 1 1∨(2ζ+γ) . Then the following holds with probability at least 1− δ. 1) If 2ζ + γ ≤ 1,\n‖L−a(fzλ − fH)‖ρ\n. n−(ζ−a) ( 1 + (γ log n)1−a)(1 + λ−1∆5 ) log2 3\nδ .\n(22)\n2) If ζ ∈ [0, 1] and 2ζ + γ > 1,\n‖L−a(fzλ − fH)‖ρ . n − ζ−a2ζ+γ ( 1 + λ−1∆5 ) log2 3\nδ .\n(23)\n3) If ζ ≥ 1,\n‖L−a(fzλ − fH)‖ρ . λ−a log 2 3\nδ ×(\nn− ζ\n2ζ+γ + ∆5\n( 1 + ( λ ∆5 ) ∆ (ζ−1)∧1 5 + ( λ ∆5 )a)) .\n(24)\nComparing the derived upper bound for projectedregularized algorithms with that for classic regularized algorithms in (Lin et al., 2018), we see that the former has an extra term, which is caused by projection. The above result asserts that projected-regularized algorithms perform similarly as classic regularized algorithms if the projection operator is well chosen such that the projection error is small enough. In the special case that P = I , we get the follow result.\nCorollary 3. Under the assumptions and notations of Theorem 1, let λ = n− 1 1∨(2ζ+γ) and P = I . Then with probability at least 1− δ,\n‖L−a(fzλ − fH)‖ρ\n. log2 3\nδ\n{ n−(ζ−a) ( 1 + (γ log n)1−a ) , if 2ζ + γ ≤ 1,\nn− ζ−a 2ζ+γ , if 2ζ + γ > 1.\n(25)\nThe above result recovers the result derived in (Lin et al., 2018). The convergence rates are optimal as they match the mini-max rates with ζ ≥ 1/2 derived in (Caponnetto & De Vito, 2007; Blanchard & Mucke, 2016)."
  }, {
    "heading": "3.3. Results for Sketched-regularized Algorithms",
    "text": "In this subsection, we state results for sketched-regularized algorithms. In sketched-regularized algorithms, the range of the projection operator P is the subspace range{S∗xG∗}, where G ∈ Cm×n is a sketch matrix whose rows are i.i.d drawn according to a distribution F . In this paper, we assume the distribution F satisfies the following two properties.\n• Isotropy property: We say that F obeys the isotropy property if\nE[aa∗] = I, a ∼ F. (26)\n• Bounded property: We assume that the random vector a ∼ F is bounded almost surely: for some µ > 0,\n‖a‖2 ≤ √ nµ. (27)\nExamples for the above sketch mechanics include subsampled orthogonal systems (OS), subsampled tight or continuous frames, and random convolutions, etc, see (Candes & Plan, 2011) for further details. In this paper, we focus on OS sketches, which are based on randomly sampling the rows of a fixed orthonormal matrix K ∈ Rn×n. Examples of such matrices include the discrete Fourier transform (DFT) matrix, and the Hadamard matrix. Using OS sketches has an advantage in computation, as that for suitably chosen orthonormal matrices such as the DFT and Hadamard matrices, a matrix-vector product can be executed in O(n logm) time, in contrast to O(nm) time required for the same operation with generic dense sketches. Conditions (27) implies that µ ≥ 1, due to the isotropy property. Without loss of generality, we assume that µ = 1 throughout. The following corollary shows that sketched-regularized algorithms have optimal rates provided the sketch dimension m is not too small.\nCorollary 4. Under the assumptions of Theorem 1, let S = range{S∗xG∗}, where G ∈ Cm×n is a randomized matrix whose rows are i.i.d drawn from the distribution F . Let λ = n− 1 1∨(2ζ+γ) and\nm &  nγ log2 3n γ δ log 3 δ if 2ζ + γ ≤ 1, n γ(ζ−a) (1−a)(2ζ+γ) log 3n γ δ log 2 3 δ if ζ ≥ 1,\nn γ 2ζ+γ log 3n γ\nδ log 2 3 δ otherwise.\n(28)\nThen with confidence at least 1− δ, for ζ ≤ 1, or ζ > 1 and a ≤ γ/(2ζ + γ − 2), the following holds\n‖L−a(fzλ − fH)‖ρ\n. log3 3\nδ\n{ n−(ζ−a) ( 1 + (γ log n)2(1−a) ) , if 2ζ + γ ≤ 1,\nn− ζ−a 2ζ+γ , if 2ζ + γ > 1.\n(29)\nThe above results assert that sketched-regularized algorithms converge optimally, provided the sketch dimension is not too small, or in another words the error caused by projection is negligible when the sketch dimension is large enough. Note that the minimal sketch dimension from the above is proportional to the effective dimension λ−γ up to a logarithmic factor for the case ζ ≤ 1. Remark 2. 1) The bounded assumption (27) may be replaced with a high-probability bounded assumption as that in (Candes & Plan, 2011), which is satisfied for Gaussian sketches. 2) Considering only the case ζ = 1/2 and a = 0, (Yang et al., 2015) provides optimal error bounds for sketched ridge regression within the fixed design setting. 3) Letting ζ = 1/2, the minimal sketch dimension from the above is smaller than O(n γ γ+1 log4 n) from (Yang et al., 2015) using OS sketches."
  }, {
    "heading": "3.4. Results for Nyström Regularized Algorithms",
    "text": "As a byproduct of the paper, using Corollary 2, we derive the following results for Nyström regularized algorithms. Corollary 5. Under the assumptions of Theorem 1, let S = span{x1, · · · , xm}, 2ζ + γ > 1, and λ = n− 1 2ζ+γ . Then with probability at least 1− δ,\n‖L−a(fzλ − fH)‖ρ . n − ζ−a2ζ+γ log3 3\nδ ,\nprovided that\nm & (1 + log nγ)\n{ n ζ−a (1−a)(2ζ+γ) if ζ ≥ 1,\nn 1 2ζ+γ if ζ ≤ 1.\nRemark 3. 1) In the above, we only consider the plain Nyström subsampling. Using the ALS Nyström subsampling (Drineas et al., 2012; Gittens & Mahoney, 2013; Alaoui & Mahoney, 2015) and the proof technique developed in this paper and (Rudi et al., 2015), we can further improve the projection dimension condition to (28) (possibly with an extra log n). We will report this result in a longer version of this paper. 2) Considering only the case 1/2 ≤ ζ ≤ 1 and a = 0, (Rudi et al., 2015) provides optimal generalization error bounds for Nyström ridge regression. This result was further extended in (Myleiko et al., 2017) to a general Nyström regularized algorithm with a general source assumption indexed with an operator monotone function (but only in the attainable cases). Note that as in classic ridge regression, Nyström ridge regression saturates over ζ ≥ 1, i.e., it does not have a better rate even for a bigger ζ ≥ 1. 3) For the case ζ ≥ 1 and a = 0, (Myleiko et al., 2017) provides certain generalization error bounds for plain Nyström regularized algorithms, but the rates are capacity-independent, and the minimal projection dimension O(n 2ζ−1 2ζ+1 ) is larger than ours (considering the case γ = 1 for the sake of fairness).\nAll the results stated in this section will be proved in the next section."
  }, {
    "heading": "4. Proof",
    "text": "In this section, we prove the results stated in Section 3. We first give some deterministic estimates and an analytics result. We then give some probabilistic estimates. Applying the probabilistic estimates into the analytics result, we prove the results for projected-regularized algorithms. We finally estimate the projection errors and present the proof for sketched-regularized algorithms."
  }, {
    "heading": "4.1. Deterministic Estimates",
    "text": "In this subsection, we introduce some deterministic estimates. For notational simplicity, throughout this paper, we\ndenote Tλ = T + λ, Txλ = Tx + λ.\nWe define a deterministic vector ωλ as follows,\nωλ = Gλ(T )S∗ρfH . (30)\nThe vector ωλ is often called population function. We introduce the following lemma. The proof is essentially the same as that for Lemma 26 from (Lin & Cevher, 2018). We thus omit it.\nLemma 6. Under Assumption 2, the following holds. 1) For any ζ − τ ≤ a ≤ ζ,\n‖L−a(Sρωλ − fH)‖ρ ≤ Rλζ−a. (31)\n2)\n‖T a−1/2ωλ‖H ≤ τR· { λζ+a−1, if − ζ ≤ a ≤ 1− ζ, κ2(ζ+a−1), if a ≥ 1− ζ.\n(32)\nThe above lemma provides some basic properties for the population function. It will be useful for the proof of our main results. The left hand-side of (31) is often called true bias. Using the above lemma and some basic operator inequalities, we can prove the following analytic, deterministic result.\nProposition 7. Under Assumption 2, let\n1 ∨ ‖T 1 2 λ T − 12 xλ ‖ 2 ∨ ‖T − 1 2 λ T 1 2 xλ‖ 2 ≤ ∆1,\n‖T −1/2λ [(Txωλ − S ∗ xy)− (T ωλ − S∗ρfH)]‖H ≤ ∆2,\n‖T − Tx‖ ≤ ∆3,\n‖T − 1 2\nλ (T − Tx)‖ ≤ ∆4,\n‖(I − P )T 12 ‖2 = ∆5.\nThen, for any 0 ≤ a ≤ ζ ∧ 12 , the following holds. 1) If ζ ∈ [0, 1],\n‖L−a(Sρωzλ − fH)‖ρ ≤ τλ−a∆1−a1 × ( ∆2 + 2(τ + 1)Rλ ζ + τRλζ−1(∆5 + ∆ 1−a 5 λ a) ) .\n(33)\n2) If ζ ≥ 1,\n‖L−a(Sρωzλ − fH)‖ρ ≤ τλ−a∆1−a1 × ( ∆2 + 3Rλ ζ + κ2(ζ−1)R ( κτ∆4 + τ∆5\n+λ(∆3 + ∆5) (ζ−1)∧1 + λ 1 2 ∆ (ζ− 12 )∧1 3 + ∆ 1−a 5 λ a )) .\n(34)\nThe above proposition is key to our proof. The proof of the above proposition for the case ζ ≤ 1 borrows ideas from (Smale & Zhou, 2007; Caponnetto & De Vito, 2007; Rudi et al., 2015; Myleiko et al., 2017; Lin et al., 2018), whereas the key step is an error decomposition from (Lin & Cevher, 2018). Our novelty lies in the proof for the case ζ ≥ 1, see the appendix for further details."
  }, {
    "heading": "4.2. Proof for Projected-regularized Algorithms",
    "text": "To derive total error bounds from Proposition 7, it is necessary to develop probabilistic estimates for the random quantities ∆1, ∆2, ∆3 and ∆4. We thus introduce the following four lemmas. Lemma 8. (Lin et al., 2018) Under Assumption 3, let δ ∈ (0, 1), λ = n−θ for some θ ≥ 0, and\nan,δ,γ(θ) = 8κ2 ( log 4κ2(cγ + 1)\nδ‖T ‖ + θγmin\n( 1\ne(1− θ)+ , log n\n)) .\n(35)\nWe have with probability at least 1− δ,\n‖(T + λ)1/2(Tx + λ)−1/2‖2 ≤ 3an,δ,γ(θ)(1 ∨ nθ−1),\nand\n‖(T + λ)−1/2(Tx + λ)1/2‖2 ≤ 4\n3 an,δ,γ(θ)(1 ∨ nθ−1).\nLemma 9. Let 0 < δ < 1/2. It holds with probability at least 1− δ :\n‖T − Tx‖HS ≤ 6κ2√ n log 2 δ .\nHere, ‖ · ‖HS denotes the Hilbert-Schmidt norm. Lemma 10. Under Assumption 3, let 0 < δ < 1/2. It holds with probability at least 1− δ :\n‖T − 1 2 λ (T − Tx)‖HS ≤ 2κ ( 2κ\nn √ λ + √ cγ nλγ ) log 2 δ .\nThe proof of the above lemmas can be done simply applying concentration inequalities for sums of Hilbert-space-valued random variables. We refer to (Lin & Rosasco, 2017) for the proofs. Lemma 11. (Lin et al., 2018) Under Assumptions 1, 2 and 3, let ωλ be given by (30). For all δ ∈]0, 1/2[, the following holds with probability at least 1− δ :\n‖T −1/2λ [(Txωλ − S ∗ xy)− (T ωλ − S∗ρfρ)]‖H\n≤\n( C1\nnλ 1 2∨(1−ζ)\n+\n√ C2λ2ζ\nnλ + C3 nλγ\n) log 2\nδ .\n(36)\nHere, C1 = 4(M + Rκ(2ζ−1)+), C2 = 96R2κ2 and C3 = 32(3B2 + 4Q2)cγ .\nWith the above probabilistic estimates and the analytics result, Proposition 7, we are now ready prove results for projected-regularized algorithms.\nProof of Theorem 1. We use Proposition 7 to prove the result. We thus need to estimate ∆1, ∆2, ∆3 and ∆4. Following from Lemmas 8, 9, 10 and 11, with n−1 ≤ λ ≤ 1, we know that with probability at least 1− δ,\n∆1 . tθ,n log 3\nδ , (37)\n∆2 .\n( 1\nnλ 1 2∨(1−ζ) + λζ + 1√ nλγ\n) log 3\nδ ,\n∆3 . 1√ n log 3 δ , (38)\n∆4 . 1√ nλγ log 3 δ .\nThe results thus follow by introducing the above estimates into (33) or (34), combining with a direct calculation and 1/n ≤ λ ≤ 1."
  }, {
    "heading": "4.3. Proof for Sketched-regularized Algorithms",
    "text": "In order to use Corollary 2 for sketched-regularized algorithms, we need to estimate the projection error. The basic idea is to approximate the projection error in terms of its ‘empirical’ version, ‖(I − P )T 1 2\nx ‖2. The estimate for ‖(I −P )T 1 2\nx ‖2 is quite lengthy and it is divided into several steps. We begin with the following concentration inequalities.\nLemma 12. Let 0 < δ < 1 and λ > 0. For any given x ⊆ Hn, there exists a subset Ux of Rm×n with measure at least 1− δ, such that for all G ∈ Ux,∥∥∥(Tx + λ)−1/2(Tx −m−1S∗xG∗GSx)(Tx + λ)−1/2∥∥∥\n≤ 4Nx(λ)β 3m +\n√ 2Nx(λ)β\nm ,\nwhere Nx(λ) = tr((Tx + λ)−1Tx),\nβ = log 4Nx(λ)(1 + λ/‖Tx‖)\nδ .\nThe above lemma can be proved using the concentration inequalities from (Tropp, 2012; Minsker, 2011). With the above lemma and Lemma 8, we can estimate ‖(I−P )T 1 2\nx ‖2 as follows.\nLemma 13. Let 0 < δ < 1 and θ ∈ [0, 1]. Given a fix x ∈ Hn, assume that for λ = n−θ,\ntr((Tx + λ)−1Tx) ≤ bγλ−γ (39)\nholds for some bγ > 0, γ ∈ [0, 1]. Then there exists a subset Ux of Rm×n with measure at least 1− δ, such that for all G ∈ Ux,\n‖(I − P )T 1 2 x ‖2 ≤ 3\nnθ ,\nprovided that\nm ≥ 8bγnθγ log 8bγn θγ\nδ . (40)\nUnder the condition (39), Lemma 13 provides an upper bound for ‖(I − P )T 1 2\nx ‖, which will be used to control the projection error using the following lemma.\nLemma 14. Let P be a projection operator in a Hilbert space H , and A, B be two semidefinite positive operators on H. For any 0 ≤ s, t ≤ 12 , we have\n‖As(I − P )At‖ ≤ ‖A−B‖s+t + ‖B 12 (I − P )B 12 ‖s+t.\nThe left-hand side of (39) is called empirical effective dimension. It can be estimated as follows.\nLemma 15. Under Assumption 3, let λ = n−θ for some θ ∈ [0, 1] and 0 < δ < 1. With confidence 1− δ,\ntr((Tx + λ)−1Tx)\n≤ 3(4κ2 + 2κ√cγ + cγ) log 4\nδ an,δ/2,γ(θ)λ\n−γ , (41)\nwhere an,δ/2,γ(θ) is given as in Lemma 8.\nThe above lemma improves Proposition 1 of (Rudi et al., 2015). It does not require the extra assumption that the sample size is large enough, and our proof is simpler. Now we are ready to estimate the projection error and give the proof for sketched-regularized algorithms.\nProof of Corollary 4. Let λ′ = n−θ ′ , with\nθ′ =  1, if 2ζ + γ ≤ 1, ζ−a (1−a)(2ζ+γ) , if ζ ≥ 1,\n1 2ζ+γ , otherwise\nFollowing from Corollary 2, Lemmas 8, 9 and 15, we know that there exists a subset V of Zn with measure at least 1− 4δ, such that for all z ∈ V , (22) (or (23), or (24)), (37), (38), and (41) (with θ and λ replaced by θ′ and λ′ in (41), respectively) hold. For any z ∈ V , using Lemma 13 with\nbγ =3(4κ 2 + 2κ √ cγ + cγ) log 4\nδ an,δ/2,γ(θ\n′)\n.(1 ∨ [(1− θ′)−1 ∧ log nγ ] + log 3 δ ) log 3 δ ,\nwe know that there exists a subsetUz of Rm×n with measure at least 1− δ, such that for all G ∈ Uz,\n‖(I − P )T 1 2 x ‖2 . 1\nnθ′ , (42)\nprovided m & nθ ′γbγ log\n3bγn θ′γ\nδ , which is guaranteed by\nCondition (28). Using ‖(I −P )T 1 2 x ‖2 = ‖T 1 2 x (I −P )T 1 2\nx ‖, and Lemma 14,\n‖T 12 (I − P )T 12 ‖ ≤ ‖Tx − T ‖+ ‖(I − P )T 1 2 x ‖2.\nIntroducing with (38), and (42), and noting that ‖T 12 (I − P )T 12 ‖ = ‖(I − P )T 12 ‖2, we get\n‖(I − P )T 12 ‖2 . log 3δ√ n + 1 nθ′ .\nIntroduce the above into (24), one can prove the desired results for the case ζ ≥ 1. Now consider the case ζ ≤ 1. Note that\n‖(I − P )T 12 ‖2 ≤ ‖(I − P )T 1 2 xλ‖ 2‖T − 1 2 xλ T 1 2 λ ‖ 2.\nIntroducing with (37) and using a similar argument as that for (50),\n‖(I − P )T 12 ‖2 . (‖(I − P )T 1 2 x ‖2 + λ)tθ,n log 3\nδ .\nApplying (42), ‖(I − P )T 12 ‖2 . ( 1 nθ′ + λ)tθ,n log 3 δ . Introducing the above into (22), or (23), one can prove the desired results for the case ζ ≤ 1.\nThe proof of Corollary 5 will be given in the appendix due to space limitation."
  }, {
    "heading": "5. Conclusion",
    "text": "In this paper, we prove optimal statistical results with respect to variants of norms for sketched/Nyström regularized algorithms. Our contributions are mainly on theoretical aspects. First, our results for sketched-regularized algorithms generalize previous results (Yang et al., 2015) from the fixed design setting to the random design setting. Moreover, our results involve the regularity/smoothness of the target function and thus can have a faster convergence rate. Second, our results cover the non-attainable cases, which have not been studied before for both Nyström and sketched regularized algorithms. Third, our results provide the first optimal, capacity-dependent rates even when ζ ≥ 1. This may suggest that sketched/Nyström regularized algorithms have certain advantages in comparison with distributed learning algorithms (Zhang et al., 2015), as the latter suffer a saturation effect over ζ = 1. A future direction is to extend our analysis to learning with random features, see (Sriperumbudur & Sterge, 2017; Lin & Rosasco, 2018) and references therein."
  }, {
    "heading": "Acknowledgements",
    "text": "This work was sponsored by the Department of the Navy, Office of Naval Research (ONR) under a grant number N62909-17-1-2111. It has also received funding from Hasler Foundation Program: Cyber Human Systems (project number 16066), and from the European Research Council (ERC) under the European Unions Horizon 2020 research and innovation program (grant agreement n 725594-timedata)."
  }],
  "year": 2018,
  "references": [{
    "title": "Fast randomized kernel ridge regression with statistical guarantees",
    "authors": ["Alaoui", "Ahmed", "Mahoney", "Michael W"],
    "year": 2015
  }, {
    "title": "Sharp analysis of low-rank kernel matrix approximations",
    "authors": ["Bach", "Francis"],
    "venue": "In Conference on Learning Theory, pp",
    "year": 2013
  }, {
    "title": "On the equivalence between kernel quadrature rules and random feature expansions",
    "authors": ["Bach", "Francis"],
    "venue": "Arxiv,",
    "year": 2015
  }, {
    "title": "On regularization algorithms in learning theory",
    "authors": ["Bauer", "Frank", "Pereverzev", "Sergei", "Rosasco", "Lorenzo"],
    "venue": "Journal of Complexity,",
    "year": 2007
  }, {
    "title": "Optimal rates for regularization of statistical inverse learning problems",
    "authors": ["Blanchard", "Gilles", "Mucke", "Nicole"],
    "venue": "arXiv preprint arXiv:1604.04054,",
    "year": 2016
  }, {
    "title": "A probabilistic and RIPless theory of compressed sensing",
    "authors": ["Candes", "Emmanuel J", "Plan", "Yaniv"],
    "venue": "IEEE Transactions on Information Theory,",
    "year": 2011
  }, {
    "title": "Optimal learning rates for regularization operators in learning theory",
    "authors": ["Caponnetto", "Andrea"],
    "venue": "Technical report,",
    "year": 2006
  }, {
    "title": "Optimal rates for the regularized least-squares algorithm",
    "authors": ["Caponnetto", "Andrea", "De Vito", "Ernesto"],
    "venue": "Foundations of Computational Mathematics,",
    "year": 2007
  }, {
    "title": "Adaptation for regularization operators in learning theory",
    "authors": ["Caponnetto", "Andrea", "Yao", "Yuan"],
    "year": 2006
  }, {
    "title": "Learning theory: an approximation theory viewpoint, volume 24",
    "authors": ["Cucker", "Felipe", "Zhou", "Ding Xuan"],
    "year": 2007
  }, {
    "title": "Kernel ridge vs. principal component regression: Minimax bounds and the qualification of regularization operators. 2016",
    "authors": ["Dicker", "Lee H", "Foster", "Dean P", "Hsu", "Daniel"],
    "year": 2016
  }, {
    "title": "Kernel ridge vs. principal component regression: Minimax bounds and the qualification of regularization operators",
    "authors": ["Dicker", "Lee H", "Foster", "Dean P", "Hsu", "Daniel"],
    "venue": "Electronic Journal of Statistics,",
    "year": 2017
  }, {
    "title": "Fast approximation of matrix coherence and statistical leverage",
    "authors": ["Drineas", "Petros", "Magdon-Ismail", "Malik", "Mahoney", "Michael W", "Woodruff", "David P"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2012
  }, {
    "title": "Regularization of inverse problems, volume 375",
    "authors": ["Engl", "Heinz Werner", "Hanke", "Martin", "Neubauer", "Andreas"],
    "venue": "Springer Science & Business Media,",
    "year": 1996
  }, {
    "title": "Norm inequalities equivalent to Heinz inequality",
    "authors": ["Fujii", "Junichi", "Masatoshi", "Furuta", "Takayuki", "Nakamoto", "Ritsuo"],
    "venue": "Proceedings of the American Mathematical Society,",
    "year": 1993
  }, {
    "title": "Spectral algorithms for supervised learning",
    "authors": ["Gerfo", "L Lo", "Rosasco", "Lorenzo", "Odone", "Francesca", "De Vito", "Ernesto", "Verri", "Alessandro"],
    "venue": "Neural Computation,",
    "year": 2008
  }, {
    "title": "Revisiting the nystrom method for improved large-scale machine learning",
    "authors": ["Gittens", "Alex", "Mahoney", "Michael W"],
    "venue": "arXiv preprint arXiv:1303.1849,",
    "year": 2013
  }, {
    "title": "An operator inequality",
    "authors": ["Hansen", "Frank"],
    "venue": "Mathematische Annalen,",
    "year": 1980
  }, {
    "title": "Random design analysis of ridge regression",
    "authors": ["Hsu", "Daniel", "Kakade", "Sham M", "Zhang", "Tong"],
    "venue": "Foundations of Computational Mathematics,",
    "year": 2014
  }, {
    "title": "Optimal convergence for distributed learning with stochastic gradient methods and spectral-regularization algorithms",
    "authors": ["Lin", "Junhong", "Cevher", "Volkan"],
    "venue": "arXiv preprint arXiv:1801.07226,",
    "year": 2018
  }, {
    "title": "Optimal rates for multipass stochastic gradient methods",
    "authors": ["Lin", "Junhong", "Rosasco", "Lorenzo"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2017
  }, {
    "title": "Generalization properties of doubly stochastic learning algorithms",
    "authors": ["Lin", "Junhong", "Rosasco", "Lorenzo"],
    "venue": "Journal of Complexity,",
    "year": 2018
  }, {
    "title": "Optimal rates for spectral-regularized algorithms with least-squares regression over hilbert spaces",
    "authors": ["Lin", "Junhong", "Rudi", "Alessandro", "Rosasco", "Lorenzo", "Cevher", "Volkan"],
    "venue": "arXiv preprint arXiv:1801.06720,",
    "year": 2018
  }, {
    "title": "On some extensions of Bernstein’s inequality for self-adjoint operators",
    "authors": ["Minsker", "Stanislav"],
    "venue": "arXiv preprint arXiv:1112.5448,",
    "year": 2011
  }, {
    "title": "Regularized Nyström subsampling in regression and ranking problems under general smoothness assumptions",
    "authors": ["GL Myleiko", "S Pereverzyev Jr.", "Solodky", "SG"],
    "year": 2017
  }, {
    "title": "Remarks on inequalities for large deviation probabilities",
    "authors": ["IF Pinelis", "Sakhanenko", "AI"],
    "venue": "Theory of Probability & Its Applications,",
    "year": 1986
  }, {
    "title": "Functional data analysis",
    "authors": ["Ramsay", "James O"],
    "venue": "Wiley Online Library,",
    "year": 2006
  }, {
    "title": "Less is more: Nyström computational regularization",
    "authors": ["Rudi", "Alessandro", "Camoriano", "Raffaello", "Rosasco", "Lorenzo"],
    "venue": "Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Learning theory estimates via integral operators and their approximations",
    "authors": ["Smale", "Steve", "Zhou", "Ding-Xuan"],
    "venue": "Constructive approximation,",
    "year": 2007
  }, {
    "title": "Sparse greedy matrix approximation for machine learning",
    "authors": ["Smola", "Alex J", "Schölkopf", "Bernhard"],
    "year": 2000
  }, {
    "title": "Approximate kernel pca using random features: Computational vs. statistical trade-off",
    "authors": ["Sriperumbudur", "Bharath", "Sterge", "Nicholas"],
    "venue": "arXiv preprint arXiv:1706.06296,",
    "year": 2017
  }, {
    "title": "Support Vector Machines",
    "authors": ["Steinwart", "Ingo", "Christmann", "Andreas"],
    "venue": "Springer Science & Business Media,",
    "year": 2008
  }, {
    "title": "Optimal rates for regularized least squares regression",
    "authors": ["Steinwart", "Ingo", "Hush", "Don R", "Scovel", "Clint"],
    "venue": "In Conference On Learning Theory,",
    "year": 2009
  }, {
    "title": "User-friendly tools for random matrices: An introduction",
    "authors": ["Tropp", "Joel A"],
    "venue": "Technical report, DTIC Document,",
    "year": 2012
  }, {
    "title": "Using the Nyström method to speed up kernel machines",
    "authors": ["Williams", "Christopher KI", "Seeger", "Matthias"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2000
  }, {
    "title": "Randomized sketches for kernels: Fast and optimal nonparametric regression",
    "authors": ["Yang", "Yun", "Pilanci", "Mert", "Wainwright", "Martin J"],
    "venue": "arXiv preprint arXiv:1501.06195,",
    "year": 2015
  }, {
    "title": "Learning bounds for kernel regression using effective data dimensionality",
    "authors": ["Zhang", "Tong"],
    "venue": "Neural Computation,",
    "year": 2005
  }, {
    "title": "Divide and conquer kernel ridge regression: a distributed algorithm with minimax optimal rates",
    "authors": ["Zhang", "Yuchen", "Duchi", "John C", "Wainwright", "Martin J"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2015
  }],
  "id": "SP:481a75a4c612730540e5c941ebdf041c728f9326",
  "authors": [{
    "name": "Junhong Lin",
    "affiliations": []
  }, {
    "name": "Volkan Cevher",
    "affiliations": []
  }],
  "abstractText": "We investigate regularized algorithms combining with projection for least-squares regression problem over a Hilbert space, covering nonparametric regression over a reproducing kernel Hilbert space. We prove convergence results with respect to variants of norms, under a capacity assumption on the hypothesis space and a regularity condition on the target function. As a result, we obtain optimal rates for regularized algorithms with randomized sketches, provided that the sketch dimension is proportional to the effective dimension up to a logarithmic factor. As a byproduct, we obtain similar results for Nyström regularized algorithms. Our results provide optimal, distributiondependent rates that do not have any saturation effect for sketched/Nyström regularized algorithms, considering both the attainable and non-attainable cases.",
  "title": "Optimal Rates of Sketched-regularized Algorithms for Least-Squares Regression over Hilbert Spaces"
}