{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Let f : X → R be a black-box function defined on a hypercube X = ∏D d=1[ad, bd] where D ≥ 2. Without loss of generality we assume that 0 ∈ X . The objective is to find a global minimizer\nx∗ = argmin x∈X f(x). (1)\nWe assume, as in Preferential Bayesian Optimization (PBO, González et al., 2017), that f is not directly accessible. In PBO, queries to f can done in pairs of points x,x′ ∈ X , and the binary feedback indicates whether f(x) > f(x′). In contrast, in our work we assume that queries to f are be done\n1Helsinki Institute for Information Technology HIIT, Department of Computer Science, Aalto University, Espoo, Finland 2Department of Applied Physics, Aalto University, Espoo, Finland 3The University of Manchester, UK. Correspondence to: Petrus Mikkola <petrus.mikkola@aalto.fi>, Samuel Kaski <samuel.kaski@aalto.fi>.\nProceedings of the 37 th International Conference on Machine Learning, Online, PMLR 119, 2020. Copyright 2020 by the author(s).\nFigure 1. An illustration of a projective preferential query on molecular properties: in which rotation is the molecule most likely to bind to the surface. Here, x ∈ X describes the location and orientation of a molecule as a vector x = (X,Y, Z, a, b, c). In the figure, the projective preferential query (ξ,x) finds the optimal rotation along the horizontal plane, defined by the coordinate b. This corresponds to setting ξi = 0 to all coordinates i except the one corresponding to b, and by rotating the molecule the expert then gives the optimal value α∗ that corresponds to the optimal value for coordinate b. The other coordinates are kept fixed (these are determined by x).\nover the projection onto a projection vector ξ ∈ Ξ ⊂ X . The feedback is the optimal scalar projection, that is, the length α∗ of the projection in the direction ξ. We assume that there are zero coordinates in ξ, and these coordinates are set to fixed values described by a reference vector x ∈ X . Formally, given a query (ξ,x), the feedback is obtained as a minimizer over the possible scalar projections,\nα∗ = argmin α∈Iξ f(αξ + x), (2)\nwhere Iξ ≡ {α ∈ R|αξ + x ∈ X}.\nWhat are then natural use cases for such projective preferential queries? The main motivation comes from humans serving as the oracles. The form of the query enables efficient learning of user preferences over choice sets in which each choice has multiple attributes, and in particular over continuous choice sets. An important application is knowledge elicitation from trained professionals (doctors, physi-\nar X\niv :2\n00 2.\n03 11\n3v 4\n[ st\nat .M\nL ]\n1 4\nA ug\n2 02\n0\ncists, etc.). For example, we may learn a material scientists preferences, that is, insight based on prior knowledge and experience, over molecular translations and orientations as a molecule adsorbs to a surface. In this case, a projective preferential query could correspond to finding an optimal rotation (see Figure 1), which the scientists can easily give by rotating the molecule in a visual interface.\nProbabilistic preference learning is a relatively new topic in machine learning research but has a longer history in econometrics and psychometrics (McFadden, 1981; 2001; Stern, 1990; Thurstone, 1927). A wide range of applications of these models exists, for instance in computer graphics (Brochu et al., 2010), expert knowledge elicitation (Soufiani et al., 2013), revenue management systems of airlines (Carrier & Weatherford, 2015), rating systems, and almost any application that contains users’ preference modeling. An established probabilistic model is Thurstone-Mosteller (TM) model that measures a process of pairwise comparisons (Thurstone, 1927; Mosteller, 1951). In the preference learning context, the models based on the TM-model can be applied to learning preferences from pairwise comparison feedback (e.g. Chu & Ghahramani, 2005). An extension of this research into the interactive learning setting is studied by, among others, Brochu et al. (2008) and González et al. (2017). All these approaches resort to pairwise feedbacks. Koyama et al. (2017) proposed an extension of Bayesian optimization for learning optimal parameter values for visual design tasks by letting a user give feedback as a slider manipulation. They considered only two pairwise comparisons per slider since they tested to “included more sampling points” but they “did not observe any significant improvement in the optimization behavior”.\nA drawback of most preference learning frameworks is their incapability to handle high-dimensional input spaces. The underlying reason is a combinatorial explosion in the number of possible comparisons with respect to the number of dimensions D, O(K2D), given K grid-points per dimension. This implies that a single pairwise comparison has low information content in high-dimensional spaces. This problem was mitigated by González et al. (2017) by capturing the correlations among pairs of queries (duels). However, it is still difficult to scale that method to high-dimensional spaces, say higher than 2-dimensional (see Section 4). Furthermore, the numerical computations become infeasible in a high-dimensional setting, especially the optimization of an acquisition function or finding a Condorcet winner.\nIn this paper, we introduce a Bayesian framework, which we call Projective Preferential Bayesian Optimization (PPBO), that scales to high-dimensional input spaces. A main reason is that the information content of a projective preferential query is much higher than that of a pairwise preferential query. A projective preferential query is equiv-\nalent to infinite pairwise comparisons along a projection. An important consequence is that with projective preferential queries, the user’s workload in answering the queries will be considerably reduced. Source code is available at https://github.com/AaltoPML/PPBO."
  }, {
    "heading": "2. Learning preferences from projective preferential feedback",
    "text": "In this section we introduce a Bayesian framework capable of dealing with projective preferential data. A central idea is to model the user’s utility function, that is f , as a Gaussian process as first proposed by Chu & Ghahramani (2005). We extend this line of study to allow projective preferential queries, by deriving a tractable likelihood, proposing a method to approximate it, and introducing four acquisition criteria for enabling interactive learning in this setting.\nIn this paper, for convenience, we will formulate the method for maximization instead of minimization as in (2), without loss of generality."
  }, {
    "heading": "2.1. Likelihood",
    "text": "Our probabilistic model of user preferences is built upon the Thurstone’s law of comparative judgement (Thurstone, 1927). A straightforward way to formalize this would be to assume pairwise comparisons are corrupted by Gaussian noise: x x′, if and only if f(x) + ε > f(x′) + ε′, where the latent function f is a utility function that characterizes user preferences described by the preference relation . The standard assumption is that ε and ε′ are identically and independently distributed Gaussians. Here, we deviate slightly from this assumption: Given two alternatives (αξ + x), (βξ+x) ∈ X , we assume that αξ+x βξ+x, if and only if f(αξ + x) +W (α) > f(βξ + x) +W (β), where W is a Gaussian white noise process with zeromean and autocorrelation E(W (t)W (t+ τ)) = σ2 if τ = 0, and zero otherwise.\nWe would like to find the likelihood for an observation (α, (ξ,x)) that corresponds to uncountably infinite pairwise comparisons: αξ+x βξ+x for β 6= α. For each comparison we condition on W (α) (more details in Supplementary material),\nP (αξ + x βξ + x |W (α) = w) = 1− Φ ( f(βξ + x)− f(αξ + x)− w\nσ\n) ,\nwhere Φ is the cumulative distribution function of the standard normal distribution. For a single comparison we have\nP (αξ + x βξ + x) = 1− [Φ ∗ φ] ( f(βξ + x)− f(αξ + x)\nσ\n) ,\nwhere φ is the probability density of the standard normal distribution and ∗ is the convolution operator. For infinite comparisons, we first consider a finite number of comparisons m. By their independence, we have\nP (αξ + x β1ξ + x, ..., αξ + x βmξ + x)\n= m∏ j=1 ( 1− [Φ ∗ φ] ( f(βjξ + x)− f(αξ + x) σ )) .\nBy letting the number of points m in an increasing sequence β1, ..., βm of the partition of the interval Iξ\\{α} to approach infinity, we can interpret this as a Volterra (product) integral\nexp ( − ∫ Iξ [Φ ∗ φ] (f(βξ + x)− f(αξ + x) σ ) dβ ) .\nThe joint log-likelihood of a dataset D, denoted as L(D|f), takes the form\n− N∑ i=1 ∫ Iξi [Φ ∗ φ] (f(βξi + xi)− f(αiξi + xi) σ ) dβ."
  }, {
    "heading": "2.2. Prior",
    "text": "First, we introduce notation. Assume that N projective preferential queries have been performed and gathered into a dataset D = {(αi, (ξi,xi))}Ni=1. For every data instance (αi, (ξi,xi)), we also consider a sequence of pseudoobservations {(βijξ\ni,xi)}mj=1. Technically, the pseudoobservations are Monte-Carlo samples needed for integrating the likelihood. The latent function values evaluated on those points are gathered into a vector,\nf (i) ≡ ( f(αiξi + xi), {f(βijξ i + xi)}mj=1 ) .\nThe latent function vector over all points is formed by concatenating over f ≡ (f (i))Ni=1.\nThe user’s utility function f is modelled as a Gaussian process (Rasmussen & Williams, 2005). GP model fits ideally to this objective, since it is flexible (non-parametric) and can conveniently handle uncertainty (predictive distributions can be derived analytically). In particular, it allows us to have insight into those regions of the space X in which either we are uncertain about user preferences due to lack of data, or because the user gives inconsistent feedback. A possible reason for the latter is that one of the preference axioms, transitivity or completeness, is violated in those regions. A weak preference relation is complete if for all x,y ∈ X , either x y or y x holds. That is, a user is able to reveal their preferences over all possible pairwise comparisons. Similarly, is transitive if for any x,y, z ∈ X the following holds: (x y and y z) implies that x z. That is, a user has consistent preferences. This together\nwith the continuity of guarantees the existence of a realvalued continuous utility function that represents (Debreu, 1954).\nThus, we assume as Chu & Ghahramani (2005), that the prior of the utility function follows a zero-mean Gaussian process,\np(f) = 1\n(2π) N 2 |Σ| 12 exp(−1 2 f>Σ−1f),\nwhere the ijth-element of the covariance matrix is determined by a kernel k as Σij = k(xi,xj). Throughout the paper, we assume the squared exponential kernel k(x,x) = σ2f exp( 1 −2l ‖x− x\n′‖2), where the σf and l are hyperparameters."
  }, {
    "heading": "2.3. Posterior",
    "text": "For the sake of simplicity, we use the Laplace approximation for the posterior distribution. A maximum a posteriori (MAP) estimate is needed for that,\nargmax f P(f |D) = argmax f (P(f)L(D|f)) = argmax f T (f),\nwhere we denote the functional (log-scaled posterior)\nT (f) ≡ −1 2 f>Σ−1f\n− N∑ i=1 ∫ Iξi [Φ ∗ φ] (f(βξi + xi)− f(αiξi + xi) σ ) dβ.\nThe convolution Φ ∗ φ can be efficiently approximated by Gauss-Hermite quadrature. The outer integral is approximated as a Monte-Carlo integral,∫ Iξ [Φ ∗ φ] (f(βξ + x)− f(αξ + x) σ ) dβ\n≈ `(Iξ) m m∑ j=1 [Φ ∗ φ] (f(βjξ + x)− f(αξ + x) σ ) ,\nwhere the pseudo-observations (βjξ)mj for j = 1, ...,m are sampled from a suitable distribution. Our choice is to use a family of truncated generalized normal (TGN) distributions, since it provides a continuous transformation from the uniform distribution to the truncated normal distribution, such that the locations of distributions can be specified. The idea is to concentrate pseudo-observations more densely around the optimal value αξ as the number of queries increases. For more details, see Supplementary material.\nFor notational convenience, define\n∆i,j(f) ≡ f(βijξ i + xi)− f(αiξi + xi) σ .\nIf the domain is normalized to X = ∏D d=1[0, 1], and the projections are normalized to ξ = ξ‖ξ‖∞ , then `(Iξ) = 1. Hence, under this normalization, the functional T can be approximated as\nT (f) ≈ −1 2 f>Σ−1f − 1 m N∑ i=1 m∑ j=1 [Φ ∗ φ] ( ∆i,j(f) ) .\nThe MAP estimate can be efficiently solved by a secondorder iterative optimization algorithm, since the gradient and the Hessian can be easily derived for T .\nThe Laplace approximation of the posterior amounts to the second-order Taylor approximation of the log posterior around the MAP estimate. In the ordinary (non-log) scale, this reads P(f |D) ≈ P(fMAP|D) exp ( − 1\n2 (f − fMAP)>H(f − fMAP)\n) ,\nwhere the matrix H is the negative Hessian of the log-posterior at the MAP estimate, H ≡ −∇∇ log P(f |D)|f=fMAP = Σ−1 + Λ.1 In other words, the posterior distribution is approximated as a multivariate normal distribution with mean fMAP and the covariance matrix (Σ−1 + Λ)−1."
  }, {
    "heading": "2.4. Predictive distribution",
    "text": "Based on the well-known properties of the multivariate Gaussian distribution, the predictive distribution of f is also Gaussian. Given test locations (y(1), ...,y(M)), consider the N by M matrix K ≡ [k(y(j),x(i))]ij . The predictive mean and the predictive covariance at test locations are (for more details see (Rasmussen & Williams, 2005) or (Chu & Ghahramani, 2005))\nµpred = K >Σ−1fMAP Σpred = Σ ′ −K>(Σ + Λ−1)−1K,\nwhere Σ′ is the covariance matrix of the test locations."
  }, {
    "heading": "3. Sequential learning by projective preferential query",
    "text": "In this section, we discuss how to select the next projective preferential query (ξ,x). We will choose the next query as a maximizer of an acquisition function α(ξ,x), for instance, we will consider a modified version of the expected\n1We denote the partial derivatives matrix evaluated at MAP estimate as\nΛ ≡ ∂ 2 ∂f∂f> 1 m N∑ i=1 m∑ j=1 [Φ ∗ φ] ( ∆i,j(f) )∣∣∣∣ f=fMAP .\nimprovement acquisition function (Jones et al., 1998). The optimization (ξ,x)next = argmax(ξ,x) α(ξ,x) is carried out by using Bayesian optimization (more details in Supplementary material).\nIf the oracle is a human, this allows us to learn user preferences in an iterative loop, making PPBO interactive. However, this interesting special case, where f is a utility function of a human, also brings forth issues due to bounded rationality. We apply here the following narrow definition of this more general concept (see Simon, 1990): Bounded rationality is the idea that users give feedback that reflects their preferences, but within the limits of the information available to them and their mental capabilities."
  }, {
    "heading": "3.1. The effects of bounded rationality on the optimal next query",
    "text": "If the oracle is a human, it is important to realize that the optimal next (ξ,x) is not solely the one which optimally balances the exploration-exploitation trade-off – as it is for a perfect oracle – but the optimal (ξ,x) takes also into account human cognitive capabilities and limitations. For instance, the more there are non-zero coordinates in ξ, the greater the “cognitive burden” to a human user, and the harder it becomes to give useful feedback. Thus, if there is a human in the loop, the choice of ξ should take into account both the optimization needs and what types of queries are convenient for the user.\nThe projective preferential feedback (2) may not be singlevalued or even well-defined for all ξ ∈ Ξ, if the oracle is a human. For instance, the user may not be able to explicate their preferences with respect to the dth attribute, that is, the preferences do not satisfy the completeness axiom. Formally, this means that if ξ = ed (the dth-standard unit vector), then for some x ∈ X it holds that argmaxα∈Iξ f(αξ + x) is multi-valued, a random variable or not well-defined – depending on how we interpret the scenario in which the user should say “I do not know” but instead gives an arbitrary feedback. Fortunately, this incompleteness can be easily handled when a GP is used for modelling f ; it just implies that the posterior variance is high along the dimension d.\nA possible solution would be to allow the answer “I do not know”, and to design an acquisition function that is capable of discovering and avoiding those regions in the space X where the user gives inconsistent feedback due to any source of bounded rationality. This challenge is left for future research. It is noteworthy that the acquisition function we introduce next, performed well in the user experiment covered in Section 5."
  }, {
    "heading": "3.2. Expected improvement by projective preferential query",
    "text": "We define the expected improvement by projective preferential query at the nth-iteration by\nEIn(ξ,x) ≡ En ( max {\nmax α∈Iξ\nf(αξ + x)− µ∗n, 0 }) , (3)\nwhere µ∗n denotes the highest value of the predictive posterior mean, and the expectation is conditioned on the data up to the nth-iteration. The maximum over α models the anticipated feedback.\nEIn can be approximated as a Monte-Carlo integral (up to a multiplicative constant that does not depend on (ξ,x)),\n1\nK K∑ k=1 max { max α∈Iξ f̃k(αξ + x)− µ∗n, 0 } , (4)\nwhere maxα∈Iξ f̃k(αξ + x) is approximated by using discrete2 Thompson sampling as described in (HernándezLobato et al., 2014). Discrete Thompson sampling draws a finite sample from the GP posterior distribution, and then returns the maximum over the sample. The steps needed to approximate EIn are summarized in Algorithm 1.\nAlgorithm 1 Approximate EIn(ξ,x) input (ξ,x) and K ≥ 1, J ≥ 1\n1. Compute (Σ + Λ−1)−1 for k = 1, 2, ...,K do 2. Draw (βj)Jj=1 3. Draw ( f̃(βjξ +x) )J j=1\nfrom the predictive distribution N ( µpred,Σpred ) 4. zk ← maxj {( f̃(βjξ + x) )J j=1\n} end for\noutput 1K ∑K k=1 max { zk − µ∗n, 0 } The bottlenecks are the first and the third steps. In the third step, a predictive covariance matrix of size J×J needs to be computed, and then a sample from the multivariate normal distribution needs to be drawn. Hence, the time complexity of Algorithm 1 is O(N3m3 +KN2m2J +KNmJ2 + KJ3), where the terms come from a matrix inversion (the first step), two matrix multiplications, and a Cholesky decomposition, respectively. Recall that N,m,K and J refer to the number of observations, pseudo-observations, MonteCarlo samples, and grid points, respectively.\n2Another alternative is to consider continuous Thompson sampling to draw a continuous sample path from the GP model, and then maximize it. The method is based on Bochner’s theorem and the equivalence between a Bayesian linear model with random features and a Gaussian process. For more details see (HernándezLobato et al., 2014)."
  }, {
    "heading": "3.3. Pure exploitation and exploration",
    "text": "In the experiments we use pure exploration and exploitation as baselines. A natural interpretation of pure exploitation in our context is to select the next query (ξ,x) such that ξ + x = x∗ ≡ argmaxx′∈X µn(x′), where µn(x′) is the posterior mean of the GP model at location x′, given all the data so far Dn.\nWe interpret pure exploration as maximization of the GP variance on a query (ξ,x) given the anticipated feedback. That is, the pure explorative acquisition strategy maximizes the following acquisition function\nExplore(ξ,x) ≡ Vn (\nmax α∈Iξ\nf(αξ + x) ) . (5)\nIn practice, (5) is approximated by Monte-Carlo integration and discrete Thompson sampling in the same vein as in Algorithm 1."
  }, {
    "heading": "3.4. Preferential coordinate descent (PCD)",
    "text": "The fourth acquisition strategy corresponds to the interesting special case where ξ = ed (the dth-standard unit vector), and the coordinates d are rotated in a cyclical order for each query. The reference vector x = (x1, ..., xd−1, 0, xd+1, ..., xD) can be chosen in several ways, but it is natural to consider an exploitative strategy in which x is set to x∗ except for the dth-coordinate which is set to zero. We call this acquisition strategy Preferential Coordinate Descent (PCD), since PPBO with PCD acquisition is closely related to a coordinate descent algorithm that successively minimizes an objective function along coordinate directions. The PPBO method with PCD acquisition (PPBO-PCD) differs from the classical coordinate descent in two ways: First, PPBO-PCD assumes that direct function evaluations are not possible but instead projective preferential queries are. Second, it models the black-box function f (as a GP) whereas the classical coordinate descent does not. This makes PPBO-PCD able to take advantage of past queries from every one-dimensional optimization.\nWhen comparing to other acquisition strategies, we show that PCD performs well in numerical experiments (when f is not a utility function but a numerical test function). This agrees with the results in the optimization literature; for instance: if f is pseudoconvex with continuous gradient, and X is compact and convex with “nice boundary”, then the coordinate descent algorithm converges to a global minimum (Spall, 2012, Corollary 3.1). However, PCD may not perform so well in high-dimensional spaces, since it cannot query in between the dimensions. For instance, the expected improvement by projective preferential query outperformed PCD on a 20D test function (see Section 4), since it allows to query arbitrary projections."
  }, {
    "heading": "4. Numerical experiments",
    "text": "In this section we demonstrate the efficiency of the PPBO method in high-dimensional spaces, and experiment with various acquisition strategies in numerical experiments on simulated functions.\nThe goal is to find a global minimum of a black-box function f by querying it either through (i) pairwise comparisons or (ii) projective preferential queries. For (i) we use the PBO method of González et al. (2017), which is state of the art among Gaussian process preference learning frameworks that are based on pairwise comparisons. For (ii) we use the PPBO method as introduced in this paper. The four different acquisition strategies introduced in Section 3 are compared against the baseline that samples a random (ξ,x). For the PBO method, we consider a random and a duelingThompson sampling acquisition strategies. In total seven different methods are compared: the expected improvement by projective preferential query (PPBO-EI), pure exploitation (PPBO-EXT), pure exploration (PPBO-EXR), preferential coordinate descent (PPBO-PCD), random (PPBO-RAND), and for the PBO; random (PBO-RAND) and a variant of dueling-Thompson sampling (PBO-DTS). For more details, see Supplementary material.\nFor f we consider four different test functions: Six-humpcamel2D, Hartmann6D, Levy10D and Ackley20D.3 We add a small Gaussian error term to the test function outputs. There are as many initial queries as there are dimensions in a test function. The ith-initial query corresponds to ξ = ei, that is, to the ith-coordinate projection, and the reference vector x is uniformly random. We consider a total budget of 100 queries. The results are depicted in Figure 2.4\nPPBO-PCD obtained the best performance on three of the four test functions. On the high-dimensional test function Ackley20D, PPBO-EI performed best. Unsurprisingly, all PPBO variants clearly outperformed all PBO variants. Since the performance gap between PPBO-RAND and PBO-RAND is so high, we conclude that from the optimization perspective; whenever a projective preferential query is possible, a PPBO-type of approach should be preferred to an approach that is based on pairwise comparisons. However, we note that it is better to think of PPBO as a complement, not as a substitute for PBO. In the applications, pairwise comparisons may be preferred, for instance, if they are more convenient to a user, and the underlying choice space is low-dimensional.\nTo illustrate the low information content of pairwise comparisons, we ran a test on the Six-hump-camel2D function.\n3https://www.sfu.ca/∼ssurjano/optimization.html 4All experiments of each test function were run on a computing infrastructure of 24x Xeon Gold 6148 2.40GHz cores and 72GB RAM. The longest experiment (Ackley20D) took in total 24h.\nWe trained a GP classifier with 2000 random queries (duels), and found a Condorcet winner (see González et al., 2017) by maximizing the soft-Copeland score (33 × 33 MC-samples used for the integration) by using Bayesian optimization (500 iterations with 10 optimization restarts). This took 41 minutes on the 8th-gen Intel i5-CPU, and the distance to a true global minimizer was ‖xc − xtrue‖ = ‖(0.1770,−0.0488)− (0.0898,−0.7126)‖ ≈ 0.67, and the corresponding function value was 0.1052 compared to a true global minimum value −1.0316. In contrast, PPBORAND reached this level of accuracy at the first queries, as seen from Figure 2."
  }, {
    "heading": "5. User experiment",
    "text": "In this section we demonstrate the capability of PPBO to correctly and efficiently encode user preferences from projective preferential feedback.\nWe consider a material science problem of a single organic molecule adsorbing to an inorganic surface. This is a key step in understanding the structure at the interface between organic and inorganic films inside electronic devices, coatings, solar cells and other materials of technological relevance. The molecule can bind in different adsorption configurations, altering the electronic properties at the interface and affecting device performance. Exploring the structure and property phase space of materials with accurate but costly computer simulations is a difficult task. Our objective is to find the most stable surface adsorption configuration through human intuition and subsequent computer simulations. The optimal configuration is the one that minimises the computed adsorption energy.\nOur test case is the adsorption of a non-symmetric, bulky molecule camphor on the flat surface of (111)-plane terminated Cu slab. Some understanding of chemical bonding is required to infer correct adsorption configurations. The user is asked to consider the adsorption structure as a function of molecular orientation and translation near the surface. These are represented with 6 physical variables: angles α, β, γ of molecular rotation around the X, Y, Z Cartesian axes (in the range [0, 360] deg.), and distances x, y, z of translation above the surface (with lattice vectors following the translational symmetry of the surface). The internal structures of the molecule and surface were kept fixed since little structural deformation is expected with adsorption. A similar organic/inorganic model system and experiment scenario was previously employed to detect the most stable surface structures with autonomous BO, given the energies of sampled configurations (Todorović et al., 2019).\nIn this interactive experiment, the users encode their preferred adsorption geometry as a location in the 6- dimensional phase space. We employ the quantum-\nmechanical atomistic simulation code FHI-aims (Blum et al., 2009) to i) compute the adsorption energy E of this preferred choice, and ii) optimise the structure from this initial position to find the nearest local energy minimum in phase space, E*. We also consider the number of optimization steps N needed to reach the nearest minimum as a measure of quality of the initial location.\nThere are four different test users: two materials science experts (human: a PhD student and an experienced researcher, both of them know the optimal solution), a non-expert (human), and a random bot (computer). The hypothesis is that: the materials science experts should obtain structures associated with lower energy minimum points. We consider only coordinate projections, that is ξ ∈ {e1, ..., e6}. In other words, we let the user choose the optimal value for one dimension at a time.\nThe total number of queries was 24, of which 6 were initial queries. The ith-initial query corresponded to ξ = ei, that is, to the ith-coordinate projection. The initial values for the reference coordinate vector x were fixed to the same value across all user sessions. For acquisition, we used the expected improvement by projective preferential query. Since we allowed only coordinate projections for ξ, we first selected ξn+1 = argmaxξ∈{e1,...,e6} ∫ EIn(ξ,x)dx,\nand then, either xn+1 = argmaxx µn(x) (EI-EXT), or the next xn+1 was drawn uniformly at random (EI-RAND). The computer bot gave random values to the queries; to provide some consistency to the bot, xn+1 was selected by maximizing a standard expected improvement function (EI-EI). The results are summarized in Table 1.\nOur first observation is that PPBO can distinguish between the choices made by a human and a computer bot. Human choices pinpoint atomic arrangements that are close to nearby local minima (small N), while the random bot’s choices are far less reasonable and require much subsequent computation to optimise structures. For all human users, the preferred molecular structures were placed somewhat high above the surface, which led to relatively high E values. With this query arrangement, it appears the z variable was the most difficult one to estimate visually. Human-preferred molecular orientations were favourable, so the structures were optimised quickly (few N steps).\nThe quality of user preference is best judged by the depth of the nearest energy basin, denoted by E*. It describes the energy of the structure preferred by a user. Here, there is a marked divide by expertise. The structures refined from the choices of the bot and non-expert are local minima of adsorption, characterised by weak dispersive interactions.\nThe expert’s choice led to two low-energy structure types that compete for the global minimum, and feature strong chemical bonding of the O atom to the Cu surface. Thus, the data (Table 1, column E*: rows 1-4 versus rows 5-10) supports our hypothesis: the materials science experts do obtain structures associated with lower energy minimum points.\nThe findings above demonstrate that the PPBO framework was able to encode the expert knowledge described via preferences. However, since there are only 10 samples, further work will be needed to validate the results."
  }, {
    "heading": "6. Conclusions",
    "text": "In this paper we have introduced a new Bayesian framework, PPBO, for learning user preferences from a special kind of feedback, which we call projective preferential feedback. The feedback is equivalent to a minimizer along a projection. Its form is especially applicable in a human-in-the-loop context. We demonstrated this in a user experiment in which the user gives the feedback as an optimal position or orientation of a molecule adsorbing to a surface. PPBO was capable of encoding user preferences in this case.\nWe demonstrated that PPBO can deal with high-dimensional spaces where existing preferential Bayesian optimization frameworks that are based on pairwise comparisons, such as IBO (Brochu, 2010) or PBO (González et al., 2017), have difficulties to operate. In the numerical experiments, the performance gap between PPBO and PBO was so high that we conclude: whenever a projective preferential query is possible, a PPBO-type of approach is preferable from the optimization perspective. However, we note that it is better to think of PPBO as a complement, not as a substitute for\nPBO. In the applications, pairwise comparisons may be preferred, for instance, if they are more convenient to a user.\nIn summary, if it is possible to query a projective preferential query, then PPBO provides an efficient way for preference learning in high-dimensional problems. In particular, PPBO can be used for efficient expert knowledge elicitation in highdimensional settings which are important in many fields."
  }, {
    "heading": "Acknowledgements",
    "text": "This research was supported by the Academy of Finland (Flagship programme: Finnish Center for Artificial Intelligence FCAI; and grants 320181, 319264, 313195, 292334 and 316601). Computational resources were provided by the CSC IT Center for Science, and the Aalto Science-IT Project."
  }],
  "year": 2020,
  "references": [{
    "title": "Ab initio molecular simulations with numeric atom-centered orbitals",
    "authors": ["V. Blum", "R. Gehrke", "F. Hanke", "P. Havu", "V. Havu", "X. Ren", "K. Reuter", "M. Scheffler"],
    "venue": "Computer Physics Communications,",
    "year": 2009
  }, {
    "title": "Interactive Bayesian optimization: learning user preferences for graphics and animation",
    "authors": ["E. Brochu"],
    "venue": "PhD thesis, University of British Columbia,",
    "year": 2010
  }, {
    "title": "Active preference learning with discrete choice data",
    "authors": ["E. Brochu", "N.D.F. Brochu", "A. Ghosh"],
    "venue": "Advances in Neural Information Processing Systems",
    "year": 2008
  }, {
    "title": "A Bayesian interactive optimization approach to procedural animation design",
    "authors": ["E. Brochu", "T. Brochu", "N. de Freitas"],
    "venue": "In Proceedings of the 2010 ACM SIGGRAPH/Eurographics Symposium on Computer Animation,",
    "year": 2010
  }, {
    "title": "Implementation of MNL choice models in the passenger origin-destination simulator (PODS)",
    "authors": ["E. Carrier", "L. Weatherford"],
    "venue": "Journal of Revenue and Pricing Management,",
    "year": 2015
  }, {
    "title": "Preference learning with gaussian processes",
    "authors": ["W. Chu", "Z. Ghahramani"],
    "venue": "In Proceedings of the 22nd International Conference on Machine Learning,",
    "year": 2005
  }, {
    "title": "Representation of a preference ordering by a numerical function",
    "authors": ["G. Debreu"],
    "venue": "Decision Process,",
    "year": 1954
  }, {
    "title": "Efficient global optimization of expensive black-box functions",
    "authors": ["D.R. Jones", "M. Schonlau", "W.J. Welch"],
    "venue": "Journal of Global Optimization,",
    "year": 1998
  }, {
    "title": "Sequential line search for efficient visual design optimization by crowds",
    "authors": ["Y. Koyama", "I. Sato", "D. Sakamoto", "T. Igarashi"],
    "venue": "ACM Transactions on Graphics,",
    "year": 2017
  }, {
    "title": "Econometric models of probabilistic choice. Structural analysis of discrete data with econometric applications",
    "authors": ["D. McFadden"],
    "year": 1981
  }, {
    "title": "Remarks on the method of paired comparisons: The least squares solution assuming equal standard deviations and equal correlations",
    "authors": ["F. Mosteller"],
    "year": 1951
  }, {
    "title": "Gaussian Processes for Machine Learning",
    "authors": ["C.E. Rasmussen", "C.K.I. Williams"],
    "year": 2005
  }, {
    "title": "Reason in human affairs",
    "authors": ["H. Simon"],
    "year": 1990
  }, {
    "title": "Preference elicitation for general random utility models",
    "authors": ["H.A. Soufiani", "D.C. Parkes", "L. Xia"],
    "venue": "In Proceedings of the 29th Conference on Uncertainty in Artificial Intelligence,",
    "year": 2013
  }, {
    "title": "Cyclic seesaw process for optimization and identification",
    "authors": ["J.C. Spall"],
    "venue": "Journal of Optimization Theory and Applications,",
    "year": 2012
  }, {
    "title": "A continuum of paired comparisons",
    "authors": ["H. Stern"],
    "venue": "models. Biometrika,",
    "year": 1990
  }, {
    "title": "A law of comparative judgment",
    "authors": ["L.L. Thurstone"],
    "venue": "Psychological Review,",
    "year": 1927
  }, {
    "title": "Bayesian inference of atomistic structure in functional materials",
    "authors": ["M. Todorović", "M. Gutmann", "J. Corander", "P. Rinke"],
    "venue": "In npj Computational Materials,",
    "year": 2019
  }],
  "id": "SP:07370c27d1b1a653131a00580ce415d061969c01",
  "authors": [{
    "name": "Petrus Mikkola",
    "affiliations": []
  }, {
    "name": "Milica Todorović",
    "affiliations": []
  }, {
    "name": "Jari Järvi",
    "affiliations": []
  }, {
    "name": "Patrick Rinke",
    "affiliations": []
  }, {
    "name": "Samuel Kaski",
    "affiliations": []
  }],
  "abstractText": "Bayesian optimization is an effective method for finding extrema of a black-box function. We propose a new type of Bayesian optimization for learning user preferences in high-dimensional spaces. The central assumption is that the underlying objective function cannot be evaluated directly, but instead a minimizer along a projection can be queried, which we call a projective preferential query. The form of the query allows for feedback that is natural for a human to give, and which enables interaction. This is demonstrated in a user experiment in which the user feedback comes in the form of optimal position and orientation of a molecule adsorbing to a surface. We demonstrate that our framework is able to find a global minimum of a high-dimensional black-box function, which is an infeasible task for existing preferential Bayesian optimization frameworks that are based on pairwise comparisons.",
  "title": "Projective Preferential Bayesian Optimization"
}