{
  "sections": [{
    "heading": "1. Introduction",
    "text": "For retailers, brick-and-mortar stores and internet-based stores, various recommendation methods are proposed in an attempt to sell products. The recommendation model is usually updated in a timely manner or it includes new valuable features of products which are not previously available. For example, during the Apple WWDC 2018 keynote, Apple has introduced new features of their platforms to fight “fingerprinting”, a technique which tracks users based on identifying computers. With the available of new features, a feature selection model is employed to determine whether the new features will drive sales of products in the future\n1Cornell University, New York, NY 10021, USA. 2Rutgers University, Piscataway, NJ 08854, USA. 3Baidu Research, Bellevue, WA 98004, USA. Jing Wang <jiw2026@med.cornell.edu>, Ping Li <pingli98@gmail.com>. Correspondence to: Jie Shen <js2007@rutgers.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nand only related features will be included in the recommendation model. Hence, in real-world applications, features are usually revealed in a continuous stream. It is necessary to evaluate new features immediately and output intermediate result. The feature evaluation process in a stream is called online feature selection (Perkins & Theiler, 2003; Zhou et al., 2005; Wu et al., 2010). We first formulate this problem.\nSuppose that there are n samples but initially we do not observe all of the features. We call the sequence a1,a2, · · · ∈ Rn is a feature stream, with each ai ∈ Rn being the ith feature, or the ith covariate of n samples. Note that in our setting, the feature ai is revealed at time stamp i. If ai is selected, we update the observation matrixA as follows:\nA← [A θiai] . (1.1)\nwhere the parameter θi 6= 0 is chosen in an online manner.\nIn the literature, a large number of online methods have been proposed based on statistical measurements or optimization techniques (Perkins & Theiler, 2003; Zhou et al., 2005; Wang et al., 2015). For example, Perkins & Theiler (2003) added a new feature which contributes to a predictor learning and optimization analysis into the model. Zhou et al. (2005) proposed an adaptive complexity penalty method to evaluate a new feature based on its p-value. Wu et al. (2010) utilized the Markov blanket to measure the relationship between a new feature and the selected feature subset. Yet successful, most of the results in this line of research are empirical in nature.\nOn the other hand, feature selection method can be categorized into either supervised or unsupervised. For instance, Shen & Li (2017) recently proposed a non-convex supervised approach for variable selection with favorable iteration complexity. Unsupervised methods, however, are with great practical importance to many areas such as Cardiology, as annotated data is usually precious and limited due to genetic privacy issue and the medical background requirement for annotators.\nSummary of Contributions. In this paper, we consider the high-dimensional regime that the number of features is much larger than the sample size, and the features are revealed in an online manner. We propose an unsupervised algorithm termed Online leverage scores for Feature Selection\n(OFS). Our main technique is to approximately compute the broadly used leverage score in each iteration, and determine the importance of each feature in real time. We prove that the reduced feature space is a good approximation to the original one in some sense to be clarified. Furthermore, we apply k-means clustering on the set of selected features, and show that the clustering performance does not degrade a lot. Computationally, our algorithm enjoys low time complexity and little memory usage, which makes it a perfect fit for big data analytics."
  }, {
    "heading": "2. Related Work",
    "text": "Feature selection is a primary technique in machine learning to address “the curse of dimensionality”. In the last decades, a number of methods have been proposed (Guyon & Elisseeff, 2003; Donoho & Jin, 2008). In this section, we give a brief review of existing approaches in terms of batch situation and online situation.\nBatch Methods. Existing batch feature selection methods can be roughly divided to unsupervised, supervised and semi-supervised approaches. The supervised methods utilize the target variable to guide the feature evaluation process, such as Fisher score, Least Absolute Shrinkage and Selection Operator (Lasso) (Tibshirani, 1996) and minimum Redundancy Maximum Relevance (Peng et al., 2005). Unsupervised feature selection methods mainly depend on latent data distribution analysis (He et al., 2005), such as spectral analysis (Zhao & Liu, 2007; Cai et al., 2010) and Kullback-Leibler Divergence between neighborhood distributions (Wei & Philip, 2016). The semi-supervised feature selection algorithms make benefits of both aforementioned approaches, such as combining Gaussian Field and Harmonic functions (Kong & Yu, 2010; Zhu et al., 2003).\nFeature selection methods are also characterized as wrapper, embedded and filter model. The wrapper model evaluates feature subsets by their performance on a specific algorithm, such as SVM or Naive Bayes for classification tasks (Forman, 2003) and k-means for clustering tasks (Guyon et al., 2002; Xu et al., 2014). The embedded model seeks the desired feature subset by solving a regularized optimization objective function with certain constraints (Zhang, 2009; Yang & Xu, 2013). Examples of this approach include Least Angle Regression (Efron et al., 2004) and group Lasso (Zhang et al., 2016). The optimization process forces most coefficients small or exact zero. The features corresponding to nonzero coefficients are selected.\nThe filter model utilizes certain statistical measurements, such as the Hilbert-Schmidt Independence Criterion (HSIC), leverage score (Boutsidis et al., 2009) and kernel-based measures of independence (Chen et al., 2017). Specifically, the statistical leverage score is an important measurement\nfor unsupervised feature selection. It characterizes the outstanding features that have more affect towards the result of a statistical procedure. There are multiple variants of the statistical leverage score, such as the normalized leverage score (Boutsidis et al., 2009), the truncated version of leverage score (Gittens & Mahoney, 2013) and the kernel ridge leverage score (Alaoui & Mahoney, 2015). The ridge leverage score is used to select features for k-means clustering (Boutsidis et al., 2009) and has proved to attain (2 + )- approximate partition. Specifically, the ridge leverage score of the ith column of data matrix A ∈ Rn×d is defined as (Alaoui & Mahoney, 2015),\nli = a > i (AA > + λI)−1ai, (2.1)\nwhere λ > 0 is a parameter, I ∈ Rn×n is the identity matrix. However, it is expensive as it requires O ( n3 + n2d ) running time and O (nd) memory storage. A number of recent papers focus on sampling some columns of A and approximate the linear kernel ofA (Li et al., 2013; Alaoui & Mahoney, 2015; Cohen et al., 2016; Musco & Musco, 2017). However, none of these techniques have been applied for feature selection of streaming features.\nOnline Methods. Motivated by the fact that features are available in a stream in real-world applications, online feature selection has attracted a lot of attention (Perkins & Theiler, 2003; Zhou et al., 2005; Wu et al., 2010; Wang et al., 2013). The batch-mode algorithms cannot handle this situation well as the global feature space is required in advance. Examples of online feature selection approaches either utilize statistical measurements, such as alpha-investing (Zhou et al., 2005) and mutual information (Wu et al., 2010) or rely on optimization techniques, such as stochastic gradient grafting (Perkins & Theiler, 2003; Wang et al., 2015). All existing mentioned methods come with no theoretical guarantees of the selected feature subset for clustering task."
  }, {
    "heading": "2.1. Notation",
    "text": "We use bold lower-case letters, e.g. v ∈ Rd to denote a column vector. ‖v‖2 is used to denote the `2-norm of the vector. Capital letters such asX are used to denote matrices, and its transpose is denoted byX>. The capital letter In×n is reserved for the identity matrix where n indicates its size. For an invertible matrix X , we write its inverse as X−1. Otherwise, we use X† for the pseudoinverse. For a square matrix X , we write its trace as Tr (X), which is the sum of its diagonal elements. The ith column and jth row of the matrix X are denoted by xi and (xj)>, respectively. Suppose that the rank of matrixX ∈ Rn×m is k ≤ min{m,n}. The singular value decomposition of X\nis given by\nX = [ u1, · · · ,uk ] σ1 . . . σk  v > 1 ... v>k  where the singular values in descending order σ1 ≥ · · · ≥ σk > 0, U = [u1, · · · ,uk] ∈ Rn×k contains the left singular vectors and V = [v1, · · · ,vk] contains the right singular vectors. In this paper, we will use the Frobe-\nnius norm ‖X‖F := √∑k i=1 σ 2 i and the spectral norm ‖X‖2 := max1≤i≤k σi = σ1.\nFor a sequence of random variablesX1,X2, . . . , we write Ej−1 [Xj ] for the expectation of Xj conditioning on {X1, . . . ,Xj−1}."
  }, {
    "heading": "3. Main Results",
    "text": "In this section, we propose an online algorithm for feature selection, where the goal is to approximate the original data with much fewer attributes in some sense. To the end, we make use of the leverage score that, from a high level, reflects the importance of each feature.\nSuppose that the data matrix isA ∈ Rn×d, i.e., n samples lying in a d-dimensional ambient space. The statistical leverage score of the ith column (i.e., feature) of A is defined as\nl∗i = a > i (AA >)†ai. (3.1)\nIt is well known that sampling an n×O ( −2n log n ) matrix\nÃ with probabilities proportional to the respective leverage scores yields a (1 + )-spectral approximation toA (Spielman & Srivastava, 2011), in the sense that for all x∥∥∥Ã>x∥∥∥ 2 ≈ ∥∥∥A>x∥∥∥ 2 , or more precisely (1− )x>AA>x ≤ x>ÃÃ>x ≤ (1 + )x>AA>x, or\n(1− )AA> ÃÃ> (1 + )AA>.\nIn the online setting, however, we are not able to access all the data to compute the leverage score. The key idea of our algorithm is that when a new feature arrives, we approximate its leverage score based on the obtained features, which can further be used to guide the selection process.\nTo be more concrete, at time stamp i, suppose the observed data matrix is Ãi−1 and the new feature ai is revealed, we need to determine whether ai is kept or discarded. A natural way for the sake is to compute the approximate leverage score of ai as follows:\nli = a > i (Ãi−1Ã > i−1) †ai. (3.2)\nAlgorithm 1 Online Feature Selection Require: Initial data matrix Ã0, sampling rate c =\n8 −2 log n, approximation parameter ∈ (0, 1). 1: for i = 1, · · · do 2: Reveal the ith feature ai. 3: Compute the online leverage score\nl̃i = min((1 + )a > i (Ãi−1Ã > i−1) †ai, 1).\n4: Compute the probability,\npi = min(cl̃i, 1).\n5: With probability pi, update\nÃi = [Ãi−1 ai/ √ pi].\nOtherwise,\nÃi = Ãi−1.\n6: end for\nIntuitively, if Ãi−1 is a good approximation to A, li indicates the importance of ai as l∗i does. And what we will show is that, it is the case after we reveal a few attributes.\nIt is known that if the entire feature space is available, each leverage score is upper bounded by 1. However the estimates based on Ãi−1 can be arbitrary because Ãi−1 is a submatrix of A which leads to Ãi−1Ã > i−1 AA\n>. For our analysis, we technically require that each li is not larger than 1. Hence, we will make use of a modified quantity\nl̃i = min ( (1 + )a>i (Ãi−1Ã > i−1) †ai, 1 ) . (3.3)\nNote that > 0 is some pre-defined accuracy parameter, and the above suggests we are using a conservative estimate of the leverage score. To see this, consider Ãi−1 = A, then l̃i ≥ l∗i . It is essential in the online setting in that we may lose many important features with an aggressive strategy.\nThen, the sampling probability is computed as pi = min ( 8 −2 log n · l̃i, 1 ) . (3.4)\nWith the scaling factor of l̃i above, it is not hard to see that for a small approximation error , one has to select the current feature with high probability, which conforms the intuition – an exact estimation of A requires selecting all the features. We summarize our method in Algorithm 1."
  }, {
    "heading": "3.1. Analysis",
    "text": "We first show that with high probability, the data matrix produced by our algorithm is a good approximation toA.\nTheorem 1. Consider Algorithm 1. Let Ã be the output when it terminates. It holds with high probability that\n(1− )AA> ÃÃ> (1 + )AA>.\nProof. Let Ai = (a1 a2 . . .ai). Define Y 0 as the zero matrix and for all i ≥ 1, let\nY i−1 = (AA >)†/2(Ãi−1Ã > i−1−Ai−1A > i−1)(AA >)†/2.\nLet ui = (AA>)†/2ai. If ‖Y i−1‖2 ≥ , we set Xi = 0. Otherwise, set\nXi = { (1/pi − 1)uiu>i , if ai is sampled in Ã, −uiu>i , otherwise.\nThus,Xi = Y i − Y i−1.\nConsider the case ‖Y i−1‖2 < . We get\nl̃i = min((1 + )a > i (ÃiÃ > i ) †ai, 1)\n≥ min((1 + )a>i (AiA > i + AA >)†ai, 1) ≥ min((1 + )a>i ((1 + )(AA >))†ai, 1) = a>i (AA >)†ai = u>i ui.\nThus, pi ≥ min(cu>i ui, 1). If pi = 1, then Xi = 0. Otherwise, we have pi ≥ cu>i ui. Moreover, we get\n‖Xi‖2 ≤ 1/c\nand\nEi−1 [ X2i ]\npi · (1/pi − 1)2(uiu>i )2 + (1− pi) · (uiu>i )2\n= (uiu > i ) 2/pi\nuiu>i /c.\nLetW i = ∑i k=1 Ek−1 [ X2k ] . We have\n‖W i‖2 ≤ ∥∥∥∥∥ i∑\nk=1\nuiu > i /c ∥∥∥∥∥ 2 ≤ 1/c.\nApplying Lemma 4 gives Pr(‖Y n‖2 ≥ ) ≤ n · exp ( − 2/2 1/c+ /(3c) ) ≤ n · exp(−c 2/4) = 1/n.\nThis implies that with high probability∥∥∥(AA>)†/2(ÃÃ>)(AA>)†/2 − I∥∥∥ 2 ≤ .\nWe thus have\n(1− )AA> ÃÃ > (1 + )AA>,\ncompleting the theorem.\nNow we turn to control the number of features selected by Algorithm 1. We will use the result in (Cohen et al., 2015) shown below.\nLemma 1. Let A be an n × d matrix, ∈ (0, 1), c = 1/ , l̃1, · · · , l̃d be over-estimated leverage scores, i.e., l̃i ≥ a>i (AA\n>)†ai for all 1 ≤ i ≤ d. Let pi = min{cl̃i, 1}. Construct Ã by independently sampling each column ai of A with probability pi and rescale it by 1/ √ pi if it is included in Ã. Then, with high probability, Ã is the (1+ )- spectral approximation ofA and the number of columns in Ã is O ( −2 ∑d i=1 l̃i log n ) .\nBy Lemma 1, in order to control the number of selected features, we need to bound the sum of online leverage scores.\nLemma 2. After running Algorithm 1, it holds with high probability that\nd∑ i=1 l̃i = O (n log(‖A‖2)) .\nProof. We define\nδi = log det(ÃiÃ > i )− log det(Ãi−1Ã > i−1).\nThe sum of δi can be bounded by the logarithm of the ratio of the determinants of ÃÃ > . By the matrix determinant lemma, we have\nEi−1 [ exp(l̃i/8− δi) ] = pi · eli/8(1 + a>i (Ãi−1Ã > i−1) −1ai/pi) −1\n+ (1− pi) · eli/8\n≤ (1 + li/4) · (pi(1 + a>i (Ãi−1Ã > i−1) −1ai/pi) −1\n+ 1− pi).\nIf cl̃i < 1, we have pi = cl̃i and Ei−1 [ exp(l̃i/8− δi) ] ≤ cl̃i · (1 + li/4)(1 + 1/((1 + )c))−1 + (1− cl̃i)· (1 + li/4)\n= (1 + li/4)(cli(1 + 1/((1 + )c)) −1 + 1− cli)\n≤ (1 + li/4)(1 + cli(1− 1/(4c)− 1)) = (1 + li/4)(1− li/4) ≤ 1.\nOtherwise, pi = 1 and we have\nEi−1 [ exp(l̃i/8− δi) ] ≤ (1 + li/4)(1 +A>i (Ã > i−1Ãi−1 + λI) −1Ai) −1 ≤ (1 + li/4)(1 + li)−1 ≤ 1.\nWe now analyze the expected product of exp(l̃i/8−δi) over the first k steps. For k ≥ 1 we have\nE [ exp ( k∑ i=1 l̃i/8− δi )] ≤ E [ exp ( k−1∑ i=1 l̃i/8− δi )] ,\nand so by induction on k,\nE [ exp ( d∑ i=1 l̃i/8− δi )] ≤ 1.\nHence by Markov’s inequality,\nPr ( d∑ i=1 l̃i > 8n+ 8 d∑ i=1 δi ) ≤ e−n.\nUsing Theorem 1, with high probability, we have\nÃÃ > (1 + )AA>,\nimplying that\ndet(ÃÃ > ) ≤ (1 + )n(‖A‖22) n,\nlog det(ÃÃ > ) ≤ n(1 + log(‖A‖22)).\nBy the definition of δi, it holds with high probability that\nd∑ i=1 δi = log det(Ã > Ã+ λI)− n\n≤ n(1 + log(‖A‖22)− 1) = n(log(‖A‖22)).\nAnd with high probability,\nd∑ i=1 l̃i ≤ 8n+ 8 d∑ i=1 δi\n≤ 8n+ 8n log(‖A‖22) = O ( n log(‖A‖22) ) = O (n log(‖A‖2)) .\nThe proof is complete.\nThus Lemma 1 and 2 imply that Algorithm 1 selects O ( −2n log d log(‖A‖2) ) features with high probability.\nTime Complexity. The running time of Algorithm 1 is dominated by the online leverage score computation in Step 3, which is O ( n3 ) . In the case that Ãi−1 is a Laplacian\nmatrix, Step 3 can be implemented inO ( d log2 n ) time by a fast graph Laplacian solver with the Johnson-Lindenstrauss lemma, as stated in (Koutis et al., 2016).\nMemory Cost. The memory cost for leverage score computation is significantly reduced from O (nd) to O ( n2 log n ) (storage of Ãi). This follows from the analysis of Lemma 2 which states that when the algorithm terminates, only O ( −2n log n log(‖A‖2) ) features will be selected. Note that this paper considers the regime where n d, such as the number of patients with rare diseases n and the length of their gene expressions d, or the batch size in neural networks n and the corresponding dimension of feature space d. Hence our online implementation is order of magnitude more efficient. It leads to practical values of our algorithm for learning tasks, such as clustering.\n3.2. Application to k-Means Clustering\nWe explore the performance of matrix Ã returned by Algorithm 1 when it is used for k-means clustering. We first recall the k-means clustering problem.\nFormally, k-means clustering seeks to partition the data matrix A ∈ Rn×d into k clusters {C1, · · · , Ck} to minimize the distance between data points and its closest center {µ1, · · · ,µk} (Awasthi et al., 2010):\nmin µ1,...,µk k∑ i=1 ∑ j∈Ci ∥∥aj − µi∥∥22 , (3.5) where µi be the center of data points in Ci. It is known that k-means clustering is an instance of low-rank approximation (Boutsidis et al., 2009). To see this, we construct an n× k matrix X as the cluster indicator matrix. Then for each solution {µi}ki=1 of (3.5), we will assign a cluster label, say xj ∈ {1, 2, . . . , k}, to each sample aj . We set Xij = 1/ √ |Cj | if ai belongs to Cj , and 0 otherwise. In this way, the ith row ofXX>A is actually the average of the points with label i, i.e., the center µi of the ith class. Hence, from the discussion, we may rewrite (3.5) as follows:\nmin X k∑ i=1 ∑ j∈Ci ∥∥∥aj − (XX>A)i∥∥∥2 2 .\nMore compactly, we aim to solve\nmin X ∥∥∥A−XX>A∥∥∥2 F .\nSee (Ostrovsky et al., 2006) for a more detailed discussion.\nLet the indicator matrix X∗ ∈ Rn×k denote the optimal partition onA, i.e.,\nX∗ = argmin X ∥∥∥A−XX>A∥∥∥2 F . (3.6)\nWe first investigate how the cluster indicator matrixX over Ã is deviated from the optimum. The following lemma provides the bound of the k-means objective function value on Ã.\nLemma 3. Suppose that Ã is the matrix returned by Algorithm 1, then\n(1− ) ∥∥∥A−XX>A∥∥∥2 F ≤ ∥∥∥Ã−XX>Ã∥∥∥2 F\n≤ (1 + ) ∥∥∥A−XX>A∥∥∥2\nF ,\nwhen is the parameter of Algorithm 1.\nProof. Using the notation Y = I −XX>, we can rewrite the objective function of k-means based on the data matrices A and Ã as∥∥∥A−XX>A∥∥∥2\nF = ‖Y A‖2F = Tr\n( Y AA>Y ) ,∥∥∥Ã−XX>Ã∥∥∥2 F = ∥∥∥Y Ã∥∥∥2 F = Tr ( Y ÃÃ > Y ) .\nNote that\nTr ( Y ÃÃ > Y ) = Tr ( n∑ i=1 y>i ÃÃ > yi ) ,\nwhere yi is the ith column of Y . Then by the spectral bound onAA> in Theorem 1, we immediately get\n(1− )Tr ( Y AA>Y ) ≤ Tr ( Y ÃÃ > Y )\n≤ (1 + )Tr ( Y AA>Y ) .\nPlugging Y = I −XX> into the above inequalities completes the proof.\nNow we show that Ã is also a good approximation toA.\nTheorem 2. Suppose that Ã is returned by Algorithm 1. Let X̃∗ = argmin ∥∥∥Ã−XX>Ã∥∥∥2\nF . Then given ∈ (0, 1),\nwe can get∥∥∥A− X̃∗X̃>∗ A∥∥∥2 F ≤ 1 + 1− · ∥∥∥A−X∗X>∗ A∥∥∥2 F .\nProof. Using Lemma 3, we have (1− ) ∥∥∥A− X̃∗X̃>∗ A∥∥∥2 F ≤ ∥∥∥Ã− X̃∗X̃>∗ Ã∥∥∥2\nF ,∥∥∥Ã−X∗X>∗ Ã∥∥∥2\nF ≤ (1 + ) ∥∥∥A−X∗X>∗ A∥∥∥2 F .\nOn the other hand, by the optimality of X̃∗ for Ã, we have∥∥∥Ã− X̃∗X̃>∗ Ã∥∥∥2 F ≤ ∥∥∥Ã−X∗X>∗ Ã∥∥∥2 F .\nCombining the above inequalities, we have∥∥∥A− X̃∗X̃>∗ A∥∥∥2 F ≤ 1 + 1− · ∥∥∥A−X∗X>∗ A∥∥∥2 F .\nThe proof is complete.\nTheorem 2 implies that if X̃∗ is an optimal solution for Ã, then it also preserves an (1 + )-approximation forA. We compare our algorithm with existing dimension reduction methods for k-means clustering as shown in Table 1."
  }, {
    "heading": "4. Experiments",
    "text": "This section describes an empirical study of the efficacy and efficiency of our algorithm. We first elaborate the experimental settings.\nData Sets. We perform the experiments on 6 realistic data sets, including USPS1, AR2, COIL203, CIFAR-104, MNIST5 and ORL6. The summary of them is shown in Table 2.\nComparative Methods. We compare our algorithm with state-of-the-art feature selection approaches, including supervised model, for instance, alpha-investing (Alpha) (Zhou et al., 2005), as well as unsupervised model, e.g., λ-ridge leverage score (LevS) (Alaoui & Mahoney, 2015) and Laplacian score (LapS) (He et al., 2005). We also compare to sparse random projection (SEC) (Liu et al., 2017) which is particularly designed for k-means clustering.\nPipeline. After running our method and the baselines above, we obtain a reduced set of features. Then we feed it to the standard k-means clustering that is available in Matlab. We also report the clustering result based on the original set of features, and we simply denote it by k-means.\nResults. We report the clustering accuracy against the number of selected features in Figure 1. We can see that our algorithm achieves competitive performance with other batch methods. For example, our algorithm outperforms all the\n1https://archive.ics.uci.edu/ml/datasets. html\n2http://www2.ece.ohio-state.edu/˜aleix/ ARdatabase.html\n3http://www.cs.columbia.edu/CAVE/ software/softlib/coil-20.php\n4https://www.cs.toronto.edu/˜kriz/cifar. html\n5http://yann.lecun.com/exdb/mnist/ 6http://www.cl.cam.ac.uk/research/dtg/\nattarchive/facedatabase.html\nbaseline methods on COIL20, CIFAR-10 and ORL when the number of selected features varies from 10 to 500. The clustering performance on our selected subset even outperforms the one with all available features.\nComputational Efficiency. We illustrate the running time in Table 3. In terms of efficiency, our algorithm outperforms most of the comparative methods. This is not surprising in that for batch methods, they often update the model with all the data while we process them one by one. For example, on the CIFAR-10 data set, Laplacian score requires 2 minutes\nfor feature selection because the computation of the graph matrix based on global feature space is expensive. Our algorithm, in contrast, only requires a few seconds. The reason is that in each iteration, we operate with a skinny matrix Ã instead of the whole data matrixA."
  }, {
    "heading": "5. Conclusion",
    "text": "In this paper, we have proposed an online feature selection for k-means clustering. For features in a stream, we approx-\nimate its leverage score in an online manner and perform feature selection based on such an inexact score. We provide theoretical guarantee that our unsupervised approach produces an accurate estimation based on the original space. Moreover, in the high-dimensional regime the algorithm is computationally efficient and consumes little memory. Perhaps more importantly, our algorithm is capable of addressing streaming data which makes it a perfect fit for large-scale learning systems. In addition, we extend the analysis to the k-means clustering problem, and provably show that with the set of features reduced by our approach, we are still able to obtain a near-optimal solution to the original k-means problem. The extensive empirical study matches perfectly our analysis."
  }, {
    "heading": "Acknowledgements",
    "text": "Jing Wang, Jie Shen and Ping Li are supported by NSFBigdata-1419210 and NSF-III-1360971. Jing Wang is supported by grants from the Dalio Foundation. The work was done when Jing Wang was a postdoc at Rutgers University."
  }, {
    "heading": "A. Technical Lemmas",
    "text": "We provide a technical lemma which is due to (Tropp et al., 2011).\nLemma 4. Let Y 0,Y 1, . . . ,Y n be a matrix martingale that are self-adjoint matrices with dimension d, and let X1, . . . ,Xn be such that Xk = Y k − Y k−1 for all 1 ≤ k ≤ n. Assume\n‖Xk‖2 ≤ R, almost surely for all k.\nDefine the predictable quadratic variation process\nW k := k∑ j=1 Ej−1 [ X2j ] for all k,\nwhere Ej−1 [ X2j ]\ndenotes the expectation ofX2j conditioning onX1, · · · ,Xj−1. Then, for all > 0 and σ2 > 0,\nPr ( ‖Y n‖2 ≥ and ‖W n‖2 ≤ σ 2 )\n≤ d · exp ( − 2/2\nσ2 +R /3\n) ."
  }],
  "year": 2018,
  "references": [{
    "title": "Fast randomized kernel ridge regression with statistical guarantees",
    "authors": ["A. Alaoui", "M.W. Mahoney"],
    "venue": "In Proceedings of the 29th Annual Conference on Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Stability yields a PTAS for k-median and k-means clustering",
    "authors": ["P. Awasthi", "A. Blum", "O. Sheffet"],
    "venue": "In Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science,",
    "year": 2010
  }, {
    "title": "Unsupervised feature selection for the k-means clustering problem",
    "authors": ["C. Boutsidis", "P. Drineas", "M.W. Mahoney"],
    "venue": "In Proceedings of the 23rd Annual Conference on Neural Information Processing Systems,",
    "year": 2009
  }, {
    "title": "Randomized dimensionality reduction for k-means clustering",
    "authors": ["C. Boutsidis", "A. Zouzias", "M.W. Mahoney", "P. Drineas"],
    "venue": "IEEE Transactions on Information Theory,",
    "year": 2015
  }, {
    "title": "Unsupervised feature selection for multi-cluster data",
    "authors": ["D. Cai", "C. Zhang", "X. He"],
    "venue": "In Proceedings of the 16th ACM International Conference on Knowledge Discovery and Data Mining,",
    "year": 2010
  }, {
    "title": "Kernel feature selection via conditional covariance minimization",
    "authors": ["J. Chen", "M. Stern", "M.J. Wainwright", "M.I. Jordan"],
    "venue": "In Proceedings of the 31st Annual Conference on Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Uniform sampling for matrix approximation",
    "authors": ["M.B. Cohen", "Y.T. Lee", "C. Musco", "R. Peng", "A. Sidford"],
    "venue": "In Proceedings of the 6th Conference on Innovations in Theoretical Computer Science,",
    "year": 2015
  }, {
    "title": "Online row sampling",
    "authors": ["M.B. Cohen", "C. Musco", "J. Pachocki"],
    "venue": "In Proceedings of the 19th International Workshop on Approximation Algorithms for Combinatorial Optimization Problems,",
    "year": 2016
  }, {
    "title": "Higher criticism thresholding: Optimal feature selection when useful features are rare and weak",
    "authors": ["D. Donoho", "J. Jin"],
    "venue": "Proceedings of the National Academy of Sciences,",
    "year": 2008
  }, {
    "title": "Least angle regression",
    "authors": ["B. Efron", "T. Hastie", "I. Johnstone", "R Tibshirani"],
    "venue": "Annals of Statistics,",
    "year": 2004
  }, {
    "title": "An extensive empirical study of feature selection metrics for text classification",
    "authors": ["G. Forman"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2003
  }, {
    "title": "Revisiting the Nyström method for improved large-scale machine learning",
    "authors": ["A. Gittens", "M.W. Mahoney"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2013
  }, {
    "title": "An introduction to variable and feature selection",
    "authors": ["I. Guyon", "A. Elisseeff"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2003
  }, {
    "title": "Gene selection for cancer classification using support vector machines",
    "authors": ["I. Guyon", "J. Weston", "S. Barnhill", "V. Vapnik"],
    "venue": "Machine Learning,",
    "year": 2002
  }, {
    "title": "Laplacian score for feature selection",
    "authors": ["X. He", "D. Cai", "P. Niyogi"],
    "venue": "In Proceedings of the 19th Annual Conference on Neural Information Processing Systems,",
    "year": 2005
  }, {
    "title": "Semi-supervised feature selection for graph classification",
    "authors": ["X. Kong", "P.S. Yu"],
    "venue": "In Proceedings of the 16th ACM International Conference on Knowledge Discovery and Data Mining,",
    "year": 2010
  }, {
    "title": "Faster spectral sparsification and numerical algorithms for SDD matrices",
    "authors": ["I. Koutis", "A. Levin", "R. Peng"],
    "venue": "ACM Transactions on Algorithms,",
    "year": 2016
  }, {
    "title": "Iterative row sampling",
    "authors": ["M. Li", "G.L. Miller", "R. Peng"],
    "venue": "In Proceedings of the 54th Annual IEEE Symposium on Foundations of Computer Science,",
    "year": 2013
  }, {
    "title": "Sparse embedded k-means clustering",
    "authors": ["W. Liu", "X. Shen", "I. Tsang"],
    "venue": "In Proceedings of the 31st Annual Conference on Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Recursive sampling for the Nyström method",
    "authors": ["C. Musco"],
    "venue": "In Proceedings of the 31st Annual Conference on Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "The effectiveness of lloyd-type methods for the kmeans problem",
    "authors": ["R. Ostrovsky", "Y. Rabani", "L.J. Schulman", "C. Swamy"],
    "venue": "In Proceedings of the 47th Annual IEEE Symposium on Foundations of Computer Science,",
    "year": 2006
  }, {
    "title": "Feature selection based on mutual information criteria of max-dependency, maxrelevance, and min-redundancy",
    "authors": ["H. Peng", "F. Long", "C. Ding"],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
    "year": 2005
  }, {
    "title": "Online feature selection using grafting",
    "authors": ["S. Perkins", "J. Theiler"],
    "venue": "In Proceedings of the 20th International Conference on Machine Learning,",
    "year": 2003
  }, {
    "title": "Preconditioned data sparsification for big data with applications to PCA and k-means",
    "authors": ["F. Pourkamali-Anaraki", "S. Becker"],
    "venue": "IEEE Transactions on Information Theory,",
    "year": 2017
  }, {
    "title": "On the iteration complexity of support recovery via hard thresholding pursuit",
    "authors": ["J. Shen", "P. Li"],
    "venue": "In Proceedings of the 34th International Conference on Machine Learning,",
    "year": 2017
  }, {
    "title": "Graph sparsification by effective resistances",
    "authors": ["D.A. Spielman", "N. Srivastava"],
    "venue": "SIAM Journal on Computing,",
    "year": 1913
  }, {
    "title": "Freedman’s inequality for matrix martingales",
    "authors": ["Tropp", "J. A"],
    "venue": "Electronic Communications in Probability,",
    "year": 2011
  }, {
    "title": "Online group feature selection",
    "authors": ["J. Wang", "Zhao", "Z.-Q", "X. Hu", "Cheung", "Y.-M", "M. Wang", "X. Wu"],
    "venue": "In Proceedings of the 23rd International Joint Conference on Artificial Intelligence,",
    "year": 2013
  }, {
    "title": "Online feature selection with group structure analysis",
    "authors": ["J. Wang", "M. Wang", "P. Li", "L. Liu", "Z. Zhao", "X. Hu", "X. Wu"],
    "venue": "IEEE Transactions on Knowledge and Data Engineering,",
    "year": 2015
  }, {
    "title": "Unsupervised feature selection by preserving stochastic neighbors",
    "authors": ["X. Wei", "S.Y. Philip"],
    "venue": "In Proceedings of the 19th International Conference on Artificial Intelligence and Statistics,",
    "year": 2016
  }, {
    "title": "Online streaming feature selection",
    "authors": ["X. Wu", "K. Yu", "H. Wang", "W. Ding"],
    "venue": "In Proceedings of the 27th International Conference on Machine Learning,",
    "year": 2010
  }, {
    "title": "Gradient boosted feature selection",
    "authors": ["Z. Xu", "G. Huang", "K.Q. Weinberger", "A.X. Zheng"],
    "venue": "In Proceedings of the 20th ACM International Conference on Knowledge Discovery and Data Mining, pp",
    "year": 2014
  }, {
    "title": "A unified robust regression model for lasso-like algorithms",
    "authors": ["W. Yang", "H. Xu"],
    "venue": "In Proceedings of the 30th International Conference on Machine Learning,",
    "year": 2013
  }, {
    "title": "On the consistency of feature selection using greedy least squares regression",
    "authors": ["T. Zhang"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2009
  }, {
    "title": "On the consistency of feature selection with lasso for non-linear targets",
    "authors": ["Y. Zhang", "S. Ray", "E.W. Guo"],
    "venue": "In Proceedings of the 33rd International Conference on Machine Learning,",
    "year": 2016
  }, {
    "title": "Spectral feature selection for supervised and unsupervised learning",
    "authors": ["Z. Zhao", "H. Liu"],
    "venue": "In Proceedings of the 24th International Conference on Machine Learning,",
    "year": 2007
  }, {
    "title": "Streaming feature selection using alpha-investing",
    "authors": ["J. Zhou", "D. Foster", "R. Stine", "L. Ungar"],
    "venue": "In Proceedings of the 11st ACM International Conference on Knowledge Discovery and Data Mining, pp",
    "year": 2005
  }, {
    "title": "Semisupervised learning using gaussian fields and harmonic functions",
    "authors": ["X. Zhu", "Z. Ghahramani", "J.D. Lafferty"],
    "venue": "In Proceedings of the 20th International Conference on Machine Learning,",
    "year": 2003
  }],
  "id": "SP:577d9bb32df3b9d9b327663ff91fd6805ced821b",
  "authors": [{
    "name": "Jing Wang",
    "affiliations": []
  }, {
    "name": "Jie Shen",
    "affiliations": []
  }, {
    "name": "Ping Li",
    "affiliations": []
  }],
  "abstractText": "In large-scale machine learning applications and high-dimensional statistics, it is ubiquitous to address a considerable number of features among which many are redundant. As a remedy, online feature selection has attracted increasing attention in recent years. It sequentially reveals features and evaluates the importance of them. Though online feature selection has proven an elegant methodology, it is usually challenging to carry out a rigorous theoretical characterization. In this work, we propose a provable online feature selection algorithm that utilizes the online leverage score. The selected features are then fed to k-means clustering, making the clustering step memory and computationally efficient. We prove that with high probability, performing k-means clustering based on the selected feature space does not deviate far from the optimal clustering using the original data. The empirical results on realworld data sets demonstrate the effectiveness of our algorithm.",
  "title": "Provable Variable Selection for Streaming Features"
}