{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 152–161 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n152"
  }, {
    "heading": "1 Introduction",
    "text": "The exponentially growing online information has necessitated the development of effective automatic summarization systems. In this paper, we focus on an increasingly intriguing task, i.e., abstractive sentence summarization (Rush et al., 2015a), which generates a shorter version of a given sentence while attempting to preserve its original meaning. It can be used to design or refine appealing headlines. Recently, the application of the attentional sequence-to-sequence (seq2seq) framework has attracted growing attention and achieved state-of-the-art performance on this task (Rush et al., 2015a; Chopra et al., 2016; Nallapati et al., 2016).\nMost previous seq2seq models purely depend on the source text to generate summaries. However, as reported in many studies (Koehn and Knowles, 2017), the performance of a seq2seq model deteriorates quickly with the increase of the length of generation. Our experiments also show that seq2seq models tend to “lose control” sometimes. For example, 3% of summaries contain less than 3 words, while there are 4 summaries repeating a word for even 99 times. These results largely reduce the informativeness and readability of the generated summaries. In addition, we find seq2seq models usually focus on copying source words in order, without any actual “summarization”. Therefore, we argue that, the free generation based on the source sentence is not enough for a seq2seq model.\nTemplate based summarization (e.g., Zhou and Hovy (2004)) is a traditional approach to abstractive summarization. In general, a template is an incomplete sentence which can be filled with the input text using the manually defined rules. For instance, a concise template to conclude the stock market quotation is: [REGION] shares [open/close] [NUMBER] percent [lower/higher], e.g., “hong kong shares close #.# percent lower”. Since the templates are written by humans, the produced summaries are usually fluent and informative. However, the construction of templates is extremely time-consuming and requires a plenty of domain knowledge. Moreover, it is impossible to develop all templates for summaries in various domains.\nInspired by retrieve-based conversation systems (Ji et al., 2014), we assume the golden summaries of the similar sentences can provide a reference point to guide the input sentence summarization process. We call these existing summaries soft templates since no actual rules are nee-\nded to build new summaries from them. Due to the strong rewriting ability of the seq2seq framework (Cao et al., 2017a), in this paper, we propose to combine the seq2seq and template based summarization approaches. We call our summarization system Re3Sum, which consists of three modules: Retrieve, Rerank and Rewrite. We utilize a widely-used Information Retrieval (IR) platform to find out candidate soft templates from the training corpus. Then, we extend the seq2seq model to jointly learn template saliency measurement (Rerank) and final summary generation (Rewrite). Specifically, a Recurrent Neural Network (RNN) encoder is applied to convert the input sentence and each candidate template into hidden states. In Rerank, we measure the informativeness of a candidate template according to its hidden state relevance to the input sentence. The candidate template with the highest predicted informativeness is regarded as the actual soft template. In Rewrite, the summary is generated according to the hidden states of both the sentence and template.\nWe conduct extensive experiments on the popular Gigaword dataset (Rush et al., 2015b). Experiments show that, in terms of informativeness, Re3Sum significantly outperforms the state-ofthe-art seq2seq models, and even soft templates themselves demonstrate high competitiveness. In addition, the import of high-quality external summaries improves the stability and readability of generated summaries.\nThe contributions of this work are summarized as follows:\n• We propose to introduce soft templates as additional input to improve the readability and stability of seq2seq summarization systems. Code and results can be found at http://www4.comp.polyu. edu.hk/˜cszqcao/\n• We extend the seq2seq framework to conduct template reranking and template-aware summary generation simultaneously.\n• We fuse the popular IR-based and seq2seqbased summarization systems, which fully utilize the supervisions from both sides."
  }, {
    "heading": "2 Method",
    "text": "As shown in Fig. 1, our summarization system consists of three modules, i.e., Retrieve, Rerank\nand Rewrite. Given the input sentence x, the Retrieve module filters candidate soft templates C = {ri} from the training corpus. For validation and test, we regard the candidate template with the highest predicted saliency (a.k.a informativeness) score as the actual soft template r. For training, we choose the one with the maximal actual saliency score in C, which speeds up convergence and shows no obvious side effect in the experiments.\nThen, we jointly conduct reranking and rewriting through a shared encoder. Specifically, both the sentence x and the soft template r are converted into hidden states with a RNN encoder. In the Rerank module, we measure the saliency of r according to its hidden state relevance to x. In the Rewrite module, a RNN decoder combines the hidden states of x and r to generate a summary y. More details will be described in the rest of this section"
  }, {
    "heading": "2.1 Retrieve",
    "text": "The purpose of this module is to find out candidate templates from the training corpus. We assume that similar sentences should hold similar summary patterns. Therefore, given a sentence x, we find out its analogies in the corpus and pick their summaries as the candidate templates. Since the size of our dataset is quite large (over 3M), we leverage the widely-used Information Retrieve (IR) system Lucene1 to index and search efficiently. We keep the default settings of Lucene2 to build the IR system. For each input sentence, we select top 30 searching results as candidate templates."
  }, {
    "heading": "2.2 Jointly Rerank and Rewrite",
    "text": "To conduct template-aware seq2seq generation (rewriting), it is a necessary step to encode both the source sentence x and soft template r into hidden states. Considering that the matching networks based on hidden states have demonstrated the strong ability to measure the relevance of two pieces of texts (e.g., Chen et al. (2016)), we propose to jointly conduct reranking and rewriting through a shared encoding step. Specifically, we employ a bidirectional Recurrent Neural Network (BiRNN) encoder (Cho et al., 2014) to read x and r. Take the sentence x as an example. Its hidden state of the forward RNN at timestamp i can be\n1https://lucene.apache.org/ 2TextField with EnglishAnalyzer\nrepresented by:\n−→ h xi = RNN(xi, −→ h xi−1) (1)\nThe BiRNN consists of a forward RNN and a backward RNN. Suppose the corresponding outputs are [ −→ h x1 ; · · · ; −→ h x−1] and [ ←− h x1 ; · · · ; ←− h x−1], respectively, where the index “−1” stands for the last element. Then, the composite hidden state of a word is the concatenation of the two RNN representations, i.e., hxi = [ −→ h xi ; ←− h xi ]. The entire representation for the source sentence is [hx1 ; · · · ;hx−1]. Since a soft template r can also be regarded as a readable concise sentence, we use the same BiRNN encoder to convert it into hidden states [hr1; · · · ;hr−1]."
  }, {
    "heading": "2.2.1 Rerank",
    "text": "In Retrieve, the template candidates are ranked according to the text similarity between the corresponding indexed sentences and the input sentence. However, for the summarization task, we expect the soft template r resembles the actual summary y∗ as much as possible. Here we use the widely-used summarization evaluation metrics ROUGE (Lin, 2004) to measure the actual saliency s∗(r,y∗) (see Section 3.2). We utilize the hidden states of x and r to predict the saliency s of the template. Specifically, we regard the output of the BiRNN as the representation of the sentence or template:\nhx = [ ←− h x1 ; −→ h x−1] (2) hr = [ ←− h r1; −→ h r−1] (3)\nNext, we use Bilinear network to predict the saliency of the template for the input sentence.\ns(r,x) = sigmoid(hrWshTx + bs), (4)\nwhere Ws and bs are parameters of the Bilinear network, and we add the sigmoid activation function to make the range of s consistent with the actual saliency s∗. According to Chen et al. (2016), Bilinear outperforms multi-layer forward\nneural networks in relevance measurement. As shown later, the difference of s and s∗ will provide additional supervisions for the seq2seq framework."
  }, {
    "heading": "2.2.2 Rewrite",
    "text": "The soft template r selected by the Rerank module has already competed with the state-of-the-art method in terms of ROUGE evaluation (see Table 4). However, r usually contains a lot of named entities that does not appear in the source (see Table 5). Consequently, it is hard to ensure that the soft templates are faithful to the input sentences. Therefore, we leverage the strong rewriting ability of the seq2seq model to generate more faithful and informative summaries. Specifically, since the input of our system consists of both the sentence and soft template, we use the concatenation function3 to combine the hidden states of the sentence and template:\nHc = [h x 1 ; · · · ;hx−1;hr1; · · · ;hr−1] (5)\nThe combined hidden states are fed into the prevailing attentional RNN decoder (Bahdanau et al., 2014) to generate the decoding hidden state at the position t:\nst = Att-RNN(st−1, yt−1,Hc), (6)\nwhere yt−1 is the previous output summary word. Finally, a softmax layer is introduced to predict the current summary word:\not = softmax(stWo), (7)\nwhere Wo is a parameter matrix."
  }, {
    "heading": "2.3 Learning",
    "text": "There are two types of costs in our system. For Rerank, we expect the predicted saliency s(r,x) close to the actual saliency s∗(r,y∗). Therefore,\n3We also attempted complex combination approaches such as the gate network Cao et al. (2017b) but failed to achieve obvious improvement. We assume the Rerank module has partially played the role of the gate network.\nwe use the cross entropy (CE) between s and s∗ as the loss function:\nJR(θ) = CE(s(r,x), s ∗(r,y∗)) (8)\n= −s∗ log s− (1− s∗) log(1− s),\nwhere θ stands for the model parameters. For Rewrite, the learning goal is to maximize the estimated probability of the actual summary y∗. We adopt the common negative log-likelihood (NLL) as the loss function:\nJG(θ) = − log(p(y∗|x, r)) (9) = − ∑\nt log(ot[y\n∗ t ])\nTo make full use of supervisions from both sides, we combine the above two costs as the final loss function:\nJ(θ) = JR(θ) + JG(θ) (10)\nWe use mini-batch Stochastic Gradient Descent (SGD) to tune model parameters. The batch size is 64. To enhance generalization, we introduce dropout (Srivastava et al., 2014) with probability p = 0.3 for the RNN layers. The initial learning rate is 1, and it will decay by 50% if the generation loss does not decrease on the validation set."
  }, {
    "heading": "3 Experiments",
    "text": ""
  }, {
    "heading": "3.1 Datasets",
    "text": "We conduct experiments on the Annotated English Gigaword corpus, as with (Rush et al., 2015b). This parallel corpus is produced by pairing the first sentence in the news article and its headline as the summary with heuristic rules. All the training, development and test datasets can be downloaded at https://github. com/harvardnlp/sent-summary. The statistics of the Gigaword corpus is presented in Table 1."
  }, {
    "heading": "3.2 Evaluation Metrics",
    "text": "We adopt ROUGE (Lin, 2004) for automatic evaluation. ROUGE has been the standard evaluation metric for DUC shared tasks since 2004. It measures the quality of summary by computing the overlapping lexical units between the candidate summary and actual summaries, such as unigram, bi-gram and longest common subsequence (LCS). Following the common practice, we report ROUGE-1 (uni-gram), ROUGE-2 (bi-gram) and ROUGE-L (LCS) F1 scores4 in the following experiments. We also measure the actual saliency of a candidate template r with its combined ROUGE scores given the actual summary y∗:\ns∗(r,y∗) = RG(r,y∗) + RG(r,y∗), (11)\nwhere “RG” stands for ROUGE for short. ROUGE mainly evaluates informativeness. We also introduce a series of metrics to measure the summary quality from the following aspects: LEN DIF The absolute value of the length diffe-\nrence between the generated summaries and the actual summaries. We use mean value ± standard deviation to illustrate this item. The average value partially reflects the readability and informativeness, while the standard deviation links to stability.\n4We use the ROUGE evaluation option: -m -n 2 -w 1.2\nLESS 3 The number of the generated summaries, which contains less than three tokens. These extremely short summaries are usually unreadable. COPY The proportion of the summary words (without stopwords) copied from the source sentence. A seriously large copy ratio indicates that the summarization system pays more attention to compression rather than required abstraction. NEW NE The number of the named entities that do not appear in the source sentence or actual summary. Intuitively, the appearance of new named entities in the summary is likely to bring unfaithfulness. We use Stanford CoreNLP (Manning et al., 2014) to recognize named entities."
  }, {
    "heading": "3.3 Implementation Details",
    "text": "We use the popular seq2seq framework OpenNMT5 as the starting point. To make our model more general, we retain the default settings of OpenNMT to build the network architecture. Specifically, the dimensions of word embeddings and RNN are both 500, and the encoder and decoder structures are two-layer bidirectional Long Short Term Memory Networks (LSTMs). The only difference is that we add the argument “- share embeddings” to share the word embeddings between the encoder and decoder. This practice largely reduces model parameters for the monolingual task. On our computer (GPU: GTX 1080, Memory: 16G, CPU: i7-7700K), the training spends about 2 days.\nDuring test, we use beam search of size 5 to generate summaries. We add the argument “- replace unk” to replace the generated unknown words with the source word that holds the highest attention weight. Since the generated summaries are often shorter than the actual ones, we introduce an additional length penalty argument “- alpha 1” to encourage longer generation, like Wu et al. (2016)."
  }, {
    "heading": "3.4 Baselines",
    "text": "We compare our proposed model with the following state-of-the-art neural summarization systems: ABS Rush et al. (2015a) used an attentive CNN\nencoder and a NNLM decoder to summarize 5https://github.com/OpenNMT/OpenNMT-py\nthe sentence. ABS+ Rush et al. (2015a) further tuned the ABS\nmodel with additional hand-crafted features to balance between abstraction and extraction.\nRAS-Elman As the extension of the ABS model, it used a convolutional attention-based encoder and a RNN decoder (Chopra et al., 2016). Featseq2seq Nallapati et al. (2016) used a complete seq2seq RNN model and added the hand-crafted features such as POS tag and NER, to enhance the encoder representation. Luong-NMT Chopra et al. (2016) implemented the neural machine translation model of Luong et al. (2015) for summarization. This model contained two-layer LSTMs with 500 hidden units in each layer. OpenNMT We also implement the standard attentional seq2seq model with OpenNMT. All the settings are the same as our system. It is noted that OpenNMT officially examined the Gigaword dataset. We distinguish the official result6 and our experimental result with suffixes “O” and “I” respectively. FTSum Cao et al. (2017b) encoded the facts extracted from the source sentence to improve both the faithfulness and informativeness of generated summaries.\nIn addition, to evaluate the effectiveness of our joint learning framework, we develop a baseline named “PIPELINE”. Its architecture is identical to Re3Sum. However, it trains the Rerank module and Rewrite module in pipeline."
  }, {
    "heading": "3.5 Informativeness Evaluation",
    "text": "Let’s first look at the final cost values (Eq. 9) on the development set. From Table 2, we can\n6http://opennmt.net/Models/\nsee that our model achieves much lower perplexity compared against the state-of-the-art systems. It is also noted that PIPELINE slightly outperforms Re3Sum. One possible reason is that Re3Sum additionally considers the cost derived from the Rerank module.\nThe ROUGE F1 scores of different methods are then reported in Table 3. As can be seen, our model significantly outperforms most other approaches. Note that, ABS+ and Featseq2seq have utilized a series of hand-crafted features, but our model is completely data-driven. Even though, our model surpasses Featseq2seq by 22% and ABS+ by 60% on ROUGE-2. When soft templates are ignored, our model is equivalent to the standard at-\ntentional seq2seq model OpenNMTI . Therefore, it is safe to conclude that soft templates have great contribute to guide the generation of summaries.\nWe also examine the performance of directly regarding soft templates as output summaries. We introduce five types of different soft templates: Random An existing summary randomly selected from the training corpus. First The top-ranked candidate template given by the Retrieve module. Max The template with the maximal actual\nROUGE scores among the 30 candidate templates.\nOptimal An existing summary in the training corpus which holds the maximal ROUGE scores. Rerank The template with the maximal predicted ROUGE scores among the 30 candidate templates. It is the actual soft template we adopt.\nAs shown in Table 4, the performance of Random is terrible, indicating it is impossible to use one summary template to fit various actual summaries. Rerank largely outperforms First, which verifies the effectiveness of the Rerank module. However, according to Max and Rerank, we find the Rerank performance of Re3Sum is far from perfect. Likewise, comparing Max and First, we observe that the improving capacity of the Retrieve module is high. Notice that Optimal greatly exceeds all the state-of-the-art approaches. This finding strongly supports our practice of using existing summaries to guide the seq2seq models."
  }, {
    "heading": "3.6 Linguistic Quality Evaluation",
    "text": "We also measure the linguistic quality of generated summaries from various aspects, and the results are present in Table 5. As can be seen from the rows “LEN DIF” and “LESS 3”, the performance of Re3Sum is almost the same as that of soft templates. The soft templates indeed well guide the summary generation. Compared with\nRe3Sum, the standard deviation of LEN DF is 0.7 times larger in OpenNMT, indicating that OpenNMT works quite unstably. Moreover, OpenNMT generates 53 extreme short summaries, which seriously reduces readability. Meanwhile, the copy ratio of actual summaries is 36%. Therefore, the copy mechanism is severely overweighted in OpenNMT. Our model is encouraged to generate according to human-written soft templates, which relatively diminishes copying from the source sentences. Look at the last row “NEW NE”. A number of new named entities appear in the soft templates, which makes them quite unfaithful to source sentences. By contrast, this index in Re3Sum is close to the OpenNMT’s. It highlights the rewriting ability of our seq2seq framework."
  }, {
    "heading": "3.7 Effect of Templates",
    "text": "In this section, we investigate how soft templates affect our model. At the beginning, we feed different types of soft templates (refer to Table 4) into the Rewriting module of Re3Sum. As illustrated in Table 6, the more high-quality templates are provided, the higher ROUGE scores are achieved. It is interesting to see that,while the ROUGE-2 score of Random templates is zero, our model can still generate acceptable summaries with Random templates. It seems that Re3Sum can automatically judge whether the soft templates are trustworthy and ignore the seriously irrelevant ones. We believe that the joint learning with the Rerank model plays a vital role here.\nNext, we manually inspect the summaries generated by different methods. We find the outputs of Re3Sum are usually longer and more flu-\nent than the outputs of OpenNMT. Some illustrative examples are shown in Table 7. In Example 1, there is no predicate in the source sentence. Since OpenNMT prefers selecting source words around the predicate to form the summary, it fails on this sentence. By contract, Re3Sum rewrites the template and produces an informative summary. In Example 2, OpenNMT deems the starting part of the sentences are more important, while our model, guided by the template, focuses on the second part to generate the summary.\nIn the end, we test the ability of our model to generate diverse summaries. In practice, a system that can provide various candidate summaries is probably more welcome. Specifically, two candidate templates with large text dissimilarity are manually fed into the Rewriting module. The corresponding generated summaries are shown in Table 8. For the sake of comparison, we also present the 2-best results of OpenNMT with beam search. As can be seen, with different templates given, our model is likely to generate dissimilar summaries. In contrast, the 2-best results of OpenNMT is almost the same, and often a shorter summary is only a piece of the other one. To sum up, our model demonstrates promising prospect in generation diversity."
  }, {
    "heading": "4 Related Work",
    "text": "Abstractive sentence summarization aims to produce a shorter version of a given sentence while preserving its meaning (Chopra et al., 2016). This task is similar to text simplification (Saggion, 2017) and facilitates headline design and refine. Early studies on sentence summariza-\ntion include template-based methods (Zhou and Hovy, 2004), syntactic tree pruning (Knight and Marcu, 2002; Clarke and Lapata, 2008) and statistical machine translation techniques (Banko et al., 2000). Recently, the application of the attentional seq2seq framework has attracted growing attention and achieved state-of-the-art performance on this task (Rush et al., 2015a; Chopra et al., 2016; Nallapati et al., 2016).\nIn addition to the direct application of the general seq2seq framework, researchers attempted to integrate various properties of summarization. For example, Nallapati et al. (2016) enriched the encoder with hand-crafted features such as named entities and POS tags. These features have played important roles in traditional feature based summarization systems. Gu et al. (2016) found that a large proportion of the words in the summary were copied from the source text. Therefore, they proposed CopyNet which considered the copying mechanism during generation. Recently, See et al. (2017) used the coverage mechanism to discourage repetition. Cao et al. (2017b) encoded facts extracted from the source sentence to enhance the summary faithfulness. There were also studies to modify the loss function to fit the evaluation metrics. For instance, Ayana et al. (2016) applied the Minimum Risk Training strategy to maximize the ROUGE scores of generated sum-\nmaries. Paulus et al. (2017) used the reinforcement learning algorithm to optimize a mixed objective function of likelihood and ROUGE scores.\nGuu et al. (2017) also proposed to encode human-written sentences to improvement the performance of neural text generation. However, they handled the task of Language Modeling and randomly picked an existing sentence in the training corpus. In comparison, we develop an IR system to find proper existing summaries as soft templates. Moreover, Guu et al. (2017) used a general seq2seq framework while we extend the seq2seq framework to conduct template reranking and template-aware summary generation simultaneously."
  }, {
    "heading": "5 Conclusion and Future Work",
    "text": "This paper proposes to introduce soft templates as additional input to guide the seq2seq summarization. We use the popular IR platform Lucene to retrieve proper existing summaries as candidate soft templates. Then we extend the seq2seq framework to jointly conduct template reranking and template-aware summary generation. Experiments show that our model can generate informative, readable and stable summaries. In addition, our model demonstrates promising prospect in generation diversity.\nWe believe our work can be extended in vari-\nous aspects. On the one hand, since the candidate templates are far inferior to the optimal ones, we intend to improve the Retrieve module, e.g., by indexing both the sentence and summary fields. On the other hand, we plan to test our system on the other tasks such as document-level summarization and short text conversation.\nAcknowledgments\nThe work described in this paper was supported by Research Grants Council of Hong Kong (PolyU 152036/17E), National Natural Science Foundation of China (61672445 and 61572049) and The Hong Kong Polytechnic University (G-YBP6, 4- BCDV)."
  }],
  "year": 2018,
  "references": [{
    "title": "Neural headline generation with minimum risk training",
    "authors": ["Shiqi Shen Ayana", "Zhiyuan Liu", "Maosong Sun."],
    "venue": "arXiv preprint arXiv:1604.01904.",
    "year": 2016
  }, {
    "title": "Neural machine translation by jointly learning to align and translate",
    "authors": ["Dzmitry Bahdanau", "Kyunghyun Cho", "Yoshua Bengio."],
    "venue": "arXiv preprint arXiv:1409.0473.",
    "year": 2014
  }, {
    "title": "Headline generation based on statistical translation",
    "authors": ["Michele Banko", "Vibhu O Mittal", "Michael J Witbrock."],
    "venue": "Proceedings of the 38th Annual Meeting on Association for Computational Linguistics, pages 318–325. Association for Computational",
    "year": 2000
  }, {
    "title": "Joint copying and restricted generation for paraphrase",
    "authors": ["Ziqiang Cao", "Chuwei Luo", "Wenjie Li", "Sujian Li."],
    "venue": "AAAI, pages 3152–3158.",
    "year": 2017
  }, {
    "title": "Faithful to the original: Fact aware neural abstractive summarization",
    "authors": ["Ziqiang Cao", "Furu Wei", "Wenjie Li", "Sujian Li."],
    "venue": "arXiv preprint arXiv:1711.04434.",
    "year": 2017
  }, {
    "title": "A thorough examination of the cnn/daily mail reading comprehension task",
    "authors": ["Danqi Chen", "Jason Bolton", "Christopher D Manning."],
    "venue": "arXiv preprint arXiv:1606.02858.",
    "year": 2016
  }, {
    "title": "Learning phrase representations using rnn encoder-decoder for statistical machine translation",
    "authors": ["Kyunghyun Cho", "Bart Van Merriënboer", "Caglar Gulcehre", "Dzmitry Bahdanau", "Fethi Bougares", "Holger Schwenk", "Yoshua Bengio."],
    "venue": "arXiv preprint",
    "year": 2014
  }, {
    "title": "Abstractive sentence summarization with attentive recurrent neural networks",
    "authors": ["Sumit Chopra", "Michael Auli", "Alexander M Rush", "SEAS Harvard."],
    "venue": "Proceedings of NAACL-HLT16, pages 93–98.",
    "year": 2016
  }, {
    "title": "Global inference for sentence compression: An integer linear programming approach",
    "authors": ["James Clarke", "Mirella Lapata."],
    "venue": "Journal of Artificial Intelligence Research, 31:399–429.",
    "year": 2008
  }, {
    "title": "Incorporating copying mechanism in sequence-to-sequence learning",
    "authors": ["Jiatao Gu", "Zhengdong Lu", "Hang Li", "Victor OK Li."],
    "venue": "arXiv preprint arXiv:1603.06393.",
    "year": 2016
  }, {
    "title": "Generating sentences by editing prototypes",
    "authors": ["Kelvin Guu", "Tatsunori B Hashimoto", "Yonatan Oren", "Percy Liang."],
    "venue": "arXiv preprint arXiv:1709.08878.",
    "year": 2017
  }, {
    "title": "An information retrieval approach to short text conversation",
    "authors": ["Zongcheng Ji", "Zhengdong Lu", "Hang Li."],
    "venue": "arXiv preprint arXiv:1408.6988.",
    "year": 2014
  }, {
    "title": "Summarization beyond sentence extraction: A probabilistic approach to sentence compression",
    "authors": ["Kevin Knight", "Daniel Marcu."],
    "venue": "Artificial Intelligence, 139(1):91–107.",
    "year": 2002
  }, {
    "title": "Six challenges for neural machine translation",
    "authors": ["Philipp Koehn", "Rebecca Knowles."],
    "venue": "arXiv preprint arXiv:1706.03872.",
    "year": 2017
  }, {
    "title": "Rouge: A package for automatic evaluation of summaries",
    "authors": ["Chin-Yew Lin."],
    "venue": "Proceedings of the ACL Workshop, pages 74–81.",
    "year": 2004
  }, {
    "title": "Effective approaches to attentionbased neural machine translation",
    "authors": ["Minh-Thang Luong", "Hieu Pham", "Christopher D Manning."],
    "venue": "arXiv preprint arXiv:1508.04025.",
    "year": 2015
  }, {
    "title": "The Stanford CoreNLP natural language processing toolkit",
    "authors": ["Christopher D. Manning", "Mihai Surdeanu", "John Bauer", "Jenny Finkel", "Steven J. Bethard", "David McClosky."],
    "venue": "Proceedings of ACL: System Demonstrations, pages 55–60.",
    "year": 2014
  }, {
    "title": "Abstractive text summarization using sequence-to-sequence rnns and beyond",
    "authors": ["Ramesh Nallapati", "Bowen Zhou", "Caglar Gulcehre", "Bing Xiang"],
    "venue": "arXiv preprint arXiv:1602.06023",
    "year": 2016
  }, {
    "title": "A deep reinforced model for abstractive summarization",
    "authors": ["Romain Paulus", "Caiming Xiong", "Richard Socher."],
    "venue": "arXiv preprint arXiv:1705.04304.",
    "year": 2017
  }, {
    "title": "A neural attention model for abstractive sentence summarization",
    "authors": ["Alexander M Rush", "Sumit Chopra", "Jason Weston."],
    "venue": "arXiv preprint arXiv:1509.00685.",
    "year": 2015
  }, {
    "title": "A neural attention model for abstractive sentence summarization",
    "authors": ["Alexander M. Rush", "Sumit Chopra", "Jason Weston."],
    "venue": "Proceedings of EMNLP, pages 379–389.",
    "year": 2015
  }, {
    "title": "Automatic text simplification",
    "authors": ["Horacio Saggion."],
    "venue": "Synthesis Lectures on Human Language Technologies, 10(1):1–137.",
    "year": 2017
  }, {
    "title": "Get to the point: Summarization with pointer-generator networks",
    "authors": ["Abigail See", "Peter J Liu", "Christopher D Manning."],
    "venue": "arXiv preprint arXiv:1704.04368.",
    "year": 2017
  }, {
    "title": "Dropout: a simple way to prevent neural networks from overfitting",
    "authors": ["Nitish Srivastava", "Geoffrey E Hinton", "Alex Krizhevsky", "Ilya Sutskever", "Ruslan Salakhutdinov."],
    "venue": "Journal of Machine Learning Research, 15(1):1929–1958.",
    "year": 2014
  }, {
    "title": "Template-filtered headline summarization",
    "authors": ["Liang Zhou", "Eduard Hovy."],
    "venue": "Text Summarization Branches Out.",
    "year": 2004
  }],
  "id": "SP:c93b8518204ef722f4c749628023c6d5d061a5fa",
  "authors": [{
    "name": "Ziqiang Cao",
    "affiliations": []
  }, {
    "name": "Wenjie Li",
    "affiliations": []
  }, {
    "name": "Furu Wei",
    "affiliations": []
  }, {
    "name": "Sujian Li",
    "affiliations": []
  }],
  "abstractText": "Most previous seq2seq summarization systems purely depend on the source text to generate summaries, which tends to work unstably. Inspired by the traditional template-based summarization approaches, this paper proposes to use existing summaries as soft templates to guide the seq2seq model. To this end, we use a popular IR platform to Retrieve proper summaries as candidate templates. Then, we extend the seq2seq framework to jointly conduct template Reranking and templateaware summary generation (Rewriting). Experiments show that, in terms of informativeness, our model significantly outperforms the state-of-the-art methods, and even soft templates themselves demonstrate high competitiveness. In addition, the import of high-quality external summaries improves the stability and readability of generated summaries.",
  "title": "Retrieve, Rerank and Rewrite: Soft Template Based Neural Summarization"
}