{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 2009–2019 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n2009"
  }, {
    "heading": "1 Introduction",
    "text": "User geolocation, the task of identifying the “home” location of a user, is an integral component of many applications ranging from public health monitoring (Paul and Dredze, 2011; Chon et al., 2015; Yepes et al., 2015) and regional studies of sentiment, to real-time emergency awareness systems (De Longueville et al., 2009; Sakaki et al., 2010), which use social media as an implicit information resource about people.\nSocial media services such as Twitter rely on IP addresses, WiFi footprints, and GPS data to geolocate users. Third-party service providers don’t have easy access to such information, and have to rely on public sources of geolocation information such as the profile location field, which is noisy and difficult to map to a location (Hecht et al., 2011), or geotagged tweets, which are publicly available for only 1% of tweets (Cheng et al., 2010; Morstatter et al., 2013). The scarcity of publicly available\nlocation information motivates predictive user geolocation from information such as tweet text and social interaction data.\nMost previous work on user geolocation takes the form of either supervised text-based approaches (Wing and Baldridge, 2011; Han et al., 2012) relying on the geographical variation of language use, or graph-based semi-supervised label propagation relying on location homophily in user–user interactions (Davis Jr et al., 2011; Jurgens, 2013).\nBoth text and network views are critical in geolocating users. Some users post a lot of local content, but their social network is lacking or is not representative of their location; for them, text is the dominant view for geolocation. Other users have many local social interactions, and mostly use social media to read other people’s comments, and for interacting with friends. Single-view learning would fail to accurately geolocate these users if the more information-rich view is not present. There has been some work that uses both the text and network views, but it either completely ignores unlabelled data (Li et al., 2012a; Miura et al., 2017), or just uses unlabelled data in the network view (Rahimi et al., 2015b; Do et al., 2017). Given that the 1% of geotagged tweets is often used for supervision, it is crucial for geolocation models to be able to leverage unlabelled data, and to perform well under a minimal supervision scenario.\nIn this paper, we propose GCN, an end-to-end user geolocation model based on Graph Convolutional Networks (Kipf and Welling, 2017) that jointly learns from text and network information to classify a user timeline into a location. Our contributions are: (1) we evaluate our model under a minimal supervision scenario which is close to real world applications and show that GCN outperforms two strong baselines; (2) given sufficient supervision, we show that GCN is competitive, although the much simpler MLP-TXT+NET outper-\nforms state-of-the-art models; and (3) we show that highway gates play a significant role in controlling the amount of useful neighbourhood smoothing in GCN.1"
  }, {
    "heading": "2 Model",
    "text": "We propose a transductive multiview geolocation model, GCN, using Graph Convolutional Networks (“GCN”: Kipf and Welling (2017)). We also introduce two multiview baselines: MLP-TXT+NET based on concatenation of text and network, and DCCA based on Deep Canonical Correlation Analysis (Andrew et al., 2013)."
  }, {
    "heading": "2.1 Multivew Geolocation",
    "text": "Let X ∈ R|U |×|V | be the text view, consisting of the bag of words for each user in U using vocabulary V , and A ∈ 1|U |×|U | be the network view, encoding user–user interactions. We partition U = US ∪ UH into a supervised and heldout (unlabelled) set, US and UH , respectively. The goal is to infer the location of unlabelled samples YU , given the location of labelled samples YS , where each location is encoded as a one-hot classification label, yi ∈ 1c with c being the number of target regions.\n2.2 GCN GCN defines a neural network model f(X,A) with each layer:\nÂ = D̃− 1 2 (A+ λI)D̃− 1 2 H(l+1) = σ ( ÂH(l)W (l) + b ) ,\n(1)\nwhere D̃ is the degree matrix of A + λI; hyperparameter λ controls the weight of a node against its neighbourhood, which is set to 1 in the original model (Kipf and Welling, 2017); H0 = X and the din × dout matrix W (l) and dout × 1 matrix b are trainable layer parameters; and σ is an arbitrary nonlinearity. The first layer takes an average of each sample and its immediate neighbours (labelled and unlabelled) using weights in Â, and performs a linear transformation using W and b followed by a nonlinear activation function (σ). In other words, for user ui, the output of layer l is computed by:\n~hl+1i = σ (∑ j∈nhood(i) Âij~h l jW l + bl ) , (2)\n1Code and data available at https://github.com/ afshinrahimi/geographconv\nHighway GCN:\nHighway GCN: ,\nOutput GCN:\nX = BoWtext\nÂ\nÂ\nÂ tanh\ntanh\nsoftmax\nH0\nH1\nHl−1\nHl\npredict location: ŷ\nW l−1, bl−1, W l−1h , b l−1 h\nW 1, b1, W 1h , b 1 h\nW l, bl\nFigure 1: The architecture of GCN geolocation model with layer-wise highway gates (W ih, b i h). GCN is applied to a BoW model of user content over the @-mention graph to predict user location.\nwhere W l and bl are learnable layer parameters, and nhood(i) indicates the neighbours of user ui. Each extra layer in GCN extends the neighbourhood over which a sample is smoothed. For example a GCN with 3 layers smooths each sample with its neighbours up to 3 hops away, which is beneficial if location homophily extends to a neighbourhood of this size."
  }, {
    "heading": "2.2.1 Highway GCN",
    "text": "Expanding the neighbourhood for label propagation by adding multiple GCN layers can improve geolocation by accessing information from friends that are multiple hops away, but it might also lead to propagation of noisy information to users from an exponentially increasing number of expanded neighbourhood members. To control the required balance of how much neighbourhood information should be passed to a node, we use layer-wise gates similar to highway networks. In highway networks (Srivastava et al., 2015), the output of a layer is summed with its input with gating weights T (~hl):\nT (~hl) = σ ( W lt ~hl + blt ) ~hl+1 = ~hl+1 ◦ T (~hl) + ~hl ◦ (1− T (~hl)) , (3)\nwhere ~hl is the incoming input to layer l + 1, (W lt , b l t) are gating weights and bias variables, ◦ is elementwise multiplication, and σ is the Sigmoid function.\n2.3 DCCA Given two views X and Â (from Equation 1) of data samples, CCA (Hotelling, 1936), and its deep version (DCCA) (Andrew et al., 2013) learn functions f1(X) and f2(Â) such that the correlation between the output of the two functions is maximised:\nρ = corr(f1(X), f2(Â)) . (4)\nThe resulting representations of f1(X) and f2(Â) are the compressed representations of the two views where the uncorrelated noise between them is reduced. The new representations ideally represent user communities for the network view, and the language model of that community for the text view, and their concatenation is a multiview representation of data, which can be used as input for other tasks.\nIn DCCA, the two views are first projected to a lower dimensionality using a separate multilayer perceptron for each view (the f1 and f2 functions of Equation 4), the output of which is used to estimate the CCA cost:\nmaximise: tr(W T1 Σ12W2) subject to: W T1 Σ11W1 = W T 2 Σ22W2 = I (5)\nwhere Σ11 and Σ22 are the covariances of the two outputs, and Σ12 is the cross-covariance. The weights W1 and W2 are the linear projections of the MLP outputs, which are used in estimating the CCA cost. The optimisation problem is solved by SVD, and the error is backpropagated to train the parameters of the two MLPs and the final linear projections. After training, the two networks are used to predict new projections for unseen data. The two projections of unseen data — the outputs of the two networks — are then concatenated to form a multiview sample representation, as shown in Figure 2."
  }, {
    "heading": "3 Experiments",
    "text": ""
  }, {
    "heading": "3.1 Data",
    "text": "We use three existing Twitter user geolocation datasets: (1) GEOTEXT (Eisenstein et al., 2010), (2) TWITTER-US (Roller et al., 2012), and (3) TWITTER-WORLD (Han et al., 2012). These datasets have been used widely for training and evaluation of geolocation models. They are all pre-partitioned into training, development and test\nsets. Each user is represented by the concatenation of their tweets, and labelled with the latitude/longitude of the first collected geotagged tweet in the case of GEOTEXT and TWITTER-US, and the centre of the closest city in the case of TWITTER-WORLD. GEOTEXT and TWITTER-US cover the continental US, and TWITTER-WORLD covers the whole world, with 9k, 449k and 1.3m users, respectively. The labels are the discretised geographical coordinates of the training points using a k-d tree following Roller et al. (2012), with the number of labels equal to 129, 256, and 930 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively."
  }, {
    "heading": "3.2 Constructing the Views",
    "text": "We build matrix Â as in Equation 1 using the collapsed @-mention graph between users, where two users are connected (Aij = 1) if one mentions the other, or they co-mention another user. The text view is a BoW model of user content with binary term frequency, inverse document frequency, and l2 normalisation of samples."
  }, {
    "heading": "3.3 Model Selection",
    "text": "For GCN, we use highway layers to control the amount of neighbourhood information passed to a node. We use 3 layers in GCN with size 300, 600, 900 for GEOTEXT, TWITTER-US and TWITTERWORLD respectively. Note that the final softmax layer is also graph convolutional, which sets the radius of the averaging neighbourhood to 4. The\nk-d tree bucket size hyperparameter which controls the maximum number of users in each cluster is set to 50, 2400, and 2400 for the respective datasets, based on tuning over the validation set. The architecture of GCN-LP is similar, with the difference that the text view is set to zero. In DCCA, for the unsupervised networks we use a single sigmoid hidden layer with size 1000 and a linear output layer with size 500 for the three datasets. The loss function is CCA loss, which maximises the output correlations. The supervised multilayer perceptron has one hidden layer with size 300, 600, 1000 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively, which we set by tuning over the development sets. We evaluate the models using Median error, Mean error, and Acc@161, accuracy of predicting a user within 161km or 100 miles from the known location."
  }, {
    "heading": "3.4 Baselines",
    "text": "We also compare DCCA and GCN with two baselines:\nGCN-LP is based on GCN, but for input, instead of text-based features , we use one-hot encoding of a user’s neighbours, which are then convolved with their k-hop neighbours using the GCN. This approach is similar to label propagation in smoothing the label distribution of a user with that of its neighbours, but uses graph convolutional networks which have extra layer parameters, and also a gating mechanism to control the smoothing neighbourhood radius. Note that for unlabelled samples, the predicted labels are used for input after training accuracy reaches 0.2.\nMLP-TXT+NET is a simple transductive supervised model based on a single layer multilayer perceptron where the input to the network is the concatenation of the text view X , the user content’s bag-of-words and Â (Equation 1), which represents the network view as a vector input. For the hidden layer we use a ReLU nonlinearity, and sizes 300, 600, and 600 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively."
  }, {
    "heading": "4 Results and Analysis",
    "text": ""
  }, {
    "heading": "4.1 Representation",
    "text": "Deep CCA and GCN are able to provide an unsupervised data representation in different ways.\nDeep CCA takes the two text-based and networkbased views, and finds deep non-linear transformations that result in maximum correlation between the two views (Andrew et al., 2013). The representations can be visualised using t-SNE, where we hope that samples with the same label are clustered together. GCN, on the other hand, uses graph convolution. The representations of 50 samples from each of 4 randomly chosen labels of GEOTEXT are shown in Figure 3. As shown, Deep CCA seems to slightly improve the representations from pure concatenation of the two views. GCN, on the other hand, substantially improves the representations. Further application of GCN results in more samples clumping together, which might be desirable when there is strong homophily."
  }, {
    "heading": "4.2 Labelled Data Size",
    "text": "To achieve good performance in supervised tasks, often large amounts of labelled data are required, which is a big challenge for Twitter geolocation, where only a small fraction of the data is geotagged (about 1%). The scarcity of supervision indicates the importance of semi-supervised learning where unlabelled (e.g. non-geotagged) tweets are used for training. The three models we propose (MLP-TXT+NET, DCCA, and GCN) are all transductive semi-supervised models that use unlabelled data, however, they are different in terms of how much labelled data they require to achieve acceptable performance. Given that in a real-world scenario, only a small fraction of data is geotagged, we conduct an experiment to analyse the effect of labelled samples on the performance of the three geolocation models. We provided the three models with different fractions of samples that are labelled (in terms of % of dataset samples) while using the remainder as unlabelled data, and analysed their Median error performance over the development set of GEOTEXT, TWITTER-US, and TWITTER-WORLD. Note that the text and network view, and the development set, remain fixed for all the experiments. As shown in Figure 4, when the fraction of labelled samples is less than 10% of all the samples, GCN and DCCA outperform MLP-TXT+NET, as a result of having fewer parameters, and therefore, lower supervision requirement to optimise them. When enough training data is available (e.g. more than 20% of all the samples), GCN and MLP-TXT+NET clearly outperform DCCA, possibly as a result of directly modelling the\ninteractions between network and text views. When all the training samples of the two larger datasets (95% and 98% for TWITTER-US and TWITTERWORLD, respectively) are available to the models, MLP-TXT+NET outperforms GCN. Note that the number of parameters increases from DCCA to GCN and to MLP-TXT+NET. In 1% for GEOTEXT, DCCA outperforms GCN as a result of having fewer parameters and just a few labelled samples, insufficient to train the parameters of GCN."
  }, {
    "heading": "4.3 Highway Gates",
    "text": "Adding more layers to GCN expands the graph neighbourhood within which the user features are averaged, and so might introduce noise, and consequently decrease accuracy as shown in Figure 5 when no gates are used. We see that by adding highway network gates, the performance of GCN slightly improves until three layers are added, but then by adding more layers the performance doesn’t change that much as gates are allowing the layer inputs to pass through the network without\nmuch change. The performance peaks at 4 layers which is compatible with the distribution of shortest path lengths shown in Figure 6."
  }, {
    "heading": "4.4 Performance",
    "text": "The performance of the three proposed models (MLP-TXT+NET, DCCA and GCN) is shown in Table 1. The models are also compared with supervised text-based methods (Wing and Baldridge, 2014; Cha et al., 2015; Rahimi et al., 2017b), a network-based method (Rahimi et al., 2015a) and GCN-LP, and also joint text and network models (Rahimi et al., 2017b; Do et al., 2017; Miura et al., 2017). MLP-TXT+NET and GCN outperform all the text- or network-only models, and also the hybrid model of Rahimi et al. (2017b), indicating that joint modelling of text and network features is important. MLP-TXT+NET is competitive with Do et al. (2017), outperforming it on larger datasets, and underperforming on GEO-\nTEXT. However, it’s difficult to make a fair comparison as they use timezone data in their feature set. MLP-TXT+NET outperforms GCN over TWITTERUS and TWITTER-WORLD, which are very large, and have large amounts of labelled data. In a scenario with little supervision (1% of the total samples are labelled) DCCA and GCN clearly outperform MLP-TXT+NET, as they have fewer pa-\nrameters. Except for Acc@161 over GEOTEXT where the number of labelled samples in the minimal supervision scenario is very low, GCN outperforms DCCA by a large margin, indicating that for a medium dataset where only 1% of samples are labelled (as happens in random samples of Twitter) GCN is superior to MLP-TXT+NET and DCCA, consistent with Section 4.2. Both MLP-TXT+NET and GCN achieve state of the art results compared\nto network-only, text-only, and hybrid models. The network-based GCN-LP model, which does label propagation using Graph Convolutional Networks, outperforms Rahimi et al. (2015a), which is based on location propagation using Modified Adsorption (Talukdar and Crammer, 2009), possibly because the label propagation in GCN is parametrised."
  }, {
    "heading": "4.5 Error Analysis",
    "text": "Although the performance of MLP-TXT+NET is better than GCN and DCCA when a large amount of labelled data is available (Table 1), under a scenario where little labelled data is available (1% of data), DCCA and GCN outperform MLP-TXT+NET, mainly because the number of parameters in MLP-TXT+NET grows with the number of samples, and is much larger than GCN and DCCA. GCN outperforms DCCA and MLP-TXT+NET using 1% of data, however, the distribution of errors in the development set of TWITTER-US indicates higher error for smaller states such as Rhode Island (RI), Iowa (IA), North Dakota (ND), and Idaho (ID), which is simply because the number of labelled samples in those states is insufficient.\nAlthough we evaluate geolocation models with Median, Mean, and Acc@161, it doesn’t mean that the distribution of errors is uniform over all locations. Big cities often attract more local online discussions, making the geolocation of users in those areas simpler. For example users in LA are more likely to talk about LA-related issues such as their sport teams, Hollywood or local events than users in the state of Rhode Island (RI), which lacks large sport teams or major events. It is also possible that people in less densely populated areas are further apart from each other, and therefore, as a result of discretisation fall in different clusters. The non-uniformity in local discussions results in lower geolocation performance in less densely populated areas like Midwest U.S., and higher performance in densely populated areas such as NYC and LA as shown in Figure 7. The geographical distribution of error for GCN, DCCA and MLP-TXT+NET under the minimal supervision scenario is shown in the supplementary material.\nTo get a better picture of misclassification between states, we built a confusion matrix based on known state and predicted state for development users of TWITTER-US using GCN using only 1% of labelled data. There is a tendency for users to be wrongly predicted to be in CA, NY, TX, and surpris-\ningly OH. Particularly users from states such as TX, AZ, CO, and NV, which are located close to CA, are wrongly predicted to be in CA, and users from NJ, PA, and MA are misclassified as being in NY. The same goes for OH and TX where users from neighbouring smaller states are misclassified to be there. Users from CA and NY are also misclassified between the two states, which might be the result of business and entertainment connections that exist between NYC and LA/SF. Interestingly, there are a number of misclassifications to FL for users from CA, NY, and TX, which might be the effect of users vacationing or retiring to FL. The full confusion matrix between the U.S. states is provided in the supplementary material."
  }, {
    "heading": "4.6 Local Terms",
    "text": "In Table 2, local terms of a few regions detected by GCN under minimal supervision are shown. The terms that were present in the labelled data are excluded to show how graph convolutions over the social graph have extended the vocabulary. For example, in case of Seattle, #goseahawks is an important term not present in the 1% labelled data but present in the unlabelled data. The convolution over the social graph is able to utilise such terms that don’t exist in the labelled data."
  }, {
    "heading": "5 Related Work",
    "text": "Previous work on user geolocation can be broadly divided into text-based, network-based and multiview approaches.\nText-based geolocation uses the geographical bias in language use to infer the location of users. There are three main text-based approaches to geolocation: (1) gazetteer-based models which map geographical references in text to location, but ignore non-geographical references and vernacular uses of language (Rauch et al., 2003; Amitay et al., 2004; Lieberman et al., 2010); (2) geographical topic models that learn region-specific topics, but don’t scale to the magnitude of social media (Eisenstein et al., 2010; Hong et al., 2012; Ahmed et al., 2013); and (3) supervised models which are often framed as text classification (Serdyukov et al., 2009; Wing and Baldridge, 2011; Roller et al., 2012; Han et al., 2014) or text regression (Iso et al., 2017; Rahimi et al., 2017a). Supervised models scale well and can achieve good performance with sufficient supervision, which is not available in a real world scenario.\nNetwork-based methods leverage the location homophily assumption: nearby users are more likely to befriend and interact with each other. There are four main network-based geolocation approaches: distance-based, supervised classification, graph-based label propagation, and node embedding methods. Distance-based methods model the probability of friendship given the distance (Backstrom et al., 2010; McGee et al., 2013; Gu et al., 2012; Kong et al., 2014), supervised models use neighbourhood features to classify a user into a location (Rout et al., 2013; Malmi et al., 2015), and graph-based label-propagation models propagate the location information through the user–user graph to estimate unknown labels (Davis Jr et al., 2011; Jurgens, 2013; Compton et al., 2014). Node embedding methods build heterogeneous graphs between user–user, user–location and location– location, and learn an embedding space to minimise the distance of connected nodes, and maximise the distance of disconnected nodes. The embeddings are then used in supervised models for geolocation (Wang et al., 2017). Network-based models fail to geolocate disconnected users: Jurgens et al. (2015) couldn’t geolocation 37% of users as a result of disconnectedness. Previous work on hybrid text and network methods can be broadly categorised into three main approaches: (1) incorporating text-based information such as toponyms or locations predicted from a textbased model as auxiliary nodes into the user–user graph, which is then used in network-based models (Li et al., 2012a,b; Rahimi et al., 2015b,a); (2) ensembling separately trained text- and networkbased models (Gu et al., 2012; Ren et al., 2012; Jayasinghe et al., 2016; Ribeiro and Pappa, 2017); and (3) jointly learning geolocation from several information sources such as text and network information (Miura et al., 2017; Do et al., 2017), which can capture the complementary information in text and network views, and also model the interactions between the two. None of the previous\nmultiview approaches — with the exception of Li et al. (2012a) and Li et al. (2012b) that only use toponyms — effectively uses unlabelled data in the text view, and use only the unlabelled information of the network view via the user–user graph.\nThere are three main shortcomings in the previous work on user geolocation that we address in this paper: (1) with the exception of few recent works (Miura et al., 2017; Do et al., 2017), previous models don’t jointly exploit both text and network information, and therefore the interaction between text and network views is not modelled; (2) the unlabelled data in both text and network views is not effectively exploited, which is crucial given the small amounts of available supervision; and (3) previous models are rarely evaluated under a minimal supervision scenario, a scenario which reflects real world conditions."
  }, {
    "heading": "6 Conclusion",
    "text": "We proposed GCN, DCCA and MLP-TXT+NET, three multiview, transductive, semi-supervised geolocation models, which use text and network information to infer user location in a joint setting. We showed that joint modelling of text and network information outperforms network-only, text-only, and hybrid geolocation models as a result of modelling the interaction between text and network information. We also showed that GCN and DCCA are able to perform well under a minimal supervision scenario similar to real world applications by effectively using unlabelled data. We ignored the context in which users interact with each other, and assumed all the connections to hold location homophily. In future work, we are interested in modelling the extent to which a social interaction is caused by geographical proximity (e.g. using user–user gates)."
  }],
  "year": 2018,
  "references": [{
    "title": "Hierarchical geographical modeling of user locations from social media posts",
    "authors": ["Amr Ahmed", "Liangjie Hong", "Alexander J. Smola."],
    "venue": "Proceedings of the 22nd International Conference on World Wide Web (WWW 2013), pages 25–36, Rio de Janeiro,",
    "year": 2013
  }, {
    "title": "Web-a-where: geotagging web content",
    "authors": ["Einat Amitay", "Nadav Har’El", "Ron Sivan", "Aya Soffer"],
    "venue": "In Proceedings of the 27th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR",
    "year": 2004
  }, {
    "title": "Deep canonical correlation analysis",
    "authors": ["Galen Andrew", "Raman Arora", "Jeff Bilmes", "Karen Livescu."],
    "venue": "International Conference on Machine Learning, pages 1247–1255, Atlanta, USA.",
    "year": 2013
  }, {
    "title": "Find me if you can: improving geographical prediction with social and spatial proximity",
    "authors": ["Lars Backstrom", "Eric Sun", "Cameron Marlow."],
    "venue": "Proceedings of the 19th International Conference on World Wide Web (WWW 2010), pages 61–70, Raleigh,",
    "year": 2010
  }, {
    "title": "Twitter geolocation and regional classification via sparse coding",
    "authors": ["Miriam Cha", "Youngjune Gwon", "H.T. Kung."],
    "venue": "Proceedings of the 9th International Conference on Weblogs and Social Media (ICWSM 2015), pages 582–585, Oxford, UK.",
    "year": 2015
  }, {
    "title": "You are where you tweet: a content-based approach to geo-locating Twitter users",
    "authors": ["Zhiyuan Cheng", "James Caverlee", "Kyumin Lee."],
    "venue": "Proceedings of the 19th ACM International Conference Information and Knowledge Management (CIKM 2010),",
    "year": 2010
  }, {
    "title": "Modeling flu trends with real-time geo-tagged twitter data streams",
    "authors": ["Jaime Chon", "Ross Raymond", "Haiyan Wang", "Feng Wang."],
    "venue": "Proceedings of the 10th International Conference on Wireless Algorithms, Systems, and Applications (WASA 2015),",
    "year": 2015
  }, {
    "title": "Geotagging one hundred million twitter accounts with total variation minimization",
    "authors": ["Ryan Compton", "David Jurgens", "David Allen."],
    "venue": "Proceedings of the IEEE International Conference on Big Data (IEEE BigData 2014), pages 393–401, Washington",
    "year": 2014
  }, {
    "title": "Inferring the location of twitter messages based on user relationships",
    "authors": ["Clodoveu A Davis Jr", "Gisele L Pappa", "Diogo Rennó Rocha de Oliveira", "Filipe de L Arcanjo."],
    "venue": "Transactions in GIS, 15(6):735–751.",
    "year": 2011
  }, {
    "title": "omg, from here, i can see the flames!”: A use case of mining location based social networks to acquire spatio-temporal data on forest fires",
    "authors": ["Bertrand De Longueville", "Robin S. Smith", "Gianluca Luraschi."],
    "venue": "Proceedings of the 2009 International Work-",
    "year": 2009
  }, {
    "title": "Multiview deep learning for predicting twitter users’ location",
    "authors": ["Tien Huu Do", "Duc Minh Nguyen", "Evaggelia Tsiligianni", "Bruno Cornelis", "Nikos Deligiannis."],
    "venue": "arXiv preprint arXiv:1712.08091.",
    "year": 2017
  }, {
    "title": "A latent variable model for geographic lexical variation",
    "authors": ["Jacob Eisenstein", "Brendan O’Connor", "Noah A. Smith", "Eric P. Xing"],
    "venue": "In Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing (EMNLP",
    "year": 2010
  }, {
    "title": "Fusing text and frienships for location inference in online social networks",
    "authors": ["Hansu Gu", "Haojie Hang", "Qin Lv", "Dirk Grunwald."],
    "venue": "Proceedings of the The 2012 IEEE/WIC/ACM International Joint Conferences on Web Intelligence and Intelli-",
    "year": 2012
  }, {
    "title": "Geolocation prediction in social media data by finding location indicative words",
    "authors": ["Bo Han", "Paul Cook", "Timothy Baldwin."],
    "venue": "Proceedings of the 24th International Conference on Computational Linguistics (COLING 2012), pages 1045–",
    "year": 2012
  }, {
    "title": "Textbased Twitter user geolocation prediction",
    "authors": ["Bo Han", "Paul Cook", "Timothy Baldwin."],
    "venue": "Journal of Artificial Intelligence Research, 49:451–500.",
    "year": 2014
  }, {
    "title": "Tweets from Justin Bieber’s heart: the dynamics of the location field in user profiles",
    "authors": ["Brent Hecht", "Lichan Hong", "Bongwon Suh", "Ed H. Chi."],
    "venue": "Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 237–246, Van-",
    "year": 2011
  }, {
    "title": "Discovering geographical topics in the twitter stream",
    "authors": ["Liangjie Hong", "Amr Ahmed", "Siva Gurumurthy", "Alexander J. Smola", "Kostas Tsioutsiouliklis."],
    "venue": "Proceedings of the 21st international conference on World Wide Web, pages 769–778, Lyon, France.",
    "year": 2012
  }, {
    "title": "Relations between two sets of variates",
    "authors": ["Harold Hotelling."],
    "venue": "Biometrika, 28(3/4):321–377.",
    "year": 1936
  }, {
    "title": "Density estimation for geolocation via convolutional mixture density network",
    "authors": ["Hayate Iso", "Shoko Wakamiya", "Eiji Aramaki."],
    "venue": "arXiv preprint arXiv:1705.02750.",
    "year": 2017
  }, {
    "title": "CSIRO Data61 at the WNUT geo shared task",
    "authors": ["Gaya Jayasinghe", "Brian Jin", "James Mchugh", "Bella Robinson", "Stephen Wan."],
    "venue": "Proceedings of the COLING 2016 Workshop on Noisy User-generated Text (W-NUT 2016), pages 218–226, Osaka, Japan.",
    "year": 2016
  }, {
    "title": "That’s what friends are for: Inferring location in online social media platforms based on social relationships",
    "authors": ["David Jurgens."],
    "venue": "Proceedings of the 7th International Conference on Weblogs and Social Media (ICWSM 2013), pages 273–282, Boston, USA.",
    "year": 2013
  }, {
    "title": "Geolocation prediction in twitter using social networks: A critical analysis and review of current practice",
    "authors": ["David Jurgens", "Tyler Finethy", "James McCorriston", "Yi Tian Xu", "Derek Ruths."],
    "venue": "Proceedings of the 9th International Conference on Weblogs",
    "year": 2015
  }, {
    "title": "Semisupervised classification with graph convolutional networks",
    "authors": ["Thomas N. Kipf", "Max Welling."],
    "venue": "International Conference on Learning Representations (ICLR).",
    "year": 2017
  }, {
    "title": "Spot: Locating social media users based on social network context",
    "authors": ["Longbo Kong", "Zhi Liu", "Yan Huang."],
    "venue": "Proceedings of the VLDB Endowment, 7(13):1681–1684.",
    "year": 2014
  }, {
    "title": "Multiple location profiling for users and relationships from social network and content",
    "authors": ["Rui Li", "Shengjie Wang", "Kevin Chen-Chuan Chang."],
    "venue": "Proceedings of the VLDB Endowment, 5(11):1603–1614.",
    "year": 2012
  }, {
    "title": "Towards social user profiling: unified and discriminative influence model for inferring home locations",
    "authors": ["Rui Li", "Shengjie Wang", "Hongbo Deng", "Rui Wang", "Kevin Chen-Chuan Chang."],
    "venue": "Proceedings of the 18th ACM SIGKDD International Con-",
    "year": 2012
  }, {
    "title": "Geotagging with local lexicons to build indexes for textually-specified spatial data",
    "authors": ["Michael D Lieberman", "Hanan Samet", "Jagan Sankaranarayanan."],
    "venue": "Proceedings of the 26th International Conference on Data Engineering (ICDE 2010), pages",
    "year": 2010
  }, {
    "title": "The blind leading the blind: Network-based location estimation under uncertainty",
    "authors": ["Eric Malmi", "Arno Solin", "Aristides Gionis."],
    "venue": "Proceedings of the European Conference on Machine Learning and Principles and Practice of Knowledge Discov-",
    "year": 2015
  }, {
    "title": "Location prediction in social media based on tie strength",
    "authors": ["Jeffrey McGee", "James Caverlee", "Zhiyuan Cheng."],
    "venue": "Proceedings of the 22nd ACM international conference on Conference on information & knowledge management, pages 459–468, San",
    "year": 2013
  }, {
    "title": "Unifying text, metadata, and user network representations with a neural network for geolocation prediction",
    "authors": ["Yasuhide Miura", "Motoki Taniguchi", "Tomoki Taniguchi", "Tomoko Ohkuma."],
    "venue": "Proceedings of the 55th Annual Meeting of the Association for",
    "year": 2017
  }, {
    "title": "Is the sample good enough? Comparing data from Twitter’s streaming API with Twitter’s firehose",
    "authors": ["Fred Morstatter", "Jürgen Pfeffer", "Huan Liu", "Kathleen M Carley."],
    "venue": "Proceedings of the 7th International Conference on Weblogs and Social Media",
    "year": 2013
  }, {
    "title": "You are what you tweet: Analyzing twitter for public health",
    "authors": ["Michael J. Paul", "Mark Dredze."],
    "venue": "Proceedings of the Fifth International Conference on Weblogs and Social Media (ICSWM 2011), pages 265–272, Barcelona, Spain.",
    "year": 2011
  }, {
    "title": "Continuous representation of location for geolocation and lexical dialectology using mixture density networks",
    "authors": ["Afshin Rahimi", "Timothy Baldwin", "Trevor Cohn."],
    "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language",
    "year": 2017
  }, {
    "title": "Twitter user geolocation using a unified text and network prediction model",
    "authors": ["Afshin Rahimi", "Trevor Cohn", "Timothy Baldwin."],
    "venue": "Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics — 7th International Joint",
    "year": 2015
  }, {
    "title": "A neural model for user geolocation and lexical dialectology",
    "authors": ["Afshin Rahimi", "Trevor Cohn", "Timothy Baldwin."],
    "venue": "Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (ACL 2017), pages 207–216, Vancouver,",
    "year": 2017
  }, {
    "title": "Exploiting text and network context for geolocation of social media users",
    "authors": ["Afshin Rahimi", "Duy Vu", "Trevor Cohn", "Timothy Baldwin."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for Compu-",
    "year": 2015
  }, {
    "title": "A confidence-based framework for disambiguating geographic terms",
    "authors": ["Erik Rauch", "Michael Bukatin", "Kenneth Baker."],
    "venue": "Proceedings of the HLT-NAACL 2003 workshop on Analysis of geographic references-Volume 1, pages 50–54, Edmon-",
    "year": 2003
  }, {
    "title": "Where are you settling down: Geo-locating Twitter users based on tweets and social networks",
    "authors": ["Kejiang Ren", "Shaowu Zhang", "Hongfei Lin."],
    "venue": "Proceedings of the 8th Asia Information Retrieval Societies Conference (AIRS 2012), pages 150–161, Tian-",
    "year": 2012
  }, {
    "title": "Strategies for combining Twitter users geo-location methods",
    "authors": ["Silvio Ribeiro", "Gisele L. Pappa."],
    "venue": "GeoInformatica, pages 1–25.",
    "year": 2017
  }, {
    "title": "Supervised text-based geolocation using language models on an adaptive grid",
    "authors": ["Stephen Roller", "Michael Speriosu", "Sarat Rallapalli", "Benjamin Wing", "Jason Baldridge."],
    "venue": "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural",
    "year": 2012
  }, {
    "title": "Where’s @wally?: A classification approach to geolocating users based on their social ties",
    "authors": ["Dominic Rout", "Kalina Bontcheva", "Daniel PreoţiucPietro", "Trevor Cohn."],
    "venue": "Proceedings of the 24th ACM Conference on Hypertext and Social Media (Hyper-",
    "year": 2013
  }, {
    "title": "Earthquake shakes twitter users: Real-time event detection by social sensors",
    "authors": ["Takeshi Sakaki", "Makoto Okazaki", "Yutaka Matsuo."],
    "venue": "Proceedings of the 19th International Conference on World Wide Web, pages 851–860, New York, USA.",
    "year": 2010
  }, {
    "title": "Placing Flickr photos on a map",
    "authors": ["Pavel Serdyukov", "Vanessa Murdock", "Roelof Van Zwol."],
    "venue": "Proceedings of the 32nd International ACM SIGIR Conference on Research and Development in Information Retrieval, pages 484–491, Boston, USA.",
    "year": 2009
  }, {
    "title": "Highway networks",
    "authors": ["Rupesh Kumar Srivastava", "Klaus Greff", "Jürgen Schmidhuber."],
    "venue": "arXiv preprint arXiv:1505.00387.",
    "year": 2015
  }, {
    "title": "New regularized algorithms for transductive learning",
    "authors": ["Partha Pratim Talukdar", "Koby Crammer."],
    "venue": "Proceedings of the European Conference on Machine Learning (ECML-PKDD 2009), pages 442–457, Bled, Slovenia.",
    "year": 2009
  }, {
    "title": "Collective geographical embedding for geolocating social network users",
    "authors": ["Fengjiao Wang", "Chun-Ta Lu", "Yongzhi Qu", "S Yu Philip."],
    "venue": "Proceedings of the Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2017), pages",
    "year": 2017
  }, {
    "title": "Simple supervised document geolocation with geodesic grids",
    "authors": ["Benjamin P Wing", "Jason Baldridge."],
    "venue": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies-Volume 1 (ACL-HLT",
    "year": 2011
  }, {
    "title": "Hierarchical discriminative classification for text-based geolocation",
    "authors": ["Benjamin P Wing", "Jason Baldridge."],
    "venue": "Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP 2014), pages 336–348, Doha, Qatar.",
    "year": 2014
  }, {
    "title": "Investigating public health surveillance using twitter",
    "authors": ["Antonio Jimeno Yepes", "Andrew MacKinlay", "Bo Han."],
    "venue": "Proceedings of the 2015 Workshop on Biomedical Natural Language Processing (BioNLP 2015), pages 164–170, Beijing, China.",
    "year": 2015
  }],
  "id": "SP:a6b131b18cdbb15031f435a27f6d63cfbbce4e46",
  "authors": [{
    "name": "Afshin Rahimi",
    "affiliations": []
  }, {
    "name": "Trevor Cohn",
    "affiliations": []
  }, {
    "name": "Timothy Baldwin",
    "affiliations": []
  }],
  "abstractText": "Social media user geolocation is vital to many applications such as event detection. In this paper, we propose GCN, a multiview geolocation model based on Graph Convolutional Networks, that uses both text and network context. We compare GCN to the state-of-the-art, and to two baselines we propose, and show that our model achieves or is competitive with the stateof-the-art over three benchmark geolocation datasets when sufficient supervision is available. We also evaluate GCN under a minimal supervision scenario, and show it outperforms baselines. We find that highway network gates are essential for controlling the amount of useful neighbourhood expansion in GCN.",
  "title": "Semi-supervised User Geolocation via Graph Convolutional Networks"
}