{
  "sections": [{
    "heading": "1 Introduction",
    "text": "Deep learning techniques have been very successful in several domains, like object recognition in images (e.g Krizhevsky et al., 2012; Simonyan & Zisserman, 2015; Szegedy et al., 2015; He et al., 2016), machine translation (e.g. Cho et al., 2014; Sutskever et al., 2014; Bahdanau et al., 2015; Wu et al., 2016; Gehring et al., 2016) and speech recognition (e.g. Graves et al., 2013; Hannun et al., 2014; Chorowski et al., 2015; Chan et al., 2016; Collobert et al., 2016). Several arguments have been brought forward to justify these empirical results. From a representational point of view, it has been argued that deep networks can efficiently\n1Université of Montréal, Montréal, Canada 2DeepMind, London, United Kingdom 3Google Brain, Mountain View, United States 4CIFAR Senior Fellow. Correspondence to: Laurent Dinh <laurent.dinh@umontreal.ca>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\napproximate certain functions (e.g. Montufar et al., 2014; Raghu et al., 2016). Other works (e.g Dauphin et al., 2014; Sagun et al., 2014; Choromanska et al., 2015) have looked at the structure of the error surface to analyze how trainable these models are. Finally, another point of discussion is how well these models can generalize (Nesterov & Vial, 2008; Keskar et al., 2017; Zhang et al., 2017). These correspond, respectively, to low approximation, optimization and estimation error as described by Bottou (2010).\nOur work focuses on the analysis of the estimation error. In particular, different approaches had been used to look at the question of why stochastic gradient descent results in solutions that generalize well (Bottou & LeCun, 2005; Bottou & Bousquet, 2008). For example, Duchi et al. (2011); Nesterov & Vial (2008); Hardt et al. (2016); Bottou et al. (2016); Gonen & Shalev-Shwartz (2017) rely on the concept of stochastic approximation or uniform stability (Bousquet & Elisseeff, 2002). Another conjecture that was recently (Keskar et al., 2017) explored, but that could be traced back to Hochreiter & Schmidhuber (1997), relies on the geometry of the loss function around a given solution. It argues that flat minima, for some definition of flatness, lead to better generalization. Our work focuses on this particular conjecture, arguing that there are critical issues when applying the concept of flat minima to deep neural networks, which require rethinking what flatness actually means.\nWhile the concept of flat minima is not well defined, having slightly different meanings in different works, the intuition is relatively simple. If one imagines the error as a onedimensional curve, a minimum is flat if there is a wide region around it with roughly the same error, otherwise the minimum is sharp. When moving to higher dimensional spaces, defining flatness becomes more complicated. In Hochreiter & Schmidhuber (1997) it is defined as the size of the connected region around the minimum where the training loss is relatively similar. Chaudhari et al. (2017) relies, in contrast, on the curvature of the second order structure around the minimum, while Keskar et al. (2017) looks at the maximum loss in a bounded neighbourhood of the minimum. All these works rely on the fact that flatness results in robustness to low precision arithmetic or noise in the parameter space, which, using an minimum description length-based argument, suggests a low expected overfitting.\nHowever, several common architectures and parametrizations in deep learning are already at odds with this conjecture, requiring at least some degree of refinement in the statements made. In particular, we show how the geometry of the associated parameter space can alter the ranking between prediction functions when considering several measures of flatness/sharpness. We believe the reason for this contradiction stems from the Bayesian arguments about KLdivergence made to justify the generalization ability of flat minima (Hinton & Van Camp, 1993). Indeed, KullbackLiebler divergence is invariant to change of parameters whereas the notion of ”flatness” is not. The demonstrations of Hochreiter & Schmidhuber (1997) are approximately based on a Gibbs formalism and rely on strong assumptions and approximations that can compromise the applicability of the argument, including the assumption of a discrete function space."
  }, {
    "heading": "2 Definitions of flatness/sharpness",
    "text": "For conciseness, we will restrict ourselves to supervised scalar output problems, but several conclusions in this paper can apply to other problems as well. We will consider a function f that takes as input an element x from an input space X and outputs a scalar y. We will denote by fθ the prediction function. This prediction function will be parametrized by a parameter vector θ in a parameter space Θ. Often, this prediction function will be over-parametrized and two parameters (θ, θ′) ∈ Θ2 that yield the same prediction function everywhere, ∀x ∈ X , fθ(x) = fθ′(x), are called observationally equivalent. The model is trained to minimize a continuous loss function L which takes as argument the prediction function fθ. We will often think of the loss L as a function of θ and adopt the notation L(θ).\nThe notion of flatness/sharpness of a minimum is relative, therefore we will discuss metrics that can be used to compare the relative flatness between two minima. In this section we will formalize three used definitions of flatness in\nthe literature.\nHochreiter & Schmidhuber (1997) defines a flat minimum as ”a large connected region in weight space where the error remains approximately constant”. We interpret this formulation as follows:\nDefinition 1. Given > 0, a minimum θ, and a loss L, we define C(L, θ, ) as the largest (using inclusion as the partial order over the subsets of Θ) connected set containing θ such that ∀θ′ ∈ C(L, θ, ), L(θ′) < L(θ) + . The - flatness will be defined as the volume of C(L, θ, ). We will call this measure the volume -flatness.\nIn Figure 1, C(L, θ, ) will be the purple line at the top of the red area if the height is and its volume will simply be the length of the purple line.\nFlatness can also be defined using the local curvature of the loss function around the minimum if it is a critical point 1. Chaudhari et al. (2017); Keskar et al. (2017) suggest that this information is encoded in the eigenvalues of the Hessian. However, in order to compare how flat one minimum versus another, the eigenvalues need to be reduced to a single number. Here we consider the spectral norm and trace of the Hessian, two typical measurements of the eigenvalues of a matrix.\nAdditionally Keskar et al. (2017) defines the notion of - sharpness. In order to make proofs more readable, we will slightly modify their definition. However, because of norm equivalence in finite dimensional space, our results will transfer to the original definition in full space as well. Our modified definition is the following:\nDefinition 2. Let B2( , θ) be an Euclidean ball centered on a minimum θ with radius . Then, for a non-negative valued loss function L, the -sharpness will be defined as proportional to\nmaxθ′∈B2( ,θ) ( L(θ′)− L(θ) ) 1 + L(θ) .\nIn Figure 1, if the width of the red area is 2 then the height of the red area is maxθ′∈B2( ,θ) ( L(θ′)− L(θ) ) .\n-sharpness can be related to the spectral norm of the Hessian. Indeed, a second-order Taylor expansion of L around a critical point minimum is written\nL(θ′) = L(θ) + 1\n2 (θ′ − θ) (∇2L)(θ)(θ′ − θ)T\n+ o(‖θ′ − θ‖22).\nIn this second order approximation, the -sharpness at θ\n1In this paper, we will often assume that is the case when dealing with Hessian-based measures in order to have them welldefined.\nwould be ∣∣∣∣∣∣(∇2L)(θ)∣∣∣∣∣∣ 2 2\n2 ( 1 + L(θ) ) ."
  }, {
    "heading": "3 Properties of Deep Rectified Networks",
    "text": "Before moving forward to our results, in this section we first introduce the notation used in the rest of paper. Most of our results, for clarity, will be on the deep rectified feedforward networks with a linear output layer that we describe below, though they can easily be extended to other architectures (e.g. convolutional, etc.). Definition 3. GivenK weight matrices (θk)k≤K with nk = dim ( vec(θk) ) and n = ∑K k=1 nk, the output y of a deep rectified feedforward networks with a linear output layer is:\ny = φrect ( φrect ( · · ·φrect(x · θ1) · · · ) · θK−1 ) · θK ,\nwhere\n• x is the input to the model, a high-dimensional vector\n• φrect is the rectified elementwise activation function (Jarrett et al., 2009; Nair & Hinton, 2010; Glorot et al., 2011), which is the positive part (zi)i 7→ (max(zi, 0))i.\n• vec reshapes a matrix into a vector.\nNote that in our definition we excluded the bias terms, usually found in any neural architecture. This is done mainly for convenience, to simplify the rendition of our arguments. However, the arguments can be extended to the case that includes biases (see Appendix) . Another choice is that of the linear output layer. Having an output activation function does not affect our argument either: since the loss is a function of the output activation, it can be rephrased as a function of linear pre-activation.\nDeep rectifier models have certain properties that allows us in section 4 to arbitrary manipulate the flatness of a minimum.\nAn important topic for optimization of neural networks is understanding the non-Euclidean geometry of the parameter space as imposed by the neural architecture (see, for example Amari, 1998). In principle, when we take a step in parameter space what we expect to control is the change in the behavior of the model (i.e. the mapping of the input x to the output y). In principle we are not interested in the parameters per se, but rather only in the mapping they represent.\nIf one defines a measure for the change in the behavior of the model, which can be done under some assumptions, then, it can be used to define, at any point in the parameter space, a metric that says what is the equivalent change in the parameters for a unit of change in the behavior of the model. As it turns out, for neural networks, this metric is not constant over Θ. Intuitively, the metric is related to the curvature, and since neural networks can be highly nonlinear, the curvature will not be constant. See Amari (1998); Pascanu & Bengio (2014) for more details. Coming back to the concept of flatness or sharpness of a minimum, this metric should define the flatness.\nHowever, the geometry of the parameter space is more complicated. Regardless of the measure chosen to compare two instantiations of a neural network, because of the structure of the model, it also exhibits a large number of symmetric configurations that result in exactly the same behavior. Because the rectifier activation has the non-negative homogeneity property, as we will see shortly, one can construct a continuum of points that lead to the same behavior, hence the metric is singular. Which means that one can exploit these directions in which the model stays unchanged to shape the neighbourhood around a minimum in such a way that, by most definitions of flatness, this property can be controlled. See Figure 2 for a visual depiction, where the flatness (given here as the distance between the different level curves) can be changed by moving along the curve.\nLet us redefine, for convenience, the non-negative homogeneity property (Neyshabur et al., 2015; Lafond et al., 2016) below. Note that beside this property, the reason for studying the rectified linear activation is for its widespread adoption (Krizhevsky et al., 2012; Simonyan & Zisserman, 2015; Szegedy et al., 2015; He et al., 2016).\nDefinition 4. A given a function φ is non-negative homogeneous if\n∀(z, α) ∈ R× R+, φ(αz) = αφ(z)\n.\nTheorem 1. The rectified function φrect(x) = max(x, 0) is non-negative homogeneous.\nProof. Follows trivially from the constraint that α > 0, given that x > 0⇒ αx > 0, iff α > 0.\nFor a deep rectified neural network it means that:\nφrect ( x · (αθ1) ) · θ2 = φrect(x · θ1) · (αθ2),\nmeaning that for this one (hidden) layer neural network, the parameters (αθ1, θ2) is observationally equivalent to (θ1, αθ2). This observational equivalence similarly holds for convolutional layers.\nGiven this non-negative homogeneity, if (θ1, θ2) 6= (0, 0) then { (αθ1, α −1θ2), α > 0 }\nis an infinite set of observationally equivalent parameters, inducing a strong nonidentifiability in this learning scenario. Other models like deep linear networks (Saxe et al., 2013), leaky rectifiers (He et al., 2015) or maxout networks (Goodfellow et al., 2013) also have this non-negative homogeneity property.\nIn what follows we will rely on such transformations, in particular we will rely on the following definition:\nDefinition 5. For a single hidden layer rectifier feedforward network we define the family of transformations\nTα : (θ1, θ2) 7→ (αθ1, α−1θ2)\nwhich we refer to as a α-scale transformation.\nNote that a α-scale transformation will not affect the generalization, as the behavior of the function is identical. Also while the transformation is only defined for a single layer rectified feedforward network, it can trivially be extended to any architecture having a single rectified network as a submodule, e.g. a deep rectified feedforward network. For simplicity and readability we will rely on this definition."
  }, {
    "heading": "4 Deep Rectified networks and flat minima",
    "text": "In this section we exploit the resulting strong nonidentifiability to showcase a few shortcomings of some definitions of flatness. Although α-scale transformation does not affect the function represented, it allows us to significantly decrease several measures of flatness. For another definition of flatness, α-scale transformation show that all minima are equally flat."
  }, {
    "heading": "4.1 Volume -flatness",
    "text": "Theorem 2. For a one-hidden layer rectified neural network of the form\ny = φrect(x · θ1) · θ2,\nand a minimum θ = (θ1, θ2), such that θ1 6= 0 and θ2 6= 0, ∀ > 0 C(L, θ, ) has an infinite volume.\nWe will not consider the solution θ where any of the weight matrices θ1, θ2 is zero, θ1 = 0 or θ2 = 0, as it results in a constant function which we will assume to give poor training performance. For α > 0, the α-scale transformation Tα : (θ1, θ2) 7→ (αθ1, α−1θ2) has Jacobian determinant αn1−n2 , where once again n1 = dim ( vec(θ1) ) and n2 =\ndim ( vec(θ2) ) . Note that the Jacobian determinant of this linear transformation is the change in the volume induced by Tα and Tα ◦ Tβ = Tαβ . We show below that there is a connected region containing θ with infinite volume and where the error remains approximately constant.\nProof. We will first introduce a small region with approximately constant error around θ with non-zero volume. Given > 0 and if we consider the loss function continuous with respect to the parameter, C(L, θ, ) is an open set containing θ. Since we also have θ1 6= 0 and θ2 6= 0, let r > 0 such that the L∞ ball B∞(r, θ) is in C(L, θ, ) and has empty intersection with {θ′, θ′1 = 0}. Let v = (2r)n1+n2 > 0 the volume of B∞(r, θ).\nSince the Jacobian determinant of Tα is the multiplicative change of induced by Tα, the volume of Tα ( B∞(r, θ) ) is vαn1−n2 . If n1 6= n2, we can arbitrarily grow the volume of Tα ( B∞(r, θ) ) , with error within an -interval of L(θ), by having α tends to +∞ if n1 > n2 or to 0 otherwise.\nIf n1 = n2, ∀α′ > 0, Tα′ ( B∞(r, θ) ) has volume v. Let\nC ′ = ⋃ α′>0 Tα′ ( B∞(r, θ) ) . C ′ is a connected region where the error remains approximately constant, i.e. within an -interval of L(θ).\nLet α = 2 ‖θ1‖∞+r‖θ1‖∞−r . Since\nB∞(r, θ) = B∞(r, θ1)×B∞(r, θ2),\nwhere × is the Cartesian set product, we have\nTα ( B∞(r, θ) ) = B∞(αr, αθ1)×B∞(α−1r, α−1θ2).\nTherefore, Tα ( B∞(r, θ) ) ∩B∞(r, θ) = ∅ (see Figure 3).\nSimilarly, B∞(r, θ), Tα ( B∞(r, θ) ) , T 2α ( B∞(r, θ) ) , . . .\nare disjoint and have volume v. We have also T kα ( B∞(r ′, θ) ) = Tαk ( B∞(r ′, θ) ) ∈ C ′. The volume of C ′ is then lower bounded by 0 < v + v + v + · · · and is therefore infinite. C(L, θ, ) has then infinite volume too, making the volume -flatness of θ infinite.\nThis theorem can generalize to rectified neural networks in general with a similar proof. Given that every minimum has an infinitely large region (volume-wise) in which the error remains approximately constant, that means that every minimum would be infinitely flat according to the volume -flatness. Since all minima are equally flat, it is not possible to use volume -flatness to gauge the generalization property of a minimum."
  }, {
    "heading": "4.2 Hessian-based measures",
    "text": "The non-Euclidean geometry of the parameter space, coupled with the manifolds of observationally equal behavior of the model, allows one to move from one region of the parameter space to another, changing the curvature of the model without actually changing the function. This approach has been used with success to improve optimization, by moving from a region of high curvature to a region of well behaved\ncurvature (e.g. Desjardins et al., 2015; Salimans & Kingma, 2016). In this section we look at two widely used measures of the Hessian, the spectral radius and trace, showing that either of these values can be manipulated without actually changing the behavior of the function. If the flatness of a minimum is defined by any of these quantities, then it could also be easily manipulated.\nTheorem 3. The gradient and Hessian of the loss L with respect to θ can be modified by Tα.\nProof.\nL(θ1, θ2) = L(αθ1, α −1θ2),\nwe have then by differentiation (∇L)(θ1, θ2) = (∇L)(αθ1, α−1θ2) [ αIn1 0\n0 α−1In2 ] ⇔ (∇L)(αθ1, α−1θ2) = (∇L)(θ1, θ2) [ α−1In1 0\n0 αIn2 ] and\n(∇2L)(αθ1, α−1θ2)\n=\n[ α−1In1 0\n0 αIn2\n] (∇2L)(θ1, θ2) [ α−1In1 0\n0 αIn2\n] .\nSharpest direction Through these transformations we can easily find, for any critical point which is a minimum with non-zero Hessian, an observationally equivalent parameter whose Hessian has an arbitrarily large spectral norm.\nTheorem 4. For a one-hidden layer rectified neural network of the form\ny = φrect(x · θ1) · θ2,\nand critical point θ = (θ1, θ2) being a minimum for L, such that (∇2L)(θ) 6= 0, ∀M > 0,∃α > 0, ∣∣∣∣∣∣(∇2L)(Tα(θ))∣∣∣∣∣∣2 ≥ M where ∣∣∣∣∣∣(∇2L)(Tα(θ))∣∣∣∣∣∣2 is\nthe spectral norm of (∇2L) ( Tα(θ) ) .\nProof. The trace of a symmetric matrix is the sum of its eigenvalues and a real symmetric matrix can be diagonalized in R, therefore if the Hessian is non-zero, there is one nonzero positive diagonal element. Without loss of generality, we will assume that this non-zero element of value γ > 0 corresponds to an element in θ1. Therefore the Frobenius norm\n∣∣∣∣∣∣(∇2L)(Tα(θ))∣∣∣∣∣∣F of (∇2L)(αθ1, α−1θ2)\n=\n[ α−1In1 0\n0 αIn2\n] (∇2L)(θ1, θ2) [ α−1In1 0\n0 αIn2\n] .\nis lower bounded by α−2γ.\nSince all norms are equivalent in finite dimension, there exists a constant r > 0 such that r|||A|||F ≤ |||A|||2 for all symmetric matrices A. So by picking α < √ rγ M , we are\nguaranteed that ∣∣∣∣∣∣(∇2L)(Tα(θ))∣∣∣∣∣∣2 ≥M .\nAny minimum with non-zero Hessian will be observationally equivalent to a minimum whose Hessian has an arbitrarily large spectral norm. Therefore for any minimum in the loss function, if there exists another minimum that generalizes better then there exists another minimum that generalizes better and is also sharper according the spectral norm of the Hessian. The spectral norm of critical points’ Hessian becomes as a result less relevant as a measure of potential generalization error. Moreover, since the spectral norm lower bounds the trace for a positive semi-definite symmetric matrix, the same conclusion can be drawn for the trace.\nFurther properties of the Hessian are analyzed in Appendix."
  }, {
    "heading": "4.3 -sharpness",
    "text": "We have redefined for > 0 the -sharpness of Keskar et al. (2017) as follow\nmaxθ′∈B2( ,θ) ( L(θ′)− L(θ) ) 1 + L(θ)\nwhere B2( , θ) is the Euclidean ball of radius centered on θ. This modification will demonstrate more clearly the issues of that metric as a measure of probable generalization. If we use K = 2 and (θ1, θ2) corresponding to a non-constant function, i.e. θ1 6= 0 and θ2 6= 0, then we can define α = ‖θ1‖2 . We will now consider the observationally equivalent parameter Tα(θ1, θ2) = ( θ1‖θ1‖2 , α −1θ2).\nGiven that ‖θ1‖2 ≤ ‖θ‖2, we have that (0, α−1θ2) ∈ B2 ( , Tα(θ) ) , making the maximum loss in this neighborhood at least as high as the best constant-valued function,\nincurring relatively high sharpness. Figure 4 provides a visualization of the proof.\nFor rectified neural network every minimum is observationally equivalent to a minimum that generalizes as well but with high -sharpness. This also applies when using the full-space -sharpness used by Keskar et al. (2017). We can prove this similarly using the equivalence of norms in finite dimensional vector spaces and the fact that for c > 0, > 0, ≤ (c + 1) (see Keskar et al. (2017)). We have not been able to show a similar problem with random subspace -sharpness used by Keskar et al. (2017), i.e. a restriction of the maximization to a random subspace, which could relate to the notion of wide valleys described by Chaudhari et al. (2017).\nBy exploiting the non-Euclidean geometry and nonidentifiability of rectified neural networks, we were able to demonstrate some of the limits of using typical definitions of minimum’s flatness as core explanation for generalization."
  }, {
    "heading": "5 Allowing reparametrizations",
    "text": "In the previous section 4 we explored the case of a fixed parametrization, that of deep rectifier models. In this section we demonstrate a simple observation. If we are allowed to change the parametrization of some function f , we can obtain arbitrarily different geometries without affecting how the function evaluates on unseen data. The same holds for reparametrization of the input space. The implication is that the correlation between the geometry of the parameter space (and hence the error surface) and the behavior of a given function is meaningless if not preconditioned on the specific parametrization of the model."
  }, {
    "heading": "5.1 Model reparametrization",
    "text": "One thing that needs to be considered when relating flatness of minima to their probable generalization is that the choice of parametrization and its associated geometry are arbitrary. Since we are interested in finding a prediction function in a given family of functions, no reparametrization of this family should influence generalization of any of these functions. Given a bijection g onto θ, we can define new transformed parameter η = g−1(θ). Since θ and η represent in different space the same prediction function, they should generalize as well.\nLet’s call Lη = L ◦ g the loss function with respect to the new parameter η. We generalize the derivation of Subsec-\ntion 4.2:\nLη(η) = L ( g(η) ) ⇒ (∇Lη)(η) = (∇L) ( g(η) ) (∇g)(η)\n⇒ (∇2Lη)(η) = (∇g)(η)T (∇2L) ( g(η) ) (∇g)(η)\n+ (∇L) ( g(η) ) (∇2g)(η).\nAt a differentiable critical point, we have by definition (∇L) ( g(η) ) = 0, therefore the transformed Hessian at a\ncritical point becomes\n(∇2Lη)(η) = (∇g)(η)T (∇2L) ( g(η) ) (∇g)(η).\nThis means that by reparametrizing the problem we can modify to a large extent the geometry of the loss function so as to have sharp minima of L in θ correspond to flat minima ofLη in η = g−1(θ) and conversely. Figure 5 illustrates that point in one dimension. Several practical (Dinh et al., 2014; Rezende & Mohamed, 2015; Kingma et al., 2016; Dinh et al., 2016) and theoretical works (Hyvärinen & Pajunen, 1999) show how powerful bijections can be. We can also note that the formula for the transformed Hessian at a critical point also applies if g is not invertible, g would just need to be surjective over Θ in order to cover exactly the same family of prediction functions\n{fθ, θ ∈ Θ} = {fg(η), η ∈ g−1(Θ)}.\nWe show in Appendix, bijections that allow us to perturb the relative flatness between a finite number of minima.\nInstances of commonly used reparametrization are batch normalization (Ioffe & Szegedy, 2015), or the virtual batch normalization variant (Salimans et al., 2016), and weight normalization (Badrinarayanan et al., 2015; Salimans & Kingma, 2016; Arpit et al., 2016). Im et al. (2016) have plotted how the loss function landscape was affected by batch normalization. However, we will focus on weight normalization reparametrization as the analysis will be simpler, but the intuition with batch normalization will be similar. Weight normalization reparametrizes a nonzero weight w as w = s v‖v‖2 with the new parameter being the scale s and the unnormalized weight v 6= 0.\nSince we can observe that w is invariant to scaling of v, reasoning similar to Section 3 can be applied with the simpler transformations T ′α : v 7→ αv for α 6= 0. Moreover, since this transformation is a simpler isotropic scaling, the conclusion that we can draw can be actually more powerful with respect to v:\n• every minimum has infinite volume -sharpness; • every minimum is observationally equivalent to an\ninfinitely sharp minimum and to an infinitely flat minimum when considering nonzero eigenvalues of the Hessian;\n• every minimum is observationally equivalent to a minimum with arbitrarily low full-space and random subspace -sharpness and a minimum with high full-space -sharpness.\nThis further weakens the link between the flatness of a minimum and the generalization property of the associated prediction function when a specific parameter space has not been specified and explained beforehand."
  }, {
    "heading": "5.2 Input representation",
    "text": "As we conclude that the notion of flatness for a minimum in the loss function by itself is not sufficient to determine its generalization ability in the general case, we can choose to focus instead on properties of the prediction function instead. Motivated by some work in adversarial examples (Szegedy et al., 2014; Goodfellow et al., 2015) for deep neural networks, one could decide on its generalization property by analyzing the gradient of the prediction function on examples. Intuitively, if the gradient is small on typical points from the distribution or has a small Lipschitz constant, then a small change in the input should not incur a large change in the prediction.\nBut this infinitesimal reasoning is once again very dependent of the local geometry of the input space. For an invertible preprocessing ξ−1, e.g. feature standardization, whitening or gaussianization (Chen & Gopinath, 2001), we will call fξ = f ◦ ξ the prediction function on the preprocessed input u = ξ−1(x). We can reproduce the derivation in Section 5 to obtain\n∂fξ ∂uT\n( ξ(u) ) = ∂f ∂xT ( ξ(u) ) ∂ξ ∂uT (u).\nAs we can alter significantly the relative magnitude of the gradient at each point, analyzing the amplitude of the gradient of the prediction function might prove problematic if the choice of the input space have not been explained beforehand. This remark applies in applications involving images, sound or other signals with invariances (Larsen et al., 2015). For example, Theis et al. (2016) show for images how a small drift of one to four pixels can incur a large difference in terms of L2 norm."
  }, {
    "heading": "6 Discussion",
    "text": "It has been observed empirically that minima found by standard deep learning algorithms that generalize well tend to be flatter than found minima that did not generalize well (Chaudhari et al., 2017; Keskar et al., 2017). However, when following several definitions of flatness, we have shown that the conclusion that flat minima should generalize better than sharp ones cannot be applied as is without further context. Previously used definitions fail to account for the complex geometry of some commonly used deep architectures. In particular, the non-identifiability of the model induced by symmetries, allows one to alter the flatness of a minimum without affecting the function it represents. Additionally the whole geometry of the error surface with respect to the parameters can be changed arbitrarily under different parametrizations. In the spirit of (Swirszcz et al., 2016), our work indicates that more care is needed to define flatness to avoid degeneracies of the geometry of the model under study. Also such a concept can not be divorced from the\nparticular parametrization of the model or input space."
  }, {
    "heading": "Acknowledgements",
    "text": "The authors would like to thank Grzegorz Świrszcz for an insightful discussion on the paper, Harm De Vries, Yann Dauphin, Jascha Sohl-Dickstein and César Laurent for useful discussions about optimization, Danilo Rezende for explaining universal approximation using normalizing flows and Kyle Kastner, Adriana Romero, Junyoung Chung, Nicolas Ballas, Aaron Courville, George Dahl, Yaroslav Ganin, Prajit Ramachandran, Çağlar Gülçehre, Ahmed Touati and the ICML reviewers for useful feedback."
  }],
  "year": 2017,
  "references": [{
    "title": "Natural gradient works efficiently in learning",
    "authors": ["Amari", "Shun-Ichi"],
    "venue": "Neural Comput.,",
    "year": 1998
  }, {
    "title": "Normalization propagation: A parametric technique for removing internal covariate shift in deep networks",
    "authors": ["Arpit", "Devansh", "Zhou", "Yingbo", "Kota", "Bhargava U", "Govindaraju", "Venu"],
    "venue": "arXiv preprint arXiv:1603.01431,",
    "year": 2016
  }, {
    "title": "Understanding symmetries in deep networks",
    "authors": ["Badrinarayanan", "Vijay", "Mishra", "Bamdev", "Cipolla", "Roberto"],
    "venue": "arXiv preprint arXiv:1511.01029,",
    "year": 2015
  }, {
    "title": "Neural machine translation by jointly learning to align and translate",
    "authors": ["Bahdanau", "Dzmitry", "Cho", "Kyunghyun", "Bengio", "Yoshua"],
    "venue": "In ICLR’2015,",
    "year": 2015
  }, {
    "title": "Large-scale machine learning with stochastic gradient descent",
    "authors": ["Bottou", "Léon"],
    "venue": "In Proceedings of COMPSTAT’2010,",
    "year": 2010
  }, {
    "title": "The tradeoffs of large scale learning",
    "authors": ["Bottou", "Léon", "Bousquet", "Olivier"],
    "venue": "Advances in Neural Information Processing Systems,",
    "year": 2008
  }, {
    "title": "On-line learning for very large datasets",
    "authors": ["Bottou", "Léon", "LeCun", "Yann"],
    "venue": "Applied Stochastic Models in Business and Industry,",
    "year": 2005
  }, {
    "title": "Optimization methods for large-scale machine learning",
    "authors": ["Bottou", "Léon", "Curtis", "Frank E", "Nocedal", "Jorge"],
    "venue": "arXiv preprint arXiv:1606.04838,",
    "year": 2016
  }, {
    "title": "Stability and generalization",
    "authors": ["Bousquet", "Olivier", "Elisseeff", "André"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2002
  }, {
    "title": "Listen, attend and spell: A neural network for large vocabulary conversational speech recognition",
    "authors": ["Chan", "William", "Jaitly", "Navdeep", "Le", "Quoc V", "Vinyals", "Oriol"],
    "venue": "In 2016 IEEE International Conference on Acoustics, Speech and Signal Processing,",
    "year": 2016
  }, {
    "title": "Entropy-sgd: Biasing gradient descent into wide valleys",
    "authors": ["Chaudhari", "Pratik", "Choromanska", "Anna", "Soatto", "Stefano", "LeCun", "Yann", "Baldassi", "Carlo", "Borgs", "Christian", "Chayes", "Jennifer", "Sagun", "Levent", "Zecchina", "Riccardo"],
    "venue": "In ICLR’2017,",
    "year": 2017
  }, {
    "title": "The loss surfaces of multilayer networks",
    "authors": ["Choromanska", "Anna", "Henaff", "Mikael", "Mathieu", "Michaël", "Arous", "Gérard Ben", "LeCun", "Yann"],
    "venue": "In AISTATS,",
    "year": 2015
  }, {
    "title": "Attention-based models for speech recognition",
    "authors": ["Chorowski", "Jan K", "Bahdanau", "Dzmitry", "Serdyuk", "Dmitriy", "Cho", "Kyunghyun", "Bengio", "Yoshua"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Wav2letter: an end-to-end convnet-based speech recognition system",
    "authors": ["Collobert", "Ronan", "Puhrsch", "Christian", "Synnaeve", "Gabriel"],
    "venue": "arXiv preprint arXiv:1609.03193,",
    "year": 2016
  }, {
    "title": "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization",
    "authors": ["Dauphin", "Yann N", "Pascanu", "Razvan", "Gülçehre", "Çaglar", "Cho", "KyungHyun", "Ganguli", "Surya", "Bengio", "Yoshua"],
    "year": 2014
  }, {
    "title": "Nice: Nonlinear independent components estimation",
    "authors": ["Dinh", "Laurent", "Krueger", "David", "Bengio", "Yoshua"],
    "venue": "arXiv preprint arXiv:1410.8516,",
    "year": 2014
  }, {
    "title": "Density estimation using real nvp",
    "authors": ["Dinh", "Laurent", "Sohl-Dickstein", "Jascha", "Bengio", "Samy"],
    "venue": "In ICLR’2017,",
    "year": 2016
  }, {
    "title": "Adaptive subgradient methods for online learning and stochastic optimization",
    "authors": ["Duchi", "John", "Hazan", "Elad", "Singer", "Yoram"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2011
  }, {
    "title": "A convolutional encoder model for neural machine translation",
    "authors": ["Gehring", "Jonas", "Auli", "Michael", "Grangier", "David", "Dauphin", "Yann N"],
    "venue": "arXiv preprint arXiv:1611.02344,",
    "year": 2016
  }, {
    "title": "Deep sparse rectifier neural networks",
    "authors": ["Glorot", "Xavier", "Bordes", "Antoine", "Bengio", "Yoshua"],
    "venue": "In Aistats,",
    "year": 2011
  }, {
    "title": "Fast rates for empirical risk minimization of strict saddle problems",
    "authors": ["Gonen", "Alon", "Shalev-Shwartz", "Shai"],
    "venue": "arXiv preprint arXiv:1701.04271,",
    "year": 2017
  }, {
    "title": "Explaining and harnessing adversarial examples",
    "authors": ["Goodfellow", "Ian J", "Shlens", "Jonathon", "Szegedy", "Christian"],
    "venue": "In ICLR’2015",
    "year": 2015
  }, {
    "title": "Speech recognition with deep recurrent neural networks. In Acoustics, speech and signal processing",
    "authors": ["Graves", "Alex", "Mohamed", "Abdel-rahman", "Hinton", "Geoffrey"],
    "venue": "(icassp), 2013 ieee international conference on,",
    "year": 2013
  }, {
    "title": "Deep speech: Scaling up end-to-end speech recognition",
    "authors": ["Hannun", "Awni Y", "Case", "Carl", "Casper", "Jared", "Catanzaro", "Bryan", "Diamos", "Greg", "Elsen", "Erich", "Prenger", "Ryan", "Satheesh", "Sanjeev", "Sengupta", "Shubho", "Coates", "Adam", "Ng", "Andrew Y"],
    "venue": "CoRR, abs/1412.5567,",
    "year": 2014
  }, {
    "title": "Train faster, generalize better: Stability of stochastic gradient descent",
    "authors": ["Hardt", "Moritz", "Recht", "Ben", "Singer", "Yoram"],
    "venue": "Proceedings of the 33nd International Conference on Machine Learning,",
    "year": 2016
  }, {
    "title": "Delving deep into rectifiers: Surpassing human-level performance on imagenet classification",
    "authors": ["He", "Kaiming", "Zhang", "Xiangyu", "Ren", "Shaoqing", "Sun", "Jian"],
    "venue": "In Proceedings of the IEEE international conference on computer vision,",
    "year": 2015
  }, {
    "title": "Deep residual learning for image recognition",
    "authors": ["He", "Kaiming", "Zhang", "Xiangyu", "Ren", "Shaoqing", "Sun", "Jian"],
    "venue": "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
    "year": 2016
  }, {
    "title": "Keeping the neural networks simple by minimizing the description length of the weights",
    "authors": ["Hinton", "Geoffrey E", "Van Camp", "Drew"],
    "venue": "In Proceedings of the sixth annual conference on Computational learning theory,",
    "year": 1993
  }, {
    "title": "Nonlinear independent component analysis: Existence and uniqueness results",
    "authors": ["Hyvärinen", "Aapo", "Pajunen", "Petteri"],
    "venue": "Neural Networks,",
    "year": 1999
  }, {
    "title": "An empirical analysis of deep network loss surfaces",
    "authors": ["Im", "Daniel Jiwoong", "Tao", "Michael", "Branson", "Kristin"],
    "venue": "arXiv preprint arXiv:1612.04010,",
    "year": 2016
  }, {
    "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
    "authors": ["Ioffe", "Sergey", "Szegedy", "Christian"],
    "venue": "In Bach & Blei",
    "year": 2015
  }, {
    "title": "What is the best multi-stage architecture for object recognition",
    "authors": ["Jarrett", "Kevin", "Kavukcuoglu", "Koray", "LeCun", "Yann"],
    "venue": "In Computer Vision,",
    "year": 2009
  }, {
    "title": "On largebatch training for deep learning: Generalization gap and sharp minima",
    "authors": ["Keskar", "Nitish Shirish", "Mudigere", "Dheevatsa", "Nocedal", "Jorge", "Smelyanskiy", "Mikhail", "Tang", "Ping Tak Peter"],
    "venue": "In ICLR’2017,",
    "year": 2017
  }, {
    "title": "Imagenet classification with deep convolutional neural networks",
    "authors": ["Krizhevsky", "Alex", "Sutskever", "Ilya", "Hinton", "Geoffrey E"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2012
  }, {
    "title": "About diagonal rescaling applied to neural nets",
    "authors": ["Lafond", "Jean", "Vasilache", "Nicolas", "Bottou", "Léon"],
    "venue": "ICML Workshop on Optimization Methods for the Next Generation of Machine Learning,",
    "year": 2016
  }, {
    "title": "Autoencoding beyond pixels using a learned similarity",
    "authors": ["Larsen", "Anders Boesen Lindbo", "Sønderby", "Søren Kaae", "Winther", "Ole"],
    "venue": "metric. CoRR,",
    "year": 2015
  }, {
    "title": "On the number of linear regions of deep neural networks",
    "authors": ["Montufar", "Guido F", "Pascanu", "Razvan", "Cho", "Kyunghyun", "Bengio", "Yoshua"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2014
  }, {
    "title": "Rectified linear units improve restricted boltzmann machines",
    "authors": ["Nair", "Vinod", "Hinton", "Geoffrey E"],
    "venue": "In Proceedings of the 27th international conference on machine learning",
    "year": 2010
  }, {
    "title": "Confidence level solutions for stochastic programming",
    "authors": ["Nesterov", "Yurii", "Vial", "Jean-Philippe"],
    "year": 2008
  }, {
    "title": "Path-sgd: Path-normalized optimization in deep neural networks",
    "authors": ["Neyshabur", "Behnam", "Salakhutdinov", "Ruslan R", "Srebro", "Nati"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2015
  }, {
    "title": "Revisiting natural gradient for deep networks",
    "authors": ["Pascanu", "Razvan", "Bengio", "Yoshua"],
    "venue": "ICLR,",
    "year": 2014
  }, {
    "title": "On the expressive power of deep neural networks",
    "authors": ["Raghu", "Maithra", "Poole", "Ben", "Kleinberg", "Jon", "Ganguli", "Surya", "Sohl-Dickstein", "Jascha"],
    "venue": "arXiv preprint arXiv:1606.05336,",
    "year": 2016
  }, {
    "title": "Variational inference with normalizing flows",
    "authors": ["Rezende", "Danilo Jimenez", "Mohamed", "Shakir"],
    "venue": "In Bach & Blei",
    "year": 2015
  }, {
    "title": "Explorations on high dimensional landscapes",
    "authors": ["Sagun", "Levent", "Güney", "V Ugur", "Arous", "Gerard Ben", "LeCun", "Yann"],
    "venue": "arXiv preprint arXiv:1412.6615,",
    "year": 2014
  }, {
    "title": "Weight normalization: A simple reparameterization to accelerate training of deep neural networks",
    "authors": ["Salimans", "Tim", "Kingma", "Diederik P"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2016
  }, {
    "title": "Improved techniques for training gans",
    "authors": ["Salimans", "Tim", "Goodfellow", "Ian", "Zaremba", "Wojciech", "Cheung", "Vicki", "Radford", "Alec", "Chen", "Xi"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2016
  }, {
    "title": "Exact solutions to the nonlinear dynamics of learning in deep linear neural networks",
    "authors": ["Saxe", "Andrew M", "McClelland", "James L", "Ganguli", "Surya"],
    "venue": "CoRR, abs/1312.6120,",
    "year": 2013
  }, {
    "title": "Very deep convolutional networks for large-scale image recognition",
    "authors": ["Simonyan", "Karen", "Zisserman", "Andrew"],
    "venue": "In ICLR’2015,",
    "year": 2015
  }, {
    "title": "Sequence to sequence learning with neural networks. In Advances in neural information processing",
    "authors": ["Sutskever", "Ilya", "Vinyals", "Oriol", "Le", "Quoc V"],
    "year": 2014
  }, {
    "title": "Local minima in training of deep",
    "authors": ["Swirszcz", "Grzegorz", "Czarnecki", "Wojciech Marian", "Pascanu", "Razvan"],
    "venue": "networks. CoRR,",
    "year": 2016
  }, {
    "title": "Intriguing properties of neural networks",
    "authors": ["Szegedy", "Christian", "Zaremba", "Wojciech", "Sutskever", "Ilya", "Bruna", "Joan", "Erhan", "Dumitru", "Goodfellow", "Ian", "Fergus", "Rob"],
    "venue": "In ICLR’2014,",
    "year": 2014
  }, {
    "title": "Going deeper with convolutions",
    "authors": ["Szegedy", "Christian", "Liu", "Wei", "Jia", "Yangqing", "Sermanet", "Pierre", "Reed", "Scott", "Anguelov", "Dragomir", "Erhan", "Dumitru", "Vanhoucke", "Vincent", "Rabinovich", "Andrew"],
    "venue": "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
    "year": 2015
  }, {
    "title": "A note on the evaluation of generative models",
    "authors": ["Theis", "Lucas", "Oord", "Aäron van den", "Bethge", "Matthias"],
    "venue": "In ICLR’2016",
    "year": 2016
  }, {
    "title": "Google’s neural machine translation system: Bridging the gap between human and machine translation",
    "authors": ["Wu", "Yonghui", "Schuster", "Mike", "Chen", "Zhifeng", "Le", "Quoc V", "Norouzi", "Mohammad", "Macherey", "Wolfgang", "Krikun", "Maxim", "Cao", "Yuan", "Gao", "Qin", "Klaus"],
    "venue": "arXiv preprint arXiv:1609.08144,",
    "year": 2016
  }, {
    "title": "Understanding deep learning requires rethinking generalization",
    "authors": ["Zhang", "Chiyuan", "Bengio", "Samy", "Hardt", "Moritz", "Recht", "Benjamin", "Vinyals", "Oriol"],
    "venue": "In ICLR’2017,",
    "year": 2017
  }],
  "id": "SP:42756ab3bacc0f1c3c4d436347cdb939fb29f45e",
  "authors": [{
    "name": "Laurent Dinh",
    "affiliations": []
  }, {
    "name": "Razvan Pascanu",
    "affiliations": []
  }, {
    "name": "Samy Bengio",
    "affiliations": []
  }, {
    "name": "Yoshua Bengio",
    "affiliations": []
  }],
  "abstractText": "Despite their overwhelming capacity to overfit, deep learning architectures tend to generalize relatively well to unseen data, allowing them to be deployed in practice. However, explaining why this is the case is still an open area of research. One standing hypothesis that is gaining popularity, e.g. Hochreiter & Schmidhuber (1997); Keskar et al. (2017), is that the flatness of minima of the loss function found by stochastic gradient based methods results in good generalization. This paper argues that most notions of flatness are problematic for deep models and can not be directly applied to explain generalization. Specifically, when focusing on deep networks with rectifier units, we can exploit the particular geometry of parameter space induced by the inherent symmetries that these architectures exhibit to build equivalent models corresponding to arbitrarily sharper minima. Furthermore, if we allow to reparametrize a function, the geometry of its parameters can change drastically without affecting its generalization properties.",
  "title": "Sharp Minima Can Generalize For Deep Nets"
}