{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Kernel methods such as Gaussian processes (GPs) (Rasmussen, 2006; Srinivas et al., 2009; Snoek et al., 2012) and support vector machines (SVMs) (Chang & Lin, 2011; Fan et al., 2008) have been successfully used in many statistical modeling and machine learning tasks. Despite of strong expressive power, kernel methods usually cannot scale up to the large scale datasets with L samples due to the need of manipulatingL×LGram matrix. Recently, random feature maps (Rahimi et al., 2007; Rahimi & Recht, 2009; Sutherland & Schneider, 2015) have demonstrated their effectiveness on kernel approximation to scale up kernel methods. Roughly speaking, a shift invariant kernel K(x, z) = K(x − z) : Rd → C can be approximated by K(x, z) ≈ Ψ(x)TΨ(z), where Ψ is the explicit mapped feature constructed as Ψ(x) = f(WTx)/ √ N , where f(·)\n1Department of Computer Science, City University of Hong Kong, Tat Chee Avenue, Hong Kong . Correspondence to: Yueming Lyu <LV Yueming@outlook.com>.\nProceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s).\ndenotes the nonlinear function, W ∈ Rd×N is constructed by N i.i.d samples drawn from a distribution defined by K. Therefore, the training and inference of kernel methods can be greatly accelerated by working directly on the primal space of Ψ(·). For example, Gaussian Processes (GPs) have O(L3) computation and O(L2) storage complexity. By using feature maps, it reduces to O(N2L + N3) computation and O(NL + N2) storage complexity. All these elegant properties make random feature maps promising for large scale kernel methods. Thus, many kernel methods (Le & Wilson, 2015; Cutajar et al., 2016; Oliva et al., 2016) have been proposed to deal with large scale statistical learning by directly working on feature maps.\nGenerally, two aspects of random feature maps are mostly concerned by literature for scaling up kernel methods. One is the approximation accuracy of feature maps while the other is the computational cost of feature maps construction. To achieve better approximation accuracy, (Yang, 2014; Avron et al., 2016) employ QMC (Dick et al., 2013) sampling instead of standard Monte Carlo sampling to construct feature maps. By mapping QMC points on [0, 1]d through the inverse cumulative distribution function, they construct more effective feature maps. To reduce time complexity, (Le et al., 2013) propose Fastfood to construct feature maps. Benefiting from the special structured matrix multiplication, it reduces time complexity of feature maps construction from O(Nd) to O(N log d). However, it achieves computational efficiency at the expense of increasing the variance of approximation. Recently, (Feng et al., 2015) employ the property of circulant matrix to accelerate feature maps construction of Gaussian kernel without increasing the variance. (Choromanski & Sindhwani, 2016) generalize the Fastfood and circulant feature maps to P model and particularly discuss the structured matrix with low-displacement rank. Despite of the success of P model, it still cannot achieve better approximation accuracy compared with feature maps obtained with fully Gaussian matrix.\nTo achieve better approximation accuracy and loglinear time complexity, we propose Spherical Structured Feature (SSF) maps to approximate shift and rotation invariant kernels as well as bth-order arc-cosine kernels (Cho & Saul, 2009). Specifically, We construct SSF maps based on the point set on d − 1 dimensional sphere Sd−1, where the\npoints are columns of a particular structured matrix produced by a discrete Fourier matrix. The points on Sd−1 for SSF maps construction can be generated by optimizing the discrete Riesz s-energy. According to (Brauchart et al., 2014), optimizing the discrete Riesz s-energy (for s in some ranges) can generate QMC designs on Sd−1, which usually can achieve smaller approximation error compared with fully random methods. Moreover, Because of special structure of the point set, SSF maps construction can achieve loglinear time complexity via Fast Fourier Transform (FFT).\nOur contributions are summarized as follows:\n• We propose Spherical Structured Feature (SSF) maps to approximate shift and rotation invariant kernels as well as bth-order arc-cosine kernels (Cho & Saul, 2009). We prove that the inner product of SSF maps are unbiased estimates for above kernels if asymptotically uniformly distributed point set on d − 1 dimensional sphere Sd−1 is given.\n• We propose an efficient coordinate decent method to find a local optimum of the discrete Riesz senergy (Brauchart & Grabner, 2015), thereby approximately generating asymptotically uniformly distributed points on Sd−1.\n• We can construct SSF maps with linear space complexity and loglinear time complexity. Empirically, SSF maps achieve superior performance compared with other methods."
  }, {
    "heading": "2. Background and Preliminaries",
    "text": "We provide a brief review of random feature maps and the discrete Riesz s-energy in this section as preliminaries."
  }, {
    "heading": "2.1. Random Feature Maps",
    "text": "Random feature maps can be viewed as equal weight approximation of multidimensional integrals. One earlier work (Rahimi et al., 2007) approximates the shift invariant kernels based on the Bochner’s Theorem.\nTheorem 2.1 Bochner’s Theorem ((Rudin, 2011)) : A continuous shift invariant scaled kernel function K(x, z) = K(x − z) : Rd → C is positive definite if and only if it is the Fourier Transform of a unique finite probability measure p on Rd.\nK(x, z) = ∫ Rd e −i(x−z)Twp(w)dw (1)\nFor a real valued kernel K(x, z), p(w) = p(−w) ≥ 0 can ensure the imaginary parts of the integral vanish. According to the Bochner’s theorem, there is a one-to-one corre-\nspondence between the kernel functions K(x, z) and probability densities p(w) defined on Rd.\nShift and rotation invariant kernels are shift invariant kernels with the rotation invariant property, i.e. K(x, z) = K(Rx, Rz), given any rotation R ∈ SO(d), where SO(d) denotes rotation groups. The Gaussian kernel K(x, z) = e−‖x−z‖ 2 2/2σ 2\nis a member of this family. From Bochner’s theorem, the corresponding probability density is also Gaussian. For a general Gaussian RBF kernel K(x, z) = e−(x−z)\nTΣ(x−z)/2, it can be transformed into rotation invariant form by using y = Σ1/2x in the original domain.\nbth-order arc-cosine kernels are rotation invariant kernels. As discussed in (Cho & Saul, 2009), bth-order arccosine kernels have the following form:\nKb(x, z) = 1 π ‖x‖ b 2 ‖z‖ b 2 Jb(θ) (2) where θ = cos−1 (\nxT z ‖x‖2‖z‖2 ) bth-order arc-cosine kernels have trivial dependence on the norm of x and z. The dependence on the angle is defined by function Jb(θ). bth-order arc-cosine kernels are rotation invariant kernels but not shift invariant kernels in general. For example, the zero-order (3) and first-order (4) arc-cosine kernel are not shift invariant kernels.\nK0(x, z) = 1− θπ (3)\nK1(x, z) = 1 π ‖x‖2 ‖z‖2 (sin θ + (π − θ) cos θ) (4)\nThe bth-order arc-cosine kernel Kb(x, z) can be reformulated via the integral representation:\nKb(x, z) = 2 ∫ Rd s(w Tx)s(wT z)(wTx) b (wT z) b p(w)dw\n(5) where s(·) is a step function (i.e. s(x) = 1 if x > 0 and 0 otherwise) and the density p is standard Gaussian.\nFeature maps: Both Monte Carlo and Quasi-Monte Carlo approximation (Dick et al., 2013) are equal weight approximation to integrals. Based on equal weight approximation, the feature maps can be constructed as:\nK(x, z) ≈ 1N N∑ i=1 f ( wTi x ) f ( wTi x ) = Ψ(x)TΨ(z)\n(6) where wi, i ∈ 1, ..., N are samples constructed by Monte Carlo or Quasi-Monte Carlo methods. f(·) is a nonlinear function depending on the kernel. Ψ(·) is the explicit finite dimensional feature map. For Gaussian kernel with bandwidth σ, the associated nonlinear function is a complex exponential function f(x) = eix/σ . For a zero-order arccosine kernel in (3) and first-order arc-cosine kernel in (4), the associated nonlinear functions are step function f(x) = s(x) and ReLU activation function f(x) = max(0, x) respectively."
  }, {
    "heading": "2.2. Discrete Riesz s-energy",
    "text": "The discrete Riesz s-energy is related to the equal weight numerical integration and uniformly distributed point set.\nEqual weight numerical integration over a d-dimensional sphere Sd := {x ∈ Rd+1 | ‖x‖2 = 1} uses equal weight summation of finite point evaluations of the integrands to approximate the integrals:\n∫ Sd f(v)dσ(v) ≈ 1 N N∑ i=1 f(vi) (7)\nwhere σ denotes the normalized surface area measure on Sd.\nAccording to (Brauchart & Grabner, 2015), the point set V = [v1, ...,vN ] ∈ Sd×N is asymptotically uniformly distributed if equation (8) holds true.\nlim N→∞\n1 N N∑ i=1 f(vi) = ∫ Sd f(v)dσ(v) (8)\nThe discrete Riesz s-energy(Götz, 2003; Brauchart & Grabner, 2015) is defined as equation (9):\nEs (V) :=  N∑ i=1 N∑ j=1,j 6=i 1 ‖vi−vj‖s2 , s 6= 0 N∑ i=1 N∑ j=1,j 6=i log 1‖vi−vj‖2 , s = 0\n(9)\nTheorem 2.2 ((Brauchart & Grabner, 2015)): For s > −2, the optimum N-point configuration of the Riesz s-energy on Sd is asymptotically uniformly distributed w.r.t the normalized surface area measure σ on Sd.\nAccording to (Brauchart et al., 2014; Brauchart & Grabner, 2015), the discrete Riesz s-energy can serve as a criterion to construct the point set V = [v1, ...,vN ] ∈ Sd×N for QMC designs. Particularly, (Brauchart et al., 2014) have proved that maximizing the discrete Riesz s-energy with s ∈ (−2, 0) can generate QMC designs for functions in Sobolev space. They also prove that QMC designs have higher convergence rate of worst-case error than fully randomly chosen points for functions in Sobolev space."
  }, {
    "heading": "3. Spherical Structured Feature Maps",
    "text": "In this section, we propose SSF maps to approximate shift and rotation invariant kernels as well as bth-order arccosine kernels by employing their rotation invariant property."
  }, {
    "heading": "3.1. Feature Maps for Shift and Rotation Invariant Kernels",
    "text": "Shift and rotation invariant kernels are highly symmetric and structured because they satisfy both shift invariant property and rotation invariant property. Rotation invariant property means that K(x, z) = K(Rx, Rz), given any rotation R ∈ SO(d), where SO(d) denotes rotation groups. To benefit from rotation invariant property, it is reasonable to construct the feature maps by using spherical equal weight approximation in equation (7) and (8).\nThe feature maps for real valued shift and rotation invariant kernels K(x, z) can be constructed as equation (10):\nΨ (x) = 1√ NM\n[cos ( Φ−(t1)x Tv1 ) , sin ( Φ−(t1)x Tv1 ) ,\n..., cos ( Φ−(tM )x TvN ) , sin ( Φ−(tM )x TvN ) ]T\n(10) where tj = jM+1 , V = [v1, ...,vN ] ∈ S\nd−1×N denotes the point set asymptotically uniformly distributed on Sd−1and Φ−(x) denotes the inverse cumulative distribution function w.r.t the nonnegative radial scale.\nTheorem 3.1: Ψ(x)TΨ (z) is an unbiased estimate of a real valued shift and rotation invariant kennel K(x, z).\nProof: From Bochner’s Theorem, a shift invariant kernel K(x, z) can be written as equation (1). Let r = ‖w‖2and p(r) be the density function of r. Because of the rotation invariant property of K(x, z), we achieve equation (11).\nK(x, z) = ∫ R+ ∫ Sd−1 e −ir(x−z)Tvp(r)drdσ(v)\n= ∫\n[0,1] ∫ Sd−1 e −i Φ−(t)(x−z)Tvdσ(v)dt\n(11) where R+ denotes the nonnegative real values.\nFor real valued kernel K(x, z), the imaginary parts of the integral vanish. We can achieve equation (12).\nK(x, z) = ∫\n[0,1] ∫ Sd−1 cos ( Φ−(t)(x− z)Tv ) dσ(v)dt\n(12) According to the property of asymptotically uniformly distributed point set V in equation (8) and the onedimensional QMC rule, we obtain equation (13).\nlim M,N→∞\nΨ(x) T Ψ (z) =\nlim M,N→∞\n1 MN N∑ i=1 M∑ j=1 (cos ( Φ−(tj)x Tvi ) cos ( Φ−(tj)z Tvi )\n+ sin ( Φ−(tj)x Tvi ) sin ( Φ−(tj)z Tvi ) )\n= lim M,N→∞\n1 MN M∑ j=1 N∑ i=1 cos ( Φ−(tj)(x− z)Tvi )\n= ∫\n[0,1] ∫ Sd−1 cos ( Φ−(t)(x− z)Tv ) dσ(v)dt\n= K(x, z) (13)\nProposition 3.1: Let U = [V,−V], using point set U to approximate a real valued shift and rotation invariant kernel K(x, z) by using equation (10) is equal to using point set V to approximate K(x, z):\nΨ(x;U) T Ψ (z;U) = Ψ(x;V) T Ψ (z;V) (14)\nProof: Note that cosine function is an even function. Thus, we obtain equation (15).\ncos ( Φ−(tj)(x− z)Tvi ) = cos ( −Φ−(tj)(x− z)Tvi ) (15)\nThus, we achieve equation (16).\nΨ(x;U) T Ψ (z;U)\n= 12NM N∑ i=1 M∑ j=1 cos ( Φ−(tj)(x− z)Tvi )\n+ 12NM N∑ i=1 M∑ j=1 cos ( −Φ−(tj)(x− z)Tvi ) = 12NM N∑ i=1 M∑ j=1 2 cos ( Φ−(tj)(x− z)Tvi ) = Ψ(x;V) T Ψ (z;V)\n(16)\nProposition 3.1 shows that for a shift and rotation invariant kernel, computing N points can achieve the same approximation effect compared with using 2N points.\n3.2. Feature Maps for bth-order Arc-cosine Kernels\nIn this subsection, we discuss the feature maps for bthorder arc-cosine kernels. We discuss them separately because they are rotation invariant kernels but not shift invariant kernels in general. Moreover, they are closely related to deep neural networks (Cho & Saul, 2009), which demonstrate super performance in many areas.\nLemma 3.1: The bth-order arc-cosine kernels can be calculated as equation (17).\nKb(x, z) = Cb ∫ Sd−1 χ ( vTx ) χ ( vT z ) +χ(−vTx)χ(−vT z)dσ(v) (17)\nwhere χ(x) = max(0, sign(x)|x|b), Cb = ∫ R+ r\n2bp(r)dr. Cb is a constant that is independent of x and z. p(r) is the density function of the chi-distribution with d degrees freedom. For example, the constants associated with the zero, first and second-order arc-cosine kernels are C0 = 1, C1 = d and C2 = d(d+ 2) respectively.\nProof: From equation (5), we can achieve equation (18).\nKb(x, z) = 2 ∫ Rd s(w Tx)s(wT z)(wTx) b (wT z) b p(w)dw\n= 2 ∫ Rd χ ( wTx ) χ ( wT z ) p(w)dw\n(18)\nLet r = ‖w‖2. Since p is standard Gaussian, by taking rotation invariant property, we obtain equation (19).\nKb(x, z) = 2 ∫ Rd χ ( wTx ) χ ( wTz ) p(w)dw\n= 2 ∫ Sd−1 ∫ R+ χ ( rbvTx ) χ ( rbvT z ) p(r)dσ(v)dr\n= 2 ∫ Sd−1 ∫ R+ r 2bχ ( vTx ) χ ( vT z ) p(r)dσ(v)dr\n= 2 ∫ R+ r 2bp(r)dr ∫ Sd−1 χ ( vTx ) χ ( vT z ) dσ(v)\n= 2Cb ∫ Sd−1 χ ( vTx ) χ ( vT z ) dσ(v)\n(19) Since Kb(x, z) is rotation invariant, we have Kb(x, z) = Kb(−x,−z). Together with equation (19), we achieve equation (20).\nKb(x, z) = Cb ∫ Sd−1 χ ( vTx ) χ ( vT z ) +χ(−vTx)χ(−vT z)dσ(v) (20)\nThe feature maps for a bth-order arc-cosine kernel Kb(x, z) can be constructed as equation (21).\nΨ (x) = √\nCb N [χ ( vT1 x ) , χ ( −vT1 x ) , ....,\nχ ( vTNx ) , χ ( −vTNx ) ]T ∈ R2N\n(21)\nTheorem 3.2: Ψ(x)TΨ (z) is an unbiased estimate of a bth-order arc-cosine kernel Kb(x, z).\nProof: According to the Lemma 3.1 and the property of the asymptotically uniformly distributed point set V, we obtain equation (22).\nlim N→∞\nΨ(x) T Ψ (z)\n= lim N→∞\nCb N N∑ i=1 χ ( vTi x ) χ ( vTi z ) + χ(−vTi x)χ(−vTi z)\n= Cb ∫ Sd−1 χ ( vTx ) χ ( vT z ) + χ(−vTx)χ(−vT z)dσ(v) = Kb(x, z) (22)\nFrom equation (17) and (22), we observe that the approximation is actually operated on the (d − 1)-dimensional domain instead of d-dimensional domain (Cho & Saul, 2009). Generally, the approximation error of Quasi Monte Carlo methods with N points depends on the dimension of integration. A lower dimension leads to smaller approximation error, thus the feature maps in equation (21) can achieve lower approximation error.\nThe feature maps in equation (21) are closely related to the bidirectional activation neural network. Specifically, the feature maps for the first-order arc-cosine kernel are related to the bidirectional ReLU activation function (An et al., 2015) which has the distance preservation property compared with ReLU.\nFrom equation (14) and (21), we know that the feature maps actually rely on the point set U = [V,−V]. The design of the point set U will be discussed in section 4."
  }, {
    "heading": "4. Design of Matrix U",
    "text": "We have discussed the construction of SSF maps in last section. However, one unsolved problem is how to obtain the matrix U = [V,−V]. We employ the discrete Riesz s-energy as the objective function to obtain matrix U because it can generate asymptotically uniformly distributed points on Sd−1 (Brauchart & Grabner, 2015). Moreover, to achieve computation and storage efficiency for feature maps construction , we add a structured constraint to the matrix U. In this section, we show the structure of matrix U first and then the optimization of discrete Riesz s-energy.\nIt is worth noting that matrix U can be used not only for kernel approximation, but also for approximation of general integrals over hypersphere. Moreover, by using FFT, matrix U can accelerate the integral approximation which involves projection operations. In addition, it only needs to store the indexes with linear storage cost (i.e. O(d)) instead of to explicitly store the matrix with cost O(Nd)."
  }, {
    "heading": "4.1. Structure of Matrix U",
    "text": "Since U can be constructed by V, i.e. U = [V,−V], we only need to define structured matrix V. To achieve loglinear time complexity of SSF maps construction, we construct V by extracting rows from a discrete Fourier matrix. The complexity analysis of SSF maps construction based on matrix V is given in section 5.\nMathematically, the construction of matrix V is shown as follows. Without loss of generality, we assume that d = 2m,N = 2n, m < n. Let F ∈ Cn×n be a n × n discrete Fourier matrix. Fk,j = e 2πikj n is the (k, j)thentry of F ,\nwhere i = √ −1. Let Λ = [k1, k2, ..., km] ⊂ {1, ..., n− 1} be a subset of indexes.\nThe structured matrix V can be defined as equation (23).\nV = 1√ m [ ReFΛ −ImFΛ ImFΛ ReFΛ ] ∈ Rd×N (23)\nwhere FΛ in equation (24) is the matrix constructed by m rows of F .\nFΛ=  e 2πik11 n · · · e 2πik1n n ... . . .\n... e 2πikm1 n · · · e 2πikmn n  ∈ Cm×n (24) With the V given in equation (23), it is easy to verify that ‖vi‖2 = 1 for i ∈ {1, ..., n}. Thus, each column of matrix V is a point on Sd−1."
  }, {
    "heading": "4.2. Minimize the Discrete Riesz s-energy",
    "text": "With structured matrix V defined in equation (23), our goal is to select a subset of indexes Λ that optimizes the discrete\nRiesz s-energy. Specifically, we will discuss how to minimize the Riesz 0-energy in equation (25). The other Riesz s-energy can be optimized in a similar way.\nE(U) = 2N∑ i=1 2N∑ j=1,j 6=i log 1‖ui−uj‖ (25)\nwhere U = [V,−V] = [u1, ...,u2N ].\nIn the following, we will discuss how to minimize equation (25) by using a coordinate decent method.\nTheorem 4.1: Let U = [V,−V] with V defined in (23), the discrete Riesz 0-energy of U can be calculated as equation (26).\nE(U) = C − 2n n−1∑ p=1 log ( 1− (Im 1m m∑ s=1 e 2πiksp n ) 2) −2n\nn−1∑ p=1 log ( 1− (Re 1m m∑ s=1 e 2πiksp n ) 2) (26)\nwhere C is a constant independent of the choice of Λ.\nProof: Since U = [V,−V] ∈ S(d−1)×2N, we obtain equation (27).\nE(U) = − 2N∑ i=1 2N∑ j=1,j6=i log ‖ui − uj‖\n= −2 N∑ i=1 log ‖2vi‖\n−2 N∑ i=1 N∑ j=1,j 6=i (log ‖vi − vj‖+ log ‖vi + vj‖)\n= C − 2 N∑ i=1 N∑ j=1,j 6=i log (‖vi − vj‖ ‖vi + vj‖)\n= C − 2 N∑ i=1 N∑ j=1,j 6=i log (√ 2− 2vTi vj √ 2 + 2vTi vj ) (27)\nRecall that N = 2n. By separating the summation term into two parts (each part has n×n term), we achieve equation (28).\nE(U) = C− 2 2n∑ i=1 2n∑ j=1,j 6=i log\n( 2 √ 1− (vTi vj) 2 )\n= C − 4 n∑ i=1 2n∑ j=n+1 log\n( 2 √ 1− (vTi vj) 2 )\n−4 n∑ i=1 n∑ j=1,j 6=i log\n( 2 √ 1− (vTi vj) 2 )\n(28)\nLet V·,1:n = [v1, ...,vn] and V·,n+1:2n = [vn+1, ...,v2n] be the matrix consisting of the first n and last n columns of V respectively. We can obtain equation (29).\nVT·,1:nV·,n+1:2n = 1 mReFΛ T(−ImFΛ) + 1m (ImFΛ) TReFΛ (29)\nNote that all diagonal elements of VT·,1:nV·,n+1:2n are zero. By further separating the first summation term of equation (28) into two parts, we obtain equation (30).\nE(U) = C− 4 n∑\ni=1 2n∑ j=n+i log ( 2 √ 1− 0 ) −4\nn∑ i=1 2n∑ j=n+1,j 6=n+i log\n( 2 √ 1− (vTi vj) 2 )\n−4 n∑ i=1 n∑ j=1,j 6=i log\n( 2 √ 1− (vTi vj) 2 )\n= C − 4 n∑ i=1 2n∑ j=n+1,j 6=n+i log\n( 2 √ 1− (vTi vj) 2 )\n−4 n∑ i=1 n∑ j=1,j 6=i log\n( 2 √ 1− (vTi vj) 2 )\n(30)\nTo be concise, let Z = [z1, , ..., zn] = 1√mFΛ.\nFor 1 ≤ j ≤ n, j 6= i, we achieve equation (31).\n(vTi vj) 2 = (Rez∗i zj) 2 = ( 1 mRe m∑ s=1 e2πiksp/n )2\n(31)\nFor n+ 1 ≤ j ≤ 2n, , j 6= n+ i, we attain equation (32).\n(vTi vj) 2 = (Imz∗i zj−n) 2 = ( 1 m Im m∑ s=1 e2πiksp/n )2\n(32) In equation (31) and (32), p ≡ i − j (mod n), where mod denotes the modulus operation on integers.\nNote that z∗i zj has at most n− 1 distinct values when i 6= j (mod n) . Together with equation (30), we achieve equation (33).\nE(U) = C− 4 n∑\ni=1 2n∑ j=n+1,j 6=n+i log\n( 2 √ 1− (vTi vj) 2 )\n−4 n∑ i=1 n∑ j=1,j 6=i log\n( 2 √ 1− (vTi vj) 2 )\n= C − 4 n∑ i=1 2n∑ j=n+1,j 6=n+i log\n( 2 √\n1− (Imz∗i zj−n) 2 ) −4\nn∑ i=1 n∑ j=1,j 6=i log\n( 2 √\n1− (Rez∗i zj) 2 ) = C − 4n\nn−1∑ p=1 log\n( 2 √ 1− (Im 1m m∑ s=1 e2πiksp/n) 2 )\n−4n n−1∑ p=1 log\n( 2 √ 1− (Re 1m m∑ s=1 e2πiksp/n) 2 )\n= C − 2n n−1∑ p=1 log ( 1− (Im 1m m∑ s=1 e2πiksp/n) 2)\n−2n n−1∑ p=1 log ( 1− (Re 1m m∑ s=1 e2πiksp/n) 2)\n(33)\nAlgorithm 1 Initialization: random sample Λ = [k1, k2, ..., km] from {1, 2, ...n− 1} without replacement. Set h̃ = 1TFΛ repeat\nSet J = J(Λ) for q = 1 to m do\nSet g = [e2πikq/n, e2πikq2/n..., e2πikq(n−1)/n] Set h = h̃− g Find k∗q by k ∗ q = arg max\nkq∈{1,...,n−1} J(kq) in (35)\nUpdate g = [e2πik ∗ q/n, e2πik ∗ q2/n..., e2πik ∗ q (n−1)/n]\nSet h̃ = h + g end for\nuntil J does not change\nFrom Theorem 4.1, we know that minimizing E(U) is equivalent to maximizing J(Λ) which is defined in equation (34).\nJ(Λ) = n−1∑ p=1 log ( 1− (Im 1m m∑ s=1 e2πiksp/n) 2)\n+ n−1∑ p=1 log ( 1− (Re 1m m∑ s=1 e2πiksp/n) 2) (34)\nBy keeping all the indexes in Λ = [k1, k2, ..., km] fixed except the qth element, we can obtain equation (35).\nJ(kq) = n−1∑ p=1 log ( 1− (Im ( hp + e 2πikqp/n ) /m) 2 )\n+ n−1∑ p=1 log ( 1− (Re ( hp + e 2πikqp/n ) /m) 2 )\n(35) where kq ∈ {1, 2, ...n− 1}, hp = m∑\ns=1,s6=q e2πiksp/n.\nWith equation (35), we can maximize J(Λ) by maximizing J(kq) with other indexes fixed each time. Let h = [h1, ..., hn−1] , g = [e2πikq/n, e2πikq2/n..., e2πikq(n−1)/n]. 1 = [1, ..., 1]T ∈ Rm is the vector of all ones. A coordinate ascent method to maximize J(Λ) is given in Algorithm 1.\nObviously, it is a discrete optimization problem. Algorithm 1 can find a local optimum. The time complexity of the Algorithm 1 isO(Tmn2), where T denotes the number of outer iteration. Empirically, the outer iteration T is less than ten."
  }, {
    "heading": "5. Fast Feature Maps Construction",
    "text": "In this section, we will discuss how to construct SSF maps in loglinear time complexity and linear space complexity by using the structure property of V.\nTheorem 5.1 Assume that d = 2m,N = 2n, m < n. Let\nx = [ x1 x2 ] ∈ R2m and z = x1 + ix2 ∈ Cm. Given Λ = [k1, k2, ..., km] ⊂ {1, ..., n − 1} , let y ∈ Cn with yΛ = z. Other elements outside the index set Λ are equal to zero. Given V defined in equation (23), equation (36) holds.\nVTx = 1√ m [Re(F ∗y), Im(F ∗y)] T (36)\nProof: Let Ω ∈ Rn×n be a diagonal matrix with all diagonal elements inside the index set Λ equal to one , the others equal to zero.\nVTx = 1√ m [ ReFΛ −ImFΛ ImFΛ ReFΛ ]T [ x1 x2 ] = 1√\nm\n[ (ReFΛ T )x1 + (ImFΛ T )x2\n(−ImFΛT )x1 + (ReFΛT )x2 ] = 1√\nm [ Re(F ∗Λz) Im(F ∗Λz) ] = 1√\nm [ Re(F ∗Ωy) Im(F ∗Ωy) ] = 1√\nm [ Re(F ∗y) Im(F ∗y)\n] (37)\nThus, the projection operation VTx (previously mentioned in equation (10) and (21)) can be calculated by Fast Fourier Transform algorithm (FFT) in O(n log n) time complexity. Because scaling and taking nonlinear transform can be finished in O(n), the total time complexity to construct SSF maps is O(n log n).\nAll steps to construct SSF maps are summarized as follows:\n(a) Compute x̃ by x̃ = Dx, where D ∈ {−1,+1}d×d is a diagonal matrix where diagonal elements are uniformly sampled from {−1,+1}.\n(b) Construct y such that yΛ = x̃1 + ix̃2, other elements outside the index set Λ are equal to zero.\n(c) Compute VT x̃ by equation (36) via FFT.\n(d) Construct feature maps Ψ (x) via equation (10) or (21).\nFor each (m,n) pair , the index set Λ only need to be computed once. It takes O(m) space to store Λ. For shift and rotation invariant kernels, it takes O(M) space to store Φ−(tj), j ∈ 1, ...,M and takes O(d) (d = 2m) space to store Λ and D. For bth-order arc-cosine kernels, it only needs to store one parameter Cb and takes O(d) space to store Λ and D. By setting M ≤ d, the total space complexity to store the projection matrix is O(d)."
  }, {
    "heading": "6. Empirical Studies",
    "text": "We compare SSF maps with feature maps obtained by fully Gaussian (Cho & Saul, 2009; Rahimi et al., 2007), the Cir-\nculant (Choromanski & Sindhwani, 2016) matrices, QMC with Halton set and QMC with Sobol set (Avron et al., 2016). For Halton set and Sobol set, the implementation in MATLAB are employed in the experiments. The scrambling and shifting techniques are used for Haltonset and Sobolset. In all the experiments, we fix M = 1 (the number of one-dimensional QMC points) for SSF maps."
  }, {
    "heading": "6.1. Convergence and Speedup",
    "text": "First, the convergence of the logarithmic energy ( −J(Λ) in equation (34)) with (m,n) = (160, 1600) is shown in Figure 1. From Figure 1, we find that it takes less than ten iterations (i.e. T < 10) for Algorithm 1 to find a local optimum.\nSecond, the speedup results of all methods are shown in\nFigure 2. We set N = 2d for all the methods. The speedup of fully Gaussian projection is the baseline. We can observe that the speedup of QMC with Halton set is constant as the dimension d increases and is slower than the baseline. The speedup of both SSF maps and the Circulant increase fast as dimension increases, which is consistent with theoretical analysis. The speedup of Sobol set is not shown because the inbuilt Sobolset routine of MATLAB does not support dimension larger than 1,111."
  }, {
    "heading": "6.2. Approximation Accuracy",
    "text": "We evaluate reconstruction error of Gaussian kernel, zeroorder arc-cosine kernel and first-order arc-cosine kernel on CIFAR10 (Krizhevsky & Hinton, 2009), MNIST (LeCun & Cortes, 2010), usps and dna dataset. MNIST is a handwritten digit image dataset, which contains 70,000 samples with 784-dimensional features(pixel). For CIFAR10 with 60,000 samples, the 320-dimensional gist feature (Gong et al., 2013) are employed in the experiments. Both the relative Frobenius error (i.e. ‖K̃−K‖ F\n‖K‖F ) and the relative\nelement-wise maximum error (i.e. ‖K̃−K‖∞ ‖K‖∞ ) are evaluated, where K and K̃ denote the exact and approximated Gram matrices respectively. The Frobenius norm and the elementwise maximum norm are defined as ‖X‖F =√∑\ni ∑ j |Xij |\n2 and ‖X‖∞ = maxi,j |Xij | respectively.\nThe reconstruction error in the experiments is the mean value over 10 independent runs. The dimensions of the feature maps are set to {2×d, 3×d, 4×d, 5×d}, where d is the dimension of the data. For MNIST and CIFAR10 dataset, each run randomly select 2,000 samples to construct the Gram matrix. The mean value of the reconstruction errors with different norms on MNIST are shown in Figure 3. Results on the other datasets are similar to that of Figure 3. One can refer to the supplementary material for results on other datasets.\nFigure 3 shows that the feature maps obtained with fully Gaussian matrix, the Circulant matrix, QMC with Halton set and QMC with Sobol set have similar reconstruction error. SSF maps have the smallest approximation error among five methods. Especially for the first-order arccosine kernel, it achieves nearly one-fifth relative mean error and one-seventh relative max error of other methods. Moreover, even if M = 1, SSF maps can achieve about one-third relative mean error and half of the relative max error of other methods for Gaussian Kernel approximation."
  }, {
    "heading": "7. Conclusion",
    "text": "We propose Spherical Structured Feature (SSF) maps to approximate shift and rotation invariant kernels as well as bthorder arc-cosine kernels. SSF maps can achieve computation and storage efficiency as well as better approximation accuracy."
  }, {
    "heading": "Acknowledgements",
    "text": "We thank the anonymous reviewers for their valuable comments and suggestions."
  }],
  "year": 2017,
  "references": [{
    "title": "How can deep rectifier networks achieve linear separability and preserve distances",
    "authors": ["An", "Senjian", "Boussaid", "Farid", "Bennamoun", "Mohammed"],
    "venue": "In ICML,",
    "year": 2015
  }, {
    "title": "Quasi-monte carlo feature maps for shift-invariant kernels",
    "authors": ["Avron", "Haim", "Sindhwani", "Vikas", "Yang", "Jiyan", "Mahoney", "Michael W"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2016
  }, {
    "title": "Qmc designs: optimal order quasi monte carlo integration schemes on the sphere",
    "authors": ["J Brauchart", "E Saff", "I Sloan", "R. Womersley"],
    "venue": "Mathematics of computation,",
    "year": 2014
  }, {
    "title": "Distributing many points on spheres: minimal energy and designs",
    "authors": ["Brauchart", "Johann S", "Grabner", "Peter J"],
    "venue": "Journal of Complexity,",
    "year": 2015
  }, {
    "title": "Libsvm: a library for support vector machines",
    "authors": ["Chang", "Chih-Chung", "Lin", "Chih-Jen"],
    "venue": "ACM Transactions on Intelligent Systems and Technology (TIST),",
    "year": 2011
  }, {
    "title": "Kernel methods for deep learning",
    "authors": ["Cho", "Youngmin", "Saul", "Lawrence K"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2009
  }, {
    "title": "Recycling randomness with structure for sublinear time kernel expansions",
    "authors": ["Choromanski", "Krzysztof", "Sindhwani", "Vikas"],
    "year": 2016
  }, {
    "title": "Practical learning of deep gaussian processes via random fourier features",
    "authors": ["Cutajar", "Kurt", "Bonilla", "Edwin V", "Michiardi", "Pietro", "Filippone", "Maurizio"],
    "venue": "arXiv preprint arXiv:1610.04386,",
    "year": 2016
  }, {
    "title": "Highdimensional integration: the quasi-monte carlo way",
    "authors": ["Dick", "Josef", "Kuo", "Frances Y", "Sloan", "Ian H"],
    "venue": "Acta Numerica,",
    "year": 2013
  }, {
    "title": "Liblinear: A library for large linear classification",
    "authors": ["Fan", "Rong-En", "Chang", "Kai-Wei", "Hsieh", "Cho-Jui", "Wang", "Xiang-Rui", "Lin", "Chih-Jen"],
    "venue": "Journal of machine learning research,",
    "year": 2008
  }, {
    "title": "Random feature mapping with signed circulant matrix projection",
    "authors": ["Feng", "Chang", "Hu", "Qinghua", "Liao", "Shizhong"],
    "venue": "In IJCAI, pp",
    "year": 2015
  }, {
    "title": "On the riesz energy of measures",
    "authors": ["Götz", "Mario"],
    "venue": "Journal of Approximation Theory,",
    "year": 2003
  }, {
    "title": "Learning multiple layers of features from tiny images",
    "authors": ["Krizhevsky", "Alex", "Hinton", "Geoffrey"],
    "year": 2009
  }, {
    "title": "Fastfoodapproximating kernel expansions in loglinear time",
    "authors": ["Le", "Quoc", "Sarlós", "Tamás", "Smola", "Alex"],
    "venue": "In Proceedings of the international conference on machine learning,",
    "year": 2013
  }, {
    "title": "Bayesian nonparametric kernel-learning",
    "authors": ["Oliva", "Junier B", "Dubey", "Avinava", "Poczos", "Barnabas", "Schneider", "Jeff", "Xing", "Eric P"],
    "venue": "In Proceedings of the 19th International Conference on Artificial Intelligence and Statistics,",
    "year": 2016
  }, {
    "title": "Weighted sums of random kitchen sinks: Replacing minimization with randomization in learning",
    "authors": ["Rahimi", "Ali", "Recht", "Benjamin"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2009
  }, {
    "title": "Random features for large-scale kernel machines",
    "authors": ["Rahimi", "Ali", "Recht", "Benjamin"],
    "venue": "In NIPS,",
    "year": 2007
  }, {
    "title": "Gaussian processes for machine learning",
    "authors": ["Rasmussen", "Carl Edward"],
    "year": 2006
  }, {
    "title": "Fourier analysis on groups",
    "authors": ["Rudin", "Walter"],
    "year": 2011
  }, {
    "title": "Practical bayesian optimization of machine learning algorithms",
    "authors": ["Snoek", "Jasper", "Larochelle", "Hugo", "Adams", "Ryan P"],
    "venue": "In Advances in neural information processing systems,",
    "year": 2012
  }, {
    "title": "Gaussian process optimization in the bandit setting: No regret and experimental design",
    "authors": ["Srinivas", "Niranjan", "Krause", "Andreas", "Kakade", "Sham M", "Seeger", "Matthias"],
    "venue": "arXiv preprint arXiv:0912.3995,",
    "year": 2009
  }, {
    "title": "On the error of random fourier features",
    "authors": ["Sutherland", "Dougal J", "Schneider", "Jeff"],
    "venue": "arXiv preprint arXiv:1506.02785,",
    "year": 2015
  }, {
    "title": "Quasimonte carlo feature maps for shift-invariant",
    "authors": ["J. Yang", "Sindhwani. V. Avron H. Mahoney M"],
    "venue": "kernels. ICML,",
    "year": 2014
  }],
  "id": "SP:b6e7cce12b7b0327c164602b5a328fb209506296",
  "authors": [{
    "name": "Yueming Lyu",
    "affiliations": []
  }],
  "abstractText": "We propose Spherical Structured Feature (SSF) maps to approximate shift and rotation invariant kernels as well as b-order arc-cosine kernels (Cho & Saul, 2009). We construct SSF maps based on the point set on d − 1 dimensional sphere Sd−1. We prove that the inner product of SSF maps are unbiased estimates for above kernels if asymptotically uniformly distributed point set on Sd−1 is given. According to (Brauchart & Grabner, 2015), optimizing the discrete Riesz s-energy can generate asymptotically uniformly distributed point set on Sd−1. Thus, we propose an efficient coordinate decent method to find a local optimum of the discrete Riesz s-energy for SSF maps construction. Theoretically, SSF maps construction achieves linear space complexity and loglinear time complexity. Empirically, SSF maps achieve superior performance compared with other methods.",
  "title": "Spherical Structured Feature Maps for Kernel Approximation"
}