{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Spectral clustering algorithms are designed to solve a relaxation of the graph cut problem based on graph Laplacians that capture pairwise dependencies between vertices, and produce sets with small conductance that represent clusters. Due to their scalability and provable performance guarantees, spectral methods represent one of the most prevalent graph clustering approaches (Chung, 1997; Ng et al., 2002).\nMany relevant problems in clustering, semisupervised learning and MAP inference (Zhou et al., 2007; Hein et al., 2013; Zhang et al., 2017) involve higher-order vertex dependencies that require one to consider hypergraphs instead of graphs. To address spectral hypergraph clustering problems, several approaches have been proposed that typically operate by first projecting the hypergraph onto a graph via clique expansion and then performing spectral clustering on graphs (Zhou et al., 2007). Clique expansion involves transforming a weighted hyperedge into a weighted clique such that the graph cut weights approximately preserve the cut weights of the hyperedge. Almost exclusively, these\n1Department of Electrical and Computer Engineering, University of Illinois Urbana-Champaign, USA. Correspondence to: Pan Li <panli2@illinois.edu>, Olgica Milenkovic <milenkov@illinois.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\napproximations have been based on the assumption that each hyperedge cut has the same weight, in which case the underlying hypergraph is termed homogeneous.\nHowever, in image segmentation, MAP inference on Markov random fields (Arora et al., 2012; Shanu et al., 2016), network motif studies (Li & Milenkovic, 2017; Benson et al., 2016; Tsourakakis et al., 2017) and rank learning (Li & Milenkovic, 2017), higher order relations between vertices captured by hypergraphs are typically associated with different cut weights. In (Li & Milenkovic, 2017), Li and Milenkovic generalized the notion of hyperedge cut weights by assuming that different hyperedge cuts have different weights, and that consequently, each hyperedge is associated with a vector of weights rather than a single scalar weight. If the weights of the hyperedge cuts are submodular, then one can use a graph with nonnegative edge weights to efficiently approximate the hypergraph, provided that the largest size of a hyperedge is a relatively small constant. This property of the projected hypergraphs allows one to leverage spectral hypergraph clustering algorithms based on clique expansions with provable performance guarantees. Unfortunately, the clique expansion method in general has two drawbacks: The spectral clustering algorithm for graphs used in the second step is merely quadratically optimal, while the projection step can cause a large distortion.\nTo address the quadratic optimality issue in graph clustering, Amghibech (Amghibech, 2003) introduced the notion of p-Laplacians of graphs and derived Cheeger-type inequalities for the second smallest eigenvalue of a p-Laplacian, p > 1, of a graph. These results motivated Bühler and Hein’s work (Bühler & Hein, 2009) on spectral clustering based on p-Laplacians that provided tighter approximations of the Cheeger constant. Szlam and Bresson (Szlam & Bresson, 2010) showed that the 1-Laplacian allows one to exactly compute the Cheeger constant, but at the cost of computational hardness (Chang, 2016). Very little is known about the use of p-Laplacians for hypergraph clustering and their spectral properties.\nTo address the clique expansion problem, Hein et al. (Hein et al., 2013) introduced a clustering method for homogeneous hypergraphs that avoids expansions and works directly with the total variation of homogeneous hypergraphs,\nwithout investigating the spectral properties of the operator. The only other line of work trying to mitigate the projection problem is due to Louis (Louis, 2015), who used a natural extension of 2-Laplacians for homogeneous hypergraphs, derived quadratically-optimal Cheeger-type inequalities and proposed a semidefinite programing (SDP) based algorithm whose complexity scales with the size of the largest hyperedge in the hypergraph.\nOur contributions are threefold. First, we introduce submodular hypergraphs. Submodular hypergraphs allow one to perform hyperedge partitionings that depend on the subsets of elements involved in each part, thereby respecting higherorder and other constraints in graphs (see (Li & Milenkovic, 2017; Arora et al., 2012; Fix et al., 2013) for applications in food network analysis, learning to rank, subspace clustering and image segmentation). Second, we define p-Laplacians for submodular hypergraphs and generalize the corresponding discrete nodal domain theorems (Tudisco & Hein, 2016; Chang et al., 2017) and higher-order Cheeger inequalities. Even for homogeneous hypergraphs, nodal domain theorems were not known and only one low-order Cheeger inequality for 2-Laplacians was established by Louis (Louis, 2015). An analytical obstacle in the development of such a theory is the fact that p-Laplacians of hypergraphs are operators that act on vectors and produce sets of values. Consequently, operators and eigenvalues have to be defined in a set-theoretic manner. Third, based on the newly established spectral hypergraph theory, we propose two spectral clustering methods that learn the second smallest eigenvalues of 2- and 1-Laplacians. The algorithm for 2-Laplacian eigenvalue computation is based on an SDP framework and can provably achieve quadratic optimality with an O( √ ζ(E)) approximation constant, where ζ(E) denotes the size of the largest hyperedge in the hypergraph. The algorithm for 1-Laplacian eigenvalue computation is based on the inverse power method (IPM) (Hein & Bühler, 2010) that only has convergence guarantees. The key novelty of the IPM-based method is that the critical inner-loop optimization problem of the IPM is efficiently solved by algorithms recently developed for decomposable submodular minimization (Jegelka et al., 2013; Ene & Nguyen, 2015; Li & Milenkovic, 2018). Although without performance guarantees, given that the 1-Laplacian provides the tightest approximation guarantees, the IPM-based algorithm – as opposed to the clique expansion method (Li & Milenkovic, 2017) – performs very well empirically even when the size of the hyperedges is large. This fact is illustrated on several UC Irvine machine learning datasets available from (Asuncion & Newman, 2007).\nThe paper is organized as follows. Section 2 contains an overview of graph Laplacians and introduces the notion of submodular hypergraphs. The section also contains a description of hypergraph Laplacians, and relevant concepts in submodular function theory. Section 3 presents the funda-\nmental results in the spectral theory of p-Laplacians, while Section 4 introduces two algorithms for evaluating the second largest eigenvalue of p-Laplacians needed for 2-way clustering. Section 5 presents experimental results. All proofs are relegated to the Supplementary Material."
  }, {
    "heading": "2. Mathematical Preliminaries",
    "text": "A weighted graph G = (V,E,w) is an ordered pair of two sets, the vertex set V = [N ] = {1, 2, . . . , N} and the edge set E ⊆ V × V , equipped with a weight function w : E → R+.\nA cut C = (S, S̄) is a bipartition of the set V , while the cut-set (boundary) of the cut C is defined as the set of edges that have one endpoint in S and one in the complement of S, S̄, i.e., ∂S = {(u, v) ∈ E | u ∈ S, v ∈ S̄}. The weight of the cut induced by S equals vol(∂S) = ∑ u∈S, v∈S̄ wuv , while the conductance of the cut is defined as\nc(S) = vol(∂S)\nmin{vol(S), vol(S̄)} ,\nwhere vol(S) = ∑ u∈S µu, and µu = ∑ v∈V wuv. Whenever clear from the context, for e = (uv), we write we instead of wuv. Note that in this setting, the vertex weight values µu are determined based on the weights of edges we incident to u. Clearly, one can use a different choice for these weights and make them independent from the edge weights, which is a generalization we pursue in the context of submodular hypergraphs. The smallest conductance of any bipartition of a graph G is denoted by h2 and referred to as the Cheeger constant of the graph.\nA generalization of the Cheeger constant is the k−way Cheeger constant of a graph G. Let Pk denote the set of all partitions of V into k-disjoint nonempty subsets, i.e., Pk = {(S1, S2, ..., Sk)|Si ⊂ V, Si 6= ∅, Si ∩ Sj = ∅,∀i, j ∈ [k], i 6= j}. The k−way Cheeger constant is defined as\nhk = min (S1,S2,...,Sk)∈Pk max i∈[k] c(Si).\nSpectral graph theory provides a means for bounding the Cheeger constant using the (normalized) Laplacian matrix of the graph, defined as L = D − A and L = I −D−1/2AD−1/2, respectively. Here, A stands for the adjacency matrix of the graph, D denotes the diagonal degree matrix, while I stands for the identity matrix. The graph Laplacian is an operator4(g)2 (Chung, 1997) that satisfies\n〈x,4(g)2 (x)〉 = ∑\n(uv)∈E\nwuv(xu − xv)2.\nA generalization of the above operator termed the pLaplacian operator of a graph 4(g)p was introduced by\nAmghibech in (Amghibech, 2003), where 〈x,4(g)p (x)〉 = ∑\n(uv)∈E\nwuv|xu − xv|p.\nThe well known Cheeger inequality asserts the following relationship between h2 and λ, the second smallest eigenvalue of the normalized Laplacian4(g)2 of a graph:\nh2 ≤ √ 2λ ≤ 2 √ h2.\nIt can be shown that the cut ĥ2 dictated by the elements of the eigenvector associated with λ satisfies ĥ2 ≤ √ 2λ, which\nimplies ĥ2 ≤ 2 √ h2. Hence, spectral clustering provides a quadratically optimal graph partition."
  }, {
    "heading": "2.1. Submodular Hypergraphs",
    "text": "A weighted hypergraph G = (V,E,w) is an ordered pair of two sets, the vertex set V = [N ] and the hyperedge set E ⊆ 2V , equipped with a weight function w : E → R+. The relevant notions of cuts, boundaries and volumes for hypergraphs can be defined in a similar manner as for graphs. If each cut of a hyperedge e has the same weight we, we refer to the cut as a homogeneous cut and the corresponding hypergraph as a homogeneous hypergraph.\nFor a ground set Ω, a set function f : 2Ω → R is termed submodular if for all S, T ⊆ Ω, one has f(S) + f(T ) ≥ f(S ∪ T ) + f(S ∩ T ).\nA weighted hypergraph G = (V,E,µ,w) is termed a submodular hypergraph with vertex set V , hyperedge set E and positive vertex weight vector µ , {µv}v∈V , if each hyperedge e ∈ E is associated with a submodular weight function we(·) : 2e → [0, 1]. In addition, we require the weight function we(·) to be:\n1) Normalized, so that we(∅) = 0, and all cut weights corresponding to a hyperedge e are normalized by ϑe = maxS⊆e we(S). In this case, we(·) ∈ [0, 1];\n2) Symmetric, so that we(S) = we(e\\S) for any S ⊆ e;\nThe submodular hyperedge weight functions are summarized in the vector w , {(we, ϑe)}e∈E . If we(S) = 1 for all S ∈ 2e\\{∅, e}, submodular hypergraphs reduce to homogeneous hypergraphs. We omit the designation homogeneous whenever there is no context ambiguity.\nClearly, a vertex v is in e if and only if we({v}) > 0: If we({v}) = 0, the submodularity property implies that v is not incident to e, as for any S ⊆ e\\{v}, |we(S ∪ {v}) − we(S)| ≤ we({v}) = 0.\nWe define the degree of a vertex v as dv = ∑ e∈E: v∈e ϑe, i.e., as the sum of the max weights of edges incident to the vertex v. Furthermore, for any vector y ∈ RN , we define the projection weight of y onto any subset S ⊆ V\nas y(S) = ∑ v∈S yv. The volume of a subset of vertices\nS ⊆ V equals vol(S) = ∑ v∈S µv.\nFor any S ⊆ V , we generalize the notions of the boundary of S and the volume of the boundary of S according to ∂S = {e ∈ E|e ∩ S 6= ∅, e ∩ S̄ 6= ∅}, and\nvol(∂S) = ∑ e∈∂S ϑewe(S) = ∑ e∈E ϑewe(S), (1)\nrespectively. Then, the normalized cut induced by S, the Cheeger constant and the k-way Cheeger constant for hypergraphs are defined in an analogous manner as for graphs."
  }, {
    "heading": "2.2. Laplacian Operators for Hypergraphs",
    "text": "We introduce next p-Laplacians of hypergraphs and a number of relevant notions associated with Laplacian operators.\nHein et al.(Hein et al., 2013) connected p-Laplacians4(h)p for homogeneous hypergraphs with the total variation via\n〈x,4(h)p (x)〉 = ∑ e∈E we max u,v∈e |xu − xv|p,\nwhere we denotes the weight of a homogeneous hyperedge e. They also introduced the Inverse Power Method (IPM) to evaluate the spectrum of the hypergraph 1-Laplacian 4(h)1 (Hein et al., 2013), but did not establish any performance guarantees. In an independent line of work, Louis (Louis, 2015) introduced a quadratic variant of a hypergraph Laplacian\n〈x,4(h)2 (x)〉 = ∑ e∈E we max u,v∈e (xu − xv)2.\nHe also derived a Cheeger-type inequality relating the second smallest eigenvalue λ of 4(h)2 and the Cheeger constant of the hypergraph h2 that reads as ĥ2 ≤ O( √ log ζ(E)) √ λ ≤ O( √ log ζ(E)) √ h2. Compared to the result of graph (3.12), for homogeneous hypergraphs, log ζ(E) plays as some additional difficulty to approximate h2. Learning the spectrum of generalizations of hypergraph Laplacians can be an even more challenging task."
  }, {
    "heading": "2.3. Relevant Background on Submodular Functions",
    "text": "Given an arbitrary set function F : 2V → R satisfying F (V ) = 0, the Lovász extension (Lovász, 1983) f : RN → R of F is defined as follows: For any vector x ∈ RN , we order its entries in nonincreasing order xi1 ≥ xi2 ≥ · · · ≥ xin while breaking the ties arbitrarily, and set\nf(x) = N−1∑ j=1 F (Sj)(xij − xij+1), (2)\nwith Sj = {i1, i2, ..., ij}. For submodular F , the Lovász extension is a convex function (Lovász, 1983).\nLet 1S ∈ RN be the indicator vector of the set S. Hence, for any S ⊆ V , one has F (S) = f(1S). For a submodular F , we define a convex set termed the base polytope\nB , {y ∈ RN |y(S) ≤ F (S), for all S ⊆ V, and such that y(V ) = F (V ) = 0}.\nAccording to the defining property of submodular functions (Lovász, 1983), we may write f(x) = maxy∈B〈y, x〉.\nThe subdifferential ∇f(x) of f is defined as\n{y ∈ RN | f(x′)− f(x) ≥ 〈y, x′ − x〉, ∀x′ ∈ RN}.\nAn important result from (Bach et al., 2013) characterizes the subdifferentials∇f(x): If f(x) is the Lovász extension of a submodular function F with base polytope B, then\n∇f(x) = arg max y∈B 〈y, x〉. (3)\nObserve that∇f(x) is a set and that the right hand side of the definition represents a set of maximizers of the objective function. If f(x) is the Lovász extension of a submodular function, then 〈q, x〉 = f(x) for all q ∈ ∇f(x).\nFor each hyperedge e ∈ E of a submodular hypergraph, following the above notations, we let Be, E(Be), fe denote the base polytope, the set of extreme points of the base polytope, and the Lovász extension of the submodular hyperedge weight function we, respectively. Note that for any S ⊆ V , we(S) = we(S ∩ e). Consequently, for any y ∈ Be, yv = 0 for v 6∈ e. Since ∇fe ⊆ Be, it also holds that (∇fe)v = 0 for v /∈ e. When using formula (2) to explicitly describe the Lovász extension fe, we can either use a vector x of dimension N or only those of its components that lie in e. Furthermore, in the later case, |E(Be)| = |e|!.\n3. p-Laplacians of Submodular Hypergraphs We start our discussion by defining the notion of a pLaplacian operator for submodular hypergraphs. We find the following definitions useful for our subsequent exposition.\nLet sgn(·) be the sign function defined as sgn(a) = 1, for a > 0, sgn(a) = −1, for a < 0, and sgn(a) = [−1, 1], for a = 0. For all v ∈ V , define the entries of a vector ϕp over RN according to (ϕp(x))v = |xv|p−1sgn(xv). Furthermore, let U be a N ×N diagonal matrix such that Uvv = µv for all v ∈ V .\nLet ‖x‖`p,µ = ( ∑ v∈V µv|xv|p)1/p and Sp,µ , {x ∈ RN |‖x‖`p,µ = 1}. For a function Φ over RN , let Φ|Sp,µ stand for Φ restricted to Sp,µ. Definition 3.1. The p-Laplacian operator of a submodular hypergraph, denoted by4p (p ≥ 1), is defined for all x ∈\nRN according to 〈x,4p(x)〉 , Qp(x) = ∑ e∈E ϑefe(x) p. (4)\nHence,4p(x) may also be specified directly as an operator over RN that reads as\n4p(x) = { ∑ e∈E ϑefe(x) p−1∇fe(x) p > 1,∑\ne∈E ϑe∇fe(x) p = 1.\nDefinition 3.2. A pair (λ, x) ∈ R × RN/{0} is called an eigenpair of the p-Laplacian4p if4p(x) ∩ λU ϕp(x) 6= ∅.\nAs fe(1) = 0, we have 4p(1) = 0, so that (0,1) is an eigenpair of the operator 4p. A p-Laplacian operates on vectors and produces sets. In addition, since for any t > 0, 4p(tx) = tp−14p(x) and ϕp(tx) = tp−1ϕp(x), (tx, λ) is an eigenpair if and only if (x, λ) is an eigenpair. Hence, one only needs to consider normalized eigenpairs: In our setting, we choose eigenpairs that lie in Sp,µ for a suitable choice for the dimension of the space.\nFor linear operators, the Rayleigh-Ritz method (Gould, 1966) allows for determining approximate solutions to eigenproblems and provides a variational characterization of eigenpairs based on the critical points of functionals. To generalize the method, we introduce two even functions,\nQ̃p(x) , Qp(x)|Sp,µ , Rp(x) , Qp(x)\n‖x‖p`p,µ .\nDefinition 3.3. A point x ∈ Sp,µ is termed a critical point of Rp(x) if 0 ∈ ∇Rp(x). Correspondingly, Rp(x) is termed a critical value of Rp(x). Similarly, x is termed a critical point of Q̃p if there exists a σ ∈ ∇Qp(x) such that P (x)σ = 0, where P (x)σ stands for the projection of σ onto the tangent space of Sp,µ at the point x. Correspondingly, Q̃p(x) is termed a critical value of Q̃p.\nThe relationships between the critical points of Q̃p(x) and Rp(x) and the eigenpairs of4p relevant to our subsequent derivations are listed in Theorem 3.4.\nTheorem 3.4. A pair (λ, x) (x ∈ Sp,µ) is an eigenpair of the operator4p 1) if and only if x is a critical point of Q̃p with critical value λ, and provided that p ≥ 1. 2) if and only if x is a critical point of Rp with critical value λ, and provided that p > 1. 3) if x is a critical point of Rp with critical value λ, and provided that p = 1.\nThe critical points of Q̃p bijectively characterize eigenpairs for all choices of p ≥ 1. However, Rp has the same property only if p > 1. This is a consequence of the nonsmoothness of the set S1,µ, which has been observed for graphs as well (See the examples in Section 2.2 of (Chang, 2016))."
  }, {
    "heading": "3.1. Discrete Nodal Domain Theorem for p−Laplacians",
    "text": "Nodal domain theorems are essential for understanding the structure of eigenvectors of operators and they have been the subject of intense study in geometry and graph theory alike (Bıyıkoglu et al., 2007). The eigenfunctions of a Laplacian operator may take positive and negative values. The signs of the values induce a partition of the vertices in V into maximal connected components on which the sign of the eigenfunction does not change: These components represent the nodal domains of the eigenfunction and approximate the clusters of the graphs.\nDavies et al. (BrianDavies et al., 2001) derived the first discrete nodal domain theorem for the4(g)2 operator. Chang et al. (Chang et al., 2017) and Tudisco et al. (Tudisco & Hein, 2016) generalized these theorem for4(g)1 and4 (g) p (p > 1) of graphs. In what follows, we prove that the discrete nodal domain theorem applies to4p of submodular hypergraphs.\nAs every nodal domain theorem depends on some underlying notion of connectivity, we first define the relevant notion of connectivity for submodular hypergraphs. In a graph or a homogeneous hypergraph, vertices on the same edge or hyperedge are considered to be connected. However, this property does not generalize to submodular hypergraphs, as one can merge two nonoverlapping hyperedges into one without changing the connectivity of the hyperedges. To see why this is the case, consider two hyperedges e1 and e2 that are nonintersecting. One may transform the submodular hypergraph so that it includes a hyperedge e = e1 ∪ e2 with weight we = we1 + we2 . This transformation essentially does not change the submodular hypergraph, but in the newly obtained hypergraph, according to the standard definition of connectivity, the vertices in e1 and e2 are connected. This problem may be avoided by defining connectivity based on the volume of the boundary set.\nDefinition 3.5. Two distinct vertices u, v ∈ V are said to be connected if for any S such that u ∈ S and v /∈ S, vol(∂S) > 0. A submodular hypergraph is connected if for any non-empty S ⊂ V , one has vol(∂S) > 0.\nAccording to the following lemma, it is always possible to transform the weight functions of submodular hypergraph in such a way as to preserve connectivity.\nLemma 3.6. Any submodular hypergraph G = (V,E,w,µ) can be reduced to another submodular hypergraph G′ = (V,E′,w′,µ) without changing vol(∂S) for any S ⊆ V and ensuring that for any e ∈ E′, and u, v ∈ e, u and v are connected.\nDefinition 3.7. Let x ∈ RN . A positive (respectively, negative) strong nodal domain is the set of vertices of a maximally connected induced subgraph of G such that {v ∈ V |xv > 0} (respectively, {v ∈ V |xv < 0}). A positive (respectively, negative) weak nodal domain is defined in\nthe same manner, except for changing the strict inequalities as {v ∈ V |xv ≥ 0} (respectively, {v ∈ V |xv ≤ 0}).\nThe following lemma establishes that for a connected submodular hypergraph G, all nonconstant eigenvectors of the operator4p correspond to nonzero eigenvalues. Lemma 3.8. If G is connected, then all eigenvectors associated with the zero eigenvalue have constant entries.\nWe next state new nodal domain theorems for submodular hypergraph p−Laplacians. The results imply the bounds for the numbers of nodal domains induced from eigenvectors of p-Laplacian do not essentially change compared to those for graphs (Tudisco & Hein, 2016). We do not consider the case p = 1, although it is possible to adapt the methods for analyzing the4(g)1 operators of graphs to41 operators of submodular hypergraphs. Such a generalization requires extensions of the critical-point theory to piecewise linear manifolds (Chang, 2016). Theorem 3.9. Let p > 1 and assume that G is a connected submodular hypergraph. Furthermore, let the eigenvalues of 4p be ordered as 0 = λ(p)1 < λ (p) 2 ≤ · · · ≤ λ (p) k−1 < λ (p) k = · · · = λ(p)k+r−1 < λ (p) k+r ≤ · · · ≤ λ (p) n , with λ (p) k having multiplicity r. Let x be an arbitrary eigenvector associated with λ(p)k . Then x induces at most k + r − 1 strong and at most k weak nodal domains. Lemma 3.10. Let G be a connected submodular hypergraph. For p > 1, any nonconstant eigenvector has at least two weak (strong) nodal domains. Hence, the eigenvectors associated with the second smallest eigenvalue λ(p)2 have exactly two weak (strong) nodal domains. For p = 1, the eigenvectors associated with the second smallest eigenvalue λ\n(1) 2 may have only one single weak (strong) nodal domain. We define next the following three functions: µ+p (x) ,∑ v∈V :xv>0 µv|xv| p−1, µ0(x) , ∑ v∈V :xv=0 µv, and\nµ−p (x) , ∑ v∈V :xv<0 µv|xv|\np−1. Lemma 3.11. Let G be a connected submodular hypergraph. Then, for any nonconstant eigenvector x of4p, one has µ+p (x)−µ−p (x) = 0 for p > 1, and |µ+1 (x)−µ − 1 (x)| ≤ µ0(x) for p = 1. Consequently, 0 ∈ arg minc∈R ‖x − c1‖p`p,µ for any p ≥ 1.\nThe nodal domain theorem characterizes the structure of the eigenvectors of the operator, and the number of nodal domains determines the approximation guarantees in Cheegertype inequalities relating the spectra of graphs and hypergraphs and the Cheeger constant. These observations are rigorously formalized in the next section."
  }, {
    "heading": "3.2. Higher-Order Cheeger Inequalities",
    "text": "In what follows, we analytically characterize the relationship between the Cheeger constants and the eigenvalues\nλ (p) k of4p for submodular hypergraphs. Theorem 3.12. Suppose that p ≥ 1 and let (λ(p)k , xk) be the k−th eigenpair of the operator 4p, with mk denoting the number of strong nodal domains of xk. Then,(\n1\nτ )p−1( hmk p )p ≤ λ(p)k ≤ (min{ζ(E), k}) p−1 hk,\nwhere τ = maxv dv/µv . For homogeneous hypergraphs, a tighter bound holds that reads as(\n2\nτ )p−1( hmk p )p ≤ λ(p)k ≤ 2 p−1 hk.\nIt is straightforward to see that setting p = 1 produces the tightest bounds on the eigenvalues, while the case p = 2 reduces to the classical Cheeger inequality. This motivates an in depth study of algorithms for evaluating the spectrum of p = 1, 2-Laplacians, described next."
  }, {
    "heading": "4. Spectral Clustering Algorithms for Submodular Hypergraphs",
    "text": "The Cheeger constant is frequently used as an objective function for (balanced) graph and hypergraph partitioning (Zhou et al., 2007; Bühler & Hein, 2009; Szlam & Bresson, 2010; Hein & Bühler, 2010; Hein et al., 2013; Li & Milenkovic, 2017). Theorem 3.12 implies that λ(p)k is a good approximation for the k-way Cheeger constant of submodular graphs. Hence, to perform accurate hypergraph clustering, one has to be able to efficiently learn λ(p)k (Ng et al., 2002; Von Luxburg, 2007). We outline next how to do so for k = 2.\nIn Theorem 4.1, we describe an objective function that allows us to characterize λ(p)2 in a computationally tractable manner; the choice of the objective function is related to the objective developed for graphs in (Bühler & Hein, 2009; Szlam & Bresson, 2010). Minimizing the proposed objective function produces a real-valued output vector x ∈ RN . Theorem 4.3 describes how to round the vector x and obtain a partition which provably upper bounds c(S). Based on the theorems, we propose two algorithms for evaluating λ\n(2) 2 and λ (1) 2 . Since λ (1) 2 = h2, the corresponding partition corresponds to the tightest approximation of the 2-way Cheeger constant. The eigenvalue λ(2)2 can be evaluated in polynomial time with provable performance guarantees. The problem of devising good approximations for values λ\n(p) k , k 6= 2, is still open.\nLet Zp,µ(x, c) , ‖x − c1‖p`p,µ and Zp,µ(x) , minc∈R Zp,µ(x, c), and define\nRp(x) , Qp(x)\nZp,µ(x) . (5)\nTheorem 4.1. For p > 1, λ(p)2 = infx∈RN Rp(x). Moreover, λ(1)2 = infx∈RN R1(x) = h2. Definition 4.2. Given a nonconstant vector x ∈ RN , and a threshold θ, set Θ(x, θ) = {v : xv > θ}. The optimal conductance obtained from thresholding vector x equals\nc(x) = inf θ∈[xmin,xmax) vol(∂Θ(x, θ)) min{vol(Θ(x, θ)), vol(V/Θ(x, θ))} .\nTheorem 4.3. For any x ∈ RN that satisfies 0 ∈ arg minc Zp,µ(x, c), i.e., such that Zp,µ(x, 0) = Zp,µ(x), one has c(x) ≤ p τ (p−1)/pRp(x)1/p, where τ = maxv∈V dv/µv .\nIn what follows, we present two algorithms. The first algorithm describes how to minimizeR2(x), and hence provides a polynomial-time solution for submodular hypergraph partitioning with provable approximation guarantees, given that the size of the largest hyperedge is a constant. The result is concluded in Theorem 4.5. The algorithm is based on an SDP, and may be computationally too intensive for practical applications involving large hypergrpahs of even moderately large hyperedges. The second algorithm is based on IPM (Hein & Bühler, 2010) and aims to minimize R1(x). Although this algorithm does not come with performance guarantees, it provably converges (see Theorem 4.6) and has good heuristic performance. Moreover, the inner loop of the IPM involves solving a version of the proximal-type decomposable submodular minimization problem (see Theorem 4.7), which can be efficiently performed using a number of different algorithms (Kolmogorov, 2012; Jegelka et al., 2013; Nishihara et al., 2014; Ene & Nguyen, 2015; Li & Milenkovic, 2018).\n4.1. An SDP Method for MinimizingR2(x)\nThe R2(x) minimization problem introduced in Equation (5) may be rewritten as\nmin x:Ux⊥1\nQ2(x)\n‖x‖2`2,µ , (6)\nwhere we observe that Q2(x) = ∑ e∈E ϑef 2 e (x) =∑\ne∈E ϑe maxy∈E(Be)〈y, x〉2. This problem is, in turn, equivalent to the nonconvex optimization problem\nmin x∈RN ∑ e ϑe ( max y∈E(Be) 〈y, x〉 )2 (7)\ns.t. ∑ v∈V µvx 2 v = 1, ∑ v∈V µvxv = 0.\nFollowing an approach proposed for homogeneous hypergraphs (Louis, 2015), one may try to solve an SDP relaxation of (7) instead. To describe the relaxation, let each vertex v of the graph be associated with a vector x′v ∈ Rn,\nn ≥ ζ(E). The assigned vectors are collected into a matrix of the form X = (x′1, .., x ′ N ). The SDP relaxation reads as\nmin X∈Rn×N , η∈R|E| ∑ e ϑeη 2 e (8)\ns.t. ‖Xy‖22 ≤ η2e ∀y ∈ E(Be), e ∈ E∑ v∈V µv‖x′v‖22 = 1, ∑ v∈V µvx ′ v = 0.\nNote that E(Be) is of size O(|e|!), and the above problem can be solved efficiently if ζ(E) is small.\nAlgorithm 1 lists the steps of an SDP-based algorithm for minimizingR2(x), and it comes with approximation guarantees stated in Lemma 4.4. In contrast to homogeneous hypergraphs (Louis, 2015), for which the approximation factor equals O(log ζ(E)), the guarantees for general submodular hypergraphs are O(ζ(E)). This is due to the fact that the underlying base polytope Be for a submodular function is significantly more complex than the corresponding polytope for the homogeneous case. We conjecture that this approximation guarantee is optimal for SDP methods.\nAlgorithm 1: Minimization ofR2(x) using SDP Input: A submodular hypergraph G = (V,E,w,µ) 1: Solve the SDP (8). 2: Generate a random Gaussian vector g ∼ N(0, In), where In denotes the identity matrix of order n. 3: Output x = XT g.\nLemma 4.4. Let x be as in Algorithm 1, and let the optimal value of (8) be SDPopt. Then, with high probability, R2(x) ≤ O(ζ(E)) SDPopt ≤ O(ζ(E)) minR2.\nThis result immediately leads to the following theorem.\nTheorem 4.5. Suppose that x is the output of Algorithm 1. Then, c(x) ≤ O( √ ζ(E)τ h2) with high probability.\nWe describe next Algorithm 2 for optimizingR1(x) which has guaranteed convergence properties.\nTheorem 4.6. The sequence {xk} generated by Algorithm 2 satisfiesR1(xk+1) ≤ R1(xk).\nThe computationally demanding part of Algorithm 2 is the optimization procedure in Step 3. The optimization problem is closely related to the problem of submodular function minimization (SFM) due to the defining properties of the Lovász extension. Theorem 4.7 describes different equivalent formulations of the optimization problem in Step 3.\nTheorem 4.7. If the norm of the vector z in Step 3 is ‖z‖2, the underlying optimization problem is the dual of the following `2 minimization problem\nmin ye ‖ ∑ e∈E ye − λ̂kgk‖22, ye ∈ ϑeBe, ∀ e ∈ E, (9)\nAlgorithm 2: IPM-based minimization ofR1(x) Input: A submodular hypergraph G = (V,E,w,µ) Find nonconstant x0 ∈ RN s.t. 0 ∈ arg minc ‖x0 − c1‖`1,µ initialize λ̂0 ← R1(x0), k ← 0\n1: Repeat:\n2: For v ∈ V , gkv ←\n{ sgn(xkv)µv, if x k v 6= 0\n−µ + 1 (x k)−µ−1 (x k)\nµ0(xk) µv, if xkv = 0\n3: zk+1 ← arg minz:‖z‖≤1Q1(z)− λ̂k〈z, gk〉 4: ck+1 ← arg minc ‖zk+1 − c1‖`1,µ 5: xk+1 ← zk+1 − ck+11 6: λ̂k+1 ← R1(xk+1) 7: Until |λ̂k+1 − λ̂k|/λ̂k < 8. Output xk+1\nwhere the primal and dual variables are related according to z = λ̂kgk− ∑ e∈E ye\n‖λ̂kgk− ∑ e∈E ye‖2 .\nIf the norm of the vector z in Step 3 is ‖z‖∞, the underlying optimization problem is equivalent to the following SFM problem\nmin S⊆V ∑ e ϑewe(S)− λ̂kgk(S), (10)\nwhere the the primal and dual variables are related according to zv = 1 if v ∈ S, and zv = −1 if v /∈ S.\nFor special forms of submodular weights, different algorithms for the optimization problems in Theorem 4.7 may be used instead. For graphs and homogeneous hypergraphs with hyperedges of small size, the min-cut algorithms by Karger et al. and Chekuri et al. (Karger, 1993; Chekuri & Xu, 2017) allow one to efficiently solve the discrete problem (10). Continuous optimization methods such as alternating projections (AP) (Nishihara et al., 2014) and coordinate descend methods (CDM) (Ene & Nguyen, 2015) can be used to solve (9) by “tracking” minimum norm points of base polytopes corresponding to individual hyperedges, where for general submodular weights, the Wolfe’s Algorithm (Wolfe, 1976) can be used. When the submodular weights have some special properties, such as that they depend only on the cardinality of the input, there exist algorithms that operate efficiently even when |e| is extremely large (Jegelka et al., 2013).\nIn our experimental evaluations, we use a random coordinate descent method (RCDM) (Ene & Nguyen, 2015), which ensures an expected (1 + )−approximation by solving an expected number ofO(|V |2|E| log 1 ) min-norm-point problems. Note that when performing continuous optimization, one does not need to solve the inner-loop optimization problem exactly and is allowed to exit the loop as long as the objective function value decreases. The underlying algorithm – Algorithm 3 – is described in the Supplement."
  }, {
    "heading": "5. Experiments",
    "text": "In what follows, we compare the algorithms for submodular hypergraph clustering described in the previous section to two methods: The IPM for homogeneous hypergraph clustering (Hein et al., 2013) and the clique expansion method (CEM) for submodular hypergraph clustering (Li & Milenkovic, 2017). We focus on 2-way graph partitioning problems related to the University of California Irvine (UCI) datasets selected for analysis in (Hein et al., 2013), described in Table 1 of the Supplementary Material. The datasets include 20Newsgroups, Mushrooms, Covertype. In all datasets, ζ(E) was roughly 103, and each of these datasets describes multiple clusters. Since we are interested in 2-way partitioning, we focused on two pairs of clusters in Covertype, denoted by (4, 5) and (6, 7), and paired the four 20Newsgroups clusters, one of which includes Comp. and Sci, and another one which includes Rec. and Talk. The Mushrooms and 20Newsgroups datasets contain only categorical features, while Covertype also includes numerical features. We adopt the same approach as the one described in (Hein et al., 2013) to construct hyperedges: Each feature corresponds to one hyperedge; hence, each categorical feature is captured by one hyperedge, while numerical features are first quantized into 10 bins of equal size, and then mapped to hyperedges. To describe the submodular weights, we fix ϑe = 1 for all hyperedges and parametrize we using a variable α ∈ (0, 0.5]\nwe(S;α) = 1\n2 +\n1 2 min { 1, |S| dα|e|e , |e/S| dα|e|e } , ∀S ⊆ e.\nThe intuitive explanation behind our choice of weights is that it allows one to accommodate categorization errors and outliers: In contrast to the homogeneous case in which any partition of a hyperedge has weight one, the chosen submodular weights allow a smaller weight to be used when the hyperedge is partitioned into small parts, i.e., when min{|S|, |e/S|} < dα|e|e. In practice, α is chosen to be relatively small – in all experiments, we set α ≤ 0.04, with α close to zero producing homogeneous hyperedge weights.\nThe results are shown in Figure 1. As may be observed, both in terms of the Clustering error (i.e., the total number of erroneously classified vertices) and the values of the Cheeger constant, IPM-based methods outperform CEM. This is due to the fact that for large hyperedge sizes, CEM incurs a high distortion when approximating the submodular weights (O(ζ(E)) (Li & Milenkovic, 2017)). Moreover, as we(S) depends merely on |S|, the submodular hypergraph CEM reduces to the homogeneous hypergraph CEM (Zhou et al., 2007), which is an issue that the IPM-based method does not face. Comparing the performance of IPM on submodular hypergraphs (IPM-S) with that on homogeneous hypergraphs (IPM-H), we see that IPM-S achieves better clustering performance on both 20Newsgroups and Covertypes, and offers the same performance as IPM-H on the Mushrooms dataset. This indicates that it is practically useful to use submodular hyperedge weights for clustering purposes. A somewhat unexpected finding is that for certain cases, one observes that when α increases (and thus, when we decreases), the corresponding Cheeger constant increases. This may be caused by the fact that the IPM algorithm can get trapped in a local optima."
  }],
  "year": 2018,
  "references": [{
    "title": "Eigenvalues of the discrete p-Laplacian for graphs",
    "authors": ["S. Amghibech"],
    "venue": "Ars Combinatoria,",
    "year": 2003
  }, {
    "title": "Generic cuts: An efficient algorithm for optimal inference in higher order MRF-MAP",
    "authors": ["Arora", "Chetan", "Banerjee", "Subhashis", "Kalra", "Prem", "Maheshwari", "SN"],
    "venue": "In Proceedings of the European Conference on Computer Vision,",
    "year": 2012
  }, {
    "title": "Higher-order organization of complex",
    "authors": ["Benson", "Austin R", "Gleich", "David F", "Leskovec", "Jure"],
    "venue": "networks. Science,",
    "year": 2016
  }, {
    "title": "Laplacian eigenvectors of graphs",
    "authors": ["Bıyıkoglu", "Türker", "Leydold", "Josef", "Stadler", "Peter F"],
    "venue": "Lecture notes in mathematics,",
    "year": 2007
  }, {
    "title": "Discrete nodal domain theorems",
    "authors": ["E BrianDavies", "Gladwell", "GrahamM L", "Leydold", "Josef", "Stadler", "Peter F"],
    "venue": "Linear Algebra and its Applications,",
    "year": 2001
  }, {
    "title": "Nodal domains of eigenvectors for 1-Laplacian on graphs",
    "authors": ["KC Chang", "Shao", "Sihong", "Zhang", "Dong"],
    "venue": "Advances in Mathematics,",
    "year": 2017
  }, {
    "title": "Spectrum of the 1-Laplacian and Cheeger’s constant on graphs",
    "authors": ["Chang", "Kung Ching"],
    "venue": "Journal of Graph Theory,",
    "year": 2016
  }, {
    "title": "Computing minimum cuts in hypergraphs",
    "authors": ["Chekuri", "Chandra", "Xu", "Chao"],
    "venue": "In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms,",
    "year": 2017
  }, {
    "title": "Spectral graph theory",
    "authors": ["Chung", "Fan RK"],
    "venue": "Number 92. American Mathematical Soc.,",
    "year": 1997
  }, {
    "title": "Random coordinate descent methods for minimizing decomposable submodular functions",
    "authors": ["Ene", "Alina", "Nguyen", "Huy"],
    "venue": "In Proceedings of the International Conference on Machine Learning,",
    "year": 2015
  }, {
    "title": "Variational methods for eigenvalue problems, volume 22",
    "authors": ["Gould", "Sydney Henry"],
    "year": 1966
  }, {
    "title": "An inverse power method for nonlinear eigenproblems with applications in 1-spectral clustering and sparse pca",
    "authors": ["Hein", "Matthias", "Bühler", "Thomas"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2010
  }, {
    "title": "The total variation on hypergraphslearning on hypergraphs revisited",
    "authors": ["Hein", "Matthias", "Setzer", "Simon", "Jost", "Leonardo", "Rangapuram", "Syama Sundar"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Reflection methods for user-friendly submodular optimization",
    "authors": ["Jegelka", "Stefanie", "Bach", "Francis", "Sra", "Suvrit"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2013
  }, {
    "title": "Global min-cuts in RNC, and other ramifications of a simple min-cut algorithm",
    "authors": ["Karger", "David R"],
    "venue": "In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms,",
    "year": 1993
  }, {
    "title": "Minimizing a sum of submodular functions",
    "authors": ["Kolmogorov", "Vladimir"],
    "venue": "Discrete Applied Mathematics,",
    "year": 2012
  }, {
    "title": "Inhomogeneous hypergraph clustering with applications",
    "authors": ["Li", "Pan", "Milenkovic", "Olgica"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2017
  }, {
    "title": "Revisiting decomposable submodular function minimization with incidence relations",
    "authors": ["Li", "Pan", "Milenkovic", "Olgica"],
    "venue": "arXiv preprint arXiv:1803.03851,",
    "year": 2018
  }, {
    "title": "Hypergraph markov operators, eigenvalues and approximation algorithms",
    "authors": ["Louis", "Anand"],
    "venue": "In Proceedings of the ACM symposium on Theory of computing,",
    "year": 2015
  }, {
    "title": "Submodular functions and convexity",
    "authors": ["Lovász", "László"],
    "venue": "In Mathematical Programming The State of the Art,",
    "year": 1983
  }, {
    "title": "On spectral clustering: Analysis and an algorithm",
    "authors": ["Ng", "Andrew Y", "Jordan", "Michael I", "Weiss", "Yair"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2002
  }, {
    "title": "On the convergence rate of decomposable submodular function minimization",
    "authors": ["Nishihara", "Robert", "Jegelka", "Stefanie", "Jordan", "Michael I"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2014
  }, {
    "title": "Min norm point algorithm for higher order MRF-MAP inference",
    "authors": ["Shanu", "Ishant", "Arora", "Chetan", "Singla", "Parag"],
    "venue": "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
    "year": 2016
  }, {
    "title": "Total variation and cheeger cuts",
    "authors": ["Szlam", "Arthur", "Bresson", "Xavier"],
    "venue": "In Proceedings of the International Conference on Machine Learning,",
    "year": 2010
  }, {
    "title": "Scalable motif-aware graph clustering",
    "authors": ["Tsourakakis", "Charalampos E", "Pachocki", "Jakub", "Mitzenmacher", "Michael"],
    "venue": "In Proceedings of the 26th International Conference on World Wide Web, pp. 1451–1460. International World Wide Web Conferences Steering Committee,",
    "year": 2017
  }, {
    "title": "A nodal domain theorem and a higher-order cheeger inequality for the graph p-Laplacian",
    "authors": ["Tudisco", "Francesco", "Hein", "Matthias"],
    "venue": "arXiv preprint arXiv:1602.05567,",
    "year": 2016
  }, {
    "title": "A tutorial on spectral clustering",
    "authors": ["Von Luxburg", "Ulrike"],
    "venue": "Statistics and computing,",
    "year": 2007
  }, {
    "title": "Finding the nearest point in a polytope",
    "authors": ["Wolfe", "Philip"],
    "venue": "Mathematical Programming,",
    "year": 1976
  }, {
    "title": "Re-revisiting learning on hypergraphs: Confidence interval and subgradient method",
    "authors": ["Zhang", "Chenzi", "Hu", "Shuguang", "Tang", "Zhihao Gavin", "Chan", "T-H. Hubert"],
    "venue": "In Proceedings of the International Conference on Machine Learning,",
    "year": 2017
  }, {
    "title": "Learning with hypergraphs: Clustering, classification, and embedding",
    "authors": ["Zhou", "Denny", "Huang", "Jiayuan", "Schölkopf", "Bernhard"],
    "venue": "In Advances in Neural Information Processing Systems,",
    "year": 2007
  }],
  "id": "SP:4ffc25f59c8b8eab903737f783da1d6bcc3fed09",
  "authors": [{
    "name": "Pan Li",
    "affiliations": []
  }, {
    "name": "Olgica Milenkovic",
    "affiliations": []
  }],
  "abstractText": "We introduce submodular hypergraphs, a family of hypergraphs that have different submodular weights associated with different cuts of hyperedges. Submodular hypergraphs arise in clustering applications in which higher-order structures carry relevant information. For such hypergraphs, we define the notion of p-Laplacians and derive corresponding nodal domain theorems and k-way Cheeger inequalities. We conclude with the description of algorithms for computing the spectra of 1and 2-Laplacians that constitute the basis of new spectral hypergraph clustering methods.",
  "title": "Submodular Hypergraphs: p-Laplacians, Cheeger Inequalities  and Spectral Clustering"
}