{
  "sections": [{
    "heading": "1. Introduction",
    "text": ""
  }, {
    "heading": "1.1. Background",
    "text": "Density functions that represent sample data are often multimodal, i.e. they exhibit more than one maximum. Typically this behavior indicates that the underlying data deserves a more detailed representation as a mixture of densities with individually simpler structure. The usual specification of a component density is quite restrictive, with log-concave the most general case considered in the literature, and Gaussian the overwhelmingly typical case. It is also necessary to determine the number of mixture components a priori, and much art is devoted to this.\nIn this paper we detail how to efficiently determine a topologically and information-theoretically optimal mixture of generic unimodal component densities directly from a onedimensional input density and without any auxiliary information whatsoever. The topological criterion is a natural qualitative alternative to more traditional quantitative model selection criteria (e.g., information criteria) and is computed at the outset of computation, then subsequently preserved, while the information-theoretical criterion optimally sepa-\n1BAE Systems FAST Labs, Arlington, VA, USA. Correspondence to: Steve Huntsman <steve.huntsman@baesystems.com>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nrates component densities. We further show how to optimally smooth the mixture when the input density itself is being estimated. Topological persistence (which operationally amounts to the assignment of significance to topological features that persist as a function of scale) is the essential ingredient in both the “model selection” and smoothing."
  }, {
    "heading": "1.2. Formal Motivation",
    "text": "To give some formal motivation, letD(Rd) denote a suitable space of continuous probability densities (henceforth merely called densities) on Rd. A mixture on Rd with M components is a pair (π, p) ∈ ∆◦M × D(Rd)M , where ∆◦M := {π ∈ (0, 1]M : ∑ m πm = 1}; we write |(π, p)| := M , and note that π cannot have any components equal to zero. The corresponding mixture density is 〈π, p〉 := ∑M m=1 πmpm. The Jensen-Shannon divergence of (π, p) is (Briët & Harremoës, 2009)\nJ(π, p) := H (〈π, p〉)− 〈π,H(p)〉 (1) where H(p)m := H(pm) and H(f) := − ∫ f log f dx is the entropy of f .\nNow J(π, p) is the mutual information between the random variables Ξ ∼ π and X ∼ 〈π, p〉. Since mutual information is always nonnegative, the same is true of J . The concavity of H gives the same result, i.e. H (〈π, p〉) ≥ 〈π,H(p)〉. If M := |(π, p)| > 1, π̂ := (π1, . . . , πM−2, πM−1 + πM ), and p̂ := ( p1, . . . , pM−2,\nπM−1pM−1+πMpM πM−1+πM\n) , then is easy\nto show that J(π̂, p̂) ≤ J(π, p).\nWe say that a density f ∈ D(Rd) is unimodal if f−1([y,∞)) is either empty or contractible (i.e., topologically equivalent to a point in the sense of homotopy) for all y. For d = 1, this simply means that any nonempty sets f−1([y,∞)) are intervals and agrees with intuition. We call a mixture (π, p) unimodal iff each of the component densities pm is unimodal. The unimodal category ucat(f) is the smallest number of components of any unimodal mixture (π, p) that satisfies 〈π, p〉 = f . Figure 1 shows that the unimodal category can be much less than the number of maxima. In the event that 〈π, p〉 = f and |(π, p)| = ucat(f), we write (π, p) |= f : the symbol |= is called “models.” The unimodal category is a topological invariant that generalizes and relates to other classical invariants (Baryshnikov & Ghrist, 2011; Ghrist, 2014).\nThe preceding constructions naturally lead us to consider the unimodal Jensen-Shannon divergence\nJ∩(f) := sup (π,p)|=f J(π, p) (2)\nas a simultaneous measure of both the topological and information-theoretical complexity of f , and\n(π∩, p∩) := arg max (π,p)|=f J(π, p) (3)\nas a topologically and information-theoretically optimal topological mixture estimate (TME).\nThe natural questions are if such an estimate exists (is the supremum attained?), is unique, and if so, how to perform TME in practice. In this paper we address these questions for the case d = 1, and we demonstrate the utility of TME in examples (see Figures 6-10).\nAfter reviewing related work in §2, we cover the basic algorithm of TME in §3. The proof therein that Algorithm 1 computes (3) is nearly trivial with Lemmas 1 and 2 in hand: these are respectively in appendices §A and §B. Next, in §4 we review the related technique of topological density estimation (TDE) before showing in §5 how blurring and deblurring mixture estimates can usefully couple TDE and TME. Finally, in §6 we produce examples of TME in action before making some closing remarks in §7."
  }, {
    "heading": "2. Related Work",
    "text": "While density estimation enables various clustering techniques (Li et al., 2007; Azzalini & Menardi, 2014; Xu & Tian, 2015), mixture estimation is altogether more powerful than clustering: e.g., it is possible to have mixture components that significantly and meaningfully overlap. For example, a cluster with a bimodal density will usually be considered as arising from two unimodal mixture components that are individually of interest. In this light and in view of its totally nonparametric nature, our approach can be seen as particularly powerful, particularly when coupled with TDE and deblurring/reblurring (see §4 and §5).\nStill, even for clustering (even in one dimension, where an optimal solution to k-means can be computed efficiently (Wang & Song, 2011; Nielsen & Nock, 2014; Grønlund et al., 2017)), determining the number of clusters in data (Feng & Hamerly, 2007; Mirkin, 2011) is as much an art as a science. All of the techniques we are aware of either require some ad hoc determination to be made, require auxiliary information (e.g., (Tibshirani et al., 2001)) or are parametric in at least a limited sense (e.g., (Sugar & James, 2003)). While a parametric approach allows likelihoods and thus various information criteria (Burnham & Anderson, 2003) or their ilk to be computed for automatically determining the number of clusters, this comes at the cost of a strong modeling assumption, and criteria values themselves are difficult to compare meaningfully (Melnykov & Maitra, 2010).\nThese shortcomings–including determining the number of mixture components–carry over to the more difficult problem of mixture estimation. (McLachlan & Peel, 2004; Melnykov & Maitra, 2010; McLachlan & Rathnayake, 2014) As an example, an ad hoc and empirically derived unimodal mixture estimation technique that requires one of a few common functional forms for the mixture components has been recently employed in (Mints & Hekker, 2017). Univariate model-based mixtures of skew distributions admit EM-type algorithms and can outperform Gaussian mixture models (Lin et al., 2007; Basso et al., 2010). Though these generalize to the multivariate case quite effectively (see, e.g., (Lee & McLachlan, 2016)), the EM-type algorithms are generically vulnerable to becoming trapped in local minima without good initial parameter values, and they require some model selection criterion to determine the number of mixture components, though the parameter learning and model selection steps can be integrated as in (Figueiredo & Jain, 2002). A Bayesian nonparametric mixture model that incorporates many–but not arbitrary–unimodal distributions is considered in (Rodrı́guez & Walker, 2014). Principled work has been done on estimating mixtures of log-concave distributions (Walther, 2009) and (Chan et al., 2013) describes how densities of discrete unimodal mixtures can be estimated. However, actually estimating generic unimodal mixtures themselves appears to be unaddressed in the literature, even in one dimension. Indeed, even estimating individual modes and their associated uncertainties or significances has only been addressed recently (Genovese et al., 2016; Mukhopadhyay, 2017)."
  }, {
    "heading": "3. The Basic Algorithm",
    "text": "Given f , the “sweep” algorithm of (Baryshnikov & Ghrist, 2011) yields (π, p) |= f . We will repeatedly perturb (π, p) to obtain (3) using Lemmas 1 and 2, which are respectively in §A and §B. Lemma 1 states that that J is convex under perturbations of (π, p) that preserve 〈π, p〉. Lemma 2 is\nAlgorithm 1 Topological Mixture Estimation (TME) Input: function data {xk, f(xk)} Initialize (π, p) |= f as in (Baryshnikov & Ghrist, 2011) repeat\nfor each evaluation point and pair of components do Greedily perturb (π, p) to (π′, p′) using Lemma 2 end for Update (π, p) = arg max J(π′, p′)\nuntil (π, p) and/or J(π, p) converge Output: (π, p)\na characterization of perturbations of two components of a piecewise affine and continuous (or piecewise constant) mixture that preserve the predicate (π, p) |= f , i.e., that preserve unimodality (as in Figure 2) and the mixture density. Together, these results entail Theorem 1, which establishes that greedy unimodality- and density-preserving local perturbations of pairs of mixture components converge to (3).\nTheorem 1. Let −∞ = x−1 < x0 < · · · < xN < xN+1 = ∞ and f be piecewise constant (or affine) over each [xk, xk+1]. Then Algorithm 1 efficiently computes (3).\nProof. By Lemma 1 (see §A), greedily and locally perturbing the mixture (π, p) |= f according to Lemma 2 (see §B), then updating the mixture according to the perturbation which optimizes J gives the desired result in O(MN) iterations. This result is unique by convexity. Each iteration requires O(M2N) trial perturbations, each of which in turn requires O(MN) arithmetic operations to evaluate J ."
  }, {
    "heading": "4. Topological Density Estimation",
    "text": "The obvious situation of practical interest for TME is that a density has been obtained from a preliminary estimation process involving some sample data. There is a natural approach to this preliminary estimation process called topological density estimation (TDE) (Huntsman, 2017) that naturally dovetails with TME.\nAlgorithm 2 Topological Density Estimation (TDE) Input: {Xj} for each proposed bandwidth h do\nCompute uX(h) using (5) end for Compute m̂X using (6) Output: ĥX using (7)"
  }, {
    "heading": "4.1. Idea",
    "text": "We recall the basic idea here (for pseudocode, see Algorithm 2). Given a kernel K and sample data Xj for 1 ≤ j ≤ n, and for each proposed bandwidth h, compute the kernel density estimate (Silverman, 1986; Chen, 2017)\nf̂h;X := 1\nn n∑ j=1 KXj ,h (4)\nwhere Kµ,σ(x) := 1σK( x−µ σ ). Next, compute\nuX(h) := ucat(f̂h;X) (5)\nand estimate the unimodal category of the PDF that X is sampled from via\nm̂X := arg max m\nµ(u−1X (m)) (6)\nwhere µ denotes an appropriate measure (nominally counting measure or the pushforward of Lebesgue measure under the transformation h 7→ 1/h).\n(6) gives the most prevalent and topologically persistent (Ghrist, 2014; Oudot, 2015) value of the unimodal category, i.e., this is a topologically robust estimate of the number of components required to produce the PDF that X is sampled from as a mixture. While any element of u−1X (m̂X) is a bandwidth consistent with the estimate (6), considerations of robustness lead us to typically make the more detailed nominal specification\nĥX := medianµ(u−1X (m̂X)). (7)"
  }, {
    "heading": "4.2. Performance",
    "text": "TDE turns out to be very computationally efficient relative to the traditional technique of cross-validation (CV). On highly multimodal densities, TDE is competitive or at least reasonably performant relative to CV and other nonparametric density estimation approaches with respect to traditional statistical evaluation criteria. Moreover, TDE outperforms other approaches when qualitative criteria such as the number of local maxima and the unimodal category itself are considered (see Figures 3-5). In practice, such qualitative\ncriteria are generally of paramount importance. For example, precisely estimating the shape of a density is generally less important than determining if it has multiple modes.\nAs an illustration, consider µ(j,m) := jm+1 , σ(k,m) := 2−(k+2)(m+ 1)−2 and the family of distributions\nfkm := 1\nm m∑ j=1 Kµ(j,m),σ(k,m) (8)\nfor 1 ≤ k ≤ 3 and 1 ≤ m ≤ 10, and where here K is the standard Gaussian density: see Figure 3. Exhaustive details relating to the evaluation of TDE on this family and other densities are in the software package and test suite (BAE Systems, 2017): here, we merely show performance data for (8) in Figures 4 and 5.\nTDE has the very useful feature (shared by essentially no high-performing density estimation technique other than\nCV) that it requires no free parameters or assumptions. Indeed, TDE can be used to evaluate its own suitability: for unimodal distributions, it is often not an ideal choice–but it is good at detecting this situation in the first place. Furthermore, TDE is very efficient computationally.\nIn situtations of practical interest, it is tempting to couple TDE and TME in the obvious way: i.e., perform them sequentially and indepdently. This yields a completely nonparametric estimate of a mixture from sample data alone. However, there is a much better way to couple these techniques, as we shall see in the sequel."
  }, {
    "heading": "5. Blurring and Deblurring",
    "text": ""
  }, {
    "heading": "5.1. Blurring",
    "text": "Recall that a log-concave function is unimodal, and moreover that a function is log-concave iff its convolutions with unimodal functions are identically unimodal (Ibragimov, 1956; Keilson & Gerber, 1971; Bertin et al., 2013). This observation naturally leads to the following question: if (π, p) |= f , how good of an approximation to the δ distribution must a log-concave density g be in order to have (π, p∗g) |= f ∗g? In particular, suppose that g is a Gaussian density: what bandwidth must it have? An answer to this question of how much blurring a minimal unimodal mixture model can sustain defines a topological scale (viz., the persistence of the unimodal category under blurring) that we proceed to illustrate in light of TDE.\nIn this paragraph we assume thatK is the standard Gaussian density, so that Kµ,h ∗ Kµ′,h′ = Kµ+µ′,(h2+h′2)1/2 and f̂h;X ∗K0,h′ = f̂(h2+h′2)1/2;X . Write ĥX for the bandwidth obtained via TDE, whether via the nominal specification (7) or any other: by construction we have that inf u−1X (m̂X) ≤\nĥX ≤ supu−1X (m̂X). Now if (π, p) |= f̂ĥX ;X , then m̂X = uX(ĥX) = |(π, p)|. In order to have (π, p ∗ K0,h′) |= f ∗ K0,h′ , it must be that m̂X = uX(ĥX) = |(π, p)| = |(π, p ∗K0,h′)| = uX((ĥ2X + h′2)1/2), i.e.,\nh′ ≤ ([ supu−1X (m̂X) ]2 − ĥ2X)1/2 . (9)\nIn particular, we have the weaker inequality involving a purely topological scale:\nh′ ≤ ([ supu−1X (m̂X) ]2 − [inf u−1X (m̂X)]2)1/2 . (10)\nThe preceding considerations generalize straightforwardly if we define uf (h) := ucat(f ∗K0,h), where once againK is a generic kernel. This generalizes (5) so long as we associate sample data with a uniform average of δ distributions. Under reasonable conditions, we can write uf (0) = ucat(f), and it is easy to see that the analogous bound is\nh′ ≤ supu−1f (uf (0)). (11)\nOf course, (11) merely restates the triviality that the blurred mixture ceases to be minimal precisely when the number of mixture components exceeds the unimodal category of the mixture density. Meanwhile, the special case furnished by TDE with the standard Gaussian kernel affords sufficient structure for a slightly less trivial statement."
  }, {
    "heading": "5.2. Deblurring/reblurring",
    "text": "The considerations of §5.1 suggest how to couple TDE and TME in a much more effective way than performing them sequentially and independently. The idea is to use a Gaussian kernel and instead of (7), pick the bandwidth\nĥ (−) X := infµ(u −1 X (m̂X)) (12)\nand then perform TME; finally, convolve the results with K0,∆h where\n∆h := ( ĥ2X − [ ĥ (−) X ]2)1/2 . (13)\nThis preserves the result of TDE while giving a smoother, less artificial, and more practically useful mixture estimate than the information theoretically optimal result.\nOf course, a similar tactic can be performed directly on a density f by considering its Fourier deconvolution F−1(Ff/FK0,h′), where F denotes the Fourier transform and h′ is as in (11): however, any a priori justification for such a tactic is necessarily context-dependent in general, and our experience suggests that its implementation would be delicate and/or prone to aliasing. Nevertheless, this would\nAlgorithm 3 Reblurred Topological Mixture Estimation Input: {Xj} for each proposed bandwidth h do\nCompute uX(h) using (5) end for Compute m̂X using (6) Compute ĥ(−)X using (12) Compute (π, p) from f̂\nĥ (−) X ;X using Algorithm 1 Update p = p ∗K0,∆h with ∆h as in (13) Output: (π, p)\nbe particularly desirable in the context of heavy-tailed distributions, where kernel density estimation requires much larger sample sizes in order to achieve acceptable results. In this context it would also be worth considering the use of a symmetric stable density (Uchaikin & Zolotarev, 1999; Nolan, 2018) (e.g., a Cauchy density) as a kernel with the aim of recapturing the essence of (13)."
  }, {
    "heading": "6. Examples",
    "text": "We present two phenomenologically illustrative examples. First, in Figures 6 and 7 we consider the n = 272 waiting times between eruptions of the Old Faithful geyser from the data set in (Härdle, 2012). Then, in Figures 8 and 9 we consider the n = 2107 Sloan Digitial Sky Survey g − r color indices accessed from the VizieR database (Ochsen-\nbein et al., 2000) at http://cdsarc.u-strasbg. fr/viz-bin/Cat?J/ApJ/700/523 and discussed in (An et al., 2009); the latter example is replicated in (BAE Systems, 2018).\nAs suggested, several phenomena are readily apparent from these examples. First, mixtures obtained via the sweep algorithm are manifestly parity-dependent, i.e., the direction of sweeping matters; second, mixtures obtained via TME alone exhibit artificial anti-overlapping behavior; third, deblurring followed by reblurring preserves unimodality, the overall density, a topologically persistent invariant (viz., the unimodal category) and the spirit of information-theoretical optimality while producing an obviously better behaved mixture; fourth and finally, the various techniques involved here can significantly shift classification/decision boundaries based on the dominance of various mixture components.\nWhile the data in Figures 6 and 7 is at least qualitatively approximated by a two-component Gaussian mixture, it\nis clear that a three-component Gaussian mixture cannot capture the highly oscillatory behavior of the density in Figures 8 and 9. Indeed, this example illustrates how such oscillatory behavior can actually arise from a unimodal mixture with many fewer components than might naively appear to be required.\nFigure 10 shows that there are strong and independent grounds to conclude that the color index data of Figure 9 is produced by a unimodal mixture of three components, with componentwise modes as suggested by TME, and furthermore that CV undersmooths this data. For each density estimate shown, each componentwise maximum of the corresponding mixture (3) is virtually identical to one of the local maxima of the density estimate itself: this is a consequence of the anti-overlapping tendency described above.\nIn particular, the fourth panel of Figure 10 illustrates that it is possible and potentially advantageous to use TME as an alternative mode identification technique in the LPMode algorithm of (Mukhopadhyay, 2017). Furthermore, while we have not implemented a reliable Fourier deconvolution/reblurring algorithm of the sort hinted at in §5.2, the fifth and sixth panels of Figure 10 suggest that this is not particularly important for the narrowly defined task of mode finding/bump hunting."
  }, {
    "heading": "7. Remarks",
    "text": "While the O(M4N3) arithmetic operations of TME as implemented in Algorithm 1 might seem uncomfortably high, in practice M is generally quite small and it is reasonable to enforce N = 102 as in fact we do in the MATLAB implementation (BAE Systems, 2018) and §6. Furthermore, avoiding redundant perturbations and incrementally computing J would dramatically reduce the computational complexity. Still, even without the benefit of any such refinements, the color index example in §6 runs in less than 40 seconds.\nNote also that TDE and de/reblurring as respectively implemented in Algorithms 2 and 3 are relatively computationally inexpensive. The former case is helped by resampling data to on the order of 103 quantiles, which has no material effect on the output in cases where kernels are appropriate to use. That said, using a fast generalized Gauss transform (Spivak et al., 2010) would dramatically accelerate TDE.\nEven though TME is presently limited to one dimension, it is still very useful due to the preponderance of onedimensional problems. For instance, TME is a good candidate to improve on some of the best practical unsupervised image thresholding techniques (Kapur et al., 1985; Kittler & Illingworth, 1986; Sezgin & Sankur, 2004), and has prospects for enhancing data/sensor fusion, informationtheoretical analysis of time series (by using sliding time windows to define samples), and many other tasks.\nFurthermore, the one-dimensional framework can be used with random projections of high-dimensional data in a way that is likely to yield improvements for model selection (Feng & Hamerly, 2007) (cf. (Kalai et al., 2012)) and anomaly detection (Pevný, 2016). We plan to explore these topics in future work, with the associated intent of gauging the art of the possible with respect to determining unimodal decompositions in dimension > 1.\nThat said, the extension of TME to dimension > 1 will require effort and mathematical tools well beyond those used in this paper. One reason is that computing a unimodal decomposition is algorithmically undecidable in high dimensions, a property inherited from the problem of determining contractibility of simplicial complexes (Tancer, 2016) and the geometric realization theorem (Edelsbrunner & Harer, 2010) applied to level and upper excursion sets. Therefore, extending the constructions of this paper will require some modification of the notion of unimodal category in dimension > 1, approximations and/or heuristics.\nFor example, restricting to convex versus contractible upper excursion sets is probably desirable on intuitive as well as computational grounds. However, even in two dimensions the corresponding problem of constructing minimal convex partitions of polygons is still NP-hard. On the other hand, the case without interior holes is efficiently solvable (O’Rourke et al., 2017) and there is a quasi-polynomial time approximation scheme for the general case (Bandyapadhyay et al., 2015). The heuristic of (Liu et al., 2010) seems to be a good starting point for exploring relevant tradeoffs.\nAn appropriate tactic for directly leveraging the onedimensional framework en route to higher dimensions appears to be tomography in the spirit of the topological Radon transform (Ghrist, 2014). Besides working with random projections in this vein, another sensible approach (suggested to the author by Robert Ghrist) is to foliate (Lawson Jr., 1974) the domain of a sample (in practice this would just mean taking a family of parallel lines) and perform TME on data in tubular neighborhoods of nearby leaves of the foliation, then assemble the results, essentially by interpolating. Here topological tools such as sheaves and Morse theory seem inevitably to be required in order to do things in a globally coherent way. A suitable member of the class of metrics on mixtures introduced in (Liu & Huang, 2000) that provides data relevant for assembly as a byproduct will likely also be necessary.\nFinally, we note that there are prospects for recursively coupling TME and TDE: the idea here is to pull mixture components back to weighted subsamples, then re-run TDE (or in the unimodal case, CV) on these individually. The resulting variable-bandwidth mixture estimator would give a multiresolution description of data that would be be likely to yield further improvements in many applications."
  }, {
    "heading": "A. Convexity",
    "text": "The following lemma shows that J is convex as we gradually shift part of one mixture component to another.\nLemma 1. Let |(π, p)| = 3 and define\nπ12,t := π1 + (1− t)π2; π23,t := tπ2 + π3; p12,t := π1p1 + (1− t)π2p2\nπ12,t ;\np23,t := tπ2p2 + π3p3\nπ23,t ,\nso that 〈(π12,t, π23,t) , (p12,t, p23,t)〉 = 〈π, p〉. The function gπ,p : [0, 1]→ [0,∞) defined by\ngπ,p(t) := J ((π12,t, π23,t) , (p12,t, p23,t)) (14)\nsatisfies\ngπ,p(t) ≤ t · gπ,p(1) + (1− t) · gπ,p(0). (15)\nProof. We have that gπ,p(t) = H(〈π, p〉) − 〈(π12,t, π23,t) , (H(p12,t), H(p23,t))〉. Furthermore, if we write π12 := π1 + π2, π23 := π2 + π3, p12 := π1p1+π2p2π12 , and p23 := π2p2+π3p3π23 , then\nπ12,t = tπ1 + (1− t)π12; π23,t = tπ23 + (1− t)π3; p12,t = tπ1p1 + (1− t)π12p12\nπ12,t ;\np23,t = tπ23p23 + (1− t)π3p3\nπ23,t .\nIt is well known that H is a concave functional: from this it follows that\nH(p12,t) ≥ tπ1 π12,t H(p1) + (1− t)π12 π12,t H(p12);\nH(p23,t) ≥ tπ23 π23,t H(p23) + (1− t)π3 π23,t H(p3).\nTherefore\ngπ,p(t) = H(〈π, p〉) −〈(π12,t, π23,t) , (H(p12,t), H(p23,t))〉\n≤ H(〈π, p〉)− tπ1H(p1)− (1− t)π12H(p12) −tπ23H(p23)− (1− t)π3H(p3)\n= tH(〈π, p〉)− t〈(π1, π23), (H(p1), H(p23))〉 +(1− t) ·H(〈π, p〉) −(1− t) · 〈(π12, π3), (H(p12), H(p3))〉\n= t · gπ,p(1) + (1− t) · gπ,p(0)\nas claimed."
  }, {
    "heading": "B. Preserving Unimodality",
    "text": "Suppose that (π, p) is a unimodal mixture on R with |(π, p)| > 1. We would like to determine how we can perturb two components of this mixture so that the result is still unimodal and yields the same density. In the event that the mixture is piecewise affine and continuous (or piecewise constant) the space of permissible perturbations can be characterized by the following\nLemma 2. For 0 ≤ k ≤ N , let yk ∈ [0,∞) be such that y0 = 0 = yN and there are integers `, u satisfying 0 < ` ≤ u < N with\ny0 ≤ · · · ≤ y`−1 < y` = · · · = yu > yu+1 ≥ · · · ≥ yN . (16) (That is, y1, . . . , yN−1 is a nonnegative, nontrivial unimodal sequence.) Then for 1 ≤ r ≤ N−1 and ε−r ≥ 0, yk−δkrε−r is nonnegative and unimodal iff\nε−r ≤ yr −min{yr−1, yr+1}. (17)\nSimilarly, for ε+r ≥ 0, yk + δkrε+r is nonnegative and unimodal iff\nε+r ≤ { ∞ if `− 1 ≤ k ≤ u+ 1 max{yr−1, yr+1} − yr otherwise.\n(18)\nProof (sketch). We first sketch ((17),⇐). Nonegativity follows from 0 ≤ min{yr−1, yr+1} ≤ yr − ε−r . Unimodality follows from a series of trivial checks for the cases 1 ≤ r < `−1, r = `−1, r = `, and ` < r < u: the remaining cases r = u, r = u+ 1, and u+ 1 < r ≤ N − 1 follow from symmetry. For example, in the case 1 ≤ r < ` − 1, we only need to show that yr−1 ≤ yr − ε−r ≤ yr+1.\nA sketch of ((17),⇒) amounts to using the same cases and symmetry argument to perform equally trivial checks. For example, in the case 1 ≤ r < ` − 1, we have ε−r ≤ yr − yr−1 ≤ yr −min{yr−1, yr+1}.\nThe proof of (18) is mostly similar to that of (17): the key difference here is that any argument adjacent to or at a point where the maximum is attained can have its value increased arbitrarily without affecting unimodality (or nonnegativity).\nThe example in Figure 2 is probably more illuminating than filling in the details of the proof sketch above."
  }, {
    "heading": "Acknowledgements",
    "text": "The author thanks Adelchi Azzalini, Robert Ghrist, Subhadeep Mukhopadhyay, and John Nolan for their helpful and patient discussions, and reviewers for their comments and advice.\nThis material is based upon work supported by the Defense Advanced Research Projects Agency (DARPA) and the Air Force Research Laboratory (AFRL). Any opinions, findings and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of DARPA or AFRL."
  }],
  "year": 2018,
  "references": [{
    "title": "Galactic globular and open clusters in the Sloan Digital Sky Survey. II. Test of theoretical stellar isochrones",
    "authors": ["D. An", "M.H. Pinsonneault", "T. Masseron", "F. Delahaye", "J.A. Johnson", "D.M. Terndrup", "T.C. Beers", "I.I. Ivans", "Ž. Ivezić"],
    "venue": "The Astrophysical Journal,",
    "year": 2009
  }, {
    "title": "Clustering via nonparametric density estimation: The R package pdfCluster",
    "authors": ["A. Azzalini", "G. Menardi"],
    "venue": "Journal of Statistical Software, Articles,",
    "year": 2014
  }, {
    "title": "Approximation schemes for partitioning: convex decomposition and surface approximation",
    "authors": ["S. Bandyapadhyay", "S. Bhowmick", "K. Varadarajan"],
    "venue": "In Proceedings of SODA,",
    "year": 2015
  }, {
    "title": "Unimodal category and topological statistics",
    "authors": ["Y. Baryshnikov", "R. Ghrist"],
    "venue": "In Proceedings of NOLTA,",
    "year": 2011
  }, {
    "title": "Robust mixture modeling based on scale mixtures of skew-normal distributions",
    "authors": ["R.M. Basso", "V.H. Lachos", "C.R.B. Cabral", "P. Ghosh"],
    "venue": "Computational Statistics & Data Analysis,",
    "year": 2010
  }, {
    "title": "Properties of classical and quantum Jensen-Shannon divergence",
    "authors": ["J. Briët", "P. Harremoës"],
    "venue": "Physical Review A,",
    "year": 2009
  }, {
    "title": "Model Selection and Multimodel Inference: A Practical Information-theoretic Approach",
    "authors": ["K.P. Burnham", "D.R. Anderson"],
    "year": 2003
  }, {
    "title": "Learning mixtures of structured distributions over discrete domains",
    "authors": ["Chan", "S.-O", "I. Diakonikolas", "R.A. Servedio", "X. Sun"],
    "venue": "In Proceedings of SODA,",
    "year": 2013
  }, {
    "title": "A tutorial on kernel density estimation and recent advances",
    "authors": ["Chen", "Y.-C"],
    "year": 2017
  }, {
    "title": "PG-means: learning the number of clusters in data",
    "authors": ["Y. Feng", "G. Hamerly"],
    "venue": "In Proceedings of NIPS,",
    "year": 2007
  }, {
    "title": "Unsupervised learning of finite mixture models",
    "authors": ["M.A.T. Figueiredo", "A.K. Jain"],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
    "year": 2002
  }, {
    "title": "Non-parametric inference for density modes",
    "authors": ["C.R. Genovese", "M. Perone-Pacifico", "I. Verdinelli", "L. Wasserman"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2016
  }, {
    "title": "Fast exact k-means, k-medians and Bregman divergence clustering in 1d",
    "authors": ["A. Grønlund", "K.G. Larsen", "A. Mathiasen", "J.S. Nielsen"],
    "year": 2017
  }, {
    "title": "Smoothing Techniques: With Implementation in S",
    "authors": ["W. Härdle"],
    "venue": "Springer Science & Business Media,",
    "year": 2012
  }, {
    "title": "Topological density estimation",
    "authors": ["S. Huntsman"],
    "venue": "In Proceedings of NOLTA,",
    "year": 2017
  }, {
    "title": "On the composition of unimodal distributions",
    "authors": ["I.A. Ibragimov"],
    "venue": "Theory of Probability & Its Applications,",
    "year": 1956
  }, {
    "title": "A new method for gray-level picture thresholding using the entropy of the histogram",
    "authors": ["J.N. Kapur", "P.K. Sahoo", "A.K.C. Wong"],
    "venue": "Computer Vision, Graphics, and Image Processing,",
    "year": 1985
  }, {
    "title": "Some results for discrete unimodality",
    "authors": ["J. Keilson", "H. Gerber"],
    "venue": "Journal of the American Statistical Association,",
    "year": 1971
  }, {
    "title": "Minimum error thresholding",
    "authors": ["J. Kittler", "J. Illingworth"],
    "venue": "Pattern Recognition,",
    "year": 1986
  }, {
    "title": "Finite mixtures of canonical fundamental skew t-distributions",
    "authors": ["S.X. Lee", "G.J. McLachlan"],
    "venue": "Statistics and Computing,",
    "year": 2016
  }, {
    "title": "A nonparametric statistical approach to clustering via mode identification",
    "authors": ["J. Li", "S. Ray", "B.G. Lindsay"],
    "venue": "Journal of Machine Learning Research,",
    "year": 2007
  }, {
    "title": "Robust mixture modeling using the skew t distribution",
    "authors": ["T.I. Lin", "J.C. Lee", "W.J. Hsieh"],
    "venue": "Statistics and Computing,",
    "year": 2007
  }, {
    "title": "Convex shape decomposition",
    "authors": ["H. Liu", "W. Liu", "L.J. Latecki"],
    "venue": "In Proceedings of CVPR,",
    "year": 2010
  }, {
    "title": "A new distance measure for probability distribution function of mixture type",
    "authors": ["Z. Liu", "Q. Huang"],
    "venue": "In Proceedings of ICASSP,",
    "year": 2000
  }, {
    "title": "Finite Mixture Models",
    "authors": ["G.J. McLachlan", "D. Peel"],
    "year": 2004
  }, {
    "title": "On the number of components in a Gaussian mixture model",
    "authors": ["G.J. McLachlan", "S. Rathnayake"],
    "venue": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery,",
    "year": 2014
  }, {
    "title": "Finite mixture models and model-based clustering",
    "authors": ["V. Melnykov", "R. Maitra"],
    "venue": "Statistics Surveys,",
    "year": 2010
  }, {
    "title": "A unified tool to estimate distances, ages, and masses (UniDAM) from spectrophotometric data",
    "authors": ["A. Mints", "S. Hekker"],
    "venue": "Astronomy & Astrophysics,",
    "year": 2017
  }, {
    "title": "Choosing the number of clusters. Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery",
    "authors": ["B. Mirkin"],
    "year": 2011
  }, {
    "title": "Large-scale mode identification and data-driven sciences",
    "authors": ["S. Mukhopadhyay"],
    "venue": "Electronic Journal of Statistics,",
    "year": 2017
  }, {
    "title": "Optimal interval clustering: Application to Bregman clustering and statistical mixture learning",
    "authors": ["F. Nielsen", "R. Nock"],
    "venue": "IEEE Signal Processing Letters,",
    "year": 2014
  }, {
    "title": "Stable Distributions: Models for Heavy Tailed Data",
    "authors": ["J.P. Nolan"],
    "year": 2018
  }, {
    "title": "The VizieR database of astronomical catalogues",
    "authors": ["F. Ochsenbein", "P. Bauer", "J. Marcout"],
    "venue": "Astronomy and Astrophysics Supplement Series,",
    "year": 2000
  }, {
    "title": "Persistence Theory: From Quiver Representations to Data Analysis",
    "authors": ["S.Y. Oudot"],
    "venue": "American Mathematical Society,",
    "year": 2015
  }, {
    "title": "Loda: Lightweight on-line detector of anomalies",
    "authors": ["T. Pevný"],
    "venue": "Machine Learning,",
    "year": 2016
  }, {
    "title": "Univariate Bayesian nonparametric mixture modeling with unimodal kernels",
    "authors": ["C.E. Rodrı́guez", "S.G. Walker"],
    "venue": "Statistics and Computing,",
    "year": 2014
  }, {
    "title": "Survey over image thresholding techniques and quantitative performance evaluation",
    "authors": ["M. Sezgin", "B. Sankur"],
    "venue": "Journal of Electronic Imaging,",
    "year": 2004
  }, {
    "title": "Density Estimation for Statistics and Data Analysis",
    "authors": ["B.W. Silverman"],
    "venue": "CRC Press,",
    "year": 1986
  }, {
    "title": "The fast generalized Gauss transform",
    "authors": ["M. Spivak", "S.K. Veerapaneni", "L. Greengard"],
    "venue": "SIAM Journal on Scientific Computing,",
    "year": 2010
  }, {
    "title": "Finding the number of clusters in a dataset: An information-theoretic approach",
    "authors": ["C.A. Sugar", "G.M. James"],
    "venue": "Journal of the American Statistical Association,",
    "year": 2003
  }, {
    "title": "Recognition of collapsible complexes is NPcomplete",
    "authors": ["M. Tancer"],
    "venue": "Discrete and Computational Geometry,",
    "year": 2016
  }, {
    "title": "Estimating the number of clusters in a data set via the gap statistic",
    "authors": ["R. Tibshirani", "G. Walther", "T. Hastie"],
    "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology),",
    "year": 2001
  }, {
    "title": "Chance and Stability: Stable Distributions and Their Applications",
    "authors": ["V.V. Uchaikin", "V.M. Zolotarev"],
    "venue": "Walter de Gruyter,",
    "year": 1999
  }, {
    "title": "Inference and modeling with log-concave distributions",
    "authors": ["G. Walther"],
    "venue": "Statistical Science, pp",
    "year": 2009
  }, {
    "title": "Ckmeans.1d.dp: optimal k-means clustering in one dimension by dynamic programming",
    "authors": ["H. Wang", "M. Song"],
    "venue": "The R Journal,",
    "year": 2011
  }, {
    "title": "A comprehensive survey of clustering algorithms",
    "authors": ["D. Xu", "Y. Tian"],
    "venue": "Annals of Data Science,",
    "year": 2015
  }],
  "id": "SP:d15584b10f2f8b636443f6ba4c4a3bc94dc78201",
  "authors": [{
    "name": "Steve Huntsman",
    "affiliations": []
  }],
  "abstractText": "We introduce topological mixture estimation, a completely nonparametric and computationally efficient solution to the problem of estimating a one-dimensional mixture with generic unimodal components. We repeatedly perturb the unimodal decomposition of Baryshnikov and Ghrist to produce a topologically and information-theoretically optimal unimodal mixture. We also detail a smoothing process that optimally exploits topological persistence of the unimodal category in a natural way when working directly with sample data. Finally, we illustrate these techniques through examples.",
  "title": "Topological Mixture Estimation"
}