{
  "sections": [{
    "text": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, pages 78–88 Copenhagen, Denmark, September 7–11, 2017. c©2017 Association for Computational Linguistics"
  }, {
    "heading": "1 Introduction",
    "text": "Word Sense Disambiguation (WSD) is a key task in computational lexical semantics, inasmuch as it addresses the lexical ambiguity of text by making explicit the meaning of words occurring in a given context (Navigli, 2009). Anyone who has struggled with frustratingly unintelligible translations from an automatic system, or with the meaning bias of search engines, can understand the importance for an intelligent system to go beyond the surface appearance of text.\nThere are two mainstream lines of research in WSD: supervised and knowledge-based WSD. Supervised WSD frames the problem as a classical machine learning task in which, first a training phase occurs aimed at learning a classification model from sentences annotated with word senses and, second the model is applied to previouslyunseen sentences focused on a target word. A key\ndifference from many other problems, however, is that the classes to choose from (i.e., the senses of a target word) vary for each word, therefore requiring a separate training process to be performed on a word by word basis. As a result, hundreds of training instances are needed for each ambiguous word in the vocabulary. This would necessitate a million-item training set to be manually created for each language of interest, an endeavour that is currently beyond reach even in resource-rich languages like English.\nThe second paradigm, i.e., knowledge-based WSD, takes a radically different approach: the idea is to exploit a general-purpose knowledge resource like WordNet (Fellbaum, 1998) to develop an algorithm which can take advantage of the structural and lexical-semantic information in the resource to choose among the possible senses of a target word occurring in context. For example, a PageRank-based algorithm can be developed to determine the probability of a given sense being reached starting from the senses of its context words. Recent approaches of this kind have been shown to obtain competitive results (Agirre et al., 2014; Moro et al., 2014). However, due to its inherent nature, knowledge-based WSD tends to adopt bag-of-word approaches which do not exploit the local lexical context of a target word, including function and collocation words, which limits this approach in some cases.\nIn this paper we get the best of both worlds and present Train-O-Matic, a novel method for generating huge high-quality training sets for all the words in a language’s vocabulary. The approach is language-independent, thanks to its use of a multilingual knowledge resource, BabelNet (Navigli and Ponzetto, 2012), and it can be applied to any kind of corpus. The training sets produced with Train-O-Matic are shown to provide competitive performance with those of manually and semi-\n78\nautomatically tagged corpora. Moreover, state-ofthe-art performance is also reported for low resourced languages (i.e., Italian and Spanish) and domains, where manual training data is not available."
  }, {
    "heading": "2 Building a Training Set from Scratch",
    "text": "In this Section we present Train-O-Matic, a language-independent approach to the automatic construction of a sense-tagged training set. TrainO-Matic takes as input a corpus C (e.g., Wikipedia) and a semantic network G = (V,E). We assume a WordNet-like structure of G, i.e., V is the set of concepts (i.e., synsets) such that, for each word w in the vocabulary, Senses(w) is the set of vertices in V that are expressed by w, e.g., the WordNet synsets that include w as one of their senses.\nTrain-O-Matic consists of three steps:\n• Lexical profiling: for each vertex in the semantic network, we compute its Personalized PageRank vector, which provides its lexicalsemantic profile (Section 2.1).\n• Sentence scoring: For each sentence containing a word w, we compute a probability distribution over all the senses of w based on its context (Section 2.2).\n• Sentence ranking and selection: for each sense s of a word w in the vocabulary, we select those sentences that are most likely to use w in the sense of s (Section 2.3)."
  }, {
    "heading": "2.1 Lexical profiling",
    "text": "In terms of semantic networks the probability of reaching a node v′ starting from v can be interpreted as a measure of relatedness between the synsets v and v′. Thus we define the lexical profile of a vertex v in a graph G = (V,E) as the probability distribution over all the vertices v′ in the graph. Such distribution is computed by applying the Personalized PagaRank algorithm, a variant of the traditional PageRank (Brin and Page, 1998). While the latter is equivalent to performing random walks with uniform restart probability on every vertex at each step, PPR, on the other hand, makes the restart probability non-uniform, thereby concentrating more probability mass in the surroundings of those vertices having higher restart\nprobability. Formally, (P)PR is computed as follows:\nv(t+1) = (1− α)v(0) + αMv(t) (1)\nwhere M is the row-normalized adjacency matrix of the semantic network, the restart probability distribution is encoded by vector v(0), and α is the well-known damping factor usually set to 0.85 (Brin and Page, 1998). If we set v(0) to a unit probability vector (0, . . . , 0, 1, 0, . . . , 0), i.e., restart is always on a given vertex, PPR outputs the probability of reaching every vertex starting from the restart vertex after a certain number of steps. This approach has been used in the literature to create semantic signatures (i.e., profiles) of individual concepts, i.e., vertices of the semantic network (Pilehvar et al., 2013), and then to determine the semantic similarity of concepts. As also done by Pilehvar and Collier (2016), we instead use the PPR vector as an estimate of the conditional probability of a word w′ given the target sense1 s ∈ V of word w:\nP (w′|s, w) = maxs′∈Senses(w′) vs(s ′)\nZ (2)\nwhere Z = ∑\nw” P (w”|s, w) is a normalization constant, vs is the vector resulting from an adequate number of random walks used to calculate PPR, and vs(s′) is the vector component corresponding to sense s′. To fix the number of iterations needed to have a sufficiently accurate vector, we follow Lofgren et al. (2014) and set the error δ = 0.00001 and the number of iterations to 1 δ = 100, 000.\nAs a result of this lexical profiling step we have a probability distribution over vocabulary words for each given word sense of interest."
  }, {
    "heading": "2.2 Sentence scoring",
    "text": "The objective of the second step is to score the importance of word senses for each of the corpus sentences which contain the word of interest. Given a sentence σ = w1, w2, . . . , wn, for a given target wordw in the sentence (w ∈ σ), and for each of its senses s ∈ Senses(w), we compute the probability P (s|σ,w). Thanks to Bayes’ theorem we can determine the probability of sense s of w given the\n1Note that we use senses and concepts (synsets) interchangeably, because – given a word – a word sense unambiguously determines a concept (i.e., the synset it is contained in) and vice versa.\nsentence as follows:\nP (s|σ,w) = P (σ|s, w)P (s|w) P (σ|w) (3)\n= P (w1, . . . , wn|s, w)P (s|w) P (w1, . . . , wn|w) ∝ P (w1, . . . , wn|s, w)P (s|w) (4) ≈ P (w1|s, w) . . . P (wn|s, w)P (s|w)\n(5)\nwhere Formula 4 is proportional to the original probability (due to removing the constant in the denominator) and is approximated with Formula 5 due to the assumption of independence of the words in the sentence. P (wi|s, w) is calculated as in Formula 2 and P (s|w) is set to 1/|Senses(w)| (recall that s is a sense of w). For example, given the sentence σ = “A match is a tool for starting a fire”, the target word w = match and its set of senses Smatch = {s1match, s2match}, where s1match is the sense of lighter and s2match is the sense of game match, we want to calculate the probability of each simatch ∈ Smatch of being the correct sense of match in the sentence σ. Following Formula 5 we have:\nP (s1match|σ,match) ≈ P (tool|s1match,match) · P (start|s1match,match) · P (fire|s1match,match) · P (s1match|match) = 2.1 · 10−4 · 2 · 10−3 · 10−2 · 5 · 10−1 = 2.1 · 10−9\nP (s2match|σ,match) ≈ P (tool|s2match,match) · P (start|s2match,match) · P (fire|s2match,match) · P (s2match|match) = 10−5 · 2.9 · 10−4 · 10−6 · 5 · 10−1 = 1.45 · 10−15\nAs can be seen, the first sense of match has a much higher probability due to its stronger relatedness to the other words in the context (i.e. start, fire and tool). Note also that all the probabilities for the second sense are at least one magnitude less than the probability of the first sense."
  }, {
    "heading": "2.3 Sense-based sentence ranking and selection",
    "text": "Finally, for a given word w and a given sense s1 ∈ Senses(w), we score each sentence σ in which w appears and s1 is its most likely sense according to a formula that takes into account the difference between the first (i.e., s1) and the second most likely sense of w in σ:\n∆s1(σ) = P (s1|σ,w)− P (s2|σ,w) (6) where s1 = arg maxs∈Senses(w) P (s|σ,w), and s2 = arg maxs∈Senses(w)\\{s1} P (s|σ,w). We then sort all sentences based on ∆s1(·) and return a ranked list of sentences where word w is most likely to be sense-annotated with s1. Although we recognize that other scoring strategies could have been used, this was experimentally the most effective one when compared to alternative strategies, i.e., the sense probability, the number of words related to the target word w, the sentence length or a combination thereof."
  }, {
    "heading": "3 Creating a Denser and Multilingual Semantic Network",
    "text": "In the previous Section we assumed that WordNet was our semantic network, with synsets as vertices and edges represented by its semantic relations. However, while its lexical coverage is high, with a rich set of fine-grained synsets, at the relation level WordNet provides mainly paradigmatic information, i.e., relations like hypernymy (is-a) and meronymy (part-of). It lacks, on the other hand, syntagmatic relations, such as those that connect verb synsets to their arguments (e.g., the appropriate senses of eatv and foodn), or pairs of noun synsets (e.g., the appropriate senses of busn and drivern).\nIntuitively, Train-O-Matic would suffer from such a lack of syntagmatic relations, as the relevance of a sense for a given word in a sentence depends directly on the possibility of visiting senses of the other words in the same sentence (cf. Formula 5) via random walks as calculated with Formula 1. Such reachability depends on the connections available between synsets. Because syntagmatic relations are sparse in WordNet, if it was used on its own, we would end up with a poor ranking of sentences for any given word sense. Moreover, even though the methodology presented in Section 2 is languageindependent, Train-O-Matic would lack informa-\ntion (e.g. senses for a word in an arbitrary vocabulary) for languages other than English.\nTo cope with these issues, we exploit BabelNet,2 a huge multilingual semantic network obtained from the automatic integration of WordNet, Wikipedia, Wiktionary and other resources (Navigli and Ponzetto, 2012), and create the BabelNet subgraph induced by the WordNet vertices. The result is a graph whose vertices are BabelNet synsets that contain at least one WordNet synset and whose edge set includes all those relations in BabelNet coming either from WordNet itself or from links in other resources mapped to WordNet (such as hyperlinks in a Wikipedia article connecting it to other articles). The greatest contribution of syntagmatic relations comes, indeed, from Wikipedia, as its articles are linked to related articles (e.g., the English Wikipedia Bus article3 is linked to Passenger, Tourism, Bus lane, Timetable, School, and many more).\nBecause not all Wikipedia (and other resources’) pages are connected with the same degree of relatedness (e.g., countries are often linked, but they are not necessarily closely related to the source article in which the link occurs), we apply the following weighting strategy to each edge (s, s′) ∈ E of our WordNet-induced subgraph of BabelNet G = (V,E):\nw(s, s′) = { 1 (s, s′) ∈ E(WordNet) WO(s, s′) otherwise\n(7) where E(WordNet) is the edge set of the original WordNet graph andWO(s, s′) is the weighted\n2http://babelnet.org 3Retrieved on February 3rd, 2017.\noverlap measure which calculates the similarity between two synsets:\nWO(s, s′) = ∑|S| i=1(r 1 i + r\n2 i ) −1∑|S|\ni=1(2i)−1\nwhere r1i and r 2 i are the rankings of the i-th synsets in the set S of the components in common between the vectors associated with s and s′, respectively. Because at this stage we still have to calculate our synset vector representation, we use the precomputed NASARI vectors (Camacho-Collados et al., 2015) to calculate WO. This choice is due to WO’s higher performance over cosine similarity for vectors with explicit dimensions (Pilehvar et al., 2013).\nAs a result, each row of the original adjacency matrix M of G will be replaced with the weights calculated in Formula 7 and then normalized in order to be ready for PPR calculation (see Formula 1). An idea of why a denser semantic network has more useful connections and thus leads to better results is provided by the example in\niment for the animal, and operating system and Windows for the device sense, among others)."
  }, {
    "heading": "4 Experimental Setup",
    "text": "Corpora for sense annotation We used two different corpora to extract sentences: Wikipedia and the United Nations Parallel Corpus (Ziemski et al., 2016). The first is the largest and most up-to-date encyclopedic resource, containing definitional information, the second, on the other hand, is a public collection of parliamentary documents of the United Nations. The application of TrainO-Matic to the two corpora produced two senseannotated datasets, which we named T-O-MWiki and T-O-MUN , respectively.\nSemantic Network We created sense-annotated corpora with Train-O-Matic both when using PPR vectors computed from vanilla WordNet and when using WordNetBN , our denser network obtained from the WordNet-induced subgraph of BabelNet (see Section 3).\nGold standard datasets We performed our evaluations using the framework made available by Raganato et al. (2017a) on five different allwords datasets, namely: the Senseval-2 (Edmonds and Cotton, 2001), Senseval-3 (Snyder and Palmer, 2004), SemEval-2007 (Pradhan et al., 2007), SemEval-2013 (Navigli et al., 2013) and SemEval-2015 (Moro and Navigli, 2015) WSD datasets. We focused on nouns only, given the fact that Wikipedia provides connections between nominal synsets only, and therefore contributes mainly to syntagmatic relations between nouns.\nComparison sense-annotated corpora To show the impact of our T-O-M corpora in WSD, we compared its performance on the above gold standard datasets, against training with:\n• SemCor (Miller et al., 1993), a corpus containing about 226,000 words annotated manually with WordNet senses.\n• One Million Sense-Tagged Instances (Taghipour and Ng, 2015, OMSTI), a sense-annotated dataset obtained via a semi-automatic approach based on the disambiguation of a parallel corpus, i.e., the United Nations Parallel Corpus, performed by exploiting manually translated word senses. Because OMSTI integrates SemCor\nto increase coverage, to keep a level playing field we excluded the latter from the corpus.\nWe note that T-O-M, instead, is fully automatic and does not require any WSD-specific human intervention nor any aligned corpus.\nReference system In all our experiments, we used It Makes Sense (Zhong and Ng, 2010, IMS), a state-of-the-art WSD system based on linear Support Vector Machines, as our reference system for comparing its performance when trained on TO-M, against the same WSD system trained on other sense-annotated corpora (i.e., SemCor and OMSTI). Following the WSD literature, unless stated otherwise, we report performance in terms of F1, i.e., the harmonic mean of precision and recall.\nWe note that it is not the purpose of this paper to show that T-O-M, when integrated into IMS, beats all other configurations or alternative systems, but rather to fully automatize the WSD pipeline with performances which are competitive with the state of the art.\nBaseline As a traditional baseline in WSD, we used the Most Frequent Sense (MFS) baseline given by the first sense in WordNet. The MFS is a very competitive baseline, due to the sense skewness phenomenon in language (Navigli, 2009).\nNumber of training sentences per sense Given a target word w, we sorted its senses Senses(w) following the WordNet ordering and selected the top ki training sentences for the i-th sense according to Formula 6, where:\nki = 1 iz ∗K (8)\nwith K = 500 and z = 2 which were tuned on a separate small in-house development dataset5."
  }, {
    "heading": "5 Results",
    "text": ""
  }, {
    "heading": "5.1 Impact of syntagmatic relations",
    "text": "The first result we report regards the impact of vanilla WordNet vs. our WordNet-induced subgraph of BabelNet (WordNetBN ) when calculating PPR vectors. As can be seen from Table 2 – which shows the performance of the T-O-MWiki corpora generated with the two semantic networks – using WordNet for PPR computation decreases\n550 word-sense pairs annotated manually.\nthe overall performance of IMS from 0.5 to around 4 points across the five datasets, with an overall loss of 1.6 F1 points. Similar performance losses were observed when using T-O-MUN (see Table 3). This corroborates our hunch discussed in Section 3 that a resource like BabelNet can contribute important syntagmatic relations that are beneficial for identifying (and ranking high) sentences which are semantically relevant for the target word sense. In the following experiments, we report only results using WordNetBN ."
  }, {
    "heading": "5.2 Comparison against sense-annotated corpora",
    "text": "We now move to comparing the performance of T-O-M, which is fully automatic, against corpora which are annotated manually (SemCor) and semi-automatically (OMSTI). In Table 3 we show the F1-score of IMS on each gold standard dataset in the evaluation framework and on all datasets merged together (last row), when it is trained with the various corpora described above.\nAs can be seen, T-O-MWiki and T-O-MUN obtain higher performance than OMSTI (up to 5.5 points above) on 3 out of 5 datasets, and, overall, T-O-MWiki scores 1 point above OMSTI. The MFS is in the same ballpark as T-O-MWiki, performing better on some datasets and worse on others. We note that IMS trained on T-O-MWiki succeeds in surpassing or obtaining the same results as IMS trained on SemCor on SemEval15 and SemEval-13. We view this as a significant achievement given the total absence of manual effort involved in T-O-M. Because overall T-O-MWiki outperforms T-O-MUN , in what follows we report all the results with T-O-MWiki, except for the domain-oriented evaluation (see Section 5.4)."
  }, {
    "heading": "5.3 Performance without backoff strategy",
    "text": "IMS uses the MFS as a backoff strategy when no sense can be output for a target word in context (Zhong and Ng, 2010). Consequently, the performance of the MFS is mixed up with that of the SVM classifier. As shown in Table 4, OMSTI is able to provide annotated sentences for roughly half of the tokens in the datasets. Train-O-Matic, on the other hand, is able to cover almost all words in each dataset with at least one training sentence. This means that in around 50% of cases OMSTI gives an answer based on the IMS backoff strategy.\nTo determine the real impact of the different training data, we therefore decided to perform an additional analysis of the IMS performance when the MFS backoff strategy is disabled. Because we suspected the system would not always return a sense for each target word, in this experiment we measured precision, recall and their harmonic mean, i.e., F1. The results in Table 5 confirm our hunch, showing that OMSTI’s recall drops heavily, thereby affecting F1 considerably. T-O-M performances, instead, remain high in terms of precision, recall and F1. This confirms that OMSTI relies heavily on data (those obtained for the MFS and from SemCor) that are produced manually, rather than semi-automatically."
  }, {
    "heading": "5.4 Domain-oriented WSD",
    "text": "To further inspect the ability of T-O-M to enable disambiguation in different domains, we decided to evaluate on specific documents from the various gold standard datasets which could be clearly assigned a domain label. Specifically, we tested on 13 SemEval-13 documents from various domains6 and 2 SemEval-15 documents (namely, maths & computers, and biomedicine) and carried out two separate tests and evaluations of T-O-M on each domain: once using the MFS backoff strategy, and once not using it. In Tables 6 and 7 we report the results of both T-O-MWiki and T-O-MUN to determine the impact of the corpus type.\nAs can be seen in the tables, T-O-MWiki systematically attains higher scores than OMSTI (except for the biology domain), and, in most cases, attains higher scores than MFS when the backoff is used, with a drastic, systematic increase over OMSTI with both Train-O-Matic configurations\n6Namely biology, climate, finance, health care, politics, social issues and sport.\nin recall and F1 when the backoff strategy is disabled. This demonstrates the usefulness of the corpora annotated by Train-O-Matic not only on open text, but also on specific domains. We note that T-O-MUN obtains the best results in the politics domain, which is the closest domain to the UN corpus from which its training sentences are obtained."
  }, {
    "heading": "6 Scaling up to Multiple Languages",
    "text": "Experimental Setup In this section we investigate the ability of Train-O-Matic to scale to lowresourced languages, such as Italian and Spanish, for which training data for WSD is not available.\nThanks to BabelNet, in fact, Train-O-Matic can\nbe used to generate sense-annotated data for any language supported by the knowledge base. Thus, in order to build new training datasets for the two languages, we ran Train-O-Matic on their corresponding versions of Wikipedia, then we tuned the two parameters K and z on an in-house development dataset7. In contrast to the English setting, in order to calculate Formula 8 we sorted the senses of each word by vertex degree. Finally we used the output data to train IMS.\nResults To perform our evaluation we chose the most recent multilingual task (SemEval 2015 task 13) which includes gold data for Italian and Spanish. As can be seen from Table 8 TrainO-Matic enabled IMS to perform better than the best participating system (Manion and Sainudiin, 2014, SUDOKU) in all three settings (All domains, Maths & Computer and Biomedicine). Its performance was in fact, 1 to 3 points higher, with a 6-point peak on Maths & Computer in Spanish and on Biomedicine in Italian. This demonstrates the ability of Train-O-Matic to enable supervised WSD systems to surpass state-of-theart knowledge-based WSD approaches in lowresourced languages without relying on manually curated data for training."
  }, {
    "heading": "7 Related Work",
    "text": "There are two mainstream approaches to Word Sense Disambiguation: supervised and knowledge-based approaches. Both suffer in different ways from the so-called knowledge acquisition bottleneck, that is, the difficulty in obtaining an adequate amount of lexical-semantic data: for training in the case of supervised systems, and for enriching semantic networks in the case of knowledge-based ones (Pilehvar and\n7We set K = 100 and z = 2.3 for Spanish and K = 100 and z = 2.5 for Italian.\nNavigli, 2014; Navigli, 2009).\nState-of-the-art supervised systems include Support Vector Machines such as IMS (Zhong and Ng, 2010) and, more recently, LSTM neural networks with attention and multitask learning (Raganato et al., 2017b) as well as LSTMs paired with nearest neighbours classification (Melamud et al., 2016; Yuan et al., 2016). The latter also integrates a label propagation algorithm in order to enrich the sense annotated dataset. The main difference from our approach is its need for a manually annotated dataset to start the label propagation algorithm, whereas Train-O-Matic is fully automatic. An evaluation against this system would have been interesting, but neither the proprietary training data nor the code are available at the time of writing.\nIn order to generalize effectively, these supervised systems require large numbers of training in-\nstances annotated with senses for each target word occurrence. Overall, this amounts to millions of training instances for each language of interest, a number that is not within reach for any language. In fact, no supervised system has been submitted in major multilingual WSD competitions for languages other than English (Navigli et al., 2013; Moro and Navigli, 2015). To overcome this problem, new methodologies have recently been developed which aim to create sense-tagged corpora automatically. Raganato et al. (2016) developed 7 heuristics to grow the number of hyperlinks in Wikipedia pages. Otegi et al. (2016) applied a different disambiguation pipeline for each language to parallel text in Europarl (Koehn, 2005) and QTLeap (Agirre et al., 2015) in order to enrich them with semantic annotations. Taghipour and Ng (2015), the work closest to ours, exploits the alignment from English to Chinese sentences of\nthe United Nation Parallel Corpus (Ziemski et al., 2016) to reduce the ambiguity of English words and sense-tag English sentences. The assumption is that the second language is less ambiguous than the first one and that hand-made translations of senses are available for each WordNet synset. This approach is, therefore, semi-automatic and relies on certain assumptions, in contrast to TrainO-Matic which is, instead, fully automatic and can be applied to any kind of corpus (and language) depending on the specific need. Earlier attempts at the automatic extraction of training samples were made by Agirre and De Lacalle (2004) and Fernández et al. (2004). Both exploited the monosemous relatives method (Leacock et al., 1998) in order to retrieve sentences from the Web which contained a given monosemous noun or a relative monosemous word (e.g., a synonym, a hypernym, etc.). As can be seen in (Fernández et al., 2004) this approach can lead to the retrieval of very accurate examples, but its main drawback lies in the number of senses covered. In fact, for all those synsets that do not have any monosemous relative, the system is unable to retrieve examples, thus heavily affecting the performance in terms of recall and F1. Knowledge-based WSD, instead, bypasses the heavy requirement of sense-annotated corpora by applying algorithms that exploit a general-purpose semantic network, such as WordNet, which encodes the relational information that interconnects synsets via different kinds of relation. Approaches include variants of Personalized PageRank (Agirre et al., 2014) and densest subgraph approximation algorithms (Moro et al., 2014) which, thanks to the availability of multilingual resources such as BabelNet, can easily be extended to perform WSD in arbitrary languages. Other approaches to knowledge-based WSD exploit the definitional knowledge contained in a dictionary. The Lesk algorithm (Lesk, 1986) and its variants (Banerjee and Pedersen, 2002; Kilgarriff and Rosenzweig, 2000; Vasilescu et al., 2004) aim to determine the correct sense of a word by comparing each wordsense definition with the context in which the target word appears. The limit of knowledge-based WSD, however, lies in the absence of mechanisms that can take into account the very local context of a target word occurrence, including non-content words such as prepositions and articles. Furthermore, recent studies seem to suggest that such\napproaches are barely able to surpass supervised WSD systems when they enrich their networks starting from a comparable amount of annotated data (Pilehvar and Navigli, 2014). With T-O-M, rather than further enriching an existing semantic network, we exploit the information available in the network to annotate raw sentences with sense information and train a state-of-the-art supervised WSD system without task-specific human annotations."
  }, {
    "heading": "8 Conclusion",
    "text": "In this paper we presented Train-O-Matic, a novel approach to the automatic construction of large training sets for supervised WSD in an arbitrary language. Train-O-Matic removes the burden of manual intervention by leveraging the structural semantic information available in the WordNet graph enriched with additional relational information from BabelNet, and achieves performance competitive to that of semi-automatic approaches and, in some cases, of manually-curated training data. T-O-M was shown to provide training data for virtually all the target ambiguous nouns, in marked contrast to alternatives like OMSTI, which covers in many cases around half of the tokens, resorting to the MFS otherwise. Moreover Train-O-Matic has proven to scale well to lowresourced languages, for which no manually annotated dataset exists, surpassing the current state of the art of knowledge-based systems.\nWe believe that the ability of T-O-M to overcome the current paucity of annotated data for WSD, coupled with video games with a purpose for validation purposes (Jurgens and Navigli, 2014; Vannella et al., 2014), paves the way for high-quality multilingual supervised WSD. All the training corpora, including approximately one million sentences which cover English, Italian and Spanish, are made available to the community at http://trainomatic.org.\nAs future work we plan to extend our approach to verbs, adjectives and adverbs. Following Bennett et al. (2016) we will also experiment on more realistic estimates of P (s|w) in Formula 5 as well as other assumptions made in our work."
  }, {
    "heading": "Acknowledgments",
    "text": "The authors gratefully acknowledge the support of the ERC Consolidator Grant MOUSSE No. 726487."
  }],
  "year": 2017,
  "references": [{
    "title": "Europarl QTLeap WSD/NED corpus",
    "authors": ["Eneko Agirre", "António Branco", "Martin Popel", "Kiril Simov."],
    "venue": "LINDAT/CLARIN digital library at the Institute of Formal and Applied Linguistics, Charles University in Prague.",
    "year": 2015
  }, {
    "title": "Publicly available topic signatures for all wordnet nominal senses",
    "authors": ["Eneko Agirre", "Oier Lopez De Lacalle."],
    "venue": "LREC.",
    "year": 2004
  }, {
    "title": "Random walks for knowledge-based word sense disambiguation",
    "authors": ["Eneko Agirre", "Oier Lopez de Lacalle", "Aitor Soroa."],
    "venue": "Computational Linguistics, 40(1):57–84.",
    "year": 2014
  }, {
    "title": "An adapted Lesk algorithm for word sense disambiguation using wordnet",
    "authors": ["Satanjeev Banerjee", "Ted Pedersen."],
    "venue": "International Conference on Intelligent Text Processing and Computational Linguistics, pages 136–145. Springer.",
    "year": 2002
  }, {
    "title": "Lexsemtm: A semantic dataset based on all-words unsupervised sense distribution learning",
    "authors": ["Andrew Bennett", "Timothy Baldwin", "Jey Han Lau", "Diana McCarthy", "Francis Bond."],
    "venue": "Proceedings of the 54nd Annual Meeting of the Association for Compu-",
    "year": 2016
  }, {
    "title": "The anatomy of a large-scale hypertextual web search engine",
    "authors": ["Sergey Brin", "Lawrence Page."],
    "venue": "Computer Networks and ISDN Systems, 30(1–7):107– 117.",
    "year": 1998
  }, {
    "title": "Nasari: a novel approach to a semantically-aware representation of items",
    "authors": ["José Camacho-Collados", "Mohammad Taher Pilehvar", "Roberto Navigli."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for",
    "year": 2015
  }, {
    "title": "Senseval-2: overview",
    "authors": ["Philip Edmonds", "Scott Cotton."],
    "venue": "The Proceedings of the Second International Workshop on Evaluating Word Sense Disambiguation Systems, pages 1–5. Association for Computational Linguistics.",
    "year": 2001
  }, {
    "title": "WordNet: An Electronic Database",
    "authors": ["Christiane Fellbaum", "editor"],
    "year": 1998
  }, {
    "title": "Automatic acquisition of sense examples using exretriever",
    "authors": ["Juan Fernández", "Mauro Castillo Valdés", "German Rigau Claramunt", "Jordi Atserias Batalla", "Jordi Tormo."],
    "venue": "IBERAMIA Workshop on Lexical Resources and The Web for Word Sense Dis-",
    "year": 2004
  }, {
    "title": "It’s All Fun and Games until Someone Annotates: Video Games with a Purpose for Linguistic Annotation",
    "authors": ["David Jurgens", "Roberto Navigli."],
    "venue": "Transactions of the Association for Computational Linguistics (TACL), 2:449–464.",
    "year": 2014
  }, {
    "title": "Framework and results for english SENSEVAL",
    "authors": ["Adam Kilgarriff", "Joseph Rosenzweig."],
    "venue": "Computers and the Humanities, 34(1–2):15–48.",
    "year": 2000
  }, {
    "title": "Europarl: A parallel corpus for statistical machine translation",
    "authors": ["Philipp Koehn."],
    "venue": "MT summit, volume 5, pages 79–86.",
    "year": 2005
  }, {
    "title": "Using corpus statistics and wordnet relations for sense identification",
    "authors": ["Claudia Leacock", "George A Miller", "Martin Chodorow."],
    "venue": "Computational Linguistics, 24(1):147–165.",
    "year": 1998
  }, {
    "title": "Automatic sense disambiguation using machine readable dictionaries: How to tell a pine cone from an ice cream cone",
    "authors": ["Michael Lesk."],
    "venue": "Proceedings of the 5th Annual Conference on Systems Documentation, Toronto, Ontario, Canada, pages 24–26.",
    "year": 1986
  }, {
    "title": "Fast-ppr: Scaling personalized pagerank estimation for large graphs",
    "authors": ["Peter A Lofgren", "Siddhartha Banerjee", "Ashish Goel", "C Seshadhri."],
    "venue": "Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data min-",
    "year": 2014
  }, {
    "title": "An iterative “sudoku style” approach to subgraph-based word sense disambiguation",
    "authors": ["Steve L Manion", "Raazesh Sainudiin."],
    "venue": "In Proceedings of the Third Joint Conference on Lexical and Computational Se- mantics (*SEM 2014), pages 40–50,",
    "year": 2014
  }, {
    "title": "context2vec: Learning generic context embedding with bidirectional lstm",
    "authors": ["Oren Melamud", "Jacob Goldberger", "Ido Dagan."],
    "venue": "Proceedings of CONLL, pages 51–61.",
    "year": 2016
  }, {
    "title": "A semantic concordance",
    "authors": ["George A. Miller", "Claudia Leacock", "Randee Tengi", "Ross Bunker."],
    "venue": "Proceedings of the 3rd DARPA Workshop on Human Language Technology, pages 303–308, Plainsboro, N.J.",
    "year": 1993
  }, {
    "title": "Semeval2015 task 13: Multilingual all-words sense disambiguation and entity linking",
    "authors": ["Andrea Moro", "Roberto Navigli."],
    "venue": "Proc. of SemEval2015.",
    "year": 2015
  }, {
    "title": "Entity Linking meets Word Sense Disambiguation: a Unified Approach",
    "authors": ["Andrea Moro", "Alessandro Raganato", "Roberto Navigli."],
    "venue": "Transactions of the Association for Computational Linguistics (TACL), 2:231–244.",
    "year": 2014
  }, {
    "title": "Word Sense Disambiguation: A survey",
    "authors": ["Roberto Navigli."],
    "venue": "ACM Computing Surveys, 41(2):1–69.",
    "year": 2009
  }, {
    "title": "Semeval-2013 task 12: Multilingual word sense disambiguation",
    "authors": ["Roberto Navigli", "David Jurgens", "Daniele Vannella."],
    "venue": "Proceedings of the 7 International Workshop on Semantic Evaluation (SemEval 2013), in conjunction with the Second Joint",
    "year": 2013
  }, {
    "title": "BabelNet: The automatic construction, evaluation and application of a wide-coverage multilingual semantic network",
    "authors": ["Roberto Navigli", "Simone Paolo Ponzetto."],
    "venue": "Artificial Intelligence, 193:217– 250.",
    "year": 2012
  }, {
    "title": "Qtleap wsd/ned corpora: Semantic annotation of parallel corpora in six languages",
    "authors": ["Arantxa Otegi", "Nora Aranberri", "Antonio Branco", "Jan Hajic", "Steven Neale", "Petya Osenova", "Rita Pereira", "Martin Popel", "Joao Silva", "Kiril Simov"],
    "year": 2016
  }, {
    "title": "De-conflated semantic representations",
    "authors": ["Mohammad Taher Pilehvar", "Nigel Collier."],
    "venue": "Proceedings of the Conference on Empirical Methods in Natural Language Processing, pages 1680–1690, Austin, TX.",
    "year": 2016
  }, {
    "title": "Align, disambiguate and walk: A unified approach for measuring semantic similarity",
    "authors": ["Mohammad Taher Pilehvar", "David Jurgens", "Roberto Navigli."],
    "venue": "Proceedings of ACL, pages 1341– 1351.",
    "year": 2013
  }, {
    "title": "A large-scale pseudoword-based evaluation framework for state-of-the-art word sense disambiguation",
    "authors": ["Mohammad Taher Pilehvar", "Roberto Navigli."],
    "venue": "Computational Linguistics, 40(4):837–881.",
    "year": 2014
  }, {
    "title": "Semeval-2007 task 17: English lexical sample, srl and all words",
    "authors": ["Sameer S Pradhan", "Edward Loper", "Dmitriy Dligach", "Martha Palmer."],
    "venue": "Proceedings of the 4th International Workshop on Semantic Evaluations, pages 87–92.",
    "year": 2007
  }, {
    "title": "Word Sense Disambiguation: A Unified Evaluation Framework and Empirical Comparison",
    "authors": ["Alessandro Raganato", "Jose Camacho-Collados", "Roberto Navigli."],
    "venue": "Proceedings of EACL, pages 99–110, Valencia, Spain.",
    "year": 2017
  }, {
    "title": "Automatic Construction and Evaluation of a Large Semantically Enriched Wikipedia",
    "authors": ["Alessandro Raganato", "Claudio Delli Bovi", "Roberto Navigli."],
    "venue": "Proceedings of IJCAI, pages 2894–2900, New York City, NY, USA.",
    "year": 2016
  }, {
    "title": "Neural sequence learning models for word sense disambiguation",
    "authors": ["Alessandro Raganato", "Claudio Delli Bovi", "Roberto Navigli."],
    "venue": "Proceedings of Empirical Methods in Natural Language Processing, Copenhagen, Denmark.",
    "year": 2017
  }, {
    "title": "The english all-words task",
    "authors": ["Benjamin Snyder", "Martha Palmer."],
    "venue": "Senseval-3: Third International Workshop on the Evaluation of Systems for the Semantic Analysis of Text, pages 41–43, Barcelona, Spain.",
    "year": 2004
  }, {
    "title": "One million sense-tagged instances for word sense disambiguation and induction",
    "authors": ["Kaveh Taghipour", "Hwee Tou Ng."],
    "venue": "CoNLL 2015, page 338.",
    "year": 2015
  }, {
    "title": "Validating and extending semantic knowledge bases using video games with a purpose",
    "authors": ["Daniele Vannella", "David Jurgens", "Daniele Scarfini", "Domenico Toscani", "Roberto Navigli."],
    "venue": "Proceedings of the 52nd Annual Meeting of the Association",
    "year": 2014
  }, {
    "title": "Evaluating variants of the lesk approach for disambiguating words",
    "authors": ["Florentina Vasilescu", "Philippe Langlais", "Guy Lapalme."],
    "venue": "Proceedings of LREC, Lisbon, Portugal.",
    "year": 2004
  }, {
    "title": "Semi-supervised word sense disambiguation with neural models",
    "authors": ["Dayu Yuan", "Julian Richardson", "Ryan Doherty", "Colin Evans", "Eric Altendorf."],
    "venue": "Proceedings of COLING, pages 1374–1385.",
    "year": 2016
  }, {
    "title": "It makes sense: A wide-coverage word sense disambiguation system for free text",
    "authors": ["Zhi Zhong", "Hwee Tou Ng."],
    "venue": "Proceedings of the ACL 2010 System Demonstrations, pages 78–83, Uppsala, Sweden. Association for Computational Linguistics.",
    "year": 2010
  }, {
    "title": "The United Nations parallel corpus v1.0",
    "authors": ["Micha Ziemski", "Marcin Junczys-Dowmunt", "Bruno Pouliquen"],
    "venue": "In Proceedings of the Tenth International Conference on Language Resources and Evaluation (LREC 2016),",
    "year": 2016
  }],
  "id": "SP:f16ff1c0b9acbd26999df3d6aeb8bd417df3cdd6",
  "authors": [{
    "name": "Tommaso Pasini",
    "affiliations": []
  }, {
    "name": "Roberto Navigli",
    "affiliations": []
  }],
  "abstractText": "Annotating large numbers of sentences with senses is the heaviest requirement of current Word Sense Disambiguation. We present Train-O-Matic, a languageindependent method for generating millions of sense-annotated training instances for virtually all meanings of words in a language’s vocabulary. The approach is fully automatic: no human intervention is required and the only type of human knowledge used is a WordNet-like resource. Train-O-Matic achieves consistently state-of-the-art performance across gold standard datasets and languages, while at the same time removing the burden of manual annotation. All the training data is available for research purposes at http://trainomatic.org.",
  "title": "Train-O-Matic: Large-Scale Supervised Word Sense Disambiguation in Multiple Languages without Manual Training Data"
}