{
  "sections": [{
    "text": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 1369–1379 Brussels, Belgium, October 31 - November 4, 2018. c©2018 Association for Computational Linguistics\n1369"
  }, {
    "heading": "1 Introduction",
    "text": "Now that algorithms have started to produce relevant and realistic natural language that can describe images and videos, we would like to understand what these models truly comprehend. The Visual Question Answering (VQA) task provides a nice tool for fine-grained evaluation of such multimodal algorithms. VQA systems take as input an image (or video) along with relevant natural language questions, and produce answers to those questions. By asking algorithms to answer different types of questions, ranging from object identification, counting, or appearance, to more complex questions about interactions, social relationships, or inferences about why or how something is occurring, we can evaluate different aspects of a model’s multimodal semantic understanding.\nAs a result, several popular image-based VQA datasets have been introduced, including DAQUAR (Malinowski and Fritz, 2014), COCO-QA (Ren et al., 2015a), FM-IQA (Gao\net al., 2015), Visual Madlibs (Yu et al., 2015), VQA (Antol et al., 2015), Visual7W (Zhu et al., 2016), etc. In addition, multiple video-based QA datasets have also been collected recently, e.g., MovieQA (Tapaswi et al., 2016), MovieFIB (Maharaj et al., 2017a), PororoQA (Kim et al., 2017), TGIF-QA (Jang et al., 2017), etc. However, there exist various shortcomings for each such video QA dataset. For example, MovieFIB’s video clips are typically short (∼4 secs), and focused on purely visual concepts (since they were collected from audio descriptions for the visually impaired); MovieQA collected QAs based on text summaries only, making them very plot-focused and less relevant for visual information; PororoQA’s video domain is cartoon-based; and TGIF-QA used predefined templates for generation on short GIFs.\nWith video-QA in particular, as opposed to image-QA, the video itself often comes with associated natural language in the form of (subtitle) dialogue. We argue that this is an important area to study because it reflects the real world, where people interact through language, and where many computational systems like robots or other intelligent agents will ultimately have to operate. As such, systems will need to combine information from what they see with what they hear, to pose and answer questions about what is happening.\nWe aim to provide a dataset that merges the best qualities from all of the previous datasets as well as focus on multimodal compositionality. In particular, we collect a new large-scale dataset that is built on natural video content with rich dynamics and realistic social interactions, where questionanswer pairs are written by people observing both videos and their accompanying dialogues, encouraging the questions to require both vision and language understanding to answer. To further encourage this multimodal-QA quality, we ask people to write compositional questions consisting\nof two parts, a main question part, e.g. “What are Leonard and Sheldon arguing about” and a grounding part, e.g. “when they are sitting on the couch”. This also leads to an interesting secondary task of QA temporal localization.\nOur contribution is the TVQA dataset, built on 6 popular TV shows spanning 3 genres: medical dramas, sitcoms, and crime shows. On this data, we collected 152.5K human-written QA pairs (examples shown in Fig.1). There are 4 salient advantages of our dataset. First, it is large-scale and natural, containing 21,793 video clips from 925 episodes. On average, each show has 7.3 seasons, providing long range character interactions and evolving relationships. Each video clip is associated with 7 questions, with 5 answers (1 correct) for each question. Second, our video clips are relatively long (60-90 seconds), thereby containing more social interactions and activities, making video understanding more challenging. Third, we provide the dialogue (character name + subtitle) for each QA video clip. Understanding the relationship between the provided dialogue and the question-answer pairs is crucial for correctly answering many of the collected questions. Fourth, our questions are compositional, requiring algorithms to localize relevant moments (START and END points are provided for each question).\nWith the above rich annotation, our dataset supports three tasks: QA on the grounded clip, question-driven moment localization, and QA on the full video clip. We provide baseline experiments on both QA tasks and introduce a state-ofthe-art language and vision-based model (leaving moment localization for future work)."
  }, {
    "heading": "2 Related Work",
    "text": "Visual Question Answering: Several imagebased VQA datasets have recently been constructed, e.g., DAQUAR (Malinowski and Fritz, 2014), VQA (Antol et al., 2015), COCO-Q (Ren et al., 2015a), FM-IQA (Gao et al., 2015), Visual Madlibs (Yu et al., 2015), Visual7W (Zhu et al., 2016), CLEVR (Johnson et al., 2017), etc. Additionally, several video-based QA datasets have also been proposed, e.g. TGIF-QA (Jang et al., 2017), MovieFIB (Maharaj et al., 2017b), VideoQA (Zhu et al., 2017), LSMDC (Rohrbach et al., 2015), TRECVID (Over et al., 2014), MovieQA (Tapaswi et al., 2016), PororoQA (Kim et al., 2017) and MarioQA (Mun et al., 2017). However, none of these datasets provides a truly realistic, multimodal QA scenario where both visual and language understanding are required to answer a large portion of questions, either due to unrealistic video sources (PororoQA, MarioQA) or data collection strategy being more focused on either visual (MovieFIB, VideoQA, TGIF-QA) or language (MovieQA) sources. In comparison, our TVQA collection strategy takes a directly multimodal approach to construct a large-scale, realvideo dataset by letting humans ask and answer questions while watching TV-show videos with associated dialogues. Text Question Answering: The related task of text-based question answering has been extensively explored (Richardson et al., 2013; Weston et al., 2015; Rajpurkar et al., 2016; Hermann et al., 2015; Hill et al., 2015). Richardson et al. (2013) collected MCTest, a multiple choice QA dataset intended for open-domain reading comprehension.\nWith the same goal in mind, Rajpurkar et al. (2016) introduced the SQuAD dataset, but their answers are specific spans from long passages. Weston et al. (2015) designed a set of tasks with automatically generated QAs to evaluate the textual reasoning ability of artificial agents and Hermann et al. (2015); Hill et al. (2015) constructed the cloze dataset on top of an existing corpus. While questions in these text QA datasets are specifically designed for language understanding, TVQA questions require both vision understanding and language understanding. Although methods developed for text QA are not directly applicable to TVQA tasks, they can provide inspiration for designing suitable models. Natural Language Object Retrieval: Language grounding addresses the task of object or moment localization in an image or video from a natural language description. For image-based object grounding, there has been much work on phrase grounding (Plummer et al., 2015; Wang et al., 2016b; Rohrbach et al., 2016) and referring expression comprehension (Hu et al., 2016; Yu et al., 2016; Nagaraja et al., 2016; Yu et al., 2017, 2018b). Recent work (Vasudevan et al., 2018) extends the grounding task to the video domain. Most recently, moment localization was proposed in (Hendricks et al., 2017; Gao et al., 2017), where the goal is to localize a short moment from a long video sequence given a query description. Accurate temporal grounding is a necessary step to answering our compositional questions."
  }, {
    "heading": "3 TVQA Dataset",
    "text": ""
  }, {
    "heading": "3.1 Dataset Collection",
    "text": "We collected our dataset on 6 long-running TV shows from 3 genres: 1) sitcoms: The Big Bang Theory, How I Met Your Mother, Friends, 2) medical dramas: Grey’s Anatomy, House, 3) crime drama: Castle. There are in total 925 episodes spanning 461 hours. Each episode was then segmented into short clips. We first created clips every 60/90 seconds, then shifted temporal boudaries to avoid splitting subtitle sentences between clips. Shows that are mainly conversational based, e.g., The Big Bang Theory, were segmented into 60 seconds clips, while shows that are less cerebral, e.g. Castle, were segmented into 90 seconds clips. In the end, 21,793 clips were prepared for QA collection, accompanied with subtitles and aligned with transcripts to add character names. A\nsample clip is shown in Fig. 1. Amazon Mechanical Turk was used for VQA collection on video clips, where workers were presented with both videos and aligned named subtitles, to encourage multimodal questions requiring both vision and language understanding to answer. Workers were asked to create questions using a compositional-question format: [What/How/Where/Why/...] [when/before/after] . The second part of each question serves to localize the relevant video moment within a clip, while the first part poses a question about that moment. This compositional format also serves to encourage questions that require both visual and language understanding to answer, since people often naturally use visual signals to ground questions in time, e.g. What was House saying before he leaned over the bed? During data collection, we only used prompt words (when/before/after) to encourage workers to propose the desired, complex compositional questions. There were no additional template constraints. Therefore, most of the language in the questions is relatively free-form and complex.\nUltimately, workers pose 7 different questions for each video clip. For each question, we asked workers to annotate the exact video portion required to answer the question by marking the START and END timestamps as in Krishna et al. (2017). In addition, they provide 1 correct and 4 wrong answers for each question. Workers get paid $1.3 for a single video clip annotation. The whole collection process took around 3 months.\nTo ensure the quality of the questions and answers, we set up an online checker in our collection interface to verify the question format, allowing only questions that reflect our two-step format to be submitted. The collection was done in batches of 500 videos. For each harvested batch, we sampled 3 pairs of submitted QAs from each worker and checked the semantic correctness of the questions, answers, and timestamps."
  }, {
    "heading": "3.2 Dataset Analysis",
    "text": "Multiple Choice QAs: Our QAs are multiple choice questions with 5 candidate answers for each question, for which only one is correct. Table 1 provides statistics of the QAs based on the first question word. On average, our questions contain 13.5 words, which is fairly long compared to other datasets. In general, correct answers tend\nto be slightly longer than wrong answers. Fig. 2 shows the distribution of different questions types. Note “what” (Abstract, Object, Action), “who” (Person), “why” (Reasoning) and “where” (Location) questions form a large part of our data.\nThe negative answers in TVQA are written by human annotators. They are instructed to write false but relevant answers to make the negatives challenging. Alternative methods include sampling negative answers from other questions’ correct answers, either based on semantic similarity (Das et al., 2017; Jang et al., 2017) or randomly (Antol et al., 2015; Das et al., 2017). The former is prone to introducing paraphrases of the ground-truth answer (Zhu et al., 2016). The latter avoids the problem of paraphrasing, but generally produces irrelevant negative choices. We show in Table 8 that our human written negatives are more challenging than randomly sampled negatives. Moment Localization: The second part of our question is used to localize the most relevant video portion to answer the question. The prompt of “when”, “after”, “before” account for 60.03%, 30.19% and 9.78% respectively of our dataset. TVQA provides the annotated START and END timestamps for each QA. We show the annotated\nsegment lengths in Fig. 3. We found most of the questions rely on relatively short moments (less than 15 secs) within a longer clip (60-90 secs). Differences among our 6 TV Shows: The videos used in our dataset are from 6 different TV shows. Table 2 provides statistics for each show. A good way to demonstrate the difference among questions from TV shows is to show their top unique nouns. In Table 3, we present such an analysis. The top unique nouns in sitcoms (BBT, Friends, HIMYM) are mostly daily objects, scenes and actions, while medical dramas (Grey, House) questions contain more medical terms, and crime shows (Castle) feature detective terms. Although similar, there are also notable differences among shows in the same genre. For example, BBT con-\ntains “game” and “laptop” while HIMYM contains “bar” and “beer”, indicating the different major activities and topics in each show. Additionally, questions about different characters also mention different words, as shown in Table 4. Comparison with Other Datasets: Table 5 presents a comparison of our dataset to some recently proposed video question answering datasets. In terms of total length of videos, TVQA is the largest, with a total of 461.2 hours of videos. MovieQA (Tapaswi et al., 2016) is most similar to our dataset, with both multiple choice questions and timestamp annotation. However, their questions and answers are constructed by people posing questions from a provided plot summary, then later aligned to the video clips, which makes most of their questions text oriented. Human Evaluation on Usefulness of Video and Subtitle in Dataset: To gain a better understand-\ning of the roles of videos and subtitles in the our dataset, we perform a human study, asking different groups of workers to complete the QA task in settings while observing different sources (subsets) of information:\n• Question only. • Video and Question. • Subtitle and Question. • Video, Subtitle, and Question.\nWe made sure the workers that have written the questions did not participate in this study and that workers see only one of the above settings for answering each question. Human accuracy on our test set under these 4 settings are reported in Table 5. As expected, compared to human accuracy based only on question-answer pairs (Q), adding videos (V+Q), or subtitles (S+Q) significantly improves human performance. Adding both videos and subtitles (V+S+Q) brings the accuracy to 89.41%. This indicates that in order to answer the questions correctly, both visual and textual understanding are essential. We also observe that workers obtain 31.84% accuracy given questionanswer pairs only, which is higher than random guessing (20%). We ascribe this to people’s prior knowledge about the shows. Note, timestamp annotations are not provided in these experiments."
  }, {
    "heading": "4 Methods",
    "text": "We introduce a multi-stream end-to-end trainable neural network for Multi-Modal Video Question Answering. Fig. 4 gives an overview of our model. Formally, we define the inputs to the model as: a 60-90 second video clip V , a subtitle S, a question q, and five candidate answers {ai}4i=0."
  }, {
    "heading": "4.1 Video Features",
    "text": "Frames are extracted at 3 fps. We run Faster RCNN (Ren et al., 2015b) trained on the Visual\nGenome (Krishna et al., 2017) to detect object and attribute regions in each frame. Both regional features and predicted detection labels can be used as model inputs. We also use ResNet101 (He et al., 2016) trained on ImageNet (Deng et al., 2009) to extract whole image features. Regional Visual Features: On average, our videos contain 229 frames, with 16 detections per frame. It is not trivial to model such long sequences. For simplicity, we follow (Anderson et al., 2018; Karpathy and Fei-Fei, 2015) selecting the top-K regions1 from each detected label across all frames. Their regional features are L2normalized and stacked together to form our visual representation V reg ∈ Rnreg×2048. Here nreg is the number of selected regions. Visual Concept Features: Recent work (Yin and Ordonez, 2017) found that using detected object\n1Based on cross-validation, we find K=6 to perform best.\nlabels as input to an image captioning system gave comparable performance to using CNN features directly. Inspired by this work, we also experiment with using detected labels as visual inputs. As shown in Fig. 5, we are able to detect rich visual concepts, including both objects and attributes, e.g. ”white basket”, which could be used to answer “What is Sheldon holding in his hand when everyone is at the door”. We first gather detected concepts over all the frames to represent concept presence. After removing duplicate concepts, we use GloVe (Pennington et al., 2014) to embed the words. The resulting video representation is denoted as V cpt ∈ Rncpt×300, where ncpt is the number of unique concepts. ImageNet Features: We extract the pooled 2048D feature of the last block of ResNet101. Features from the same video clip are L2 normalized and stacked, denoted as V img ∈ Rnimg×2048, where nimg is the number of frames extracted from the video clip."
  }, {
    "heading": "4.2 LSTM Encoders for Video and Text",
    "text": "We use a bi-directional LSTM (BiLSTM) to encode both textual and visual sequences. A subtitle S, which contains a set of sentences, is flattened into a long sequence of words and GloVe (Pennington et al., 2014) is used to embed the words. We stack the hidden states of the BiLSTM from both directions at each timestep to obtain the subtitle representation HS ∈ RnS×2d, where nS is the number of subtitle words, d is the hidden size of the BiLSTM (set to 150 in our experiments). Similarly, we encode question Hq ∈ Rnq×2d, candidate answers Hai ∈ Rnai×2d, and visual con-\ncepts Hcpt ∈ Rncpt×2d. nq and nai are the number of words in question and answer ai, respectively. Regional features V reg and ImageNet features V img are first projected into word vector space using a non-linear layer with tanh activation, then encoded using the same BiLSTM to obtain the regional representations Hreg ∈ Rnreg×2d and H img ∈ Rnimg×2d, respectively."
  }, {
    "heading": "4.3 Joint Modeling of Context and Query",
    "text": "We use a context matching module and BiLSTM to jointly model the contextual inputs (subtitle, video) and query (question-answer pair). The context matching module is adopted from the contextquery attention layer from previous works (Seo et al., 2017; Yu et al., 2018a). It takes context vectors and query vectors as inputs and produces a set of context-aware query vectors based on the similarity between each context-query pair.\nTaking the regional visual feature stream as an example (Fig. 4 upper stream), where Hreg is used as context input2. The question embedding, Hq, and answer embedding, Hai , are used as queries. After feeding context-query pairs into the context matching module, we obtain a video-aware-question representation, Greg,q ∈ Rnreg×2d, and video-aware-answer representation, Greg,ai ∈ Rnreg×2d, which are then fused with video context:\nM reg,ai = [Hreg;Greg,q;Greg,ai ;\nHreg Greg,q;Hreg Greg,ai ],\nwhere is element-wise product. The fused feature, M reg,ai ∈ Rnreg×10d, is fed into another BiLSTM. Its hidden states, U reg,ai ∈ Rnreg×10d, are max-pooled temporally to get the final vector, ureg,ai ∈ R10d, for answer ai. We use a linear layer with softmax to convert {ureg,ai}4i=0 into answer probabilities. Similarly, we can compute the answer probabilities given subtitle as context (Fig. 4 bottom stream). When multiple streams are used, we simply sum up the scores from each stream as the final score (Wang et al., 2016a)."
  }, {
    "heading": "5 Experiments",
    "text": "For evaluation, we introduce several baselines and compare them to our proposed model.\n2For visual concept features and ImageNet features, we simply replace Hreg with Hcpt or Himg as the context.\nIn all experiments, setup is as follows. We split the TVQA dataset into 80% training, 10% validation, and 10% testing splits such that videos and their corresponding QA pairs appear in only one split. This results in 122,039 QA pairs for training, 15,253 QA pairs for validation, and 15,253 QA pairs for testing. We evaluate each model using multiple-choice question answering accuracy."
  }, {
    "heading": "5.1 Baselines",
    "text": "Longest Answer: Table 1 indicates that the average length of the correct answers is longer than the wrong ones; thus, our first baseline simply selects the longest answer for each question. Nearest Neighbor Search: In this baseline, we use Nearest Neighbor Search (NNS) to compute the closest answer to our question or subtitle. We embed sentences into vectors using TFIDF, SkipThought (Kiros et al., 2015), or averaged GloVe (Pennington et al., 2014) word vectors, then compute the cosine similarity for each questionanswer pair or subtitle-answer pair. For TFIDF, we use bag-of-words to represent the sentences, assigning a TFIDF value for each word. Retrieval: Due to the size of TVQA, there may exist similar questions and answers in the dataset. Thus, we also implement a baseline two-step retrieval approach: given a question and a set of candidate answers, we first retrieve the most relevant question in the training set, then pick the candidate answer that is closest to the retrieved question’s correct answer. Similar approaches have also been used in dialogue systems (Jafarpour and Burges, 2010; Leuski and Traum, 2011), picking the appropriate responses to an utterance from a predefined human conversational corpus. Similar to NNS, we use TFIDF, SkipThought, and GloVe vectors with cosine similarity."
  }, {
    "heading": "5.2 Results",
    "text": "Table 6 shows results from baseline methods and our proposed neural model. Our main results are obtained by using full-length video clips and subtitles, without using timestamps (w/o ts). We also run the same experiments using the localized video and subtitle segment specified by the ground truth timestamps (w/ ts). If not indicated explicitly, the numbers described below are from the experiments on full-length video clips and subtitles. Baseline Comparison: Row 1 shows results of the longest answer baseline, achieving 30.41%\n(compared to random chance at 20%). As expected, the retrieval-based methods (row 2-4) and the answer-question similarity based methods (row 5-7) perform rather poorly, since no contexts (video or subtitle) are considered. When using subtitle-answer similarity to choose correct answers, Glove, SkipThought, and TFIDF based approaches (row 8-10) all achieve significant improvement over question-answer similarity. Notably, TFIDF (row 10) answers 49.94% of the questions correctly. Since our questions are raised by people watching the videos, it is natural for them to ask questions about specific and unique objects/locations/etc., mentioned in the subtitle. Thus, it is not surprising that TFIDF based similarity between answer and subtitle performs so well. Variants of Our Model: Rows 11-18 show results of our model with different contextual inputs and features. The model that only uses questionanswer pairs (row 11) achieves 43.34% accuracy. Compared to the subtitle model (row 15), adding video as additional sources (row 16-18) improves performance. Interestingly, adding video to the question only model (row 11) do not work as well (row 12-14). Our hypothesis is that the video feature streams may be struggling to learn models for answering textual questions, which degrades\ntheir ability to answer visual questions. Overall, the best performance is achieved by using all the contextual sources, including subtitles and videos (using concept features, row 18). Comparison with Human Performance: Human performance without timestamp annotation is shown in Table 5. When using only questions (Table 6 row 11), our model outperforms humans (43.34% vs 31.84%) as it has access to all statistics of the questions and answers. When using videos or subtitles or both, humans perform significantly better than the models. Models with Timestamp Annotation: Columns under w/o ts and w/ ts show a comparison between the same model using full-length videos/subtitles and using timestamp localized videos/subtitles. With timestamp annotation, the models perform consistently better than their counterpart without this information, indicating that localization is helpful for question answering. Accuracy for Different Question Types: To gain further insight, we examined the accuracy of our models on different question types on the validation set (results in Table 7), all models using timestamp annotation. Compared to S+Q model, S+V+Q models get the most improvements on “what” and “where” questions, indicating these questions require additional visual information. On the other hand, adding video features did not improve S+Q performance on questions relying more on textual reasoning, e.g., “how” questions. Human-Written Negatives vs. RandomlySampled Negatives For comparison, we create a new answer set by replacing the original human written negative answers with randomly sampled negative answers. To produce relevant negative answers, for each question, negatives are sampled (from the other QA pairs) within the same show.\nResults are shown in Table 8. Performance on randomly sampled negatives is much higher than that of human written negatives, indicating that human written negatives are more challenging. Qualitative Analysis: Fig. 6 shows example predictions from our S+V+Q model (row 18) using full-length video and subtitle. Fig. 6a and Fig. 6b demonstrate its ability to solve both grounded visual questions and textual reasoning question. Bottom row shows two incorrect predictions. We found that wrong inferences are mainly due to incorrect language inferences and the model’s lack of common sense knowledge. For example, Fig. 6c, the characters are talking about radiology, the model is distracted to believe they are in the radiology department, while Fig. 6d shows a case of questions that need common sense to answer, rather than simply textual or visual cues."
  }, {
    "heading": "6 Conclusion",
    "text": "We presented the TVQA dataset, a large-scale, localized, compositional video question answering dataset. We also proposed two QA tasks (with/without timestamps) and provided baseline experiments as a benchmark for future comparison. Our experiments show both visual and textual understanding are necessary for TVQA.\nThere is still a significant gap between the proposed baselines and human performance on the QA accuracy. We hope this novel multimodal dataset and the baselines will encourage the community to develop stronger models in future work. To narrow the gap, one possible direction is to enhance the interactions between videos and subtitles to improve multimodal reasoning ability. Another direction is to exploit human-object relations in the video and subtitle, as we observe that a large number of questions involve such relations. Additionally, temporal reasoning is crucial for answering the TVQA questions. Thus, future work also includes integrating better temporal cues."
  }, {
    "heading": "Acknowledgments",
    "text": "We thank the anonymous reviewers for their helpful comments and discussions. This research is supported by NSF Awards #1633295, 1562098, 1405822 and a Google Faculty Research Award, Bloomberg Data Science Research Grant, and ARO-YIP Award #W911NF-18-1-0336. The views contained in this article are those of the authors and not of the funding agency."
  }],
  "year": 2018,
  "references": [{
    "title": "Bottom-up and top-down attention for image captioning and vqa",
    "authors": ["Peter Anderson", "Xiaodong He", "Chris Buehler", "Damien Teney", "Mark Johnson", "Stephen Gould", "Lei Zhang."],
    "venue": "CVPR.",
    "year": 2018
  }, {
    "title": "Vqa: Visual question answering",
    "authors": ["Stanislaw Antol", "Aishwarya Agrawal", "Jiasen Lu", "Margaret Mitchell", "Dhruv Batra", "C. Lawrence Zitnick", "Devi Parikh."],
    "venue": "ICCV, pages 2425–2433.",
    "year": 2015
  }, {
    "title": "Visual dialog",
    "authors": ["Abhishek Das", "Satwik Kottur", "Khushi Gupta", "Avi Singh", "Deshraj Yadav", "José M.F. Moura", "Devi Parikh", "Dhruv Batra."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "Imagenet: A large-scale hierarchical image database",
    "authors": ["Jia Deng", "Wei Dong", "Richard Socher", "Li-Jia Li", "Kai Li", "Li Fei-Fei."],
    "venue": "CVPR, pages 248–255.",
    "year": 2009
  }, {
    "title": "Are you talking to a machine? dataset and methods for multilingual image question",
    "authors": ["Haoyuan Gao", "Junhua Mao", "Jie Zhou", "Zhiheng Huang", "Lei Wang", "Wei Xu."],
    "venue": "NIPS.",
    "year": 2015
  }, {
    "title": "Tall: Temporal activity localization via language query",
    "authors": ["Jiyang Gao", "Chen Sun", "Zhenheng Yang", "Ramakant Nevatia."],
    "venue": "ICCV.",
    "year": 2017
  }, {
    "title": "Deep residual learning for image recognition",
    "authors": ["Kaiming He", "Xiangyu Zhang", "Shaoqing Ren", "Jian Sun."],
    "venue": "2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 770–778.",
    "year": 2016
  }, {
    "title": "Localizing moments in video with natural language",
    "authors": ["Lisa Anne Hendricks", "Oliver Wang", "Eli Shechtman", "Josef Sivic", "Trevor Darrell", "Bryan Russell."],
    "venue": "ICCV.",
    "year": 2017
  }, {
    "title": "Teaching machines to read and comprehend",
    "authors": ["Karl Moritz Hermann", "Tomás Kociský", "Edward Grefenstette", "Lasse Espeholt", "Will Kay", "Mustafa Suleyman", "Phil Blunsom."],
    "venue": "NIPS.",
    "year": 2015
  }, {
    "title": "The goldilocks principle: Reading children’s books with explicit memory representations",
    "authors": ["Felix Hill", "Antoine Bordes", "Sumit Chopra", "Jason Weston."],
    "venue": "ICLR.",
    "year": 2015
  }, {
    "title": "Natural language object retrieval",
    "authors": ["Ronghang Hu", "Huazhe Xu", "Marcus Rohrbach", "Jiashi Feng", "Kate Saenko", "Trevor Darrell."],
    "venue": "CVPR.",
    "year": 2016
  }, {
    "title": "Filter, rank, and transfer the knowledge: Learning to chat",
    "authors": ["Sina Jafarpour", "Chris J.C. Burges."],
    "venue": "Technical report.",
    "year": 2010
  }, {
    "title": "Tgif-qa: Toward spatiotemporal reasoning in visual question answering",
    "authors": ["Yunseok Jang", "Yale Song", "Youngjae Yu", "Youngjin Kim", "Gunhee Kim."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "Clevr: A diagnostic dataset for compositional language and elementary visual reasoning",
    "authors": ["Justin Johnson", "Bharath Hariharan", "Laurens van der Maaten", "Li Fei-Fei", "C Lawrence Zitnick", "Ross Girshick."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "Deep visualsemantic alignments for generating image descriptions",
    "authors": ["Andrej Karpathy", "Li Fei-Fei."],
    "venue": "CVPR.",
    "year": 2015
  }, {
    "title": "Deepstory: Video story qa by deep embedded memory networks",
    "authors": ["Kyung-Min Kim", "Min-Oh Heo", "Seong-Ho Choi", "Byoung-Tak Zhang."],
    "venue": "IJCAI.",
    "year": 2017
  }, {
    "title": "Skip-thought vectors",
    "authors": ["Ryan Kiros", "Yukun Zhu", "Ruslan Salakhutdinov", "Richard S. Zemel", "Raquel Urtasun", "Antonio Torralba", "Sanja Fidler."],
    "venue": "NIPS.",
    "year": 2015
  }, {
    "title": "Dense-captioning events in videos",
    "authors": ["Ranjay Krishna", "Kenji Hata", "Frederic Ren", "Fei fei Li", "Juan Carlos Niebles."],
    "venue": "ICCV, pages 706–715.",
    "year": 2017
  }, {
    "title": "Npceditor: Creating virtual human dialogue using information retrieval techniques",
    "authors": ["Anton Leuski", "David R. Traum."],
    "venue": "AI Magazine, 32:42–56.",
    "year": 2011
  }, {
    "title": "A dataset and exploration of models for understanding video data through fill-in-the-blank question-answering",
    "authors": ["Tegan Maharaj", "Nicolas Ballas", "Anna Rohrbach", "Aaron Courville", "Christopher Pal."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "A dataset and exploration of models for understanding video data through fill-in-the-blank question-answering",
    "authors": ["Tegan Maharaj", "Nicolas Ballas", "Anna Rohrbach", "Aaron Courville", "Christopher Pal."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "A multiworld approach to question answering about realworld scenes based on uncertain input",
    "authors": ["Mateusz Malinowski", "Mario Fritz."],
    "venue": "NIPS.",
    "year": 2014
  }, {
    "title": "Marioqa: Answering questions by watching gameplay videos",
    "authors": ["Jonghwan Mun", "Paul Hongsuck Seo", "Ilchae Jung", "Bohyung Han."],
    "venue": "ICCV.",
    "year": 2017
  }, {
    "title": "Modeling context between objects for referring expression understanding",
    "authors": ["Varun K Nagaraja", "Vlad I Morariu", "Larry S Davis."],
    "venue": "ECCV.",
    "year": 2016
  }, {
    "title": "Trecvid 2014–an overview of the goals, tasks, data, evaluation mechanisms and metrics",
    "authors": ["Paul Over", "Jon Fiscus", "Greg Sanders", "David Joy", "Martial Michel", "George Awad", "Alan Smeaton", "Wessel Kraaij", "Georges Quénot."],
    "venue": "Proceedings of TRECVID,",
    "year": 2014
  }, {
    "title": "Glove: Global vectors for word representation",
    "authors": ["Jeffrey Pennington", "Richard Socher", "Christopher D. Manning."],
    "venue": "EMNLP.",
    "year": 2014
  }, {
    "title": "Flickr30k entities: Collecting region-to-phrase correspondences for richer imageto-sentence models",
    "authors": ["Bryan A Plummer", "Liwei Wang", "Chris M Cervantes", "Juan C Caicedo", "Julia Hockenmaier", "Svetlana Lazebnik."],
    "venue": "ICCV.",
    "year": 2015
  }, {
    "title": "Squad: 100, 000+ questions for machine comprehension of text",
    "authors": ["Pranav Rajpurkar", "Jian Zhang", "Konstantin Lopyrev", "Percy Liang."],
    "venue": "EMNLP.",
    "year": 2016
  }, {
    "title": "Exploring models and data for image question answering",
    "authors": ["Mengye Ren", "Ryan Kiros", "Richard Zemel."],
    "venue": "NIPS.",
    "year": 2015
  }, {
    "title": "Faster r-cnn: Towards real-time object detection with region proposal networks",
    "authors": ["Shaoqing Ren", "Kaiming He", "Ross B. Girshick", "Jian Sun."],
    "venue": "TPAMI, 39:1137–1149.",
    "year": 2015
  }, {
    "title": "Mctest: A challenge dataset for the open-domain machine comprehension of text",
    "authors": ["Matthew Richardson", "Christopher J.C. Burges", "Erin Renshaw."],
    "venue": "EMNLP.",
    "year": 2013
  }, {
    "title": "Grounding of textual phrases in images by reconstruction",
    "authors": ["Anna Rohrbach", "Marcus Rohrbach", "Ronghang Hu", "Trevor Darrell", "Bernt Schiele."],
    "venue": "ECCV.",
    "year": 2016
  }, {
    "title": "A dataset for movie description",
    "authors": ["Anna Rohrbach", "Marcus Rohrbach", "Niket Tandon", "Bernt Schiele."],
    "venue": "CVPR.",
    "year": 2015
  }, {
    "title": "Bidirectional attention flow for machine comprehension",
    "authors": ["Min Joon Seo", "Aniruddha Kembhavi", "Ali Farhadi", "Hannaneh Hajishirzi."],
    "venue": "ICLR.",
    "year": 2017
  }, {
    "title": "Movieqa: Understanding stories in movies through question-answering",
    "authors": ["Makarand Tapaswi", "Yukun Zhu", "Rainer Stiefelhagen", "Antonio Torralba", "Raquel Urtasun", "Sanja Fidler."],
    "venue": "CVPR.",
    "year": 2016
  }, {
    "title": "Object referring in videos with language and human gaze",
    "authors": ["Arun Balajee Vasudevan", "Dengxin Dai", "Luc Van Gool."],
    "venue": "CVPR.",
    "year": 2018
  }, {
    "title": "Temporal segment networks: Towards good practices for deep action recognition",
    "authors": ["Limin Wang", "Yuanjun Xiong", "Zhe Wang", "Yu Qi Qiao", "Dahua Lin", "Xiaoou Tang", "Luc Van Gool."],
    "venue": "ECCV.",
    "year": 2016
  }, {
    "title": "Learning deep structure-preserving image-text embeddings",
    "authors": ["Liwei Wang", "Yin Li", "Svetlana Lazebnik."],
    "venue": "CVPR.",
    "year": 2016
  }, {
    "title": "Towards ai-complete question answering: A set of prerequisite toy tasks",
    "authors": ["Jason Weston", "Antoine Bordes", "Sumit Chopra", "Tomas Mikolov."],
    "venue": "ICLR.",
    "year": 2015
  }, {
    "title": "Obj2text: Generating visually descriptive language from object layouts",
    "authors": ["Xuwang Yin", "Vicente Ordonez."],
    "venue": "EMNLP.",
    "year": 2017
  }, {
    "title": "Qanet: Combining local convolution with global self-attention for reading comprehension",
    "authors": ["Adams Wei Yu", "David Dohan", "Minh-Thang Luong", "Rui Zhao", "Kai Chen", "Mohammad Norouzi", "Quoc V. Le."],
    "venue": "ICLR.",
    "year": 2018
  }, {
    "title": "Mattnet: Modular attention network for referring expression comprehension",
    "authors": ["Licheng Yu", "Zhe Lin", "Xiaohui Shen", "Jimei Yang", "Xin Lu", "Mohit Bansal", "Tamara L Berg."],
    "venue": "CVPR.",
    "year": 2018
  }, {
    "title": "Visual madlibs: Fill in the blank image generation and question answering",
    "authors": ["Licheng Yu", "Eunbyung Park", "Alexander C. Berg", "Tamara L. Berg."],
    "venue": "ICCV.",
    "year": 2015
  }, {
    "title": "Modeling context in referring expressions",
    "authors": ["Licheng Yu", "Patrick Poirson", "Shan Yang", "Alexander C Berg", "Tamara L Berg."],
    "venue": "ECCV.",
    "year": 2016
  }, {
    "title": "A joint speakerlistener-reinforcer model for referring expressions",
    "authors": ["Licheng Yu", "Hao Tan", "Mohit Bansal", "Tamara L Berg."],
    "venue": "CVPR.",
    "year": 2017
  }, {
    "title": "Uncovering the temporal context for video question answering",
    "authors": ["Linchao Zhu", "Zhongwen Xu", "Yi Yang", "Alexander G Hauptmann."],
    "venue": "IJCV.",
    "year": 2017
  }, {
    "title": "Visual7w: Grounded question answering in images",
    "authors": ["Yuke Zhu", "Oliver Groth", "Michael Bernstein", "Li FeiFei."],
    "venue": "CVPR.",
    "year": 2016
  }],
  "id": "SP:87d1283ccc9bfb0c550ebed8ec0b025dc14b160f",
  "authors": [{
    "name": "Jie Lei",
    "affiliations": []
  }, {
    "name": "Licheng Yu",
    "affiliations": []
  }, {
    "name": "Mohit Bansal",
    "affiliations": []
  }, {
    "name": "Tamara L. Berg",
    "affiliations": []
  }],
  "abstractText": "Recent years have witnessed an increasing interest in image-based question-answering (QA) tasks. However, due to data limitations, there has been much less work on video-based QA. In this paper, we present TVQA, a largescale video QA dataset based on 6 popular TV shows. TVQA consists of 152,545 QA pairs from 21,793 clips, spanning over 460 hours of video. Questions are designed to be compositional in nature, requiring systems to jointly localize relevant moments within a clip, comprehend subtitle-based dialogue, and recognize relevant visual concepts. We provide analyses of this new dataset as well as several baselines and a multi-stream end-to-end trainable neural network framework for the TVQA task. The dataset is publicly available at http://tvqa.cs.unc.edu.",
  "title": "TVQA: Localized, Compositional Video Question Answering"
}