{
  "sections": [{
    "heading": "1. Introduction",
    "text": "Real-time ad exchanges, search engines, social networks, and other Internet companies consider revenue maximization as one of the most important directions for development of their online advertising platforms (Gomes & Mirrokni, 2014; Balseiro et al., 2015; Charles et al., 2016; Agarwal et al., 2014). A large part of advertisement inventory is sold via widely applicable second price auctions (He et al., 2013; Mohri & Medina, 2014), including their generalizations such as GSP (Varian, 2007; Sun et al., 2014) and VickreyClarke-Groves (VCG) (Varian, 2009; Varian & Harris, 2014) auctions. The optimization of revenue here is mostly controlled by means of reserve prices, whose proper setting is studied both by game-theoretical methods (Myerson, 1981; Krishna, 2009) and by machine learning approaches (Nisan et al., 2007; Cesa-Bianchi et al., 2013; Paes Leme et al., 2016). A large number of online auctions run, for instance, by ad exchanges involve only a single advertiser (Amin et al., 2013; Mohri & Munoz, 2014; Drutsa, 2017), and, in this case, a second-price auction with reserve is equiva-\n1Yandex, Moscow, Russia 2Faculty of Mechanics and Mathematics, Lomonosov Moscow State University, Moscow, Russia. Correspondence to: Alexey Drutsa <adrutsa@yandex.ru>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nlent to a posted-price auction (Kleinberg & Leighton, 2003) where the seller sets a reserve price for a good (for instance, an ad space) and the buyer decides whether to accept or reject this price i.e., to bid above or below it).\nIn this work, we focus on a scenario when the seller repeatedly interacts through a posted-price mechanism with the same strategic buyer that holds a fixed private valuation for a good and seeks to maximize his cumulative discounted surplus (Amin et al., 2013). At each round of this game, the seller is able to choose the price based on previous decisions of the buyer: i.e., she applies a deterministic online learning algorithm, which is announced to the buyer in advance. The seller’s goal is to maximize her cumulative revenue over a finite time horizon T , which is generally reduced to regret minimization1. Thus, the seller seeks for a no-regret pricing algorithm, i.e., the one with a sublinear regret on T (Mohri & Munoz, 2014; Amin et al., 2014; Chen & Wang, 2016).\nFor this setting, the algorithm PRRFES with tight strategic regret bound of Θ(log log T ) was recently proposed (Drutsa, 2017). This algorithm is horizon-independent and rightconsistent (i.e., it never proposes prices lower than earlier accepted ones). However, its key drawback is its ability to decrease an offered price after its rejection, but then to propose higher prices than rejected one in subsequent rounds (not satisfying thus the left consistency). Such a behavior of the algorithm may be confusing for a buyer: he may doubt that the announced algorithm is used by the seller2. The full consistency (both right, and left) is thus quite welcome. Formally, there does not exist a no-regret horizon-independent consistent algorithm (Drutsa, 2017). But, it is still an open question whether there exists a weakly consistent algorithm with these properties. Weak consistency is a slightly relaxed variant of consistency and means, in particular, that, once the seller decreases a price after a rejection, the future prices will never exceed the rejected one.\nIn our study, we propose a novel algorithm that never decreases offered prices and can be applied against strategic buyers with a tight regret bound of Θ(log log T ) (Th. 1).\n1We study the worst-case regret minimization following (Kleinberg & Leighton, 2003; Mohri & Munoz, 2014; Drutsa, 2017).\n2See Appendix C in Supp.Mat. for an example from practice.\nThis result constitutes the main contribution of our work and closes the open research question on the existence of a no-regret horizon-independent pricing in the class of weakly consistent algorithms. We also show that the property of non-decreasing prices is crucial and, in fact, is nearly necessary for a weakly consistent algorithm to be a no-regret one: namely, a double decrease of offered prices by a weakly consistent algorithm is enough to cause a linear regret (Th. 2). Construction and analysis of the proposed algorithm have required introduction of novel techniques, which are contributed by our work as well. They include a novel transformation which maps a right-consistent algorithm to a both weakly and right- consistent one that is only able to increase prices (Sec. 3); and methods that guarantee acceptance of exploitation prices that have not been earlier accepted (Sec. 4)."
  }, {
    "heading": "2. Preliminaries",
    "text": ""
  }, {
    "heading": "2.1. Setup of Repeated Posted-Price Auctions",
    "text": "We study the mechanism of repeated posted-price auctions earlier considered, e.g., in (Amin et al., 2013; Mohri & Munoz, 2014; Drutsa, 2017). Namely, the seller repeatedly proposes goods (e.g., advertisement opportunities) to a single buyer over T rounds (the time horizon): one good per round. The buyer holds a fixed private valuation v ∈ [0; 1] for a good, i.e., the valuation v is unknown to the seller and is equal for goods offered in all rounds. At each round t ∈ {1, . . . , T}, a price pt is offered by the seller, and an allocation decision at ∈ {0, 1} is made by the buyer: at = 1, when the buyer accepts to buy a currently offered good at that price, 0, otherwise. Thus, the seller applies a (pricing) algorithm A that sets prices {pt}Tt=1 in response to buyer decisions a = {at}Tt=1 referred to as a (buyer) strategy. We consider the deterministic online learning case when the price pt at a round t ∈ {1, . . . , T} can depend only on the buyer’s actions during the previous rounds a1:t−13. Following (Drutsa, 2017), we are studying algorithms that do not depend on the horizon T since it is very natural in practice (e.g., of ad exchanges) that the seller does not know in advance the number of rounds T that the buyer wants to interact with him. Let A be the set of such algorithms.\nHence, given a pricing algorithm A ∈ A, a buyer strategy a = {at}Tt=1 uniquely defines the corresponding price sequence {pt}Tt=1, which, in turn, determines the seller’s total revenue ∑T t=1 atpt. This revenue is usually compared to the revenue that would have been earned by offering the buyer’s valuation v if it was known in advance to the seller (Kleinberg & Leighton, 2003; Amin et al., 2013; Mohri & Munoz, 2014; Drutsa, 2017). This leads to the definition of the regret of the algorithmA that faced a buyer with the valuation v ∈ [0, 1] following the (buyer) strategy a over T rounds as\n3We use a notation for a part of a strategy at1:t2 = {at} t2 t=t1 .\nReg(T,A, v,a) := ∑T t=1(v − atpt).\nFollowing a standard assumption in mechanism design that matches the practice in ad exchanges (Mohri & Munoz, 2014), the seller’s pricing algorithm A is announced to the buyer in advance. The buyer can then act strategically against this algorithm and is assumed to follow the optimal strategy aOpt(T,A, v,γ) that maximizes the buyer’s γ-discounted surplus (Amin et al., 2013):\nSurγ(T,A, v,a) := T∑ t=1 γtat(v − pt),\ni.e., aOpt(T,A, v,γ) := argmaxa Surγ(T,A, v,a), where γ = {γt}∞t=1 is the discount sequence, which is positive (γt > 0 ∀t∈N) and has convergent sums ( ∑∞ t=1 γt<∞). We define the strategic regret of the algorithm A that faced a strategic buyer with valuation v ∈ [0, 1] over T rounds as\nSReg(T,A, v,γ) := Reg ( T,A, v,aOpt(T,A, v,γ) ) .\nThus, we consider a two-player non-zero sum repeated game with commitment, incomplete information, and unlimited supply, which is introduced by Amin et al. (2013) and considered in (Mohri & Munoz, 2014; Drutsa, 2017): the buyer seeks to maximize his surplus, while the seller’s objective is to minimize her strategic regret (i.e., maximize her revenue). Note that only the buyer’s objective is discounted over time (not the seller’s one), which is motivated by the observation that sellers are far more willing to wait for revenue than buyers are willing to wait for goods in important real-world markets like online advertising (Amin et al., 2013; Mohri & Munoz, 2014).\nIn our setting, following (Kleinberg & Leighton, 2003; Amin et al., 2013; 2014; Mohri & Munoz, 2014; 2015; Drutsa, 2017), we seek for algorithms that attain o(T ) strategic regret (i.e., the averaged regret converges to zero when T →∞) for the worst-case valuation v ∈ [0, 1]. An algorithm A is said to be a no-regret one when supv∈[0,1] Reg(T,A, v,aOpt) = o(T ). The optimization goal consists in finding of algorithms with the lowest possible strategic regret upper bound of the form O(f(T )). Here we treat their optimality in terms of f(T ) with the slowest growth as T →∞. This means that the averaged regret has the best rate of convergence to zero."
  }, {
    "heading": "2.2. Notations and Auxiliary Definitions",
    "text": "Similarly to (Drutsa, 2017), a deterministic pricing algorithm A can be associated with an infinite complete binary tree T(A) (since we consider horizon-independent algorithms). Each node n ∈ T(A)4 is labeled with the price pn offered by A. We denote the node’s depth + 1 by tn. The right and left children of n are denoted by r(n) and l(n) respectively. The left (right) subtrees rooted at the node\n4To simplify notations, n∈T means “n is a node of the tree T”.\nl(n) (r(n) resp.) are denoted by L(n) (R(n) resp.). The operators l(·) and r(·) sequentially applied s times to a node n are denoted by ls(n) and rs(n) respectively, s ∈ N. The root node of a tree T is denoted by e(T).\nSo, the algorithm’s work flow is as follows: it starts at the root e(T(A)) of the tree T(A) by offering the first price pe(T(A)) to the buyer; at each step t < T , if a price pn, n ∈ T(A), is accepted, the algorithm moves to the right node r(n) and offers the price pr(n); in the case of the rejection, it moves to the left node l(n) and offers the price pl(n); this process repeats until reaching the time horizon T . The pseudo-code of this process is presented in Alg. 1. For a node n ∈ T(A), tn equals to the round at which the price of this node is offered. Each node n ∈ T(A) uniquely determines the buyer decisions up to the round tn − 15.\nWe say that two infinite complete trees T1 and T2 are price equivalent (and write T1 ∼= T2) if the trees have the same node labeling when we naturally match the nodes between the trees (starting from the roots): i.e., following the same strategy in both trees, the buyer receives the same sequence of prices. We define, for a pricing tree T, the set of its prices ℘(T) := {pn | n ∈ T} and denote by ℘(A) := ℘(T(A)) all prices that can be offered by an algorithm A."
  }, {
    "heading": "2.3. Background on Pricing Algorithms",
    "text": "First of all, we remind several classes (sets) of algorithms that were introduced in (Mohri & Munoz, 2014; Drutsa, 2017) and include the definitions of pricing consistency of different type, which are actively used in our work. After that, we briefly overview pricing algorithms from existing studies (Kleinberg & Leighton, 2003; Amin et al., 2013; Mohri & Munoz, 2014; Drutsa, 2017).\nNotion of consistency. Since the buyer holds a fixed valuation, we could expect that a smart online learning algorithm should work as follows: after an acceptance (a rejection), it should set only no lower (no higher, respectively) prices than the offered one. Formally, this leads to the definition:\nDefinition 1 ((Mohri & Munoz, 2014)). An algorithm A is said to be consistent (A in the class C) if, for any node n ∈ T(A), pm ≥ pn ∀m ∈ R(n) and pm ≤ pn ∀m ∈ L(n).\nA consistent algorithm A is based on a clear idea (Drutsa, 2017): it explores the valuation domain [0, 1] by means of a feasible search interval [q, q′] (initialized by [0, 1]) targeted to locate the valuation v. At each round t, A offers a price pt ∈ [q, q′] and, depending on the buyer’s decision, reduces the interval to the right subinterval [pt, q′] (by q := pt) or the left one [q, pt] (by q′ := pt). At any moment, q is\n5Therefore, each buyer strategy a1:t is bijectively mapped to a t-length path in the tree T(A) that starts from the root e(T(A)) and goes to a t-depth node. The strategy prices are in turn the ones that are in the nodes lying along this path.\nthus always the last accepted price or 0, while q′ is the last rejected price or 1. The most famous example of a consistent algorithm is the binary search. Definition 2 ((Drutsa, 2017)). An algorithm A is said to be weakly consistent (A in the class WC) if, for any node n ∈ T(A), (a) if pr(n) 6= pn then pm ≥ pn ∀m ∈ R(n); and, (b) if pl(n) 6= pn then pm ≤ pn ∀m ∈ L(n).\nWeakly consistent algorithms are similar to consistent ones, but they are additionally able to offer the same price p several times before making a final decision on which of the subintervals [q, p] or [p, q′] continue. See App.D.1 as well. Definition 3 ((Drutsa, 2017)). An algorithm A is said to be right-consistent (A in the class CR) if, for any n ∈ T(A), pm ≥ pn ∀m ∈ R(n).\nRight-consistent algorithms never offer a price lower than the last accepted one, but may offer a price higher than a rejected one (in contrast to consistent algorithms). We have the following relations of classes: C ⊂WC and C ⊂ CR.\nBackground. The consistency represents a quite reasonable property, when the buyer is myopic (truthful, i.e., at = 1⇔ pt ≤ v), because a reported buyer decision correctly locates v in [0, 1]. Kleinberg & Leighton (2003) showed that the regret of any pricing algorithm against a myopic buyer is lower bounded by Ω(log log T ) and proposed a horizondependent consistent algorithm FS (Fast Search), that has tight regret bound of Θ(log log T ) against such buyers.\nA strategic buyer, incited by surplus maximization, may mislead a consistent pricing algorithm (Amin et al., 2014; Mohri & Munoz, 2014). To overcome this, Mohri & Munoz (2014) proposed to inject so-called penalization rounds (see Def. 4) after each rejection into the algorithm FS and got, in this way, the algorithm PFS with strategic regret bound of O(log T log log T ). This outperforms the algorithm “Monotone” (Amin et al., 2013) with regret bound of O(T 1/2). Both algorithms are horizon-dependent and are not optimal. Definition 4 ((Mohri & Munoz, 2014; Drutsa, 2017)). Nodes n1, . . . , nr ∈ T(A) are said to be a (r-length) penalization sequence if ni+1 = l(ni), pni+1 = pni , and R(ni+1) ∼= R(ni), i = 1, . . . , r − 1.\nIt is easy to see that a strategic buyer either accepts the price at the first node or rejects this price in all of them, when the discount sequence γ is decreasing.\nAn optimal pricing was found in (Drutsa, 2017), where horizon-independent algorithms were studied and the causes of a linear regret in different classes of consistent algorithms were analyzed step-by-step. First, the algorithm FES (Drutsa, 2017) was proposed as a modification of the FS by injecting exploitation rounds after each rejection to obtain a consistent horizon-independent algorithm against truthful buyer with tight regret bound of\nΘ(log log T ). Second, this pricing was upgraded to the algorithm PRRFES (Drutsa, 2017) to act against strategic buyers. Namely, it was shown that there is no no-regret pricing in the class RWC of regular weakly consistent algorithms (a subset of WC, see Def. A.1 in Suppl.Mat.), which comprises, in particular, all consistent horizon-independent algorithms even being modified by penalization rounds. This led to a guess that possibly the left consistency requirement should be relaxed. Inspired by this guess, the optimal right-consistent algorithm PRRFES with tight strategic regret bound of Θ(log log T ) was built. However, the research question on the existence of a no-regret horizon-independent algorithm in the class WC remained open. Our research goal comprises closing of that open research question."
  }, {
    "heading": "2.4. Related Work",
    "text": "Most of studies on online advertising auctions lies in the field of game theory (Krishna, 2009; Nisan et al., 2007). A large part of them focused on characterizing equilibrium: efficiency (Aggarwal et al., 2009a), mechanism expressiveness (Dütting et al., 2011), competition across auction platforms (Ashlagi et al., 2013), buyer budget (Agarwal et al., 2014), etc. They considered different auctions (Varian, 2009; Aggarwal et al., 2009b; Celis et al., 2011) and conducted experimental analysis (Ostrovsky & Schwarz, 2011; Thompson & Leyton-Brown, 2013; Lahaie et al., 2018).\nStudies on revenue maximization were devoted to both the seller revenue solely (Zhu et al., 2009; He et al., 2013) and various trade-offs as well (Bachrach et al., 2014; Goel & Khani, 2014; Morgenstern & Roughgarden, 2015). The optimization problem was generally reduced to a selection of reserve prices for buyers: for instance, in VCG (Myerson, 1981), GSP (Lucier et al., 2012), and others (Gomes & Mirrokni, 2014; Paes Leme et al., 2016). Reserve prices, in such setups, usually depend on distributions of buyer valuations or bids that thus estimated or fitted (He et al., 2013; Sun et al., 2014; Paes Leme et al., 2016). Alternative approaches learned reserve prices directly (Mohri & Medina, 2014; 2015; Rudolph et al., 2016; Medina & Vassilvitskii, 2017). In contrast to these works, we use an online deterministic learning approach to set prices in repeated auctions.\nRevenue optimization for repeated auctions was mainly concentrated on algorithmic reserve prices, that are updated in online fashion over time, and was also known as dynamic pricing. An extensive survey on this field is presented in (den Boer, 2015). Dynamic pricing was studied: under game-theoretic view (Iyer et al., 2011; Leme et al., 2012; Chen & Farias, 2015; Balseiro et al., 2016; Ashlagi et al., 2016); as bandit problems (Amin et al., 2011; Zoghi et al.; Lin et al., 2015; Weed et al., 2016); feature-based pricing (Amin et al., 2014; Cohen et al., 2016); and from other aspects (Heidari et al., 2016; Yuan et al., 2014; Roughgarden\n& Wang, 2016; Feldman et al., 2016; Chawla et al., 2016). Vanunts et al. (2018) study the same repeated auction setup, but seek for algorithms that maximize the strategic revenue expected over buyer valuations. A series of studies (Schmidt, 1993; Devanur et al., 2015; Immorlica et al., 2017) close to ours considered repeated sales where the seller does not commit for its pricing policy (in contrast to our setting). That studies showed that the seller earns less in settings without commitment than with it, what motivates the seller to be interested in commitment. The most relevant part of these works to ours are (Kleinberg & Leighton, 2003; Amin et al., 2013; Mohri & Munoz, 2014; Drutsa, 2017), where our scenario with a fixed private valuation is considered and whose algorithms are discussed in more details in Sec. 2.3. In contrast to the first three studies, we propose and analyze algorithm that have tight strategic regret bound of Θ(log log T ), and, unlike in (Drutsa, 2017), this pricing is weakly consistent and never decreases offered prices.\n3. Transformation pre Let us introduce a novel transformation which is referred to as pre and transforms any pricing algorithm to another one. First, we define this transformation for labeled binary trees.\nDefinition 5. Given a non-negative real number q ∈ R+ and a labeled binary tree T1, the transformation pre : (q,T1) 7→ T2 is such that the labels (i.e., prices) of the tree T2 are defined recursively in the following way starting from the root node e(T2) of the tree T2:\npe(T2) := q, L ( e(T2) ) ∼= pre(q,L(e(T1))) and R ( e(T2)\n) ∼= pre(pe(T1),R(e(T1))). (1) Second, since each pricing algorithm A ∈ A is associated with a complete binary tree T(A), the transformation pre is thus correctly defined for pricing algorithms: namely, pre : R+×A→ A and pre(q,A1) is the pricing algorithm associated with the tree pre(q,T(A1)). In Algorithm 2, for better understanding, we provide a reader with a pseudocode that applies the pricing pre(q,A) with given q ∈ R and a source pricing A ∈ A6. See an example in App.D.2.\nInformally speaking, this transformation tracks over the nodes in the source algorithm’s tree T(A), but, being in a current node n ∈ T(A), it offers the price from one of preceding nodes, where the buyer purchased a good last time (or q if never purchased), instead of offering the price pn from the current node n. From the buyer’s point of view, the choice between the pricing of the subtree L(n) and the one of the subtree R(n), n ∈ T(A), should be made at the round previous to the one where the price pn will be offered.\n6Alg. 2 is placed side-by-side along with Alg. 1 in order to show the difference between the work flow of the transformed pricing pre(q,A) and the one of the source pricing A.\nAlgorithm 1 Pseudo-code of an algorithm A. 1: Input: A ∈ A 2: Initialize: n := e(T(A)), 3: while the buyer plays do 4: Offer the price pn to the buyer 5: if the buyer accepts the price then 6: n := r(n) 7: else 8: n := l(n) 9: end if 10: end while\nAlgorithm 2 Pseudo-code of its transformation pre(q,A). 1: Input: q ∈ R and A ∈ A 2: Initialize: n := e(T(A)), p := q 3: while the buyer plays do 4: Offer the price p to the buyer 5: if the buyer accepts the price then 6: p := pn\n7: n := r(n) 8: else 9: n := l(n)\n10: end if 11: end while\nThe following key properties hold for this transformation.\nLemma 1. Let A ∈ CR be a right-consistent pricing algorithm and q = inf ℘(A) be the infimum of the algorithm prices, then the transformed pricing algorithm pre(q,A) is both right-consistent and weakly consistent, i.e., pre(q,A) ∈ WC ∩ CR. Moreover, the algorithm pre(q,A) is only able to increase prices and it never decreases them regardless of any buyer strategy.\nProof. First, for each node n ∈ T(pre(q,A)), the recursion in Eq. (1) implies that there exists a node m ∈ T(A) s.t. L(n) ∼= pre ( pn,L(m) ) and R(n) ∼= pre ( pm,R(m) ) . In particular, pr(n) = pm, pl(n) = pn, ℘(L(n)) = ℘(L(m)) ∪ {pn}, and ℘(R(n)) = ℘(R(m)) ∪ {pm}. Let us prove by induction that pn ≤ p ∀p ∈ ℘(T(n)). The basis of the induction: this condition is satisfied by the root node e(T(pre(q,A))) due to the choice of q. The inductive step: assume a node n ∈ T(pre(q,A)) satisfies this condition, then, for pl(n) and pr(n), we have pl(n) = pn ≤ p ∀p ∈ ℘(L(n)) ⊆ ℘(T(n)) and pr(n) = pm ≤ p ∀p ∈ ℘(R(n)) = ℘(R(m)) ∪ {pm}, where we used pm ≤ p ∀p ∈ ℘(R(m)) since the algorithm A is right-consistent.\nSecond, note that pn ≤ p ∀p ∈ ℘(T(n)) ⊇ ℘(R(n)), i.e., the definition of a right-consistent algorithm holds. Therefore, pre(q,A) ∈ CR and the right-side part of weak consistency holds as well. Third, pl(n) = pn∀n ∈ T(pre(q,A)) as we noted above, and, hence, the left-side part of weak consistency is satisfied (the case of pl(n) 6= pn in Definition 2 of WC is never realized). Thus, pre(q,A) ∈WC and it never decreases prices along any buyer strategy."
  }, {
    "heading": "4. Weakly Consistent Optimal Pricing",
    "text": "Let us apply the transformation pre to the pricing algorithm PRRFES (Drutsa, 2017) and refer to the transformed one as prePRRFES. Formally, the algorithm prePRRFES works in phases initialized by the phase index l := 0, the first offered price at the current phase q0 := 0, and the iteration parameter 0 := 1/2. At each phase l ∈ Z+, it sequentially offers prices pl,k := ql + k l, k ∈ Z+ (exploration; in contrast to PRRFES, it starts from k = 0), where l := 2l−1 = 2 −2l ,\nl∈N. When a price pl,k is rejected, setting Kl := k ≥ 0: (1) the algorithm offers this price pl,Kl for r− 1 ∈ Z+ penalization rounds (if one of them is accepted, prePRRFES continues offering pl,k, k = Kl + 1, .. following Definition 4), (2) it offers the price pl,Kl for g(l)∈Z+ exploitation rounds (buyer decisions made at them do not affect further pricing), and (3) prePRRFES goes to the next phase by setting ql+1 := pl,Kl and l := l + 1. The pseudo-code of prePRRFES is presented in Alg. B.1 (in Suppl.Mat.). The algorithm actions described above and code lines in Alg. B.1 that differ from the ones of PRRFES are highlighted in blue. Since PRRFES is a right-consistent algorithm, see (Drutsa, 2017), Lemma 1 implies that prePRRFES is both rightconsistent and weakly consistent one.\nFurther in this section, we will show that the learning algorithm prePRRFES being properly configured is, in fact, a no-regret pricing and, moreover, is optimal with tight strategic regret bound of Θ(log log T ). To show this, we adapt the methodology used to establishing the optimality of the algorithm PRRFES. Despite the PRRFES and its transformation prePRRFES look similar, this adaptation is not straightforward and, in particular, requires additional guarantees on acceptance of prices during the exploitation rounds.\nFollowing (Mohri & Munoz, 2014; Drutsa, 2017) we assume that the discounting is geometric γ = {γt−1}∞t=1 from here on in this subsection. First, let us consider an analogue of (Drutsa, 2017, Prop.2) that will be useful to upper bound the strategic regret of the algorithm prePRRFES.\nProposition 1. Let γ = {γt−1}∞t=1 be a discount sequence with γ ∈ (0, 1), A be a pricing algorithm, n ∈ T(A) be a starting node in a r-length penalization sequence (see Def. 4), all prices after r rejections are no lower than pn (i.e., pn ≤ pm ∀m ∈ L(lr−1(n))), tn < T , and r > logγ(1−γ2). If the price pn offered by the algorithm A at the node n is rejected by the strategic buyer, then the following inequality on his valuation v holds:\nv−pr(n)<ηr,γ(pr(n)−pn), where ηr,γ := γr+γ−1 1−γ2−γr . (2)\nProof sketch. Since the price pn is rejected, the following\ninequality holds, see (Mohri & Munoz, 2014, Lemma 1),\nγt n−1(v − pn) + S(r(n)) < S(lr(n)), (3)\nwhere S(m) denotes the surplus obtained by the buyer when playing an optimal strategy after reaching a node m ∈ T(A). The left subtree’s surplus S(lr(n)) can be upper bounded as follows (using pn ≤ pm ∀m ∈ L(lr−1(n))):\nS(lr(n)) ≤ T∑\nt=tn+r\nγt−1(v − pn) < γ tn+r−1\n1− γ (v − pn);\nwhile, in contrast to the proof of (Drutsa, 2017, Prop.2), the right subtree’s surplus S(r(n)) is lower bounded by γt n\n(v − pr(n)), because, after accepting pn at the round tn, the buyer is able to earn at least this amount at the round tn + 1. We plug these bounds in Eq. (3), divide by γt\nn−1, and obtain Eq. (2) after rearrangement.\nThe full proof is given in Appendix A.1.1 in Supp.Mat. Note that the inequality in Eq. (2) bounds the deviation of the buyer’s valuation v from the price offered at some node r(n) by some increment pr(n) − pn. But, in contrast to (Drutsa, 2017, Prop.2), this bounding occurs when the buyer rejects the price pn offered previously to the price pr(n) which is used as the reference price of the valuation’s deviation.\nAs we show in the proof of Theorem 1, Prop. 1 allows us to obtain an upper bound for the number of exploring steps at each phase of the algorithm prePRRFES. However, this is not enough to directly apply the methodology of the proofs of (Drutsa, 2017, Th.3, Th.5) to bound the strategic regret, because, in contrast to the PRRFES, during exploitation rounds, the algorithm prePRRFES offers the price pl,Kl that has not been earlier accepted by the strategic buyer (hence, there is no evidence to guarantee his acceptance during the exploitation). Namely, since the buyer’s decision at made at an exploitation round t does not affect the algorithm’s pricing in the subsequent rounds t′ > t, the strategic buyer acts truthfully at this round t, i.e., at = I{pt≤v}. For the PRRFES, we knew that the price pt was accepted in a previous round t′′ < t (or pt = 0), but, for the prePRRFES, one has to specially guarantee the acceptance of the price pt at the exploitation round t in the following proposition. Proposition 2. Let γ = {γt−1}∞t=1 be a discount sequence with γ ∈ (0, 1), A be a pricing algorithm, and n ∈ T(A) be a starting node in a r-length penalization sequence (see Def. 4), which is followed by G exploitation rounds offering the price pn starting from the node lr(n). If r < logγ(1−γ), G> logγ ( 1−(1−γ)γ−r ) , T ≥ tn+r+G−1, and the buyer valuation v is higher than pn and lower than any price in the right subtree R(n) of the node n, i.e., v < p ∀p ∈ ℘(R(n)), then the strategic buyer rejects the price pn at the round tn.\nProof sketch. The condition v < p ∀p ∈ ℘(R(n)) implies that S(r(n)) = 0 and the strategic buyer will thus gain\nexactly γt n−1(v−pn) if he accepts the price pn at the round tn (S(·) is defined in the proof of Prop. 1). Let us show that there exists a strategy in L(n) with a larger surplus. Indeed, if the buyer rejects r times the price pn and accepts this price G times after that, then he gets the following surplus: tn+r+G−1∑ s=tn+r γs−1(v−pn)=(v−pn)1−γ G 1−γ γt n−1+r>(v−pn)γt n−1,\nhere the last inequality holds due to the condition on G.\nThe proof’s details are presented in Appendix A.1.2 in Suppl.Mat. Additionally to the claim of Proposition 2, note that, from the definitions of penalization and exploitation rounds, it follows that, if the strategic buyer rejects the price pn at the round tn, he rejects this price pn at the rounds tn + 1, . . . , tn + r − 1 as well and accepts it at the rounds tn+r, . . . , tn+r+G−1. Note that, since r ≥ 1 (otherwise, there is no node n and the right subtree R(n)), the condition r < logγ(1− γ) makes Prop. 2 meaningful only in the case of γ > 1/2. This is consistent with a clear intuition that, having γ ≤ 1/2, the discount γt−1 at a round t is no lower than the sum of all discounts in all possible subsequent rounds γt/(1 − γ), and the strategic buyer prefers thus to purchase a good for a price pt at the t-th round, rather than many goods for a no lower price in all subsequent rounds.\nIn order to apply both Prop. 1 and Prop. 2, the number of penalization rounds r is required to be in the interval Iγ = ( logγ(1− γ2), logγ(1− γ) ) . It easy to see that, for γ ∈ (1/2, ( √\n5− 1)/2), this interval Iγ contains r = 1 (i.e., there is no penalization). For γ ∈ (( √ 5 − 1)/2, 1), the length of the interval Iγ is larger than 1, which guarantees thus existence of a natural number in Iγ (since r ∈ N). For such discount rates, the following lemma provides values for r and G s.t. Prop. 1 and Prop. 2 hold and ηr,γ (from Eq. (2)) is bounded by some positive number κ > 0. The proof is rather technical and is thus deferred to Appendix A.1.3. Lemma 2. Let γ̂ := ( √\n5 − 1)/2, (a) for a discount rate γ ∈ (γ̂, 1) and a constant κ>(1− γ)/(γ2+γ − 1), define\nrγ,κ := logγ\n( (1− γ) ( 1 +\nκ 1 + κ\nγ )) and\nGγ,κ := logγ\n( 1− ( 1 +\nκ 1 + κ\nγ )−1 γ−1 ) ;\n(b) for γ ∈ (1/2, γ̂) and a constant κ ≥ (2γ − 1)/(1 − γ2− γ), define rγ,κ := 1 and Gγ,κ := logγ(2γ− 1). Then setting the number of penalization rounds r = drγ,κe and the number of exploitation rounds G ≥ Gγ,κ implies the conditions of Prop. 1 and 2 as well as ηr,γ ≤ κ.\nIn the interesting case of γ = γ̂, the interval Iγ is equal to (1, 2) and does not thus contain any natural number. This\ncase is the point in which, on the one hand, we should apply penalization (i.e., set r ≥ 2) according to Prop. 1 to control the amount of lies of the buyer, but, on the other hand, setting r ≥ 2 results in the absence of a strongly more profitable buyer strategy in the left subtree of the node n in Prop.2 than to accept a price at this node. We do not known whether the case of γ = γ̂ is a fundamental point in which prePRRFES could not be configured to avoid a linear regret, or it is a cause of insufficient power of our analytical tools. Further study of this case is left for future work. So, now we ready to obtain an upper bound for the prePRRFES for the case γ ∈ (1/2, 1) \\ {γ̂} by proving the following theorem. Theorem 1. Let γ = {γt−1}∞t=1 be a discount sequence with γ∈(1/2, 1)\\{( √ 5 − 1)/2} and let a constant κ satisfy the lower bounds from Lemma 2, where the constants rγ,κ and Gγ,κ are defined as well. If A is the pricing algorithm prePRRFES with r = drγ,κe and the exploitation rate g(l) = max{22l , dGγ,κe}, l ∈ Z+, then, for any valuation v∈ [0, 1] and T ≥ 2, the strategic regret is upper bounded7:\nSReg(T,A, v,γ)≤C(log2 log2 T+2)+ dGγ,κe\n2 −1,\nC := rv + (1 + κ)\n2 (2 + max{2, dGγ,κe}+ κ).\n(4)\nProof sketch. Decompose the total regret over T rounds into the sum of the regrets during each phase: SReg(T,A, v,γ) = ∑L l=0Rl, where L is the number of phases during T rounds. For the regret Rl at each phase except the last one, i.e., l = 0, . . . , L− 1, we have:\nRl = Kl−1∑ k=0 (v − pl,k) + rv + g(l)(v − pl,Kl), (5)\nwhere the first, second, and third terms correspond to the exploration rounds with acceptance, the reject-penalization rounds, and the exploitation rounds, respectively. First, here, we directly used Prop. 2 (via Lemma 2 since g(l) ≥ Gγ,κ) to conclude that pl,Kl < v and the price pl,Kl is thus accepted by the strategic buyer at the exploitation rounds.\nSecond, rejection of the price pl,Kl implies v−pl,Kl+1<κ l by Prop. 1 via Lemma 2 since ηr,γ ≤ κ for r ≥ drγ,κe and ∀t ∈ N. Hence, the valuation v ∈ ( pl,Kl , pl,Kl +(1+κ) l ) and all accepted prices pl+1,k, ∀k ≤ Kl+1, from the next phase l + 1 satisfy:\npl+1,k ∈ (ql+1, v) ⊆ ( pl,Kl , pl,Kl+(1+κ) l ) ∀k ≤ Kl+1\nsince any accepted price has to be lower than the valuation v for the strategic buyer. This infers Kl+1<(1 + κ) l/ l+1=\n7Note that the seller is not required to know γ precisely: if the seller knows only that γ ∈ [γ′ − δ, γ′ + δ], then it is easy to get an upper bound similar to Eq.(4) by properly selecting parameters G and κ for some δ > 0, when γ′∈(1/2, 1)\\{( √ 5− 1)/2}.\n(1 + κ)22l . Therefore, after some algebra, we have:\nRl ≤ (1 + κ)(2 + κ)\n2 + rv + g(l) · (1 + κ) l\n≤ rv + (1 + κ) 2\n(2 + max{2, dGγ,κe}+ κ) (6)\nfor l = 0, . . . , L − 1, where we used the definition of the exploitation rate g(l) to get g(l) · l ≤ max{1, dGγ,κe/2}.\nThe L-th phase differs from the other ones only in possible absence of some rounds: reject-penalization or exploitation ones. In this phase, we consider two cases on the actual number of exploitation rounds gL(L): (a) gL(L) ≥ dGγ,κe and (b) gL(L) < dGγ,κe. In the case (a), as above, we apply Prop. 2 to get that pL,KL < v and the price pL,KL is thus accepted by the buyer at the exploitation rounds. This infer that RL is upper bounded by the right-hand side of Eq. (5) with l = L and, in turn, by the right-hand side of Eq. (6). In the case (b), we have no guarantee that pL,KL < v and, therefore, pL,KL may be rejected by the strategic buyer at the exploitation rounds. Hence, we bound the regret RL more roughly by (1+κ)(2+κ)2 + (r + dGγ,κe − 1)v and use the inequality (dGγ,κe − 1)v −max{1, dGγ,κe/2} ≤ dGγ,κe/2− 1. Finally, all our steps results in the bound:\nSReg(T,A, v,γ) = L∑ l=0 Rl ≤ C(L+ 1) + dGγ,κe 2 − 1\nwithC from Eq. (4). To obtain Eq. (4), getL≤ log2 log2 T+ 1 via the same technique as in (Drutsa, 2017).\nThe detailed proof is given in Appendix A.1.4 in Suppl.Mat. This theorem shows that the learning algorithm prePRRFES is asymptotically optimal since it has a tight strategic regret bound of Θ(log log T ). At the same time, Theorem 1 closes the open research question on the existence of a no-regret algorithm in the class WC (Drutsa, 2017) since prePRRFES is weakly consistent. Note that the parameter κ can be adjusted either to minimize the number of penalization rounds r or to optimize the constant factor C making the upper regret bound finer. An attentive reader may also note that the pricing prePRRFES has the following drawback: this algorithm being applied against a myopic (truthful) buyer will incur a linear regret (in contrast to the source PRRFES). But we feel that this is the price we have to pay in order to construct a horizon-independent optimal algorithm that offers prices in a consistent manner (i.e., never revises prices that was previously reduced as it did by the PRRFES).\nOn the other hand, it is important to emphasize that our weakly consistent algorithm has the property: it never decreases prices (see Lemma 1). This may seem too drastic to obtain a no-regret algorithm from WC. But, in the next section, we show that this property, in fact, is nearly necessary for a weakly consistent algorithm to be a no-regret one."
  }, {
    "heading": "5. Weakly Consistent Algorithms with Double Decrease of Prices",
    "text": "In this section, we show that if a weakly consistent algorithm is able to doubly decrease prices, then it has a linear regret.\nDefinition 6. A weakly consistent algorithm A is said to be with double decrease of prices (A in the class WCdd) if there exists a path ã in the tree T(A) with the corresponding price sequence {p̃t}∞t=1 such that\n∃t̃0, t̃1 ∈ N : t̃0 ≤ t̃1 and p̃t̃1+1 < p̃t̃0 < p e(T(A)). (7)\nTheorem 2. Let γ = {γt}∞t=1 be a discount sequence and A ∈WCdd be a horizon-independent weakly consistent pricing algorithm with double decrease of prices and with the first offered price pe(T(A)) ∈ (0, 1). Then there exists a valuation v ∈ [0, 1] s.t. SReg(T,A, v,γ) = Ω(T ).\nProof. We denote the first offered price as p1 := pe(T(A))8 and let the strategy ã, t̃0, and t̃1 be from Eq. (7). Let us decompose the set of all paths in the tree T(A) into three sets S= t S< t S>: (a) S= consists of paths whose price sequences {pt}∞t=1 are constant (i.e., pt=p1 ∀t∈N); (b) the price sequence {pt}∞t=1 of a path from S< (S>, resp.) has the form: ∃t0∈N s.t. pt0+1<pt0 (pt0+1>pt0 , respectively) and pt=p1, t=1,.., t0. The set S< is non-empty since ã∈S<.\nWe consider the path â s.t. ât:=ãt ∀t≤t̃1 and ât:=1 ∀t> t̃1 (it coincides with ã at up to the t̃1-th round) and its corresponding price sequence {p̂t}∞t=1. Note that â ∈ S<. Let us denote ∆ = p1 − p̂t̃0 > 0, then, due to the weak consistency of the algorithm A9, we have p̂t ≤ p̂t̃0 = p1 −∆, ∀t ≥ t̃1. Consider a buyer with a valuation vε := p1 + ε, ε > 0. If the buyer follows the strategy â, then his surplus can be lower bounded:\nSurγ(T,A, vε, â) ≥ ∑T t=t̃1+1 γt(∆ + ε) ∀T > t̃1. (8)\nIf this buyer follows any strategy a from S>, then one has Surγ(T,A, vε,a) ≤ ∑T t=1 γtε ∀a ∈ S> ∀T > 0, (9)\nbecause the price sequence corresponding to a satisfies pt ≥ p1 ∀t ∈ N. Let ε0 := min { ∆ · γt̃1+1/ ∑t̃1 t=1 γt, 1− p1 } , then, ∀ε ∈ (0, ε0) we have vε ∈ (0, 1) and\nε < ∆ · ∑T t=t̃1+1 γt/ ∑t̃1 t=1 γt ∀T > t̃1.\nHence, the right-hand side of Eq. (8) is larger than the one of Eq. (9), which implies that Surγ(T,A, vε,a) < Surγ(T,A, vε, â) ∀a ∈ S>.\n8Note that p1 is the first element in a price sequence of any buyer strategy for a given A.\n9It easy to derive (using the weak consistency) that p̂t ≤ p̂t̃0 ∀t≥ t̃0. Because, otherwise, if ∃t ′ : t̃0<t ′<t̃1 s.t. p̂t′>p̂t̃0 , which implies p̂t≥ p̂t̃0 ∀t>t ′ and contradicts to p̂t̃1<p̂t̃0 .\nThus, we showed that, for T > t̃1, there exists a strategy in S< (i.e. â) that is better (in terms of discounted surplus) than any strategy in S> for the strategic buyer with any valuation vε = p1 + ε s.t. ε ∈ (0, ε0). Hence, the optimal strategy aOpt ∈ S= ∪ S< for T > t̃1 and, for any strategy a from this union, the regret Reg(T,A, vε,a) is lower bounded by∑ t:at=0 vε + ∑ t:at=1\n(vε − p1) ≥ Tε. This implies the bound for the strategic regret: SReg(T,A, vε,γ) ≥ Tε = Ω(T ), T > t̃1, since t̃1 and ε are independent of T .\nRemark 1. For simplicity, in Def. 6 and Th. 2, we considered the root node e(T(A)) from which the double decrease of prices should start. In fact, we can replace it both in Def. 6 and in Th. 2 (without harm for the proof) by any node n ∈ T(A) s.t. it is passed by the strategic buyer.\nNote that this theorem holds for any discount sequence and has thus the following corollary that generalizes (Drutsa, 2017, Th.4) to any discounting (the proof is in App. A.2.1).\nCorollary 1. For any horizon-independent regular weakly consistent pricing algorithm A and any discount sequence γ = {γt}∞t=1, there exists a valuation v ∈ [0, 1] s.t. SReg(T,A, v,γ) = Ω(T ).\nThe key intuition behind Theorem 2 consists in the following: the strategic buyer can lie few times to decrease offered prices and, due to (even weak) consistency, receive prices at least on ε > 0 lower than his valuation v all the remaining rounds. Note that the buyer is able to mislead a wide range of weakly consistent algorithms: the set WCdd is significantly larger than the set RWC (previously known as the largest subset of WC with a linear regret). On the other hand, if we do not allow the buyer to apply this intuition, one can build an algorithm with a sublinear strategic regret, as we showed in Section 4."
  }, {
    "heading": "6. Conclusions",
    "text": "We studied the scenario of repeated posted-price auctions with a strategic buyer that holds a fixed private valuation and discounts his cumulative surplus, while the seller applies a horizon-independent online learning (discrete) algorithm to set prices. First, we closed the open research question on the existence of a no-regret horizon-independent weakly consistent algorithm by proposing a novel algorithm that never decreases offered prices and can be applied against strategic buyers with a tight strategic regret bound of Θ(log log T ). Second, we showed that the property of non-decreasing prices is crucial and, in fact, is nearly necessary for a weakly consistent algorithm to be a no-regret one. Finally, we introduced non-trivial techniques such as (a) a novel transformation which maps a right-consistent algorithm to a both weakly and right- consistent one that is only able to increase prices; (b) approaches to control and guarantee acceptance of exploitation prices that have not been earlier accepted."
  }, {
    "heading": "Acknowledgements",
    "text": "I thank Gleb Gusev for helpful discussions on the presentation of this work and anonymous reviewers for useful suggestions to improve the paper."
  }],
  "year": 2018,
  "references": [{
    "title": "Budget pacing for targeted online advertisements at linkedin",
    "authors": ["D. Agarwal", "S. Ghosh", "K. Wei", "S. You"],
    "venue": "In KDD’2014,",
    "year": 2014
  }, {
    "title": "Efficiency of (revenue-) optimal mechanisms",
    "authors": ["G. Aggarwal", "G. Goel", "A. Mehta"],
    "venue": "In EC’2009,",
    "year": 2009
  }, {
    "title": "General auction mechanism for search advertising",
    "authors": ["G. Aggarwal", "S. Muthukrishnan", "D. Pál", "M. Pál"],
    "venue": "In WWW’2009,",
    "year": 2009
  }, {
    "title": "Bandits, query learning, and the haystack dimension",
    "authors": ["K. Amin", "M. Kearns", "U. Syed"],
    "venue": "In COLT, pp",
    "year": 2011
  }, {
    "title": "Learning prices for repeated auctions with strategic buyers",
    "authors": ["K. Amin", "A. Rostamizadeh", "U. Syed"],
    "venue": "In NIPS’2013,",
    "year": 2013
  }, {
    "title": "Repeated contextual auctions with strategic buyers",
    "authors": ["K. Amin", "A. Rostamizadeh", "U. Syed"],
    "venue": "In NIPS’2014,",
    "year": 2014
  }, {
    "title": "Competing ad auctions",
    "authors": ["I. Ashlagi", "B.G. Edelman", "H.S. Lee"],
    "venue": "Harvard Business School NOM Unit Working Paper,",
    "year": 2013
  }, {
    "title": "Sequential mechanisms with ex-post participation guarantees",
    "authors": ["I. Ashlagi", "C. Daskalakis", "N. Haghpanah"],
    "venue": "In EC’2016,",
    "year": 2016
  }, {
    "title": "Dynamic pricing with limited supply",
    "authors": ["M. Babaioff", "S. Dughmi", "R. Kleinberg", "A. Slivkins"],
    "venue": "ACM Transactions on Economics and Computation,",
    "year": 2015
  }, {
    "title": "Optimising trade-offs among stakeholders in ad auctions",
    "authors": ["Y. Bachrach", "S. Ceppi", "I.A. Kash", "P. Key", "D. Kurokawa"],
    "venue": "In EC’2014,",
    "year": 2014
  }, {
    "title": "Dynamic mechanism design with budget constrained buyers under limited commitment",
    "authors": ["S. Balseiro", "O. Besbes", "G.Y. Weintraub"],
    "venue": "In EC’2016,",
    "year": 2016
  }, {
    "title": "Repeated auctions with budgets in ad exchanges: Approximations and design",
    "authors": ["S.R. Balseiro", "O. Besbes", "G.Y. Weintraub"],
    "venue": "Management Science,",
    "year": 2015
  }, {
    "title": "Buy-it-now or take-a-chance: a simple sequential screening mechanism",
    "authors": ["L.E. Celis", "G. Lewis", "M.M. Mobius", "H. Nazerzadeh"],
    "venue": "In WWW’2011,",
    "year": 2011
  }, {
    "title": "Regret minimization for reserve prices in second-price auctions",
    "authors": ["N. Cesa-Bianchi", "C. Gentile", "Y. Mansour"],
    "venue": "In SODA’2013,",
    "year": 2013
  }, {
    "title": "Multi-score position auctions",
    "authors": ["D. Charles", "N.R. Devanur", "B. Sivan"],
    "venue": "In WSDM’2016,",
    "year": 2016
  }, {
    "title": "Simple pricing schemes for consumers with evolving values",
    "authors": ["S. Chawla", "N.R. Devanur", "A.R. Karlin", "B. Sivan"],
    "venue": "In SODA’2016,",
    "year": 2016
  }, {
    "title": "Bayesian dynamic learning and pricing with strategic customers",
    "authors": ["X. Chen", "Z. Wang"],
    "venue": "SSRN,",
    "year": 2016
  }, {
    "title": "Robust dynamic pricing with strategic customers",
    "authors": ["Y. Chen", "V.F. Farias"],
    "venue": "In EC’2015,",
    "year": 2015
  }, {
    "title": "Learning the demand curve in posted-price digital goods auctions",
    "authors": ["M. Chhabra", "S. Das"],
    "venue": "In ICAAMS’2011, pp",
    "year": 2011
  }, {
    "title": "Feature-based dynamic pricing",
    "authors": ["M.C. Cohen", "I. Lobel", "R. Paes Leme"],
    "venue": "In EC’2016,",
    "year": 2016
  }, {
    "title": "Dynamic pricing and learning: historical origins, current research, and new directions",
    "authors": ["A.V. den Boer"],
    "venue": "Surveys in operations research and management science,",
    "year": 2015
  }, {
    "title": "Perfect bayesian equilibria in repeated sales",
    "authors": ["N.R. Devanur", "Y. Peres", "B. Sivan"],
    "venue": "In SODA’2015,",
    "year": 2015
  }, {
    "title": "Horizon-independent optimal pricing in repeated auctions with truthful and strategic buyers",
    "authors": ["A. Drutsa"],
    "venue": "In WWW’2017,",
    "year": 2017
  }, {
    "title": "An expressive mechanism for auctions on the web",
    "authors": ["P. Dütting", "M. Henzinger", "I. Weber"],
    "venue": "In WWW’2011,",
    "year": 2011
  }, {
    "title": "Online pricing with strategic and patient buyers",
    "authors": ["M. Feldman", "T. Koren", "R. Livni", "Y. Mansour", "A. Zohar"],
    "venue": "In NIPS’2016,",
    "year": 2016
  }, {
    "title": "Behavior-based price discrimination and customer recognition",
    "authors": ["D. Fudenberg", "J.M. Villas-Boas"],
    "venue": "Handbook on economics and information systems,",
    "year": 2006
  }, {
    "title": "Revenue monotone mechanisms for online advertising",
    "authors": ["G. Goel", "M.R. Khani"],
    "venue": "In WWW’2014,",
    "year": 2014
  }, {
    "title": "Optimal revenue-sharing double auctions with applications to ad exchanges",
    "authors": ["R. Gomes", "V. Mirrokni"],
    "venue": "In WWW’2014,",
    "year": 2014
  }, {
    "title": "A game-theoretic machine learning approach for revenue maximization in sponsored search",
    "authors": ["D. He", "W. Chen", "L. Wang", "Liu", "T.-Y"],
    "venue": "In IJCAI’2013,",
    "year": 2013
  }, {
    "title": "Pricing a low-regret seller",
    "authors": ["H. Heidari", "M. Mahdian", "U. Syed", "S. Vassilvitskii", "S. Yazdanbod"],
    "venue": "In ICML’2016,",
    "year": 2016
  }, {
    "title": "Machine learning in an auction environment",
    "authors": ["P. Hummel", "P. McAfee"],
    "venue": "In WWW’2014,",
    "year": 2014
  }, {
    "title": "Repeated sales with multiple strategic buyers",
    "authors": ["N. Immorlica", "B. Lucier", "E. Pountourakis", "S. Taggart"],
    "venue": "In EC’2017,",
    "year": 2017
  }, {
    "title": "Mean field equilibria of dynamic auctions with learning",
    "authors": ["K. Iyer", "R. Johari", "M. Sundararajan"],
    "venue": "ACM SIGecom Exchanges,",
    "year": 2011
  }, {
    "title": "Dynamic reserve prices for repeated auctions: Learning from bids",
    "authors": ["Y. Kanoria", "H. Nazerzadeh"],
    "year": 2014
  }, {
    "title": "The value of knowing a demand curve: Bounds on regret for online posted-price auctions",
    "authors": ["R. Kleinberg", "T. Leighton"],
    "venue": "In Foundations of Computer Science,",
    "year": 2003
  }, {
    "title": "Testing incentive compatibility in display ad auctions",
    "authors": ["S. Lahaie", "A.M. Medina", "B. Sivan", "S. Vassilvitskii"],
    "venue": "In WWW’2018,",
    "year": 2018
  }, {
    "title": "Sequential auctions and externalities",
    "authors": ["R.P. Leme", "V. Syrgkanis", "É. Tardos"],
    "venue": "In SODA’2012,",
    "year": 2012
  }, {
    "title": "Stochastic online greedy learning with semi-bandit feedbacks",
    "authors": ["T. Lin", "J. Li", "W. Chen"],
    "venue": "In NIPS’2015,",
    "year": 2015
  }, {
    "title": "On revenue in the generalized second price auction",
    "authors": ["B. Lucier", "R. Paes Leme", "E. Tardos"],
    "venue": "In WWW’2012,",
    "year": 2012
  }, {
    "title": "Revenue optimization with approximate bid predictions",
    "authors": ["A.M. Medina", "S. Vassilvitskii"],
    "venue": "In NIPS’2017,",
    "year": 2017
  }, {
    "title": "Learning theory and algorithms for revenue optimization in second price auctions with reserve",
    "authors": ["M. Mohri", "A.M. Medina"],
    "venue": "In ICML’2014,",
    "year": 2014
  }, {
    "title": "Non-parametric revenue optimization for generalized second price auctions",
    "authors": ["M. Mohri", "A.M. Medina"],
    "venue": "In UAI’2015,",
    "year": 2015
  }, {
    "title": "Optimal regret minimization in posted-price auctions with strategic buyers",
    "authors": ["M. Mohri", "A. Munoz"],
    "venue": "In NIPS’2014,",
    "year": 2014
  }, {
    "title": "Revenue optimization against strategic buyers",
    "authors": ["M. Mohri", "A. Munoz"],
    "venue": "In NIPS’2015,",
    "year": 2015
  }, {
    "title": "On the pseudodimension of nearly optimal auctions",
    "authors": ["J.H. Morgenstern", "T. Roughgarden"],
    "venue": "In NIPS’2015,",
    "year": 2015
  }, {
    "title": "Optimal auction design",
    "authors": ["R.B. Myerson"],
    "venue": "Mathematics of operations research,",
    "year": 1981
  }, {
    "title": "Reserve prices in internet advertising auctions: A field experiment",
    "authors": ["M. Ostrovsky", "M. Schwarz"],
    "venue": "In EC’2011,",
    "year": 2011
  }, {
    "title": "A field guide to personalized reserve prices",
    "authors": ["R. Paes Leme", "M. Pál", "S. Vassilvitskii"],
    "venue": "In WWW’2016,",
    "year": 2016
  }, {
    "title": "Minimizing regret with multiple reserves",
    "authors": ["T. Roughgarden", "J.R. Wang"],
    "venue": "In EC’2016,",
    "year": 2016
  }, {
    "title": "Objective variables for probabilistic revenue maximization in secondprice auctions with reserve",
    "authors": ["M.R. Rudolph", "J.G. Ellis", "D.M. Blei"],
    "year": 2016
  }, {
    "title": "Commitment through incomplete information in a simple repeated bargaining game",
    "authors": ["K.M. Schmidt"],
    "venue": "Journal of Economic Theory,",
    "year": 1993
  }, {
    "title": "Optimal reserve prices in weighted gsp auctions",
    "authors": ["Y. Sun", "Y. Zhou", "X. Deng"],
    "venue": "Electronic Commerce Research and Applications,",
    "year": 2014
  }, {
    "title": "Revenue optimization in the generalized second-price auction",
    "authors": ["D.R. Thompson", "K. Leyton-Brown"],
    "venue": "In EC’2013,",
    "year": 2013
  }, {
    "title": "Optimal pricing in repeated posted-price auctions",
    "authors": ["A. Vanunts", "A. Drutsa"],
    "venue": "arXiv preprint arXiv:1805.02574,",
    "year": 2018
  }, {
    "title": "Online ad auctions",
    "authors": ["H.R. Varian"],
    "venue": "The American Economic Review,",
    "year": 2009
  }, {
    "title": "The vcg auction in theory and practice",
    "authors": ["H.R. Varian", "C. Harris"],
    "venue": "The A.E.R.,",
    "year": 2014
  }, {
    "title": "An empirical study of reserve price optimisation in real-time bidding",
    "authors": ["S. Yuan", "J. Wang", "B. Chen", "P. Mason", "S. Seljan"],
    "venue": "In KDD’2014,",
    "year": 1897
  }, {
    "title": "Optimizing search engine revenue in sponsored search",
    "authors": ["Y. Zhu", "G. Wang", "J. Yang", "D. Wang", "J. Yan", "J. Hu", "Z. Chen"],
    "venue": "In SIGIR’2009,",
    "year": 2009
  }],
  "id": "SP:06d4120603e0abe318179071bb7c2b8defbf2b53",
  "authors": [{
    "name": "Alexey Drutsa",
    "affiliations": []
  }],
  "abstractText": "We study revenue optimization learning algorithms for repeated posted-price auctions where a seller interacts with a single strategic buyer that holds a fixed private valuation for a good and seeks to maximize his cumulative discounted surplus. We propose a novel algorithm that never decreases offered prices and has a tight strategic regret bound of Θ(log log T ). This result closes the open research question on the existence of a no-regret horizon-independent weakly consistent pricing. We also show that the property of nondecreasing prices is nearly necessary for a weakly consistent algorithm to be a no-regret one.",
  "title": "Weakly Consistent Optimal Pricing Algorithms in Repeated Posted-Price Auctions with Strategic Buyer"
}