{
  "sections": [{
    "text": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 2000–2008 Melbourne, Australia, July 15 - 20, 2018. c©2018 Association for Computational Linguistics\n2000"
  }, {
    "heading": "1 Introduction",
    "text": "Online communications are increasingly becoming fast-paced and frequent, and hidden in these abundant user-generated social media posts are insights for understanding users and their preferences. However, these social media posts often come in unstructured text or images, making massive-scale opinion mining extremely challeng-\ning. Named entity disambiguation (NED), the task of linking ambiguous entities from free-form text mention to specific entities in a pre-defined knowledge base (KB), is thus a critical step for extracting structured information which leads to its application for recommendations, advertisement, personalized assistance, etc.\nWhile many previous approaches on NED been successful for well-formed text in disambiguating polysemous entities via context resolution, several additional challenges remain for disambiguating entities from extremely short and coarse text found in social media posts (e.g. “juuustin ” as opposed to “I love Justin Bieber/Justin Trudeau/etc.”). In many of these cases it is simply impossible to disambiguate entities from text alone, due to enormous number of surface forms arising from incomplete and\ninconsistent notations. In addition, social media posts often include mentions of newly emerging entities unseen in training sets, making traditional context-based entity linking often not viable.\nHowever, as popular social media platforms are increasingly incorporating a mix of text and images (e.g. Snapchat, Instargram, Pinterest, etc.), we can advance the disambiguation task to incorporate additional visual context for understanding posts. For example, the mention of ‘juuustin’ is completely ambiguous in its textual form, but an accompanying snap image of a concert scene may help disambiguate or re-rank among several lexical candidates (e.g. Justin Bieber (a pop singer) versus Justin Trudeau (a politician) in Figure 1).\nTo this end, we introduce a new task called Multimodal Named Entity Disambiguation (MNED) that handles unique challenges for social media posts composed of extremely short text and images, aimed at disambiguationg entities by leveraging both textual and visual contexts.\nWe then propose a novel zeroshot MNED model, which obtains visual context vectors from images with a CNN (LeCun et al., 1989), and combines with textual context extracted from a bidirectional LSTM (Dyer et al., 2015) (Section 2.2). In addition, we obtain embeddings representation of 1M entities from a knowledge graph, and train the MNED network to predict label embeddings of entities in the same space as corresponding knowledge graph embeddings (Section 2.4). This approach effectively allows for zeroshot prediction of unseen entities, which is critical for scarce-label scenario due to extensive human annotation efforts required. Lastly, we develop a lexical embeddings model that determines lexical similarity between a mention and potential entities, to aid in prediction of a correct entity (Section 2.3). Section 2.5 details the model combining the components above.\nNote that our method takes different perspectives from the previous work on NED (He et al., 2013; Yamada et al., 2016; Eshel et al., 2017) in the following important ways. First, while most of the previous methods generate fixed “candidates” for disambiguation given a mention from mentionentity pair statistics (thus disambiguation is limited for entities with exact surface form matches), we do not fixate candidate generation, due to intractable variety of surface forms for each named entity and unforeseen mentions of emerging entities. Instead, we have a lexical model incorpo-\nrated into the discriminative score function that serves as soft normalization of various surface forms. Second, we extract auxiliary visual contexts for detected entities from user-generated images accompanied with textual posts, which is crucial because captions in our dataset are substantially shorter than text documents in most other NED datasets. To the best of our knowledge, our work is the first in using visual contexts for the named entity disambiguation task. See Section 4 for the detailed literature review.\nOur contributions are as follows: for the new MNED task we introduce, we propose a deep zeroshot multimodal network with (1) a CNNLSTM hybrid module that extracts contexts from both image and text, (2) a zeroshot learning layer which via embeddings projection allows for entity linking with 1M knowledge graph entities even for entities unseen from captions in training set, and (3) a lexical language model called Deep Levenshtein to compute lexical similarities between mentions and entities, relaxing the need for fixed candidates generation. We show that the proposed approaches successfully disambiguate incomplete mentions as well as polysemous entities, outperforming the state-of-the-art models on our newly crawled SnapCaptionsKB dataset, composed of 12K image-caption pairs with named entities annotated and linked with an external KB."
  }, {
    "heading": "2 Proposed Methods",
    "text": "Figure 2 illustrates the proposed model, which maps each multimodal social media post data to one of the corresopnding entities in the KB. Given a multimodal input that contains a mention of an ambiguous entity, we first extract textual and visual features contexts with RCNNs and Bi-LSTMs, respectively (Section 2.2). We also obtain lexical character-level representation of a mention to compare with lexical representation of KB entities, using a proposed model called Deep Levenshtein (Section 2.3). We then get highdimensional label embeddings of KB entities constructed from a knowledge graph, where similar entities are mapped as neighbors in the same space (Section 2.4). Finally, we aggregate all the contextual information extracted from surrounding text, image, and lexical notation of a mention, and predict the best matching KB entity based on knowledge graph label representation and lexical notation of KB entity candidates (Section 2.5)."
  }, {
    "heading": "2.1 Notations",
    "text": "Let X = {x(i)}Ni=1 a set of N input social media posts samples for disambiguation, with corresponding ground truth named entities Y = {y(i)}Ni=1 for y ∈ YKB, where YKB is a set of entities in KB. Each input sample is composed of three modalities: x = {xw;xv;xc}, where xw = {xw,t}Lwt=1 is a sequence of words with length Lw surrounding a mention in a post, xv is an image associated with a post (Section 2.2), and xc = {xc,t}Lct=1 is a sequence of characters comprising a mention (Section 2.3), respectively. We denote high-dimensinal feature extractor functions for each modality as: w(xw), c(xc), v(xv). We represent each output label in two modalities: y = {yKB;yc}, where yKB is a knowledge base label embeddings representation (Sec-\ntion 2.4), and and yc is a character embeddings representation of KB entities (Section 2.3: Deep Levenshtein).\nWe formulate our zeroshot multimodal NED task as follows:\ny = argmax y′∈YKB\nsim ( fx→y(x),y ′) where fx→y is a function with learnable parameters that project multimodal input samples (x) into the same space as label representations (y), and sim(·) produces a similarity score between prediction and ground truth KB entities."
  }, {
    "heading": "2.2 Textual and Visual Contexts Features",
    "text": "Textual features: we represent textual context of surrounding words of a mention with a BiLSTM language model (Dyer et al., 2015) with distributed word semantics embeddings. We use the following implementation for the LSTM.\nit = σ(Wxiht−1 +Wcict−1)\nct = (1− it) ct−1 + it tanh(Wxcxw,t +Whcht−1)\not = σ(Wxoxw,t +Whoht−1 +Wcoct)\nht = ot tanh(ct) w(xw) = [ −−→ hLw ; ←−− hLw ] (1)\nwhere ht is an LSTM hidden layer output at decoding step t, and w(xw) is an output textual representation of bi-directional LSTM concatenating left and right context at the last decoding step t = Lw. Biase terms for gates are omitted for simplicity of formulation.\nFor the Bi-LSTM sentence encoder, we use pretrained word embeddings obtained from an unsupervised language model aimed at learning cooccurrence statistics of words from a large external corpus. Word embeddings are thus represented as distributional semantics of words. In our experiments, we use pre-trained embeddings from Stanford GloVE model (Pennington et al., 2014).\nVisaul features: we take the final activation of a modified version of the recurrent convolutional network model called Inception (GoogLeNet) (Szegedy et al., 2015) trained on the ImageNet dataset (Russakovsky et al., 2015) to classify multiple objects in the scene. The final layer representation (v(xv)) thus encodes discriminative information describing what objects are shown in an image, providing cues for disambiguation."
  }, {
    "heading": "2.3 Lexical Embeddings: Deep Levenshtein",
    "text": "While traditional NED tasks assume perfect lexical match between mentions and their corresopnding entities, in our task it is important to account for various surface forms of mentions (nicknames, mis-spellings, inconsistent notations, etc.) corresponding to each entity. Towards this goal, we train a separate deep neural network to compute approximate Levenshtein distance which we call Deep Levenshtein (Figure 3), composed of a shared bi-directional character LSTM, shared character embedding matrix, fully connected layers, and a dot product merge operation layer. The optimization is as follows:\nmin c ∥∥∥∥12 ( c(xc) · c(x′c)> ‖c(xc)‖‖c(x′c)‖ + 1 ) − sim(xc,x′c) ∥∥∥∥2 (2)\nwhere c(xc) = [ −−−→ hc,Lc ; ←−−− hc,Lc ]\nwhere c(·) is a bi-directional LSTM output vector for a character sequence defined similar as in Eq.1, sim(·) is an output of the Deep Levenshtein network, producing a normalized similarity score with a range [0,1] based on Levenshtein edit distance, and (xc,x′c) is any pair of two strings. We generate millions of these pairs as training data by artificially corrupting seed strings by varying degrees (addition, deletion, replacement).\nOnce trained, it can produce a purely lexical embedding of a string without semantic allusion (via c(·)), and predict lexical similarity between two strings based on their distance in the embedding space. On an intuitive level, this component effectively bypasses normalization steps, and instead incorporates lexical similarities between input mentions and output KB entities into the overall optimization of the disambiguation network.\nWe use by-product c(·) network to extract lexical embedings of mentions and KB entities, and freeze c in training of the disambiguation network. We observe that this approach significantly outperforms alternative ways to obtain character embeddings (e.g. having a character Bi-LSTM as a part of the disambiguation network training, which unnecessarily learns semantic allusions that are prone to errors when notations are inconsistent.)"
  }, {
    "heading": "2.4 Label Embeddings from Knowledge Graph",
    "text": "Due to the overwhelming variety of (newly trending) entities mentioned over social media posts, at\ntest phases we frequently encounter new named entities that are unseen in the training data. In order to address this issue, we propose a zeroshot learning approach (Frome et al., 2013) by inducing embeddings obtained from knowledge graphs on KB entities. Knowledge graph label embeddings are learned from known relations among entities within a graph (e.g. ‘IS-A’, ‘LOCATED-AT’, etc.), the resulting embeddings of which can group similar entities closer in the same space (e.g. ‘pop stars’ are in a small cluster, ‘people’ and ‘organizations’ clusters are far apart, etc.) (Bordes et al., 2013; Wang et al., 2014; Nickel et al., 2016). Once high-level mapping from contextual information to label embeddings is learned, the knowledgegraph based zeroshot approach can improve the entity linking performance given ambiguous entities unseen in training data. In brief formulation, the model for obtaining embeddings from a knowledge graph (composed of subject-relationobject (s, r, o) triplets) is as follows: P (Ir(s, o) = 1|e, er, θ) = scoreθ ( e(s), er(r), e(o)\n) (3)\nwhere Ir is an indicator function of a known relation r for two entities (s,o) (1: valid relation, 0: unknown relation), e is a function that extracts embeddings for entities, er extracts embeddings for relations, and scoreθ(·) is a deep neural network that produces a likelihood of a valid triplet.\nIn our experiments, we use the 1M subset of the Freebase knowledge graph (Bast et al., 2014) to obtain label embeddings with the Holographic KB implementation by (Nickel et al., 2016)."
  }, {
    "heading": "2.5 Deep Zeroshot MNED Network (DZMNED)",
    "text": "Using the contextual information extracted from surrounding text and an accompanying image (Section 2.2) and lexical embeddings of a mention (Section 2.3), we build a Deep Zeroshot MNED network (DZMNED) which predicts a corresponding KB entity based on its knowledge graph embeddings (Section 2.4) and lexical similarity (Section 2.3) with the following objective:\nmin W LKB(x,yKB;Ww,Wv,Wf )+Lc(xc,yc;Wc)\nwhere\nLKB(·)=\n1\nN N∑ i=1 ∑ ỹ 6=y(i)KB max[0, ỹ · y(i)KB−f(x (i)) · (y(i)KB− ỹ) >]\nLc(·) =\n1\nN N∑ i=1 ∑ ỹ 6=y(i)c max[0, ỹ · y(i)c −c(x(i)c ) · (y(i)c − ỹ)>]\nR(W): regularization\nwhere LKB(·) is the supervised hinge rank loss for knowledge graph embeddings prediction, Lc(·) is the loss for lexical mapping between mentions and KB entities, x is a weighted average of three modalities x = {xw;xv;xc} via the modality attention module. f(·) is a transformation function with stacked layers that projects weighted input to the KB embeddings space, ỹ refers to the embeddings of negative samples randomly sampled from KB entities except the ground truth label of the instance, W = {Wf ,Wc,Ww,Wv} are the learnable parameters for f , c, w, and v respectively, andR(W) is a weight decay regularization term.\nSimilarly to (Moon et al., 2018), we formulate the modality attention module for our MNED network as follows, which selectively attenuates or amplifies modalities:\n[aw;ac;av] = σ ( Wm · [xw;xc;xv] + bm ) (4)\nαm = exp(am)∑\nm′∈{w,c,v} exp(am′)\n∀m ∈ {w, c, v}\nx = ∑\nm∈{w,c,v}\nαmxm (5)\nwhere α = [αw;αc;αv] ∈ R3 is an attention vector, and x is a final context vector that maximizes information gain.\nIntuitively, the model is trained to produce a higher dot product similarity between the projected embeddings with its correct label than with an incorrect negative label in both the knowledge graph label embeddings and the lexical embeddings spaces, where the margin is defined as the similarity between a ground truth sample and a negative sample.\nAt test time, the following label-producing nearest neighbor (1-NN) classifier is used for the target task (we cache all the label embeddings to avoid repetitive projections):\n1-NN(x) = argmax (yKB,yc)∈YKB\nf(x) ·yKB>+g(xc) ·yc>\n(6) In summary, the model produces (1) projection of input modalities (mention, surrounding text, image) into the knowledge graph embeddings space, and (2) lexical embeddings representation of mention, which then calculates a combined score of contextual (knowledge graph) and string similarities with each entity in YKB."
  }, {
    "heading": "3 Empirical Evaluation",
    "text": "Task: Given a caption and an accompanying image (if available), the goal is to disambiguate and link a target mention in a caption to a corresponding entity from the knowledge base (1M subset of the Freebase knowledge graph (Bast et al., 2014))."
  }, {
    "heading": "3.1 Datasets",
    "text": "Our SnapCaptionsKB dataset is composed of 12K user-generated image and textual caption pairs where named entities in captions and their links to KB entities are manually labeled by expert human annotators. These captions are collected exclusively from snaps submitted to public and crowd-sourced stories (aka Live Stories or Our Stories). Examples of such stories are “New York Story” or “Thanksgiving Story”, which are aggregated collections of snaps for various public venues, events, etc. Our data do not contain raw images, and we only provide textual captions and obfuscated visual descriptor features extracted from the pre-trained InceptionNet. We split the dataset randomly into train (70%), validation (15%), and test sets (15%). The captions data have average length of 29.5 characters (5.57 words) with vocabulary size 16,553, where 6,803 are considered unknown tokens from Stanford GloVE embeddings (Pennington et al., 2014).\nNamed entities annotated in the dataset include many of new and emerging entities found in various surface forms. To the best of our knowledge, our SnapCaptionsKB is the only dataset that contains image-caption pairs with human-annotated named entities and their links to KB entities."
  }, {
    "heading": "3.2 Baselines",
    "text": "We report performance of the following state-ofthe-art NED models as baselines, with several candidate generation methods and variations of our proposed approach to examine contributions of each component (W: word, C: char, V: visual).\nCandidates generation: Note that our zeroshot approach allows for entity disambiguation without a fixed candidates generation process. In fact, we observe that the conventional method for fixed candidates generation harms the performance for noisy social media posts with many emerging entities. This is because the difficulty of entity linking at test time rises not only from multiple entities (e) linking to a single mention (m), but also from each entity found in multiple surface forms of mentions (often unseen at train time). To show the efficacy of our approach that does not require candidates generation, we compare with the following candidates generation methods:\n• m→e hash list: This method retrieves KB entity (e) candidates per mention (m) based on exact (m, e) pair occurrence statistics from a training corpora. This is the most predominantly used candidates generation method (He et al., 2013; Yamada et al., 2016; Eshel et al., 2017). Note that this approach is especially vulnerable at test time to noisy mentions or emerging entities with no or a few matching candidate entities from training set.\n• k-NN: We also consider using lexical neighbors of mentions from KB entities as candidates. This approach can be seen as soft normalization to relax the issue of having to match a variety of surface forms of a mention to KB entities. We use our Deep Levenshtein (Section 2.3) to compute lexical embeddings of KB entities and mentions, and retrieves Euclidean neighbors (and their polysemous entities) as candidates.\nNED models: We choose as baselines the following state-of-the-art NED models for noisy text, as well as several configurations of our proposed\napproach to examine contributions of each component (W: word, C: char, V: visual).\n• sDA-NED (W only) (He et al., 2013): uses a deep neural network with stacked denoising autoencoders (sDA) to encode bag-of-words representation of textual contexts and to directly compare mentions and entities.\n• ARNN (W only) (Eshel et al., 2017): uses an Attention RNN model that computes similarity between word and entity embeddings to disambiguate among fixed candidates.\n• Deep Zeroshot (W only): uses the deep zeroshot architecture similar to Figure 2, but uses word contexts (caption) only.\n• (proposed) DZMNED + Deep Levenshtein + InceptionNet with modality attention (W+C+V): is the proposed approach as described in Figure 2.\n• (proposed) DZMNED + Deep Levenshtein + InceptionNet w/o modality attention (W+C+V): concatenates all the modality vectors instead.\n• (proposed) DZMNED + Deep Levenshtein (W+C): only uses textual context.\n• (proposed) DZMNED + Deep Levenshtein w/o modality attention (W+C): does not use the modality attention module, and instead concatenates word and lexical embeddings."
  }, {
    "heading": "3.3 Results",
    "text": "Parameters: We tune the parameters of each model with the following search space (bold indicate the choice for our final model): character embeddings dimension: {25, 50, 100, 150, 200, 300}, word embeddings size: {25, 50, 100, 150, 200, 300}, knowledge graph embeddings size: {100, 200, 300}, LSTM hidden states: {50, 100, 150, 200, 300}, and x dimension: {25, 50, 100, 150, 200, 300}. We optimize the parameters with Adagrad (Duchi et al., 2011) with batch size 10, learning rate 0.01, epsilon 10−8, and decay 0.1.\nMain Results: Table 1 shows the Top-1, 3, 5, 10, and 50 candidates retrieval accuracy results on the Snap Captions dataset. We see that the proposed approach significantly outperforms the baselines which use fixed candidates generation\nmethod. Note that m→ e hash list-based methods, which retrieve as candidates the KB entities that appear in the training set of captions only, has upper performance limit at 66.9%, showing the limitance of fixed candidates generation method for unseen entities in social media posts. k-NN methods which retrieve lexical neighbors of mention (in an attempt to perform soft normalization on mentions) also do not perform well. Our proposed zeroshot approaches, however, do not fixate candidate generation, and instead compares combined contextual and lexical similarities among all 1M KB entities, achieving higher upper performance limit (Top-50 retrieval accuracy reaches 88.1%). This result indicates that the proposed zeroshot model is capable of predicting for unseen entities as well. The lexical sub-model can also be interpreted as functioning as soft neural mapping of mention to potential candidates, rather than heuristic matching to fixed candidates.\nIn addition, when visual context is available (W+C+V), the performance generally improves over the textual models (W+C), showing that visual information can provide additional contexts for disambiguation. The modality attention module also adds performance gain by re-weighting the modalities based on their informativeness.\nError Analysis: Table 3 shows example cases where incorporation of visual contexts affects disambiguation of mentions in textual captions. For example, polysemous entities such as ‘Jordan’ in the caption “Taking the new Jordan for a walk” or ‘CID’ as in “LETS GO CID” are hard to disambiguate due to the limited textual contexts provided, while visual information (e.g. visual tags ‘footwear’ for Jordan, ‘DJ’ for CID) provides similarities to each mention’s distributional semantics from other training examples. Mentions unseen at train time (‘STEPHHHH’, ‘murica’) often resort to lexical neighbors by (W+C), whereas visual contexts can help disambiguate better. A few cases where visual contexts are not helpful include visual tags that are not related to mentions, or do not complement already ambiguous contexts.\nSensitivity to KB Embeddings Quality: The proposed approach relies its prediction on entity matching in the KB embeddings space, and hence the quality of KB embeddings is crucial for successful disambiguation. To characterize this aspect, we provide Table 2 which shows MNED performance with varying quality of embeddings as follows: KB embeddings learned from 1M knowledge graph entities (same as in the main experiments), from 10K subset of entities (less triplets to train with in Eq.3, hence lower quality), and random embeddings (poorest) - while all the other parameters are kept the same. It can be seen that the performance notably drops with lower quality of KB embeddings. When KB embeddings are replaced by random embeddings, the network effectively prevents the contextual zeroshot matching to KB entities and relies only on lexical similarities, achieving the poorest performance."
  }, {
    "heading": "4 Related Work",
    "text": "NED task: Most of the previous NED models leverage local textual information (He et al., 2013; Eshel et al., 2017) and/or document-wise global contexts (Hoffart et al., 2011; Chisholm and Hachey, 2015; Pershina et al., 2015; Globerson et al., 2016), in addition to other auxiliary contexts or priors for disambiguating a mention. Note that most of the NED datasets (e.g. TAC KBP (Ji et al., 2010), ACE (Bentivogli et al., 2010), CoNLL-YAGO (Hoffart et al., 2011), etc.) are extracted from standardized documents with web links such as Wikipedia (with relatively ample textual contexts), and that named entitiy disambiguation specifically for short and noisy social media posts are rarely discussed. Note also that most of the previous literature assume the availability of “candidates” or web links for disambiguation via mention-entity pair counts from training set, which is vulnerable to inconsistent surface forms of entities predominant in social media posts.\nOur model improves upon the state-of-the-art NED models in three very critical ways: (1) incorporation of visual contexts, (2) addition of the zeroshot learning layer, which allows for disambiguation of unseen entities during training, and (3) addition of the lexical model that computes lexical similarity entities to correctly recognize inconsistent surface forms of entities.\nMultimodal learning studies learning of a joint model that leverages contextual information from multiple modalities in parallel. Some of the relevant multimodal learning task to our MNED system include the multimodal named entity recognition task (Moon et al., 2018), which leverages both text and image to classify each token in a sentence to named entity or not. In their work,\nthey employ an entity LSTM that takes as input each modality, and a softmax layer that outputs an entity label at each decoding step. Contrast to their work, our MNED addresses unique challenges characterized by zeroshot ranking of 1M knowledge-base entities (vs. categorical entity types prediction), incorporation of an external knowledge graph, lexical embeddings, etc. Another is the multimodal machine translation task (Elliott et al., 2015; Specia et al., 2016), which takes as input text in source language as well as an accompanying image to output a translated text in target language. These models usually employ a sequence-to-sequence architecture (e.g. target language decoder takes as input both encoded source language and images) often with traditional attention modules widely used in other image captioning systems (Xu et al., 2015; Sukhbaatar et al., 2015). To the best of our knowledge, our approach is the first multimodal learning work at incorporating visual contexts for the NED task."
  }, {
    "heading": "5 Conclusions",
    "text": "We introduce a new task called Multimodal Named Entity Disambiguation (MNED), which is applied on short user-generated social media posts that are composed of text and accompanying images. Our proposed MNED model improves upon the state-of-the-art models by 1) extracting visual contexts complementary to textual contexts, 2) by leveraging lexical embeddings into entity matching which accounts for various surface forms of entities, removing the need for fixed candidates generation process, and 3) by performing entity matching in the distributed knowledge graph embeddings space, allowing for matching of unseen mentions and entities by context resolutions."
  }],
  "year": 2018,
  "references": [{
    "title": "Easy access to the freebase dataset",
    "authors": ["Hannah Bast", "Florian Baurle", "Bjorn Buchhold", "Elmar Haussmann."],
    "venue": "WWW.",
    "year": 2014
  }, {
    "title": "Extending english ace 2005 corpus annotation with ground-truth links to wikipedia",
    "authors": ["Luisa Bentivogli", "Pamela Forner", "Claudio Giuliano", "Alessandro Marchetti", "Emanuele Pianta", "Kateryna Tymoshenko."],
    "venue": "Proceedings of the 2nd Workshop on",
    "year": 2010
  }, {
    "title": "Translating embeddings for modeling multirelational data",
    "authors": ["Antoine Bordes", "Nicolas Usunier", "Alberto GarciaDuran", "Jason Weston", "Oksana Yakhnenko."],
    "venue": "NIPS, pages 2787–2795.",
    "year": 2013
  }, {
    "title": "Entity disambiguation with web links",
    "authors": ["Andrew Chisholm", "Ben Hachey."],
    "venue": "Transactions of the Association of Computational Linguistics, 3(1):145– 156.",
    "year": 2015
  }, {
    "title": "Adaptive subgradient methods for online learning and stochastic optimization",
    "authors": ["John Duchi", "Elad Hazan", "Yoram Singer."],
    "venue": "JMLR.",
    "year": 2011
  }, {
    "title": "Transitionbased dependency parsing with stack long shortterm memory",
    "authors": ["Chris Dyer", "Miguel Ballesteros", "Wang Ling", "Austin Matthews", "Noah A Smith."],
    "venue": "ACL.",
    "year": 2015
  }, {
    "title": "Multi-language image description with neural sequence models",
    "authors": ["Desmond Elliott", "Stella Frank", "Eva Hasler."],
    "venue": "CoRR, abs/1510.04709.",
    "year": 2015
  }, {
    "title": "Named entity disambiguation for noisy text",
    "authors": ["Yotam Eshel", "Noam Cohen", "Kira Radinsky", "Shaul Markovitch", "Ikuda Yamada", "Omer Levy."],
    "venue": "CoNLL.",
    "year": 2017
  }, {
    "title": "Devise: A deep visualsemantic embedding model",
    "authors": ["Andrea Frome", "Greg Corrado", "Jon Shlens", "Samy Bengio", "Jeffrey Dean", "Marc’Aurelio Ranzato", "Tomas Mikolov"],
    "year": 2013
  }, {
    "title": "Collective entity resolution with multi-focal attention",
    "authors": ["Amir Globerson", "Nevena Lazic", "Soumen Chakrabarti", "Amarnag Subramanya", "Michael Ringaard", "Fernando Pereira."],
    "venue": "Proceedings of the 54th Annual Meeting of the Association for Compu-",
    "year": 2016
  }, {
    "title": "Learning entity representation for entity disambiguation",
    "authors": ["Zhengyan He", "Shujie Liu", "Mu Li", "Ming Zhou", "Longkai Zhang", "Houfeng Wang"],
    "year": 2013
  }, {
    "title": "Robust disambiguation of named entities in text",
    "authors": ["Johannes Hoffart", "Mohamed Amir Yosef", "Ilaria Bordino", "Hagen Fürstenau", "Manfred Pinkal", "Marc Spaniol", "Bilyana Taneva", "Stefan Thater", "Gerhard Weikum."],
    "venue": "Proceedings of the Conference on",
    "year": 2011
  }, {
    "title": "Overview of the tac 2010 knowledge base population track",
    "authors": ["Heng Ji", "Ralph Grishman", "Hoa Trang Dang", "Kira Griffitt", "Joe Ellis."],
    "venue": "Third Text Analysis Conference (TAC 2010), volume 3, pages 3–13.",
    "year": 2010
  }, {
    "title": "Backpropagation applied to handwritten zip code recognition",
    "authors": ["Yann LeCun", "Bernhard Boser", "John S Denker", "Donnie Henderson", "Richard E Howard", "Wayne Hubbard", "Lawrence D Jackel."],
    "venue": "Neural computation.",
    "year": 1989
  }, {
    "title": "Multimodal named entity recognition for short social media posts",
    "authors": ["Seungwhan Moon", "Leonard Neves", "Vitor Carvalho."],
    "venue": "NAACL.",
    "year": 2018
  }, {
    "title": "Holographic embeddings of knowledge graphs",
    "authors": ["Maximilian Nickel", "Lorenzo Rosasco", "Tomaso Poggio."],
    "venue": "AAAI.",
    "year": 2016
  }, {
    "title": "Glove: Global vectors for word representation",
    "authors": ["Jeffrey Pennington", "Richard Socher", "Christopher D. Manning."],
    "venue": "EMNLP.",
    "year": 2014
  }, {
    "title": "Personalized page rank for named entity disambiguation",
    "authors": ["Maria Pershina", "Yifan He", "Ralph Grishman."],
    "venue": "Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Tech-",
    "year": 2015
  }, {
    "title": "ImageNet Large Scale Visual Recognition Challenge",
    "authors": ["Olga Russakovsky", "Jia Deng", "Hao Su", "Jonathan Krause", "Sanjeev Satheesh", "Sean Ma", "Zhiheng Huang", "Andrej Karpathy", "Aditya Khosla", "Michael Bernstein", "Alexander C. Berg", "Li Fei-Fei."],
    "venue": "IJCV.",
    "year": 2015
  }, {
    "title": "A shared task on multimodal machine translation and crosslingual image description",
    "authors": ["Lucia Specia", "Stella Frank", "Khalil Sima’an", "Desmond Elliott"],
    "venue": "In WMT,",
    "year": 2016
  }, {
    "title": "End-to-end memory networks",
    "authors": ["Sainbayar Sukhbaatar", "Jason Weston", "Rob Fergus"],
    "venue": "In NIPS,",
    "year": 2015
  }, {
    "title": "Going deeper with convolutions",
    "authors": ["C. Szegedy", "W. Liu", "Y. Jia", "P. Sermanet", "S.E. Reed", "D. Anguelov", "D. Erhan", "V. Vanhoucke", "A. Rabinovich."],
    "venue": "CVPR.",
    "year": 2015
  }, {
    "title": "Knowledge graph embedding by translating on hyperplanes",
    "authors": ["Zhen Wang", "Jianwen Zhang", "Jianlin Feng", "Zheng Chen."],
    "venue": "AAAI, pages 1112–1119. Citeseer.",
    "year": 2014
  }, {
    "title": "Show, attend and tell: Neural image caption generation with visual attention",
    "authors": ["Kelvin Xu", "Jimmy Ba", "Ryan Kiros", "Kyunghyun Cho", "Aaron Courville", "Ruslan Salakhutdinov", "Richard S Zemel", "Yoshua Bengio."],
    "venue": "arXiv preprint arXiv:1502.03044, 2(3):5.",
    "year": 2015
  }, {
    "title": "Joint learning of the embedding of words and entities for named entity disambiguation",
    "authors": ["Ikuya Yamada", "Hiroyuki Shindo", "Hideaki Takeda", "Yoshiyasu Takefuji."],
    "venue": "CoNLL.",
    "year": 2016
  }],
  "id": "SP:9ce680f0707c9c0b08609b865b7fdfa02077a080",
  "authors": [{
    "name": "Seungwhan Moon",
    "affiliations": []
  }, {
    "name": "Leonardo Neves",
    "affiliations": []
  }, {
    "name": "Vitor Carvalho",
    "affiliations": []
  }],
  "abstractText": "We introduce the new Multimodal Named Entity Disambiguation (MNED) task for multimodal social media posts such as Snapchat or Instagram captions, which are composed of short captions with accompanying images. Social media posts bring significant challenges for disambiguation tasks because 1) ambiguity not only comes from polysemous entities, but also from inconsistent or incomplete notations, 2) very limited context is provided with surrounding words, and 3) there are many emerging entities often unseen during training. To this end, we build a new dataset called SnapCaptionsKB, a collection of Snapchat image captions submitted to public and crowd-sourced stories, with named entity mentions fully annotated and linked to entities in an external knowledge base. We then build a deep zeroshot multimodal network for MNED that 1) extracts contexts from both text and image, and 2) predicts correct entity in the knowledge graph embeddings space, allowing for zeroshot disambiguation of entities unseen in training set as well. The proposed model significantly outperforms the stateof-the-art text-only NED models, showing efficacy and potentials of the MNED task.",
  "title": "Zeroshot Multimodal Named Entity Disambiguation for Noisy Social Media Posts"
}